{
  "surahName": "Al-Hashr",
  "surahNameArabic": "الحشر",
  "surahNameArabicLong": "سورة الحشر",
  "surahNameTranslation": "The Exile",
  "revelationPlace": "Madina",
  "totalAyah": 24,
  "surahNo": 59,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/59.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/059.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/59.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/059.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/59.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/059.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/59.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/059.mp3"
    }
  },
  "english": [
    "Whatever is in the heavens and whatever is on the earth glorifies Allah. For He is the Almighty, All-Wise.",
    "He is the One Who expelled the disbelievers of the People of the Book from their homes for ˹their˺ first banishment ˹ever˺. You never thought they would go. And they thought their strongholds would put them out of Allah’s reach. But ˹the decree of˺ Allah came upon them from where they never expected. And He cast horror into their hearts so they destroyed their houses with their own hands and the hands of the believers. So take a lesson ˹from this˺, O  people of insight!",
    "Had Allah not decreed exile for them, He would have certainly punished them in this world. And in the Hereafter they will suffer the punishment of the Fire.",
    "This is because they defied Allah and His Messenger. And whoever defies Allah, then Allah is truly severe in punishment.",
    "Whatever palm trees you ˹believers˺ cut down or left standing intact, it was ˹all˺ by Allah’s Will, so that He might disgrace the rebellious.",
    "As for the gains Allah has turned over to His Messenger from them—you did not ˹even˺ spur on any horse or camel for such gains. But Allah gives authority to His messengers over whoever He wills. For Allah is Most Capable of everything.",
    "As for gains granted by Allah to His Messenger from the people of ˹other˺ lands, they are for Allah and the Messenger, his close relatives, orphans, the poor, and ˹needy˺ travellers so that wealth may not merely circulate among your rich. Whatever the Messenger gives you, take it. And whatever he forbids you from, leave it. And fear Allah. Surely Allah is severe in punishment.",
    "˹Some of the gains will be˺ for poor emigrants who were driven out of their homes and wealth, seeking Allah’s bounty and pleasure, and standing up for Allah and His Messenger. They are the ones true in faith.",
    "As for those who had settled in the city and ˹embraced˺ the faith before ˹the arrival of˺ the emigrants, they love whoever immigrates to them, never having a desire in their hearts for whatever ˹of the gains˺ is given to the emigrants. They give ˹the emigrants˺ preference over themselves even though they may be in need. And whoever is saved from the selfishness of their own souls, it is they who are ˹truly˺ successful.",
    "And those who come after them will pray, “Our Lord! Forgive us and our fellow believers who preceded us in faith, and do not allow bitterness into our hearts towards those who believe. Our Lord! Indeed, You are Ever Gracious, Most Merciful.”",
    "Have you ˹O Prophet˺ not seen the hypocrites who say to their fellow disbelievers from the People of the Book, “If you are expelled, we will certainly leave with you, and We will never obey anyone against you. And if you are fought against, we will surely help you.”? But Allah bears witness that they are truly liars.",
    "Indeed, if they are expelled, the hypocrites will never leave with them. And if they are fought against, the hypocrites will never help them. And even if the hypocrites did so, they would certainly flee, then the disbelievers would be left with no help.",
    "Indeed, there is more fear in their hearts for you ˹believers˺ than for Allah. That is because they are a people who do not comprehend.",
    "Even united, they would not ˹dare˺ fight against you except ˹from˺ within fortified strongholds or from behind walls. Their malice for each other is intense: you think they are united, yet their hearts are divided. That is because they are a people with no ˹real˺ understanding.",
    "They are ˹both just˺ like those who recently went down before them: they tasted the evil consequences of their doings. And they will suffer a painful punishment.",
    "˹They are˺ like Satan when he lures someone to disbelieve. Then after they have done so, he will say ˹on Judgment Day˺, “I have absolutely nothing to do with you. I truly fear Allah—the Lord of all worlds.”",
    "So they will both end up in the Fire, staying there forever. That is the reward of the wrongdoers.",
    "O believers! Be mindful of Allah and let every soul look to what ˹deeds˺ it has sent forth for tomorrow. And fear Allah, ˹for˺ certainly Allah is All-Aware of what you do.",
    "And do not be like those who forgot Allah, so He made them forget themselves. It is they who are ˹truly˺ rebellious.",
    "The residents of the Fire cannot be equal to the residents of Paradise. ˹Only˺ the residents of Paradise will be successful.",
    "Had We sent down this Quran upon a mountain, you would have certainly seen it humbled and torn apart in awe of Allah. We set forth such comparisons for people, ˹so˺ perhaps they may reflect.",
    "He is Allah—there is no god ˹worthy of worship˺ except Him: Knower of the seen and unseen. He is the Most Compassionate, Most Merciful.",
    "He is Allah—there is no god except Him: the King, the Most Holy, the All-Perfect, the Source of Serenity, the Watcher ˹of all˺, the Almighty, the Supreme in Might, the Majestic. Glorified is Allah far above what they associate with Him ˹in worship˺!",
    "He is Allah: the Creator, the Inventor, the Shaper. He ˹alone˺ has the Most Beautiful Names. Whatever is in the heavens and the earth ˹constantly˺ glorifies Him. And He is the Almighty, All-Wise."
  ],
  "arabic1": [
    "سَبَّحَ لِلّٰهِ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَهُوَ الْعَزِیْزُ الْحَكِیْمُ",
    "هُوَ الَّذِیْۤ اَخْرَجَ الَّذِیْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ مِنْ دِیَارِهِمْ لِاَوَّلِ الْحَشْرِ مَا ظَنَنْتُمْ اَنْ یَّخْرُجُوْا وَظَنُّوْۤا اَنَّهُمْ مَّا نِعَتُهُمْ حُصُوْنُهُمْ مِّنَ اللّٰهِ فَاَتٰىهُمُ اللّٰهُ مِنْ حَیْثُ لَمْ یَحْتَسِبُوْا وَقَذَفَ فِیْ قُلُوْبِهِمُ الرُّعْبَ یُخْرِبُوْنَ بُیُوْتَهُمْ بِاَیْدِیْهِمْ وَاَیْدِی الْمُؤْمِنِیْنَ فَاعْتَبِرُوْا یٰۤاُولِی الْاَبْصَارِ",
    "وَلَوْلَاۤ اَنْ كَتَبَ اللّٰهُ عَلَیْهِمُ الْجَلَآءَ لَعَذَّبَهُمْ فِی الدُّنْیَا وَلَهُمْ فِی الْاٰخِرَةِ عَذَابُ النَّارِ",
    "ذٰلِكَ بِاَنَّهُمْ شَآقُّوا اللّٰهَ وَرَسُوْلَهٗ وَمَنْ یُّشَآقِّ اللّٰهَ فَاِنَّ اللّٰهَ شَدِیْدُ الْعِقَابِ",
    "مَا قَطَعْتُمْ مِّنْ لِّیْنَةٍ اَوْ تَرَكْتُمُوْهَا قَآىِٕمَةً عَلٰۤی اُصُوْلِهَا فَبِاِذْنِ اللّٰهِ وَلِیُخْزِیَ الْفٰسِقِیْنَ",
    "وَمَاۤ اَفَآءَ اللّٰهُ عَلٰی رَسُوْلِهٖ مِنْهُمْ فَمَاۤ اَوْجَفْتُمْ عَلَیْهِ مِنْ خَیْلٍ وَّلَا رِكَابٍ وَّلٰكِنَّ اللّٰهَ یُسَلِّطُ رُسُلَهٗ عَلٰی مَنْ یَّشَآءُ وَاللّٰهُ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "مَاۤ اَفَآءَ اللّٰهُ عَلٰی رَسُوْلِهٖ مِنْ اَهْلِ الْقُرٰی فَلِلّٰهِ وَلِلرَّسُوْلِ وَلِذِی الْقُرْبٰی وَالْیَتٰمٰی وَالْمَسٰكِیْنِ وَابْنِ السَّبِیْلِ كَیْ لَا یَكُوْنَ دُوْلَةً بَیْنَ الْاَغْنِیَآءِ مِنْكُمْ وَمَاۤ اٰتٰىكُمُ الرَّسُوْلُ فَخُذُوْهُ وَمَا نَهٰىكُمْ عَنْهُ فَانْتَهُوْا وَاتَّقُوا اللّٰهَ اِنَّ اللّٰهَ شَدِیْدُ الْعِقَابِ",
    "لِلْفُقَرَآءِ الْمُهٰجِرِیْنَ الَّذِیْنَ اُخْرِجُوْا مِنْ دِیَارِهِمْ وَاَمْوَالِهِمْ یَبْتَغُوْنَ فَضْلًا مِّنَ اللّٰهِ وَرِضْوَانًا وَّیَنْصُرُوْنَ اللّٰهَ وَرَسُوْلَهٗ اُولٰٓىِٕكَ هُمُ الصّٰدِقُوْنَ",
    "وَالَّذِیْنَ تَبَوَّءُو الدَّارَ وَالْاِیْمَانَ مِنْ قَبْلِهِمْ یُحِبُّوْنَ مَنْ هَاجَرَ اِلَیْهِمْ وَلَا یَجِدُوْنَ فِیْ صُدُوْرِهِمْ حَاجَةً مِّمَّاۤ اُوْتُوْا وَیُؤْثِرُوْنَ عَلٰۤی اَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ ۫ وَمَنْ یُّوْقَ شُحَّ نَفْسِهٖ فَاُولٰٓىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "وَالَّذِیْنَ جَآءُوْ مِنْ بَعْدِهِمْ یَقُوْلُوْنَ رَبَّنَا اغْفِرْ لَنَا وَلِاِخْوَانِنَا الَّذِیْنَ سَبَقُوْنَا بِالْاِیْمَانِ وَلَا تَجْعَلْ فِیْ قُلُوْبِنَا غِلًّا لِّلَّذِیْنَ اٰمَنُوْا رَبَّنَاۤ اِنَّكَ رَءُوْفٌ رَّحِیْمٌ",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ نَافَقُوْا یَقُوْلُوْنَ لِاِخْوَانِهِمُ الَّذِیْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ لَىِٕنْ اُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِیْعُ فِیْكُمْ اَحَدًا اَبَدًا وَّاِنْ قُوْتِلْتُمْ لَنَنْصُرَنَّكُمْ وَاللّٰهُ یَشْهَدُ اِنَّهُمْ لَكٰذِبُوْنَ",
    "لَىِٕنْ اُخْرِجُوْا لَا یَخْرُجُوْنَ مَعَهُمْ وَلَىِٕنْ قُوْتِلُوْا لَا یَنْصُرُوْنَهُمْ وَلَىِٕنْ نَّصَرُوْهُمْ لَیُوَلُّنَّ الْاَدْبَارَ ۫ ثُمَّ لَا یُنْصَرُوْنَ",
    "لَاَنْتُمْ اَشَدُّ رَهْبَةً فِیْ صُدُوْرِهِمْ مِّنَ اللّٰهِ ذٰلِكَ بِاَنَّهُمْ قَوْمٌ لَّا یَفْقَهُوْنَ",
    "لَا یُقَاتِلُوْنَكُمْ جَمِیْعًا اِلَّا فِیْ قُرًی مُّحَصَّنَةٍ اَوْ مِنْ وَّرَآءِ جُدُرٍ بَاْسُهُمْ بَیْنَهُمْ شَدِیْدٌ تَحْسَبُهُمْ جَمِیْعًا وَّقُلُوْبُهُمْ شَتّٰی ذٰلِكَ بِاَنَّهُمْ قَوْمٌ لَّا یَعْقِلُوْنَ",
    "كَمَثَلِ الَّذِیْنَ مِنْ قَبْلِهِمْ قَرِیْبًا ذَاقُوْا وَبَالَ اَمْرِهِمْ وَلَهُمْ عَذَابٌ اَلِیْمٌ",
    "كَمَثَلِ الشَّیْطٰنِ اِذْ قَالَ لِلْاِنْسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ اِنِّیْ بَرِیْٓءٌ مِّنْكَ اِنِّیْۤ اَخَافُ اللّٰهَ رَبَّ الْعٰلَمِیْنَ",
    "فَكَانَ عَاقِبَتَهُمَاۤ اَنَّهُمَا فِی النَّارِ خَالِدَیْنِ فِیْهَا وَذٰلِكَ جَزٰٓؤُا الظّٰلِمِیْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَلْتَنْظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ وَاتَّقُوا اللّٰهَ اِنَّ اللّٰهَ خَبِیْرٌ بِمَا تَعْمَلُوْنَ",
    "وَلَا تَكُوْنُوْا كَالَّذِیْنَ نَسُوا اللّٰهَ فَاَنْسٰىهُمْ اَنْفُسَهُمْ اُولٰٓىِٕكَ هُمُ الْفٰسِقُوْنَ",
    "لَا یَسْتَوِیْۤ اَصْحٰبُ النَّارِ وَاَصْحٰبُ الْجَنَّةِ اَصْحٰبُ الْجَنَّةِ هُمُ الْفَآىِٕزُوْنَ",
    "لَوْ اَنْزَلْنَا هٰذَا الْقُرْاٰنَ عَلٰی جَبَلٍ لَّرَاَیْتَهٗ خَاشِعًا مُّتَصَدِّعًا مِّنْ خَشْیَةِ اللّٰهِ وَتِلْكَ الْاَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ یَتَفَكَّرُوْنَ",
    "هُوَ اللّٰهُ الَّذِیْ لَاۤ اِلٰهَ اِلَّا هُوَ عٰلِمُ الْغَیْبِ وَالشَّهَادَةِ هُوَ الرَّحْمٰنُ الرَّحِیْمُ",
    "هُوَ اللّٰهُ الَّذِیْ لَاۤ اِلٰهَ اِلَّا هُوَ اَلْمَلِكُ الْقُدُّوْسُ السَّلٰمُ الْمُؤْمِنُ الْمُهَیْمِنُ الْعَزِیْزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحٰنَ اللّٰهِ عَمَّا یُشْرِكُوْنَ",
    "هُوَ اللّٰهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْاَسْمَآءُ الْحُسْنٰی یُسَبِّحُ لَهٗ مَا فِی السَّمٰوٰتِ وَالْاَرْضِ وَهُوَ الْعَزِیْزُ الْحَكِیْمُ"
  ],
  "bengali": [
    "আসমানসমূহে ও যমীনে যা কিছু আছে সবই আল্লাহর তাসবীহ পাঠ করছে এবং তিনি মহা পরাক্রমশালী, প্রজ্ঞাময়।",
    "আহলে কিতাবদের মধ্যে যারা কুফরী করেছিল তিনিই তাদেরকে তাদের ঘর-বাড়ী থেকে বের করে দিয়েছিলেন প্রথমবারের মত। তোমরা ধারণাও করনি যে, তারা বেরিয়ে যাবে। আর তারা ধারণা করেছিল যে, তাদের দুর্গগুলো তাদেরকে আল্লাহর আযাব থেকে রক্ষা করবে। কিন্তু আল্লাহর আযাব এমন এক দিক থেকে আসল যা তারা কল্পনাও করতে পারেনি এবং তিনি তাদের অন্তরসমূহে ত্রাসের সঞ্চার করলেন, ফলে তারা তাদের বাড়ী-ঘর আপন হাতে ও মুমিনদের হাতে ধ্বংস করতে শুরু করল। অতএব হে দৃষ্টিমান লোকেরা তোমরা উপদেশ গ্রহণ কর।’",
    "আর আল্লাহ যদি তাদের জন্য নির্বাসন লিপিবদ্ধ না করতেন, তবে তিনি তাদেরকে দুনিয়াতে শাস্তি দিতেন এবং তাদের জন্য আখিরাতে রয়েছে আগুনের শাস্তি।",
    "এটি এ জন্য যে, তারা সত্যিই আল্লাহ ও তাঁর রাসূলের বিরুদ্ধাচরণ করেছিল। আর যে আল্লাহর বিরুদ্ধাচরণ করে, তবে নিশ্চয় আল্লাহ আযাব প্রদানে কঠোর।",
    "তোমরা যে সব নতুন খেজুর গাছ কেটে ফেলছ অথবা সেগুলোকে তাদের মূলের ওপর দাঁড়িয়ে থাকতে দিয়েছ। তা তো ছিল আল্লাহর অনুমতিক্রমে এবং যাতে তিনি ফাসিকদের লাঞ্ছিত করতে পারেন।",
    "আল্লাহ ইয়াহুদীদের নিকট থেকে তাঁর রাসূলকে ফায়* হিসেবে যা দিয়েছেন তোমরা তার জন্য কোন ঘোড়া বা উটে আরোহণ করে অভিযান পরিচালনা করনি। বরং আল্লাহ তাঁর রাসূলগণকে যাদের ওপর ইচ্ছা কতৃত্ব প্রদান করেন। আল্লাহ সকল কিছুর ওপর সর্বশক্তিমান। \n*যুদ্ধ ছাড়াই যে ধন-সম্পদ অর্জিত হয় তাকে في বলে। এটি সাধারণত বায়তুল মালে জমা রাখা হয় এবং রাসূল স্বীয় তত্ত্বাবধানে রাষ্ট্রীয় প্রয়োজনে তা ব্যবহার করতেন। আর যুদ্ধের মাধ্যমে যা অর্জিত হয় তাকে গনিমত غنيمت বলা হয়।",
    "আল্লাহ জনপদবাসীদের নিকট থেকে তাঁর রাসূলকে ফায় হিসেবে যা দিয়েছেন তা আল্লাহর, রাসূলের, আত্মীয়-স্বজনদের, ইয়াতীমদের, মিসকীন ও মুসাফিরদের এটি এ জন্য যে, যাতে ধন-সম্পদ তোমাদের মধ্যকার বিত্তশালীদের মাঝেই কেবল আবর্তিত না থাকে। রাসূল তোমাদের যা দেয় তা গ্রহণ কর, আর যা থেকে সে তোমাদের নিষেধ করে তা থেকে বিরত হও এবং আল্লাহকেই ভয় কর, নিশ্চয় আল্লাহ শাস্তি প্রদানে কঠোর।",
    "এই সম্পদ নিঃস্ব মুহাজিরগণের জন্য ও যাদেরকে নিজেদের ঘর-বাড়ী ও ধন-সম্পত্তি থেকে বের করে দেয়া হয়েছিল। অথচ এরা আল্লাহর অনুগ্রহ ও সন্তুষ্টির অন্বেষণ করে এবং আল্লাহ ও তাঁর রাসূলকে সাহায্য করেন। এরাই তো সত্যবাদী।",
    "আর মুহাজিরদের আগমনের পূর্বে যারা মদীনাকে নিবাস হিসেবে গ্রহণ করেছিল এবং ঈমান এনেছিল (তাদের জন্যও এ সম্পদে অংশ রয়েছে), আর যারা তাদের কাছে হিজরত করে এসেছে তাদেরকে ভালবাসে। আর মুহাজরিদেরকে যা প্রদান করা হয়েছে তার জন্য এরা তাদের অন্তরে কোন ঈর্ষা অনুভব করে না। এবং নিজেদের অভাব থাকা সত্ত্বেও নিজেদের ওপর তাদেরকে অগ্রাধিকার দেয়। যাদের মনের কার্পণ্য থেকে রক্ষা করা হয়েছে, তারাই সফলকাম।",
    "যারা তাদের পরে এসেছে তারা বলে: ‘হে আমাদের রব, আমাদেরকে ও আমাদের ভাই যারা ঈমান নিয়ে আমাদের পূর্বে অতিক্রান্ত হয়েছে তাদেরকে ক্ষমা করুন; এবং যারা ঈমান এনেছিল তাদের জন্য আমাদের অন্তরে কোন বিদ্বেষ রাখবেন না; হে আমাদের রব, নিশ্চয় আপনি দয়াবান, পরম দয়ালু।",
    "তুমি কি মুনাফিকদেরকে দেখনি যারা আহলে কিতাবের মধ্য হতে তাদের কাফির ভাইদেরকে বলে, ‘তোমাদেরকে বের করে দেয়া হলে আমরাও তোমাদের সাথে অবশ্য বেরিয়ে যাব এবং তোমাদের ব্যাপারে আমরা কখনোই কারো আনুগত্য করব না। আর তোমাদের সাথে যুদ্ধ করা হলে আমরা অবশ্যই তোমাদেরকে সাহায্য করব।’ আর আল্লাহ সাক্ষ্য দিচ্ছেন যে, তারা মিথ্যাবাদী।",
    "তারা (ইহুদিরা) যদি বহিষ্কৃত হয় তবে এরা (মুনাফিকরা) কখনো তাদের সাথে বেরিয়ে যাবে না আর তাদের (ইয়াহুদীদের) সাথে যদি যুদ্ধ করা হয় এরা (মুনাফিকরা) কখনো তাদেরকে সাহায্য করবে না। আর যদি তাদেরকে সাহায্য করে তবে তারা অবশ্যই পিঠ দেখিয়ে পালাবে; এরপর তারা কোন সাহায্যই পাবে না।",
    "প্রকৃতপক্ষে তাদের অন্তরে আল্লাহর চাইতে তোমাদের ভয় বেশী; এটা এ কারণে যে, তারা অবুঝ সম্প্রদায়।",
    "তারা সম্মিলিতিভাবে তোমাদের বিরুদ্ধে যুদ্ধ করবে না তবে সুরক্ষিত জনপদের মধ্যে অবস্থান করে বা দেয়ালের পেছন হতে; তারা নিজেরা নিজেদেরকে প্রবল শক্তিধর মনে করে; তুমি তাদেরকে ঐক্যবদ্ধ মনে করছ অথচ তাদের অন্তরসমূহ বিচ্ছিন্ন। এটি এজন্য যে, তারা নির্বোধ সম্প্রদায়।",
    "তাদের অব্যবহিত পূর্বসূরিদের ন্যায়, যারা নিজেদের কৃতকর্মের কুফল আস্বাদন করেছে; আর তাদের জন্য রয়েছে যন্ত্রণাদায়ক আযাব।",
    "(এরা) শয়তান-এর ন্যায়, সে মানুষকে বলেছিল, ‘কুফরি কর’, অতঃপর যখন সে কুফরি করল তখন সে বলল, আমি তোমার থেকে মুক্ত; নিশ্চয় আমি সকল সৃষ্টির রব আল্লাহকে ভয় করি।",
    "তাদের দু’জনের পরিণতি ছিল এই যে, তারা দু’জনেই জাহান্নামী হবে, সেখানে তারা স্থায়ী হবে; আর এটাই যালিমদের প্রতিদান।",
    "হে ঈমানদারগণ, তোমরা আল্লাহকে ভয় কর; আর প্রত্যেকের উচিত চিন্তা করে দেখা সে আগামীকালের জন্য কি প্রেরণ করেছে; তোমরা আল্লাহকে ভয় কর। তোমরা যা কর নিশ্চয় আল্লাহ সে বিষয়ে সম্যক অবহিত।",
    "তোমরা তাদের মত হইও না, যারা আল্লাহকে ভুলে গিয়েছিল ফলে আল্লাহও তাদেরকে আত্মবিস্মৃত করে দিয়েছিলেন; আর তারাই হল ফাসিক।",
    "জাহান্নামবাসী ও জান্নাতবাসীরা সমান নয়; জান্নাতবাসীরাই সফলকাম।",
    "এ কুরআনকে যদি আমি পাহাড়ের ওপর নাযিল করতাম তবে তুমি অবশ্যই তাকে দেখতে, আল্লাহর ভয়ে বিনীত ও বিদীর্ণ। মানুষের জন্য আমি এ উদাহরণগুলি পেশ করি; হয়ত তারা চিন্তাভাবনা করবে।",
    "তিনিই আল্লাহ, যিনি ছাড়া কোন ইলাহ নেই; দৃশ্য-অদৃশ্যের জ্ঞাতা; তিনিই পরম করুণাময়, দয়ালু।",
    "তিনিই আল্লাহ; যিনি ছাড়া কোন ইলাহ নেই, তিনিই বাদশাহ, মহাপবিত্র, ত্রুটিমুক্ত, নিরাপত্তাদানকারী, রক্ষক, মহাপরাক্রমশালী, মহাপ্রতাপশালী, অতীব মহিমান্বিত, তারা যা শরীক করে তা হতে পবিত্র মহান।",
    "তিনিই আল্লাহ, স্রষ্টা, উদ্ভাবনকর্তা, আকৃতিদানকারী; তাঁর রয়েছে সুন্দর নামসমূহ; আসমান ও যমীনে যা আছে সবই তার মহিমা ঘোষণা করে। তিনি মহাপরাক্রমশালী, প্রজ্ঞাময়।"
  ]
}