{
  "surahName": "Az-Zumar",
  "surahNameArabic": "الزمر",
  "surahNameArabicLong": "سورة الزمر",
  "surahNameTranslation": "The Groups",
  "revelationPlace": "Mecca",
  "totalAyah": 75,
  "surahNo": 39,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/39.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/039.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/39.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/039.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/39.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/039.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/39.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/039.mp3"
    }
  },
  "english": [
    "The revelation of this Book is from Allah—the Almighty, All-Wise.",
    "Indeed, We have sent down the Book to you ˹O Prophet˺ in truth, so worship Allah ˹alone˺, being sincerely devoted to Him.",
    "Indeed, sincere devotion is due ˹only˺ to Allah. As for those who take other lords besides Him, ˹saying,˺ “We worship them only so they may bring us closer to Allah,” surely Allah will judge between all regarding what they differed about. Allah certainly does not guide whoever persists in lying and disbelief.",
    "Had it been Allah’s Will to have offspring, He could have chosen whatever He willed of His creation. Glory be to Him! He is Allah—the One, the Supreme.",
    "He created the heavens and the earth for a purpose. He wraps the night around the day, and wraps the day around the night. And He has subjected the sun and the moon, each orbiting for an appointed term. He is truly the Almighty, Most Forgiving.",
    "He created you ˹all˺ from a single soul, then from it He made its mate. And He produced for you four pairs of cattle. He creates you in the wombs of your mothers ˹in stages˺, one development after another, in three layers of darkness. That is Allah—your Lord! All authority belongs to Him. There is no god ˹worthy of worship˺ except Him. How can you then be turned away?",
    "If you disbelieve, then ˹know that˺ Allah is truly not in need of you, nor does He approve of disbelief from His servants. But if you become grateful ˹through faith˺, He will appreciate that from you. No soul burdened with sin will bear the burden of another. Then to your Lord is your return, and He will inform you of what you used to do. He certainly knows best what is ˹hidden˺ in the heart.",
    "When one is touched with hardship, they cry out to their Lord, turning to Him ˹alone˺. But as soon as He showers them with blessings from Him, they ˹totally˺ forget the One they had cried to earlier, and set up equals to Allah to mislead ˹others˺ from His Way. Say, ˹O Prophet,˺ “Enjoy your disbelief for a little while! You will certainly be one of the inmates of the Fire.”",
    "˹Are they better˺ or those who worship ˹their Lord˺ devoutly in the hours of the night, prostrating and standing, fearing the Hereafter and hoping for the mercy of their Lord? Say, ˹O Prophet,˺ “Are those who know equal to those who do not know?” None will be mindful ˹of this˺ except people of reason.",
    "Say ˹O Prophet, that Allah says˺, “O My servants who believe! Be mindful of your Lord. Those who do good in this world will have a good reward. And Allah’s earth is spacious. Only those who endure patiently will be given their reward without limit.”",
    "Say, “I am commanded to worship Allah, being sincerely devoted to Him ˹alone˺.",
    "And I am commanded to be the first of those who submit ˹to His Will˺.”",
    "Say, “I truly fear—if I were to disobey my Lord—the torment of a tremendous Day.”",
    "Say, “It is ˹only˺ Allah that I worship, being sincere in my devotion to Him.",
    "Worship then whatever ˹gods˺ you want instead of Him.” Say, “The ˹true˺ losers are those who will lose themselves and their families on Judgment Day. That is indeed the clearest loss.”",
    "They will have layers of fire above and below them. That is what Allah warns His servants with. So fear Me, O  My servants!",
    "And those who shun the worship of false gods, turning to Allah ˹alone˺, will have good news. So give good news to My servants ˹O Prophet˺—",
    "those who listen to what is said and follow the best of it. These are the ones ˹rightly˺ guided by Allah, and these are ˹truly˺ the people of reason.",
    "What about those against whom the decree of torment has been justified? Is it you ˹O Prophet˺ who will then save those bound for the Fire?",
    "But those mindful of their Lord will have ˹elevated˺ mansions, built one above the other, under which rivers flow. ˹That is˺ the promise of Allah. ˹And˺ Allah never fails in ˹His˺ promise.",
    "Do you not see that Allah sends down rain from the sky—channelling it through streams in the earth—then produces with it crops of various colours, then they dry up and you see them wither, and then He reduces them to chaff? Surely in this is a reminder for people of reason.",
    "Can ˹the misguided be like˺ those whose hearts Allah has opened to Islam, so they are enlightened by their Lord? So woe to those whose hearts are hardened at the remembrance of Allah! It is they who are clearly astray.",
    "˹It is˺ Allah ˹Who˺ has sent down the best message—a Book of perfect consistency and repeated lessons—which causes the skin ˹and hearts˺ of those who fear their Lord to tremble, then their skin and hearts soften at the mention of ˹the mercy of˺ Allah. That is the guidance of Allah, through which He guides whoever He wills. But whoever Allah leaves to stray will be left with no guide.",
    "Are those who will only have their ˹bare˺ faces to shield themselves from the awful torment on Judgment Day ˹better than those in Paradise˺? It will ˹then˺ be said to the wrongdoers: “Reap what you sowed!”",
    "Those before them ˹also˺ rejected ˹the truth˺, then the torment came upon them from where they least expected.",
    "So Allah made them taste humiliation in this worldly life, but far worse is the punishment of the Hereafter, if only they knew.",
    "We have certainly set forth every ˹kind of˺ lesson for people in this Quran, so perhaps they will be mindful.",
    "˹It is˺ a Quran ˹revealed˺ in Arabic without any crookedness, so perhaps they will be conscious ˹of Allah˺.",
    "Allah sets forth the parable of a slave owned by several quarrelsome masters, and a slave owned by only one master. Are they equal in condition? Praise be to Allah! In fact, most of them do not know.",
    "You ˹O Prophet˺ will certainly die, and they will die too.",
    "Then on the Day of Judgment you will ˹all settle your˺ dispute before your Lord.",
    "Who then does more wrong than those who lie about Allah and reject the truth after it has reached them? Is Hell not a ˹fitting˺ home for the disbelievers?",
    "And the one who has brought the truth and those who embrace it—it is they who are the righteous.",
    "They will have whatever they desire with their Lord. That is the reward of the good-doers.",
    "As such, Allah will absolve them of ˹even˺ the worst of what they did and reward them according to the best of what they used to do.",
    "Is Allah not sufficient for His servant? Yet they threaten you with other ˹powerless˺ gods besides Him! Whoever Allah leaves to stray will be left with no guide.",
    "And whoever Allah guides, none can lead astray. Is Allah not Almighty, capable of punishment?",
    "If you ask them ˹O Prophet˺ who created the heavens and the earth, they will certainly say, “Allah!” Ask ˹them˺, “Consider then whatever ˹idols˺ you invoke besides Allah: if it was Allah’s Will to harm me, could they undo that harm? Or if He willed ˹some˺ mercy for me, could they withhold His mercy?” Say, “Allah is sufficient for me. In Him ˹alone˺ the faithful put their trust.”",
    "Say, ˹O Prophet,˺ “O my people! Persist in your ways, for I ˹too˺ will persist in mine. You will soon come to know",
    "who will be visited by a humiliating torment ˹in this life˺ and overwhelmed by an everlasting punishment ˹in the next˺.”",
    "Surely We have revealed to you the Book ˹O Prophet˺ with the truth for humanity. So whoever chooses to be guided, it is for their own good. And whoever chooses to stray, it is only to their own loss. You are not a keeper over them.",
    "˹It is˺ Allah ˹Who˺ calls back the souls ˹of people˺ upon their death as well as ˹the souls˺ of the living during their sleep. Then He keeps those for whom He has ordained death, and releases the others until ˹their˺ appointed time. Surely in this are signs for people who reflect.",
    "Or have they taken others besides Allah as intercessors? Say, ˹O Prophet,˺ “˹Would they do so,˺ even though those ˹idols˺ have neither authority nor intelligence?”",
    "Say, “All intercession belongs to Allah ˹alone˺. To Him belongs the kingdom of the heavens and the earth. Then to Him you will ˹all˺ be returned.”",
    "Yet when Allah alone is mentioned, the hearts of those who disbelieve in the Hereafter are filled with disgust. But as soon as those ˹gods˺ other than Him are mentioned, they are filled with joy.",
    "Say, ˹O Prophet,˺ “O Allah—Originator of the heavens and the earth, Knower of the seen and unseen! You will judge between Your servants regarding their differences.”",
    "Even if the wrongdoers were to possess everything in the world twice over, they would certainly offer it to ransom themselves from the horrible punishment on Judgment Day, for they will see from Allah what they had never expected.",
    "And the evil ˹consequences˺ of their deeds will unfold before them, and they will be overwhelmed by what they used to ridicule.",
    "When one is touched with hardship, they cry out to Us ˹alone˺. Then when We shower Our blessings upon them, they say, “I have been granted all this only because of ˹my˺ knowledge.” Not at all! It is ˹no more than˺ a test. But most of them do not know.",
    "The same had already been said by those ˹destroyed˺ before them, but their ˹worldly˺ gains were of no benefit to them.",
    "So the evil ˹consequences˺ of their deeds overtook them. And the wrongdoers among these ˹pagans˺ will be overtaken by the evil ˹consequences˺ of their deeds. And they will have no escape.",
    "Do they not know that Allah gives abundant or limited provisions to whoever He wills? Surely in this are signs for people who believe.",
    "Say, ˹O Prophet, that Allah says,˺ “O My servants who have exceeded the limits against their souls! Do not lose hope in Allah’s mercy, for Allah certainly forgives all sins. He is indeed the All-Forgiving, Most Merciful.",
    "Turn to your Lord ˹in repentance˺, and ˹fully˺ submit to Him before the punishment reaches you, ˹for˺ then you will not be helped.",
    "Follow ˹the Quran,˺ the best of what has been revealed to you from your Lord, before the punishment takes you by surprise while you are unaware",
    "so that no ˹sinful˺ soul will say ˹on Judgment Day˺, ‘Woe to me for neglecting ˹my duties towards˺ Allah, while ridiculing ˹the truth˺.’",
    "Or ˹a soul will˺ say, ‘If only Allah had guided me, I would have certainly been one of the righteous.’",
    "Or say, upon seeing the torment, ‘If only I had a second chance, I would have been one of the good-doers.’",
    "Not at all! My revelations had already come to you, but you rejected them, acted arrogantly, and were one of the disbelievers.”",
    "On the Day of Judgment you will see those who lied about Allah with their faces gloomy. Is Hell not a ˹fitting˺ home for the arrogant?",
    "And Allah will deliver those who were mindful ˹of Him˺ to their place of ˹ultimate˺ triumph. No evil will touch them, nor will they grieve.",
    "Allah is the Creator of all things, and He is the Maintainer of everything.",
    "To Him belong the keys ˹of the treasuries˺ of the heavens and the earth. As for those who rejected the signs of Allah, it is they who will be the ˹true˺ losers.",
    "Say, ˹O Prophet,˺ “Are you urging me to worship ˹anyone˺ other than Allah, O  ignorant ones?”",
    "It has already been revealed to you—and to those ˹prophets˺ before you—that if you associate others ˹with Allah˺, your deeds will certainly be void and you will truly be one of the losers.",
    "Rather, worship Allah ˹alone˺ and be one of the grateful.",
    "They have not shown Allah His proper reverence—when on the Day of Judgment the ˹whole˺ earth will be in His Grip, and the heavens will be rolled up in His Right Hand. Glorified and Exalted is He above what they associate ˹with Him˺!",
    "The Trumpet will be blown and all those in the heavens and all those on the earth will fall dead, except those Allah wills ˹to spare˺. Then it will be blown again and they will rise up at once, looking on ˹in anticipation˺.",
    "The earth will shine with the light of its Lord, the record ˹of deeds˺ will be laid ˹open˺, the prophets and the witnesses will be brought forward—and judgment will be passed on all with fairness. None will be wronged.",
    "Every soul will be paid in full for its deeds, for Allah knows best what they have done.",
    "Those who disbelieved will be driven to Hell in ˹successive˺ groups. When they arrive there, its gates will be opened and its keepers will ask them: “Did messengers not come to you from among yourselves, reciting to you the revelations of your Lord and warning you of the coming of this Day of yours?” The disbelievers will cry, “Yes ˹indeed˺! But the decree of torment has come to pass against the disbelievers.”",
    "It will be said to them, “Enter the gates of Hell, to stay there forever.” What an evil home for the arrogant!",
    "And those who were mindful of their Lord will be led to Paradise in ˹successive˺ groups. When they arrive at its ˹already˺ open gates, its keepers will say, “Peace be upon you! You have done well, so come in, to stay forever.”",
    "The righteous will say, “Praise be to Allah Who has fulfilled His promise to us, and made us inherit the ˹everlasting˺ land to settle in Paradise wherever we please.” How excellent is the reward of those who work ˹righteousness˺!",
    "You will see the angels all around the Throne, glorifying the praises of their Lord, for judgment will have been passed on all with fairness. And it will be said, “Praise be to Allah—Lord of all worlds!”"
  ],
  "arabic1": [
    "تَنْزِیْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِیْزِ الْحَكِیْمِ",
    "اِنَّاۤ اَنْزَلْنَاۤ اِلَیْكَ الْكِتٰبَ بِالْحَقِّ فَاعْبُدِ اللّٰهَ مُخْلِصًا لَّهُ الدِّیْنَ",
    "اَلَا لِلّٰهِ الدِّیْنُ الْخَالِصُ وَالَّذِیْنَ اتَّخَذُوْا مِنْ دُوْنِهٖۤ اَوْلِیَآءَ مَا نَعْبُدُهُمْ اِلَّا لِیُقَرِّبُوْنَاۤ اِلَی اللّٰهِ زُلْفٰی اِنَّ اللّٰهَ یَحْكُمُ بَیْنَهُمْ فِیْ مَا هُمْ فِیْهِ یَخْتَلِفُوْنَ اِنَّ اللّٰهَ لَا یَهْدِیْ مَنْ هُوَ كٰذِبٌ كَفَّارٌ",
    "لَوْ اَرَادَ اللّٰهُ اَنْ یَّتَّخِذَ وَلَدًا لَّاصْطَفٰی مِمَّا یَخْلُقُ مَا یَشَآءُ سُبْحٰنَهٗ هُوَ اللّٰهُ الْوَاحِدُ الْقَهَّارُ",
    "خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّ یُكَوِّرُ الَّیْلَ عَلَی النَّهَارِ وَیُكَوِّرُ النَّهَارَ عَلَی الَّیْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ یَّجْرِیْ لِاَجَلٍ مُّسَمًّی اَلَا هُوَ الْعَزِیْزُ الْغَفَّارُ",
    "خَلَقَكُمْ مِّنْ نَّفْسٍ وَّاحِدَةٍ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَاَنْزَلَ لَكُمْ مِّنَ الْاَنْعَامِ ثَمٰنِیَةَ اَزْوَاجٍ یَخْلُقُكُمْ فِیْ بُطُوْنِ اُمَّهٰتِكُمْ خَلْقًا مِّنْ بَعْدِ خَلْقٍ فِیْ ظُلُمٰتٍ ثَلٰثٍ ذٰلِكُمُ اللّٰهُ رَبُّكُمْ لَهُ الْمُلْكُ لَاۤ اِلٰهَ اِلَّا هُوَ فَاَنّٰی تُصْرَفُوْنَ",
    "اِنْ تَكْفُرُوْا فَاِنَّ اللّٰهَ غَنِیٌّ عَنْكُمْ ۫ وَلَا یَرْضٰی لِعِبَادِهِ الْكُفْرَ وَاِنْ تَشْكُرُوْا یَرْضَهُ لَكُمْ وَلَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰی ثُمَّ اِلٰی رَبِّكُمْ مَّرْجِعُكُمْ فَیُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ اِنَّهٗ عَلِیْمٌۢ بِذَاتِ الصُّدُوْرِ",
    "وَاِذَا مَسَّ الْاِنْسَانَ ضُرٌّ دَعَا رَبَّهٗ مُنِیْبًا اِلَیْهِ ثُمَّ اِذَا خَوَّلَهٗ نِعْمَةً مِّنْهُ نَسِیَ مَا كَانَ یَدْعُوْۤا اِلَیْهِ مِنْ قَبْلُ وَجَعَلَ لِلّٰهِ اَنْدَادًا لِّیُضِلَّ عَنْ سَبِیْلِهٖ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِیْلًا ۖ اِنَّكَ مِنْ اَصْحٰبِ النَّارِ",
    "اَمَّنْ هُوَ قَانِتٌ اٰنَآءَ الَّیْلِ سَاجِدًا وَّقَآىِٕمًا یَّحْذَرُ الْاٰخِرَةَ وَیَرْجُوْا رَحْمَةَ رَبِّهٖ قُلْ هَلْ یَسْتَوِی الَّذِیْنَ یَعْلَمُوْنَ وَالَّذِیْنَ لَا یَعْلَمُوْنَ اِنَّمَا یَتَذَكَّرُ اُولُوا الْاَلْبَابِ",
    "قُلْ یٰعِبَادِ الَّذِیْنَ اٰمَنُوا اتَّقُوْا رَبَّكُمْ لِلَّذِیْنَ اَحْسَنُوْا فِیْ هٰذِهِ الدُّنْیَا حَسَنَةٌ وَاَرْضُ اللّٰهِ وَاسِعَةٌ اِنَّمَا یُوَفَّی الصّٰبِرُوْنَ اَجْرَهُمْ بِغَیْرِ حِسَابٍ",
    "قُلْ اِنِّیْۤ اُمِرْتُ اَنْ اَعْبُدَ اللّٰهَ مُخْلِصًا لَّهُ الدِّیْنَ",
    "وَاُمِرْتُ لِاَنْ اَكُوْنَ اَوَّلَ الْمُسْلِمِیْنَ",
    "قُلْ اِنِّیْۤ اَخَافُ اِنْ عَصَیْتُ رَبِّیْ عَذَابَ یَوْمٍ عَظِیْمٍ",
    "قُلِ اللّٰهَ اَعْبُدُ مُخْلِصًا لَّهٗ دِیْنِیْ",
    "فَاعْبُدُوْا مَا شِئْتُمْ مِّنْ دُوْنِهٖ قُلْ اِنَّ الْخٰسِرِیْنَ الَّذِیْنَ خَسِرُوْۤا اَنْفُسَهُمْ وَاَهْلِیْهِمْ یَوْمَ الْقِیٰمَةِ اَلَا ذٰلِكَ هُوَ الْخُسْرَانُ الْمُبِیْنُ",
    "لَهُمْ مِّنْ فَوْقِهِمْ ظُلَلٌ مِّنَ النَّارِ وَمِنْ تَحْتِهِمْ ظُلَلٌ ذٰلِكَ یُخَوِّفُ اللّٰهُ بِهٖ عِبَادَهٗ یٰعِبَادِ فَاتَّقُوْنِ",
    "وَالَّذِیْنَ اجْتَنَبُوا الطَّاغُوْتَ اَنْ یَّعْبُدُوْهَا وَاَنَابُوْۤا اِلَی اللّٰهِ لَهُمُ الْبُشْرٰی فَبَشِّرْ عِبَادِ",
    "الَّذِیْنَ یَسْتَمِعُوْنَ الْقَوْلَ فَیَتَّبِعُوْنَ اَحْسَنَهٗ اُولٰٓىِٕكَ الَّذِیْنَ هَدٰىهُمُ اللّٰهُ وَاُولٰٓىِٕكَ هُمْ اُولُوا الْاَلْبَابِ",
    "اَفَمَنْ حَقَّ عَلَیْهِ كَلِمَةُ الْعَذَابِ اَفَاَنْتَ تُنْقِذُ مَنْ فِی النَّارِ",
    "لٰكِنِ الَّذِیْنَ اتَّقَوْا رَبَّهُمْ لَهُمْ غُرَفٌ مِّنْ فَوْقِهَا غُرَفٌ مَّبْنِیَّةٌ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ وَعْدَ اللّٰهِ لَا یُخْلِفُ اللّٰهُ الْمِیْعَادَ",
    "اَلَمْ تَرَ اَنَّ اللّٰهَ اَنْزَلَ مِنَ السَّمَآءِ مَآءً فَسَلَكَهٗ یَنَابِیْعَ فِی الْاَرْضِ ثُمَّ یُخْرِجُ بِهٖ زَرْعًا مُّخْتَلِفًا اَلْوَانُهٗ ثُمَّ یَهِیْجُ فَتَرٰىهُ مُصْفَرًّا ثُمَّ یَجْعَلُهٗ حُطَامًا اِنَّ فِیْ ذٰلِكَ لَذِكْرٰی لِاُولِی الْاَلْبَابِ",
    "اَفَمَنْ شَرَحَ اللّٰهُ صَدْرَهٗ لِلْاِسْلَامِ فَهُوَ عَلٰی نُوْرٍ مِّنْ رَّبِّهٖ فَوَیْلٌ لِّلْقٰسِیَةِ قُلُوْبُهُمْ مِّنْ ذِكْرِ اللّٰهِ اُولٰٓىِٕكَ فِیْ ضَلٰلٍ مُّبِیْنٍ",
    "اَللّٰهُ نَزَّلَ اَحْسَنَ الْحَدِیْثِ كِتٰبًا مُّتَشَابِهًا مَّثَانِیَ تَقْشَعِرُّ مِنْهُ جُلُوْدُ الَّذِیْنَ یَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِیْنُ جُلُوْدُهُمْ وَقُلُوْبُهُمْ اِلٰی ذِكْرِ اللّٰهِ ذٰلِكَ هُدَی اللّٰهِ یَهْدِیْ بِهٖ مَنْ یَّشَآءُ وَمَنْ یُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ هَادٍ",
    "اَفَمَنْ یَّتَّقِیْ بِوَجْهِهٖ سُوْٓءَ الْعَذَابِ یَوْمَ الْقِیٰمَةِ وَقِیْلَ لِلظّٰلِمِیْنَ ذُوْقُوْا مَا كُنْتُمْ تَكْسِبُوْنَ",
    "كَذَّبَ الَّذِیْنَ مِنْ قَبْلِهِمْ فَاَتٰىهُمُ الْعَذَابُ مِنْ حَیْثُ لَا یَشْعُرُوْنَ",
    "فَاَذَاقَهُمُ اللّٰهُ الْخِزْیَ فِی الْحَیٰوةِ الدُّنْیَا وَلَعَذَابُ الْاٰخِرَةِ اَكْبَرُ لَوْ كَانُوْا یَعْلَمُوْنَ",
    "وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِیْ هٰذَا الْقُرْاٰنِ مِنْ كُلِّ مَثَلٍ لَّعَلَّهُمْ یَتَذَكَّرُوْنَ",
    "قُرْاٰنًا عَرَبِیًّا غَیْرَ ذِیْ عِوَجٍ لَّعَلَّهُمْ یَتَّقُوْنَ",
    "ضَرَبَ اللّٰهُ مَثَلًا رَّجُلًا فِیْهِ شُرَكَآءُ مُتَشٰكِسُوْنَ وَرَجُلًا سَلَمًا لِّرَجُلٍ هَلْ یَسْتَوِیٰنِ مَثَلًا اَلْحَمْدُ لِلّٰهِ بَلْ اَكْثَرُهُمْ لَا یَعْلَمُوْنَ",
    "اِنَّكَ مَیِّتٌ وَّاِنَّهُمْ مَّیِّتُوْنَ",
    "ثُمَّ اِنَّكُمْ یَوْمَ الْقِیٰمَةِ عِنْدَ رَبِّكُمْ تَخْتَصِمُوْنَ",
    "فَمَنْ اَظْلَمُ مِمَّنْ كَذَبَ عَلَی اللّٰهِ وَكَذَّبَ بِالصِّدْقِ اِذْ جَآءَهٗ اَلَیْسَ فِیْ جَهَنَّمَ مَثْوًی لِّلْكٰفِرِیْنَ",
    "وَالَّذِیْ جَآءَ بِالصِّدْقِ وَصَدَّقَ بِهٖۤ اُولٰٓىِٕكَ هُمُ الْمُتَّقُوْنَ",
    "لَهُمْ مَّا یَشَآءُوْنَ عِنْدَ رَبِّهِمْ ذٰلِكَ جَزٰٓؤُا الْمُحْسِنِیْنَ ۖ",
    "لِیُكَفِّرَ اللّٰهُ عَنْهُمْ اَسْوَاَ الَّذِیْ عَمِلُوْا وَیَجْزِیَهُمْ اَجْرَهُمْ بِاَحْسَنِ الَّذِیْ كَانُوْا یَعْمَلُوْنَ",
    "اَلَیْسَ اللّٰهُ بِكَافٍ عَبْدَهٗ وَیُخَوِّفُوْنَكَ بِالَّذِیْنَ مِنْ دُوْنِهٖ وَمَنْ یُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ هَادٍ",
    "وَمَنْ یَّهْدِ اللّٰهُ فَمَا لَهٗ مِنْ مُّضِلٍّ اَلَیْسَ اللّٰهُ بِعَزِیْزٍ ذِی انْتِقَامٍ",
    "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ لَیَقُوْلُنَّ اللّٰهُ قُلْ اَفَرَءَیْتُمْ مَّا تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ اِنْ اَرَادَنِیَ اللّٰهُ بِضُرٍّ هَلْ هُنَّ كٰشِفٰتُ ضُرِّهٖۤ اَوْ اَرَادَنِیْ بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكٰتُ رَحْمَتِهٖ قُلْ حَسْبِیَ اللّٰهُ عَلَیْهِ یَتَوَكَّلُ الْمُتَوَكِّلُوْنَ",
    "قُلْ یٰقَوْمِ اعْمَلُوْا عَلٰی مَكَانَتِكُمْ اِنِّیْ عَامِلٌ فَسَوْفَ تَعْلَمُوْنَ",
    "مَنْ یَّاْتِیْهِ عَذَابٌ یُّخْزِیْهِ وَیَحِلُّ عَلَیْهِ عَذَابٌ مُّقِیْمٌ",
    "اِنَّاۤ اَنْزَلْنَا عَلَیْكَ الْكِتٰبَ لِلنَّاسِ بِالْحَقِّ فَمَنِ اهْتَدٰی فَلِنَفْسِهٖ وَمَنْ ضَلَّ فَاِنَّمَا یَضِلُّ عَلَیْهَا وَمَاۤ اَنْتَ عَلَیْهِمْ بِوَكِیْلٍ",
    "اَللّٰهُ یَتَوَفَّی الْاَنْفُسَ حِیْنَ مَوْتِهَا وَالَّتِیْ لَمْ تَمُتْ فِیْ مَنَامِهَا فَیُمْسِكُ الَّتِیْ قَضٰی عَلَیْهَا الْمَوْتَ وَیُرْسِلُ الْاُخْرٰۤی اِلٰۤی اَجَلٍ مُّسَمًّی اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّقَوْمٍ یَّتَفَكَّرُوْنَ",
    "اَمِ اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ شُفَعَآءَ قُلْ اَوَلَوْ كَانُوْا لَا یَمْلِكُوْنَ شَیْـًٔا وَّلَا یَعْقِلُوْنَ",
    "قُلْ لِّلّٰهِ الشَّفَاعَةُ جَمِیْعًا لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ ثُمَّ اِلَیْهِ تُرْجَعُوْنَ",
    "وَاِذَا ذُكِرَ اللّٰهُ وَحْدَهُ اشْمَاَزَّتْ قُلُوْبُ الَّذِیْنَ لَا یُؤْمِنُوْنَ بِالْاٰخِرَةِ وَاِذَا ذُكِرَ الَّذِیْنَ مِنْ دُوْنِهٖۤ اِذَا هُمْ یَسْتَبْشِرُوْنَ",
    "قُلِ اللّٰهُمَّ فَاطِرَ السَّمٰوٰتِ وَالْاَرْضِ عٰلِمَ الْغَیْبِ وَالشَّهَادَةِ اَنْتَ تَحْكُمُ بَیْنَ عِبَادِكَ فِیْ مَا كَانُوْا فِیْهِ یَخْتَلِفُوْنَ",
    "وَلَوْ اَنَّ لِلَّذِیْنَ ظَلَمُوْا مَا فِی الْاَرْضِ جَمِیْعًا وَّمِثْلَهٗ مَعَهٗ لَافْتَدَوْا بِهٖ مِنْ سُوْٓءِ الْعَذَابِ یَوْمَ الْقِیٰمَةِ وَبَدَا لَهُمْ مِّنَ اللّٰهِ مَا لَمْ یَكُوْنُوْا یَحْتَسِبُوْنَ",
    "وَبَدَا لَهُمْ سَیِّاٰتُ مَا كَسَبُوْا وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ یَسْتَهْزِءُوْنَ",
    "فَاِذَا مَسَّ الْاِنْسَانَ ضُرٌّ دَعَانَا ثُمَّ اِذَا خَوَّلْنٰهُ نِعْمَةً مِّنَّا قَالَ اِنَّمَاۤ اُوْتِیْتُهٗ عَلٰی عِلْمٍ بَلْ هِیَ فِتْنَةٌ وَّلٰكِنَّ اَكْثَرَهُمْ لَا یَعْلَمُوْنَ",
    "قَدْ قَالَهَا الَّذِیْنَ مِنْ قَبْلِهِمْ فَمَاۤ اَغْنٰی عَنْهُمْ مَّا كَانُوْا یَكْسِبُوْنَ",
    "فَاَصَابَهُمْ سَیِّاٰتُ مَا كَسَبُوْا وَالَّذِیْنَ ظَلَمُوْا مِنْ هٰۤؤُلَآءِ سَیُصِیْبُهُمْ سَیِّاٰتُ مَا كَسَبُوْا وَمَا هُمْ بِمُعْجِزِیْنَ",
    "اَوَلَمْ یَعْلَمُوْۤا اَنَّ اللّٰهَ یَبْسُطُ الرِّزْقَ لِمَنْ یَّشَآءُ وَیَقْدِرُ اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّقَوْمٍ یُّؤْمِنُوْنَ",
    "قُلْ یٰعِبَادِیَ الَّذِیْنَ اَسْرَفُوْا عَلٰۤی اَنْفُسِهِمْ لَا تَقْنَطُوْا مِنْ رَّحْمَةِ اللّٰهِ اِنَّ اللّٰهَ یَغْفِرُ الذُّنُوْبَ جَمِیْعًا اِنَّهٗ هُوَ الْغَفُوْرُ الرَّحِیْمُ",
    "وَاَنِیْبُوْۤا اِلٰی رَبِّكُمْ وَاَسْلِمُوْا لَهٗ مِنْ قَبْلِ اَنْ یَّاْتِیَكُمُ الْعَذَابُ ثُمَّ لَا تُنْصَرُوْنَ",
    "وَاتَّبِعُوْۤا اَحْسَنَ مَاۤ اُنْزِلَ اِلَیْكُمْ مِّنْ رَّبِّكُمْ مِّنْ قَبْلِ اَنْ یَّاْتِیَكُمُ الْعَذَابُ بَغْتَةً وَّاَنْتُمْ لَا تَشْعُرُوْنَ",
    "اَنْ تَقُوْلَ نَفْسٌ یّٰحَسْرَتٰی عَلٰی مَا فَرَّطْتُ فِیْ جَنْۢبِ اللّٰهِ وَاِنْ كُنْتُ لَمِنَ السّٰخِرِیْنَ",
    "اَوْ تَقُوْلَ لَوْ اَنَّ اللّٰهَ هَدٰىنِیْ لَكُنْتُ مِنَ الْمُتَّقِیْنَ",
    "اَوْ تَقُوْلَ حِیْنَ تَرَی الْعَذَابَ لَوْ اَنَّ لِیْ كَرَّةً فَاَكُوْنَ مِنَ الْمُحْسِنِیْنَ",
    "بَلٰی قَدْ جَآءَتْكَ اٰیٰتِیْ فَكَذَّبْتَ بِهَا وَاسْتَكْبَرْتَ وَكُنْتَ مِنَ الْكٰفِرِیْنَ",
    "وَیَوْمَ الْقِیٰمَةِ تَرَی الَّذِیْنَ كَذَبُوْا عَلَی اللّٰهِ وُجُوْهُهُمْ مُّسْوَدَّةٌ اَلَیْسَ فِیْ جَهَنَّمَ مَثْوًی لِّلْمُتَكَبِّرِیْنَ",
    "وَیُنَجِّی اللّٰهُ الَّذِیْنَ اتَّقَوْا بِمَفَازَتِهِمْ لَا یَمَسُّهُمُ السُّوْٓءُ وَلَا هُمْ یَحْزَنُوْنَ",
    "اَللّٰهُ خَالِقُ كُلِّ شَیْءٍ وَّهُوَ عَلٰی كُلِّ شَیْءٍ وَّكِیْلٌ",
    "لَهٗ مَقَالِیْدُ السَّمٰوٰتِ وَالْاَرْضِ وَالَّذِیْنَ كَفَرُوْا بِاٰیٰتِ اللّٰهِ اُولٰٓىِٕكَ هُمُ الْخٰسِرُوْنَ",
    "قُلْ اَفَغَیْرَ اللّٰهِ تَاْمُرُوْٓنِّیْۤ اَعْبُدُ اَیُّهَا الْجٰهِلُوْنَ",
    "وَلَقَدْ اُوْحِیَ اِلَیْكَ وَاِلَی الَّذِیْنَ مِنْ قَبْلِكَ لَىِٕنْ اَشْرَكْتَ لَیَحْبَطَنَّ عَمَلُكَ وَلَتَكُوْنَنَّ مِنَ الْخٰسِرِیْنَ",
    "بَلِ اللّٰهَ فَاعْبُدْ وَكُنْ مِّنَ الشّٰكِرِیْنَ",
    "وَمَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖ ۖ وَالْاَرْضُ جَمِیْعًا قَبْضَتُهٗ یَوْمَ الْقِیٰمَةِ وَالسَّمٰوٰتُ مَطْوِیّٰتٌ بِیَمِیْنِهٖ سُبْحٰنَهٗ وَتَعٰلٰی عَمَّا یُشْرِكُوْنَ",
    "وَنُفِخَ فِی الصُّوْرِ فَصَعِقَ مَنْ فِی السَّمٰوٰتِ وَمَنْ فِی الْاَرْضِ اِلَّا مَنْ شَآءَ اللّٰهُ ثُمَّ نُفِخَ فِیْهِ اُخْرٰی فَاِذَا هُمْ قِیَامٌ یَّنْظُرُوْنَ",
    "وَاَشْرَقَتِ الْاَرْضُ بِنُوْرِ رَبِّهَا وَوُضِعَ الْكِتٰبُ وَجِایْٓءَ بِالنَّبِیّٖنَ وَالشُّهَدَآءِ وَقُضِیَ بَیْنَهُمْ بِالْحَقِّ وَهُمْ لَا یُظْلَمُوْنَ",
    "وَوُفِّیَتْ كُلُّ نَفْسٍ مَّا عَمِلَتْ وَهُوَ اَعْلَمُ بِمَا یَفْعَلُوْنَ",
    "وَسِیْقَ الَّذِیْنَ كَفَرُوْۤا اِلٰی جَهَنَّمَ زُمَرًا حَتّٰۤی اِذَا جَآءُوْهَا فُتِحَتْ اَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَاۤ اَلَمْ یَاْتِكُمْ رُسُلٌ مِّنْكُمْ یَتْلُوْنَ عَلَیْكُمْ اٰیٰتِ رَبِّكُمْ وَیُنْذِرُوْنَكُمْ لِقَآءَ یَوْمِكُمْ هٰذَا قَالُوْا بَلٰی وَلٰكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَی الْكٰفِرِیْنَ",
    "قِیْلَ ادْخُلُوْۤا اَبْوَابَ جَهَنَّمَ خٰلِدِیْنَ فِیْهَا فَبِئْسَ مَثْوَی الْمُتَكَبِّرِیْنَ",
    "وَسِیْقَ الَّذِیْنَ اتَّقَوْا رَبَّهُمْ اِلَی الْجَنَّةِ زُمَرًا حَتّٰۤی اِذَا جَآءُوْهَا وَفُتِحَتْ اَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلٰمٌ عَلَیْكُمْ طِبْتُمْ فَادْخُلُوْهَا خٰلِدِیْنَ",
    "وَقَالُوا الْحَمْدُ لِلّٰهِ الَّذِیْ صَدَقَنَا وَعْدَهٗ وَاَوْرَثَنَا الْاَرْضَ نَتَبَوَّاُ مِنَ الْجَنَّةِ حَیْثُ نَشَآءُ فَنِعْمَ اَجْرُ الْعٰمِلِیْنَ",
    "وَتَرَی الْمَلٰٓىِٕكَةَ حَآفِّیْنَ مِنْ حَوْلِ الْعَرْشِ یُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْ وَقُضِیَ بَیْنَهُمْ بِالْحَقِّ وَقِیْلَ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِیْنَ"
  ],
  "bengali": [
    "এই কিতাব অবতীর্ণ আল্লাহর পক্ষ থেকে যিনি মহাপরাক্রমশালী, প্রজ্ঞাময়।",
    "নিশ্চয় আমি তোমার কাছে যথাযথভাবে এই কিতাব নাযিল করেছি; অতএব আল্লাহর ‘ইবাদাত কর তাঁরই আনুগত্যে একনিষ্ঠ হয়ে।",
    "জেনে রেখ, আল্লাহর জন্যই বিশুদ্ধ ইবাদাত-আনুগত্য। আর যারা আল্লাহ ছাড়া অন্যদেরকে অভিভাবক হিসেবে গ্রহণ করে তারা বলে, ‘আমরা কেবল এজন্যই তাদের ‘ইবাদাত করি যে, তারা আমাদেরকে আল্লাহর নিকটবর্তী করে দেবে।’ যে বিষয়ে তারা মতভেদ করছে আল্লাহ নিশ্চয় সে ব্যাপারে তাদের মধ্যে ফয়সালা করে দেবেন। যে মিথ্যাবাদী কাফির, নিশ্চয় আল্লাহ তাকে হিদায়াত দেন না।",
    "আল্লাহ যদি সন্তান গ্রহণ করতে চাইতেন, তাহলে তিনি যা সৃষ্টি করেছেন তা থেকে যাকে ইচ্ছা বেছে নিতেন; কিন্তু তিনি পবিত্র মহান। তিনিই আল্লাহ, তিনি এক, প্রবল পরাক্রান্ত।",
    "তিনি যথাযথভাবে আসমানসমূহ ও যমীন সৃষ্টি করেছেন। তিনি রাতকে দিনের উপর এবং দিনকে রাতের উপর জড়িয়ে দিয়েছেন এবং নিয়ন্ত্রণাধীন করেছেন সূর্য ও চাঁদকে। প্রত্যেকে এক নির্ধারিত সময় পর্যন্ত চলছে। জেনে রাখ, তিনি মহাপরাক্রমশালী, পরম ক্ষমাশীল।",
    "তিনি তোমাদেরকে সৃষ্টি করেছেন এক নাফ্স থেকে, তারপর তা থেকে তার জোড়া সৃষ্টি করেছেন এবং চতুষ্পদ জন্তু থেকে তোমাদের জন্য দিয়েছেন আট জোড়া*; তিনি তোমাদেরকে সৃষ্টি করেন তোমাদের মাতৃগর্ভে; এক সৃষ্টির পর আরেক সৃষ্টি, ত্রিবিধ অন্ধকারে**; তিনিই আল্লাহ; তোমাদের রব; রাজত্ব তাঁরই; তিনি ছাড়া কোন (সত্য) ইলাহ নেই। তারপরও তোমাদেরকে কোথায় ফিরানো হচ্ছে?*** \n* আট জোড়া চতুষ্পদ জন্তু: মেষের দু’টি ও ছাগলের দু’টি, উটের দু’টি ও গরুর দু’টি।",
    "তোমরা যদি কুফরী কর তবে (জেনে রাখ) আল্লাহ তোমাদের থেকে অমুখাপেক্ষী; আর তিনি তাঁর বান্দাদের জন্য কুফরী পছন্দ করেন না এবং তোমরা যদি শোকর কর তবে তোমাদের জন্য তিনি তা পছন্দ করেন; আর কোন বোঝা বহনকারী অপরের বোঝা বহন করে না। তারপর তোমাদের রবের দিকেই তোমাদের প্রত্যাবর্তন হবে। তখন তোমরা যে আমল করতে তিনি তা তোমাদেরকে জানিয়ে দেবেন। নিশ্চয় অন্তরে যা আছে তা তিনি সম্যক অবগত।",
    "আর যখন মানুষকে স্পর্শ করে দুঃখ-দুর্দশা, তখন সে একাগ্রচিত্তে তার রবকে ডাকে, তারপর তিনি যখন তাকে নিজের পক্ষ থেকে নিআমত দান করেন তখন সে ভুলে যায় ইতঃপূর্বে কি কারণে তাঁর কাছে দোয়া করেছিল, আর আল্লাহর সমকক্ষ নির্ধারণ করে, তাঁর পথ থেকে বিচ্যুত করার জন্য। বল, ‘তোমার কুফরী উপভোগ কর ক্ষণকাল; নিশ্চয় তুমি জাহান্নামীদের অন্তর্ভুক্ত।’",
    "যে ব্যক্তি রাতের প্রহরে সিদজাবনত হয়ে ও দাঁড়িয়ে আনুগত্য প্রকাশ করে, আখিরাতকে ভয় করে এবং তার রব-এর রহমত প্রত্যাশা করে (সে কি তার সমান যে এরূপ করে না) বল, ‘যারা জানে আর যারা জানে না তারা কি সমান?’ বিবেকবান লোকেরাই কেবল উপদেশ গ্রহণ করে।",
    "বল, ‘হে আমার মুমিন বান্দারা যারা ঈমান এনেছ, তোমরা তোমাদের রবকে ভয় কর। যারা এ দুনিয়ায় ভাল কাজ করে তাদের জন্য রয়েছে কল্যাণ। আর আল্লাহর যমীন প্রশস্ত, কেবল ধৈর্যশীলদেরকেই তাদের প্রতিদান পূর্ণরূপে দেয়া হবে কোন হিসাব ছাড়াই।’",
    "বল, ‘নিশ্চয় আমাকে নির্দেশ দেয়া হয়েছে আমি যেন আল্লাহর ইবাদাত করি তাঁর-ই জন্য আনুগত্যকে একনিষ্ঠ করে’।",
    "‘আমাকে আরো নির্দেশ দেয়া হয়েছে যেন আমি প্রথম মুসলিম হই।’",
    "বল, ‘আমি যদি আমার রবের অবাধ্য হই তবে আমি এক মহাদিবসের আযাবের আশঙ্কা করি।’",
    "বল, ‘আমি আল্লাহর-ই ইবাদাত করি, তাঁরই জন্য আমার আনুগত্য একনিষ্ঠ করে।’",
    "‘অতএব তাঁকে বাদ দিয়ে অন্য যা কিছুর ইচ্ছা তোমরা ‘ইবাদাত কর’। বল, ‘নিশ্চয় তারা ক্ষতিগ্রস্ত যারা কিয়ামত দিবসে নিজদেরকে ও তাদের পরিবারবর্গকে ক্ষতিগ্রস্ত পাবে। জেনে রেখ, এটাই স্পষ্ট ক্ষতি’।",
    "তাদের জন্য তাদের উপরের দিকে থাকবে আগুনের আচ্ছাদন আর তাদের নিচের দিকেও থাকবে (আগুনের) আচ্ছাদন; এদ্বারা আল্লাহ তাঁর বান্দাদেরকে ভয় দেখান। ‘হে আমার বান্দারা, তোমরা আমাকেই ভয় কর’।",
    "আর যারা তাগূতের উপাসনা পরিহার করে এবং আল্লাহ অভিমুখী হয় তাদের জন্য আছে সুসংবাদ; অতএব আমার বান্দাদেরকে সুসংবাদ দাও।",
    "যারা মনোযোগ সহকারে কথা শোনে অতঃপর তার মধ্যে যা উত্তম তা অনুসরণ করে তাদেরকেই আল্লাহ হিদায়াত দান করেন আর তারাই বুদ্ধিমান।",
    "যার ব্যাপারে আযাবের হুকুম সাব্যস্ত হয়েছে, তুমি কি তাকে উদ্ধার করতে পারবে, যে আছে জাহান্নামে?",
    "কিন্তু যারা নিজদের রবকে ভয় করে তাদের জন্য রয়েছে কক্ষসমূহ যার উপর নির্মিত আছে আরো কক্ষ। তার নিচ দিয়ে নদী প্রবাহিত। এটি আল্লাহর ওয়াদা; আল্লাহ ওয়াদা খেলাফ করেন না।",
    "তুমি কি দেখ না, আল্লাহ আকাশ থেকে পানি বর্ষণ করেন, অতঃপর যমীনে তা প্রস্রবন হিসেবে প্রবাহিত করেন তারপর তা দিয়ে নানা বর্ণের ফসল উৎপন্ন করেন, তারপর তা শুকিয়ে যায়। ফলে তোমরা তা দেখতে পাও হলুদ বর্ণের তারপর তিনি তা খড়-খুটায় পরিণত করেন। এতে অবশ্যই উপদেশ রয়েছে বুদ্ধিমানদের জন্য।",
    "আল্লাহ ইসলামের জন্য যার বক্ষ খুলে দিয়েছেন ফলে সে তার রবের পক্ষ থেকে নূরের উপর রয়েছে, (সে কি তার সমান, যে এরূপ নয়?) অতএব ধ্বংস সে লোকদের জন্য যাদের হৃদয় কঠিন হয়ে গেছে আল্লাহর স্মরণ থেকে। তারা স্পষ্ট বিভ্রান্তিতে নিপতিত।",
    "আল্লাহ নাযিল করেছেন উত্তম বাণী, সাদৃশ্যপূর্ণ একটি কিতাব (আল কুরআন), যা বারবার আবৃত্তি করা হয়। যারা তাদের রবকে ভয় করে, তাদের গা এতে শিহরিত হয়, তারপর তাদের দেহ ও মন আল্লাহর স্মরণে বিনম্র হয়ে যায়। এটা আল্লাহর হিদায়াত, তিনি যাকে চান তাকে এর দ্বারা হিদায়াত করেন। আর আল্লাহ যাকে পথভ্রষ্ট করেন, তার জন্য কোন হিদায়াতকারী নেই।",
    "যে ব্যক্তি কিয়ামতের দিন তার মুখমন্ডল দ্বারা কঠিন আযাব ঠেকাতে চাইবে (সে কি তার মত যে শাস্তি থেকে নিরাপদ?) আর যালিমদেরকে বলা হবে, ‘তোমরা যা অর্জন করতে, তার স্বাদ আস্বাদন কর।",
    "তাদের পূর্বে যারা ছিল, তারাও অস্বীকার করেছিল, ফলে তাদের প্রতি এমন ভাবে আযাব এসেছিল যে, তারা অনুভব করতে পারেনি।",
    "ফলে তাদেরকে আল্লাহ দুনিয়ার জীবনে লাঞ্ছনা আস্বাদন করালেন, আর আখিরাতের আযাব নিশ্চয় আরো বড়, যদি তারা জানত।",
    "আর নিশ্চয় আমি এই কুরআনে মানুষের জন্য প্রত্যেক প্রকার দৃষ্টান্ত বর্ণনা করেছি, যাতে তারা শিক্ষা গ্রহণ করে।",
    "বক্রতামুক্ত আরবী কুরআন। যাতে তারা তাকওয়া অবলম্বন করতে পারে।",
    "আল্লাহ একটি দৃষ্টান্ত উপস্থাপন করেছেন : এক ব্যক্তি যার মনিব অনেক, যারা পরস্পর বিরোধী; এবং আরেক ব্যক্তি, যে এক মনিবের অনুগত, এ দু’জনের অবস্থা কি সমান? সকল প্রশংসা আল্লাহর; কিন্তু তাদের অধিকাংশই জানে না।",
    "নিশ্চয় তুমি মরণশীল এবং তারাও মরণশীল।",
    "তারপর কিয়ামতের দিন নিশ্চয় তোমরা তোমাদের রবের সামনে ঝগড়া করবে।",
    "সুতরাং তার চেয়ে অধিক যালিম আর কে, যে আল্লাহর উপর মিথ্যা আরোপ করে এবং তার কাছে সত্য আসার পর তা অস্বীকার করে? জাহান্নামেই কি কাফিরদের আবাসস্থল নয়?",
    "আর যে সত্য নিয়ে এসেছে এবং যে তা সত্য বলে মেনে নিয়েছে, তারাই হল মুত্তাকী।",
    "তাদের জন্য তাদের রবের কাছে তা-ই রয়েছে যা তারা চাইবে। এটাই মুমিনদের পুরস্কার।",
    "যাতে তারা যেসব মন্দ কাজ করেছিল, আল্লাহ তা ঢেকে দেন এবং তারা যে সর্বোত্তম আমল করত তার প্রতিদানে তাদেরকে পুরস্কৃত করেন।",
    "আল্লাহ কি তাঁর বান্দার জন্য যথেষ্ট নন? অথচ তারা তোমাকে আল্লাহর পরিবর্তে অন্যদের ভয় দেখায়। আর আল্লাহ যাকে পথভ্রষ্ট করেন, তার জন্য কোন হিদায়াতকারী নেই।",
    "আর আল্লাহ যাকে হিদায়াত করেন, তার জন্য কোন পথভ্রষ্টকারী নেই। আল্লাহ কি মহাপরাক্রমশালী প্রতিশোধ গ্রহণকারী নন?",
    "আর তুমি যদি তাদেরকে জিজ্ঞাসা কর, কে আসমানসমূহ ও যমীন সৃষ্টি করেছে? তারা অবশ্যই বলবে ‘আল্লাহ’। বল, ‘তোমরা কি ভেবে দেখেছ- আল্লাহ আমার কোন ক্ষতি চাইলে তোমরা আল্লাহর পরিবর্তে যাদের ডাক তারা কি সেই ক্ষতি দূর করতে পারবে? অথবা তিনি আমাকে রহমত করতে চাইলে তারা সেই রহমত প্রতিরোধ করতে পারবে’? বল, ‘আমার জন্য আল্লাহই যথেষ্ট’। তাওয়াক্কুলকারীগণ তাঁর উপরই তাওয়াক্কুল করে।",
    "বল, ‘হে আমার কওম, তোমরা তোমাদের স্থলে কাজ করে যাও, নিশ্চয় আমিও আমার কাজ করব। অতঃপর শীঘ্রই তোমরা জানতে পারবে’।",
    "কার উপর লাঞ্ছনাদায়ক আযাব আসবে এবং কার উপর স্থায়ী আযাব আপতিত হবে?",
    "নিশ্চয় আমি তোমার প্রতি যথাযথভাবে কিতাব নাযিল করেছি মানুষের জন্য; তাই যে সৎপথ অবলম্বন করে, সে তা নিজের জন্যই করে এবং যে পথভ্রষ্ট হয় সে নিজের ক্ষতির জন্যই পথভ্রষ্ট হয়। আর তুমি তাদের তত্ত্বাবধায়ক নও।",
    "আল্লাহ জীবসমূহের প্রাণ হরণ করেন তাদের মৃত্যুর সময় এবং যারা মরেনি তাদের নিদ্রার সময়। তারপর যার জন্য তিনি মৃত্যুর ফয়সালা করেন তার প্রাণ তিনি রেখে দেন এবং অন্যগুলো ফিরিয়ে দেন একটি নির্দিষ্ট সময় পর্যন্ত। নিশ্চয় এতে চিন্তাশীল কওমের জন্য অনেক নিদর্শন রয়েছে।",
    "তবে কি তারা আল্লাহ ছাড়া অন্যদেরকে সুপারিশকারী বানিয়েছে? বল, ‘তারা কোন কিছুর মালিক না হলেও এবং তারা না বুঝলেও’?",
    "বল, ‘সকল সুপারিশ আল্লাহর মালিকানাধীন। আসমানসমূহ ও যমীনের রাজত্ব একমাত্র তাঁরই। তারপর তোমরা তাঁর কাছেই প্রত্যাবর্তিত হবে’।",
    "যারা আখিরাতে বিশ্বাস করে না, এক আল্লাহর কথা বলা হলে তাদের অন্তর সঙ্কুচিত হয়ে যায়। আর আল্লাহ ছাড়া অন্য উপাস্যগুলোর কথা বলা হলে তখনই তারা আনন্দে উৎফুল্ল হয়।",
    "বল, ‘হে আল্লাহ, আসমানসমূহ ও যমীনের সৃষ্টিকর্তা, গায়েব ও উপস্থিত বিষয়াদির জ্ঞানী; তুমি তোমার বান্দাদের মধ্যে ফয়সালা করে দেবে যাতে তারা মতবিরোধ করছে’।",
    "আর যারা যুলম করেছে, যদি যমীনে যা আছে তা সব এবং এর সমপরিমাণও তাদের জন্য হয়; তবে কিয়ামতের দিন কঠিন আযাব থেকে বাঁচার জন্য মুক্তিপণস্বরূপ তারা তা দিয়ে দেবে। সেখানে আল্লাহর কাছে থেকে তাদের জন্য এমন কিছু প্রকাশিত হবে, যা তারা কখনো কল্পনাও করত না।",
    "আর তারা যা অর্জন করেছিল তার মন্দ ফল তাদের কাছে প্রকাশ হয়ে পড়বে এবং যা নিয়ে তারা ঠাট্টা-বিদ্রূপ করত তা-ই তাদেরকে পরিবেষ্টন করবে।",
    "অতঃপর কোন বিপদাপদ মানুষকে স্পর্শ করলে সে আমাকে ডাকে। তারপর যখন আমি আমার পক্ষ থেকে নি‘আমত দিয়ে তাকে অনুগ্রহ করি তখন সে বলে, ‘জ্ঞানের কারণেই কেবল আমাকে তা দেয়া হয়েছে’। বরং এটা এক পরীক্ষা। কিন্তু তাদের অধিকাংশই তা জানে না।",
    "অবশ্যই তাদের পূর্ববর্তীরা এটা বলেছিল। কিন্তু তারা যা অর্জন করেছে তা তাদের কোন কাজে আসেনি।",
    "সুতরাং তাদের কৃতকর্মের মন্দ ফল তাদের উপর আপতিত হয়েছিল। এদের মধ্যেও যারা যুলম করে তাদের উপরেও তাদের অর্জনের সব মন্দফল শীঘ্রই আপতিত হবে। আর তারা অক্ষম করতে পারবে না।",
    "তারা কি জানে না, আল্লাহ যার জন্য ইচ্ছা করেন রিয্ক প্রশস্ত করে দেন আর সঙ্কুচিত করে দেন? নিশ্চয় এতে মুমিন সম্প্রদায়ের জন্য নিদর্শনাবলী রয়েছে।",
    "বল, ‘হে আমার বান্দাগণ, যারা নিজদের উপর বাড়াবাড়ি করেছ তোমরা আল্লাহর রহমত থেকে নিরাশ হয়ো না। অবশ্যই আল্লাহ সকল পাপ ক্ষমা করে দেবেন। নিশ্চয় তিনি ক্ষমাশীল, পরম দয়ালু’।",
    "আর তোমরা তোমাদের রবের অভিমুখী হও এবং তোমাদের উপর আযাব আসার পূর্বেই তার কাছে আত্মসমর্পণ কর। তার (আযাব আসার) পরে তোমাদেরকে সাহায্য করা হবে না।",
    "আর অনুসরণ কর উত্তম যা নাযিল করা হয়েছে তোমাদের রবের পক্ষ থেকে, তোমাদের উপর অতর্কিতভাবে আযাব আসার পূর্বে। অথচ তোমরা উপলব্ধি করতে পারবে না।",
    "যাতে কাউকেও বলতে না হয়, ‘হায় আফসোস! আল্লাহর হক আদায়ে আমি যে শৈথিল্য করেছিলাম তার জন্য। আর আমি কেবল ঠাট্টা-বিদ্রূপকারীদের মধ্যে অন্তর্ভুক্ত ছিলাম’।",
    "অথবা যাতে কাউকে একথাও বলতে না হয়, ‘আল্লাহ যদি আমাকে হিদায়াত দিতেন তাহলে অবশ্যই আমি মুত্তাকীদের অন্তর্ভুক্ত হতাম’।",
    "অথবা আযাব প্রত্যক্ষ করার সময় যাতে কাউকে একথাও বলতে না হয়, ‘যদি একবার ফিরে যাওয়ার সুযোগ আমার হত, তাহলে আমি মুমিনদের অন্তর্ভুক্ত হতাম’।",
    "হ্যাঁ, অবশ্যই তোমার কাছে আমার নিদর্শনাবলী এসেছিল, অতঃপর তুমি সেগুলোকে অস্বীকার করেছিলে এবং তুমি অহঙ্কার করেছিলে। আর তুমি কাফিরদের অন্তর্ভুক্ত ছিলে।",
    "আর যারা আল্লাহর প্রতি মিথ্যারোপ করে কিয়ামতের দিন তুমি তাদের চেহারাগুলো কালো দেখতে পাবে। অহঙ্কারীদের বাসস্থান জাহান্নামের মধ্যে নয় কি?",
    "আর আল্লাহ মুত্তাকীদেরকে তাদের সাফল্যসহ নাজাত দেবেন। কোন অমঙ্গল তাদেরকে স্পর্শ করবে না। আর তারা চিন্তিতও হবে না।",
    "আল্লাহ সব কিছুর স্রষ্টা এবং তিনি সব কিছুর তত্ত্বাবধায়ক।",
    "আসমানসমূহ ও যমীনের চাবিসমূহ তাঁরই কাছে। আর যারা আল্লাহর আয়াতসমূহকে অস্বীকার করে তারাই ক্ষতিগ্রস্ত।",
    "বল, ‘হে অজ্ঞরা, তোমরা কি আমাকে আল্লাহ ছাড়া অন্যের ইবাদাত করার আদেশ করছ’?",
    "আর অবশ্যই তোমার কাছে এবং তোমার পূর্ববর্তীদের কাছে ওহী পাঠানো হয়েছে যে, তুমি শির্ক করলে তোমার কর্ম নিষ্ফল হবেই। আর অবশ্যই তুমি ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হবে।",
    "বরং তুমি আল্লাহরই ইবাদাত কর এবং কৃতজ্ঞদের অন্তর্ভুক্ত হও।",
    "আর তারা আল্লাহকে যথাযোগ্য মর্যাদা দেয়নি। অথচ কিয়ামতের দিন গোটা পৃথিবীই থাকবে তাঁর মুষ্টিতে এবং আকাশসমূহ তাঁর ডান হাতে ভাঁজ করা থাকবে। তিনি পবিত্র, তারা যাদেরকে শরীক করে তিনি তাদের ঊর্ধ্বে।",
    "আর শিঙ্গায় ফুঁক দেয়া হবে। ফলে আল্লাহ যাদেরকে ইচ্ছা করেন তারা ছাড়া আসমানসমূহে যারা আছে এবং পৃথিবীতে যারা আছে সকলেই বেহুঁশ হয়ে পড়বে। তারপর আবার শিঙ্গায় ফুঁক দেয়া হবে, তখন তারা দাঁড়িয়ে তাকাতে থাকবে।",
    "আর যমীন তার রবের নূরে আলোকিত হবে, আমলনামা উপস্থিত করা হবে এবং নবী ও সাক্ষীগণকে আনা হবে, তাদের মধ্যে ন্যায়বিচার করা হবে। এমতাবস্থায় যে, তাদের প্রতি যুলম করা হবে না।",
    "আর প্রত্যেককে তার আমলের পূর্ণ প্রতিফল দেয়া হবে এবং তারা যা করে সে সম্পর্কে তিনিই সর্বাধিক পরিজ্ঞাত।",
    "আর কাফিরদেরকে দলে দলে জাহান্নামের দিকে হাঁকিয়ে নিয়ে যাওয়া হবে। অবশেষে তারা যখন জাহান্নামের কাছে এসে পৌঁছবে তখন তার দরজাগুলো খুলে দেয়া হবে এবং জাহান্নামের রক্ষীরা তাদেরকে বলবে, ‘তোমাদের মধ্য থেকে তোমাদের কাছে কি রাসূলগণ আসেনি, যারা তোমাদের কাছে তোমাদের রবের আয়াতগুলো তিলাওয়াত করত এবং এ দিনের সাক্ষাৎ সম্পর্কে তোমাদেরকে সতর্ক করত’? তারা বলবে, ‘অবশ্যই এসেছিল’; কিন্তু কাফিরদের উপর আযাবের বাণী সত্যে পরিণত হল।",
    "বলা হবে, ‘তোমরা জাহান্নামের দরজাসমূহে প্রবেশ কর, তাতেই স্থায়ীভাবে থাকার জন্য। অতএব অহঙ্কারীদের আবাসস্থল কতই না নিকৃষ্ট’!",
    "আর যারা তাদের রবকে ভয় করেছে তাদেরকে দলে দলে জান্নাতের দিকে নিয়ে যাওয়া হবে। অবশেষে তারা যখন সেখানে এসে পৌঁছবে এবং এর দরজাসমূহ খুলে দেয়া হবে তখন জান্নাতের রক্ষীরা তাদেরকে বলবে, ‘তোমাদের প্রতি সালাম, তোমরা ভাল ছিলে। অতএব স্থায়ীভাবে থাকার জন্য এখানে প্রবেশ কর’।",
    "আর তারা বলবে, ‘সকল প্রশংসা আল্লাহর জন্য, যিনি আমাদের প্রতি তার ওয়াদাকে সত্য করেছেন। আর আমাদেরকে যমীনের অধিকারী করেছেন। আমরা জান্নাতে যেখানে ইচ্ছা বসবাসের জায়গা করে নেব। অতএব (নেক) আমলকারীদের প্রতিফল কতইনা উত্তম’!",
    "আর তুমি ফেরেশতাদেরকে আরশের চারপাশ ঘিরে তাদের রবের প্রশংসায় তাসবীহ পাঠ করতে দেখতে পাবে। আর তাদের মধ্যে ন্যায়সঙ্গতভাবে বিচার করে দেয়া হবে এবং বলা হবে ‘সকল প্রশংসা সৃষ্টিকুলের রব আল্লাহর জন্য’।"
  ]
}