{
  "surahName": "Al-Mulk",
  "surahNameArabic": "الملك",
  "surahNameArabicLong": "سورة الملك",
  "surahNameTranslation": "The Sovereignty",
  "revelationPlace": "Mecca",
  "totalAyah": 30,
  "surahNo": 67,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/67.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/067.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/67.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/067.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/67.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/067.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/67.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/067.mp3"
    }
  },
  "english": [
    "Blessed is the One in Whose Hands rests all authority. And He is Most Capable of everything.",
    "˹He is the One˺ Who created death and life in order to test which of you is best in deeds. And He is the Almighty, All-Forgiving.",
    "˹He is the One˺ Who created seven heavens, one above the other. You will never see any imperfection in the creation of the Most Compassionate. So look again: do you see any flaws?",
    "Then look again and again—your sight will return frustrated and weary.",
    "And indeed, We adorned the lowest heaven with ˹stars like˺ lamps, and made them ˹as missiles˺ for stoning ˹eavesdropping˺ devils, for whom We have also prepared the torment of the Blaze.",
    "Those who disbelieve in their Lord will suffer the punishment of Hell. What an evil destination!",
    "When they are tossed into it, they will hear its roaring as it boils over",
    "almost bursting in fury. Every time a group is cast into it, its keepers will ask them, “Did a warner not come to you?”",
    "They will reply, “Yes, a warner did come to us, but we denied and said, ‘Allah has revealed nothing. You are extremely astray.’”",
    "And they will lament, “If only we had listened and reasoned, we would not be among the residents of the Blaze!”",
    "And so they will confess their sins. So away with the residents of the Blaze!",
    "Indeed, those in awe of their Lord without seeing Him will have forgiveness and a mighty reward.",
    "Whether you speak secretly or openly—He surely knows best what is ˹hidden˺ in the heart.",
    "How could He not know His Own creation? For He ˹alone˺ is the Most Subtle, All-Aware.",
    "He is the One Who smoothed out the earth for you, so move about in its regions and eat from His provisions. And to Him is the resurrection ˹of all˺.",
    "Do you feel secure that the One Who is in heaven will not cause the earth to swallow you up as it quakes violently?",
    "Or do you feel secure that the One Who is in heaven will not unleash upon you a storm of stones. Only then would you know how ˹serious˺ My warning was!",
    "And certainly those before them denied ˹as well˺, then how severe was My response!",
    "Have they not seen the birds above them, spreading and folding their wings? None holds them up except the Most Compassionate. Indeed, He is All-Seeing of everything.",
    "Also, which ˹powerless˺ force will come to your help instead of the Most Compassionate? Indeed, the disbelievers are only ˹lost˺ in delusion.",
    "Or who is it that will provide for you if He withholds His provision? In fact, they persist in arrogance and aversion ˹to the truth˺.",
    "Who is ˹rightly˺ guided: the one who crawls facedown or the one who walks upright on the Straight Path?",
    "Say, ˹O Prophet,˺ “He is the One Who brought you into being and gave you hearing, sight, and intellect. ˹Yet˺ you hardly give any thanks.”",
    "˹Also˺ say, “He is the One Who has dispersed you ˹all˺ over the earth, and to Him you will ˹all˺ be gathered.”",
    "˹Still˺ they ask ˹the believers˺, “When will this threat come to pass, if what you say is true?”",
    "Say, ˹O Prophet,˺ “That knowledge is with Allah alone, and I am only sent with a clear warning.”",
    "Then when they see the torment drawing near, the faces of the disbelievers will become gloomy, and it will be said ˹to them˺, “This is what you claimed would never come.”",
    "Say, ˹O Prophet,˺ “Consider this: whether Allah causes me and those with me to die or shows us mercy, who will save the disbelievers from a painful punishment?”",
    "Say, “He is the Most Compassionate—in Him ˹alone˺ we believe, and in Him ˹alone˺ we trust. You will soon know who is clearly astray.”",
    "Say, “Consider this: if your water were to sink ˹into the earth˺, then who ˹else˺ could bring you flowing water?”"
  ],
  "arabic1": [
    "تَبٰرَكَ الَّذِیْ بِیَدِهِ الْمُلْكُ وَهُوَ عَلٰی كُلِّ شَیْءٍ قَدِیْرُ",
    "١لَّذِیْ خَلَقَ الْمَوْتَ وَالْحَیٰوةَ لِیَبْلُوَكُمْ اَیُّكُمْ اَحْسَنُ عَمَلًا وَهُوَ الْعَزِیْزُ الْغَفُوْرُ",
    "الَّذِیْ خَلَقَ سَبْعَ سَمٰوٰتٍ طِبَاقًا مَا تَرٰی فِیْ خَلْقِ الرَّحْمٰنِ مِنْ تَفٰوُتٍ فَارْجِعِ الْبَصَرَ هَلْ تَرٰی مِنْ فُطُوْرٍ",
    "ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَیْنِ یَنْقَلِبْ اِلَیْكَ الْبَصَرُ خَاسِئًا وَّهُوَ حَسِیْرٌ",
    "وَلَقَدْ زَیَّنَّا السَّمَآءَ الدُّنْیَا بِمَصَابِیْحَ وَجَعَلْنٰهَا رُجُوْمًا لِّلشَّیٰطِیْنِ وَاَعْتَدْنَا لَهُمْ عَذَابَ السَّعِیْرِ",
    "وَلِلَّذِیْنَ كَفَرُوْا بِرَبِّهِمْ عَذَابُ جَهَنَّمَ وَبِئْسَ الْمَصِیْرُ",
    "اِذَاۤ اُلْقُوْا فِیْهَا سَمِعُوْا لَهَا شَهِیْقًا وَّهِیَ تَفُوْرُ",
    "تَكَادُ تَمَیَّزُ مِنَ الْغَیْظِ كُلَّمَاۤ اُلْقِیَ فِیْهَا فَوْجٌ سَاَلَهُمْ خَزَنَتُهَاۤ اَلَمْ یَاْتِكُمْ نَذِیْرٌ",
    "قَالُوْا بَلٰی قَدْ جَآءَنَا نَذِیْرٌ فَكَذَّبْنَا وَقُلْنَا مَا نَزَّلَ اللّٰهُ مِنْ شَیْءٍ اِنْ اَنْتُمْ اِلَّا فِیْ ضَلٰلٍ كَبِیْرٍ",
    "وَقَالُوْا لَوْ كُنَّا نَسْمَعُ اَوْ نَعْقِلُ مَا كُنَّا فِیْۤ اَصْحٰبِ السَّعِیْرِ",
    "فَاعْتَرَفُوْا بِذَنْۢبِهِمْ فَسُحْقًا لِّاَصْحٰبِ السَّعِیْرِ",
    "اِنَّ الَّذِیْنَ یَخْشَوْنَ رَبَّهُمْ بِالْغَیْبِ لَهُمْ مَّغْفِرَةٌ وَّاَجْرٌ كَبِیْرٌ",
    "وَاَسِرُّوْا قَوْلَكُمْ اَوِ اجْهَرُوْا بِهٖ اِنَّهٗ عَلِیْمٌۢ بِذَاتِ الصُّدُوْرِ",
    "اَلَا یَعْلَمُ مَنْ خَلَقَ وَهُوَ اللَّطِیْفُ الْخَبِیْرُ",
    "هُوَ الَّذِیْ جَعَلَ لَكُمُ الْاَرْضَ ذَلُوْلًا فَامْشُوْا فِیْ مَنَاكِبِهَا وَكُلُوْا مِنْ رِّزْقِهٖ وَاِلَیْهِ النُّشُوْرُ",
    "ءَاَمِنْتُمْ مَّنْ فِی السَّمَآءِ اَنْ یَّخْسِفَ بِكُمُ الْاَرْضَ فَاِذَا هِیَ تَمُوْرُ",
    "اَمْ اَمِنْتُمْ مَّنْ فِی السَّمَآءِ اَنْ یُّرْسِلَ عَلَیْكُمْ حَاصِبًا فَسَتَعْلَمُوْنَ كَیْفَ نَذِیْرِ",
    "وَلَقَدْ كَذَّبَ الَّذِیْنَ مِنْ قَبْلِهِمْ فَكَیْفَ كَانَ نَكِیْرِ",
    "اَوَلَمْ یَرَوْا اِلَی الطَّیْرِ فَوْقَهُمْ صٰٓفّٰتٍ وَّیَقْبِضْنَ مَا یُمْسِكُهُنَّ اِلَّا الرَّحْمٰنُ اِنَّهٗ بِكُلِّ شَیْءٍ بَصِیْرٌ",
    "اَمَّنْ هٰذَا الَّذِیْ هُوَ جُنْدٌ لَّكُمْ یَنْصُرُكُمْ مِّنْ دُوْنِ الرَّحْمٰنِ اِنِ الْكٰفِرُوْنَ اِلَّا فِیْ غُرُوْرٍ",
    "اَمَّنْ هٰذَا الَّذِیْ یَرْزُقُكُمْ اِنْ اَمْسَكَ رِزْقَهٗ بَلْ لَّجُّوْا فِیْ عُتُوٍّ وَّنُفُوْرٍ",
    "اَفَمَنْ یَّمْشِیْ مُكِبًّا عَلٰی وَجْهِهٖۤ اَهْدٰۤی اَمَّنْ یَّمْشِیْ سَوِیًّا عَلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "قُلْ هُوَ الَّذِیْۤ اَنْشَاَكُمْ وَجَعَلَ لَكُمُ السَّمْعَ وَالْاَبْصَارَ وَالْاَفْـِٕدَةَ قَلِیْلًا مَّا تَشْكُرُوْنَ",
    "قُلْ هُوَ الَّذِیْ ذَرَاَكُمْ فِی الْاَرْضِ وَاِلَیْهِ تُحْشَرُوْنَ",
    "وَیَقُوْلُوْنَ مَتٰی هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "قُلْ اِنَّمَا الْعِلْمُ عِنْدَ اللّٰهِ وَاِنَّمَاۤ اَنَا نَذِیْرٌ مُّبِیْنٌ",
    "فَلَمَّا رَاَوْهُ زُلْفَةً سِیْٓـَٔتْ وُجُوْهُ الَّذِیْنَ كَفَرُوْا وَقِیْلَ هٰذَا الَّذِیْ كُنْتُمْ بِهٖ تَدَّعُوْنَ",
    "قُلْ اَرَءَیْتُمْ اِنْ اَهْلَكَنِیَ اللّٰهُ وَمَنْ مَّعِیَ اَوْ رَحِمَنَا فَمَنْ یُّجِیْرُ الْكٰفِرِیْنَ مِنْ عَذَابٍ اَلِیْمٍ",
    "قُلْ هُوَ الرَّحْمٰنُ اٰمَنَّا بِهٖ وَعَلَیْهِ تَوَكَّلْنَا فَسَتَعْلَمُوْنَ مَنْ هُوَ فِیْ ضَلٰلٍ مُّبِیْنٍ",
    "قُلْ اَرَءَیْتُمْ اِنْ اَصْبَحَ مَآؤُكُمْ غَوْرًا فَمَنْ یَّاْتِیْكُمْ بِمَآءٍ مَّعِیْنٍ"
  ],
  "bengali": [
    "বরকতময় তিনি যার হাতে সর্বময় কর্তৃত্ব। আর তিনি সব কিছুর উপর সর্বশক্তিমান।",
    "যিনি মৃত্যু ও জীবন সৃষ্টি করেছেন যাতে তিনি তোমাদেরকে পরীক্ষা করতে পারেন যে, কে তোমাদের মধ্যে আমলের দিক থেকে উত্তম। আর তিনি মহাপরাক্রমশালী, অতিশয় ক্ষমাশীল।",
    "যিনি সাত আসমান স্তরে স্তরে সৃষ্টি করেছেন। পরম করুণাময়ের সৃষ্টিতে তুমি কোন অসামঞ্জস্য দেখতে পাবে না। তুমি আবার দৃষ্টি ফিরাও, কোন ত্রুটি দেখতে পাও কি?",
    "অতঃপর তুমি দৃষ্টি ফিরাও একের পর এক, সেই দৃষ্টি অবনমিত ও ক্লান্ত হয়ে তোমার দিকে ফিরে আসবে।",
    "আমি নিকটবর্তী আসমানকে প্রদীপপুঞ্জ দ্বারা সুশোভিত করেছি এবং সেগুলোকে শয়তানদের প্রতি নিক্ষেপের বস্তু বানিয়েছি। আর তাদের জন্য প্রস্তুত করে রেখেছি জ্বলন্ত আগুনের আযাব।",
    "আর যারা তাদের রবকে অস্বীকার করে, তাদের জন্য রয়েছে জাহান্নামের আযাব। আর কতইনা নিকৃষ্ট সেই প্রত্যাবর্তনস্থল!",
    "যখন তাদেরকে তাতে নিক্ষেপ করা হবে, তখন তারা তার বিকট শব্দ শুনতে পাবে। আর তা উথলিয়ে উঠবে।",
    "ক্রোধে তা ছিন্ন-ভিন্ন হবার উপক্রম হবে। যখনই তাতে কোন দলকে নিক্ষেপ করা হবে, তখন তার প্রহরীরা তাদেরকে জিজ্ঞাসা করবে, ‘তোমাদের নিকট কি কোন সতর্ককারী আসেনি’?",
    "তারা বলবে, ‘হ্যাঁ, আমাদের নিকট সতর্ককারী এসেছিল। তখন আমরা (তাদেরকে) মিথ্যাবাদী আখ্যায়িত করেছিলাম এবং বলেছিলাম, ‘আল্লাহ কিছুই নাযিল করেননি। তোমরা তো ঘোর বিভ্রান্তিতে রয়েছ’।",
    "আর তারা বলবে, ‘যদি আমরা শুনতাম অথবা বুঝতাম, তাহলে আমরা জ্বলন্ত আগুনের অধিবাসীদের মধ্যে থাকতাম না’।",
    "অতঃপর তারা তাদের অপরাধ স্বীকার করবে। অতএব ধ্বংস জ্বলন্ত আগুনের অধিবাসীদের জন্য।",
    "নিশ্চয় যারা তাদের রবকে না দেখেই ভয় করে তাদের জন্য রয়েছে ক্ষমা ও বড় প্রতিদান।",
    "আর তোমরা তোমাদের কথা গোপন কর অথবা তা প্রকাশ কর, নিশ্চয় তিনি অন্তরসমূহে যা আছে সে বিষয়ে সম্যক অবগত।",
    "যিনি সৃষ্টি করেছেন, তিনি কি জানেন না? অথচ তিনি অতি সূক্ষ্মদর্শী, পূর্ণ অবহিত।",
    "তিনিই তো তোমাদের জন্য যমীনকে সুগম করে দিয়েছেন, কাজেই তোমরা এর পথে-প্রান্তরে বিচরণ কর এবং তাঁর রিয্ক থেকে তোমরা আহার কর। আর তাঁর নিকটই পুনরুত্থান।",
    "যিনি আসমানে আছেন,* তিনি তোমাদের সহ যমীন ধসিয়ে দেয়া থেকে কি তোমরা নিরাপদ হয়ে গেছ, অতঃপর আকস্মিকভাবে তা থর থর করে কাঁপতে থাকবে? \n*‘যিনি আসমানে আছেন’ দ্বারা আল্লাহকে বুঝানো হয়েছে। এর দ্বারা আল্লাহ যে আসমানে আছেন, তা প্রমাণিত হয়।",
    "যিনি আসমানে আছেন, তিনি তোমাদের উপর পাথর নিক্ষেপকারী ঝড়ো হাওয়া পাঠানো থেকে তোমরা কি নিরাপদ হয়ে গেছ, তখন তোমরা জানতে পারবে কেমন ছিল আমার সতর্কবাণী?",
    "আর অবশ্যই তাদের পূর্ববর্তীরাও অস্বীকার করেছিল। ফলে কেমন ছিল আমার প্রত্যাখ্যান (এর শাস্তি)?",
    "তারা কি লক্ষ্য করেনি তাদের উপরস্থ পাখিদের প্রতি, যারা ডানা বিস্তার করে ও গুটিয়ে নেয়? পরম করুণাময় ছাড়া অন্য কেউ এদেরকে স্থির রাখে না। নিশ্চয় তিনি সব কিছুর সম্যক দ্রষ্টা।",
    "পরম করুণাময় ছাড়া তোমাদের কি আর কোন সৈন্য আছে, যারা তোমাদেরকে সাহায্য করবে ? কাফিররা শুধু তো ধোঁকায় নিপতিত।",
    "অথবা এমন কে আছে, যে তোমাদেরকে রিয্ক দান করবে যদি আল্লাহ তাঁর রিয্ক বন্ধ করে দেন? বরং তারা অহমিকা ও অনীহায় নিমজ্জিত হয়ে আছে।",
    "যে ব্যক্তি উপুড় হয়ে মুখের উপর ভর দিয়ে চলে সে কি অধিক হিদায়াতপ্রাপ্ত নাকি সেই ব্যক্তি যে সোজা হয়ে সরল পথে চলে ?",
    "বল, ‘তিনিই তোমাদেরকে সৃষ্টি করেছেন এবং তোমাদের জন্য শ্রবণ ও দৃষ্টিশক্তি এবং অন্তকরণসমূহ দিয়েছেন। তোমরা খুব অল্পই শোকর কর’।",
    "বল, ‘তিনিই তোমাদেরকে যমীনে সৃষ্টি করেছেন এবং তাঁর কাছেই তোমাদেরকে সমবেত করা হবে’।",
    "আর তারা বলে, ‘সে ওয়াদা কখন বাস্তবায়িত হবে, যদি তোমরা সত্যবাদী হও’।",
    "বল, ‘এ বিষয়ের জ্ঞান আল্লাহরই নিকট। আর আমি তো স্পষ্ট সতর্ককারী মাত্র’।",
    "অতঃপর তারা যখন তা* আসন্ন দেখতে পাবে, তখন কাফিরদের চেহারা মলিন হয়ে যাবে এবং বলা হবে, ‘এটাই হল তা, যা তোমরা দাবী করছিলে’। \n*কিয়ামতের শাস্তি।",
    "বল, ‘তোমরা ভেবে দেখেছ কি’? যদি আল্লাহ আমাকে এবং আমার সাথে যারা আছে, তাদেরকে ধ্বংস করে দেন অথবা আমাদের প্রতি দয়া করেন, তাহলে কাফিরদেরকে যন্ত্রণাদায়ক আযাব থেকে কে রক্ষা করবে’?",
    "বল, ‘তিনিই পরম করুণাময়। আমরা তাঁর প্রতি ঈমান এনেছি এবং তাঁর উপর তাওয়াক্কুল করেছি। কাজেই তোমরা অচিরেই জানতে পারবে কে স্পষ্ট বিভ্রান্তিতে রয়েছে’?",
    "বল, ‘তোমরা ভেবে দেখেছ কি, যদি তোমাদের পানি ভূগর্ভে চলে যায়, তাহলে কে তোমাদেরকে বহমান পানি এনে দিবে’ ?"
  ]
}