{
  "surahName": "Yusuf",
  "surahNameArabic": "يوسف",
  "surahNameArabicLong": "سورة يوسف",
  "surahNameTranslation": "Joseph",
  "revelationPlace": "Mecca",
  "totalAyah": 111,
  "surahNo": 12,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/12.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/012.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/12.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/012.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/12.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/012.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/12.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/012.mp3"
    }
  },
  "english": [
    "Alif-Lãm-Ra. These are the verses of the clear Book.",
    "Indeed, We have sent it down as an Arabic Quran so that you may understand.",
    "We relate to you ˹O Prophet˺ the best of stories through Our revelation of this Quran, though before this you were totally unaware ˹of them˺.",
    "˹Remember˺ when Joseph said to his father, “O my dear father! Indeed I dreamt of eleven stars, and the sun, and the moon—I saw them prostrating to me!”",
    "He replied, “O my dear son! Do not relate your vision to your brothers, or they will devise a plot against you. Surely Satan is a sworn enemy to humankind.",
    "And so will your Lord choose you ˹O Joseph˺, and teach you the interpretation of dreams, and perfect His favour upon you and the descendants of Jacob—˹just˺ as He once perfected it upon your forefathers, Abraham and Isaac. Surely your Lord is All-Knowing, All-Wise.”",
    "Indeed, in the story of Joseph and his brothers there are lessons for all who ask.",
    "˹Remember˺ when they said ˹to one another˺, “Surely Joseph and his brother ˹Benjamin˺ are more beloved to our father than we, even though we are a group of so many. Indeed, our father is clearly mistaken.",
    "Kill Joseph or cast him out to some ˹distant˺ land so that our father’s attention will be only ours, then after that you may ˹repent and˺ become righteous people!”",
    "One of them said, “Do not kill Joseph. But if you must do something, throw him into the bottom of a well so perhaps he may be picked up by some travellers.”",
    "They said, “O our father! Why do you not trust us with Joseph, although we truly wish him well?",
    "Send him out with us tomorrow so that he may enjoy himself and play. And we will really watch over him.”",
    "He responded, “It would truly sadden me if you took him away with you, and I fear that a wolf may devour him while you are negligent of him.”",
    "They said, “If a wolf were to devour him, despite our strong group, then we would certainly be losers!”",
    "And so, when they took him away and decided to throw him into the bottom of the well, We inspired him: “˹One day˺ you will remind them of this deed of theirs while they are unaware ˹of who you are˺.”",
    "Then they returned to their father in the evening, weeping.",
    "They cried, “Our father! We went racing and left Joseph with our belongings, and a wolf devoured him! But you will not believe us, no matter how truthful we are.”",
    "And they brought his shirt, stained with false blood. He responded, “No! Your souls must have tempted you to do something ˹evil˺. So ˹I can only endure with˺ beautiful patience! It is Allah’s help that I seek to bear your claims.”",
    "And there came some travellers, and they sent their water-boy who let down his bucket into the well. He cried out, “Oh, what a great find! Here is a boy!” And they took him secretly ˹to be sold˺ as merchandise, but Allah is All-Knowing of what they did.",
    "They ˹later˺ sold him for a cheap price, just a few silver coins—only wanting to get rid of him.",
    "The man from Egypt who bought him said to his wife, “Take good care of him, perhaps he may be useful to us or we may adopt him as a son.” This is how We established Joseph in the land, so that We might teach him the interpretation of dreams. Allah’s Will always prevails, but most people do not know.",
    "And when he reached maturity, We gave him wisdom and knowledge. This is how We reward the good-doers.",
    "And the lady, in whose house he lived, tried to seduce him. She locked the doors ˹firmly˺ and said, “Come to me!” He replied, “Allah is my refuge! It is ˹not right to betray˺ my master, who has taken good care of me. Indeed, the wrongdoers never succeed.”",
    "She advanced towards him, and he would have done likewise, had he not seen a sign from his Lord. This is how We kept evil and indecency away from him, for he was truly one of Our chosen servants.",
    "They raced for the door and she tore his shirt from the back, only to find her husband at the door. She cried, “What is the penalty for someone who tried to violate your wife, except imprisonment or a painful punishment?”",
    "Joseph responded, “It was she who tried to seduce me.” And a witness from her own family testified: “If his shirt is torn from the front, then she has told the truth and he is a liar.",
    "But if it is torn from the back, then she has lied and he is truthful.”",
    "So when her husband saw that Joseph’s shirt was torn from the back, he said ˹to her˺, “This must be ˹an example˺ of the cunning of you ˹women˺! Indeed, your cunning is so shrewd!",
    "O  Joseph! Forget about this. And you ˹O wife˺! Seek forgiveness for your sin. It certainly has been your fault.”",
    "Some women of the city gossiped, “The Chief Minister’s wife is trying to seduce her slave-boy. Love for him has plagued her heart. Indeed, we see that she is clearly mistaken.”",
    "When she heard about their gossip, she invited them and set a banquet for them. She gave each one a knife, then said ˹to Joseph˺, “Come out before them.” When they saw him, they were so stunned ˹by his beauty˺ that they cut their hands, and exclaimed, “Good God! This cannot be human; this must be a noble angel!”",
    "She said, “This is the one for whose love you criticized me! I did try to seduce him but he ˹firmly˺ refused. And if he does not do what I order him to, he will certainly be imprisoned and ˹fully˺ disgraced.”",
    "Joseph prayed, “My Lord! I would rather be in jail than do what they invite me to. And if You do not turn their cunning away from me, I might yield to them and fall into ignorance.”",
    "So his Lord responded to him, turning their cunning away from him. Surely He is the All-Hearing, All-Knowing.",
    "And so it occurred to those in charge, despite seeing all the proofs ˹of his innocence˺, that he should be imprisoned for a while.",
    "And two other servants went to jail with Joseph. One of them said, “I dreamt I was pressing wine.” The other said, “I dreamt I was carrying ˹some˺ bread on my head, from which birds were eating.” ˹Then both said,˺ “Tell us their interpretation, for we surely see you as one of the good-doers.”",
    "Joseph replied, “I can even tell you what kind of meal you will be served before you receive it. This ˹knowledge˺ is from what my Lord has taught me. I have shunned the faith of a people who disbelieve in Allah and deny the Hereafter.",
    "I follow the faith of my fathers: Abraham, Isaac, and Jacob. It is not ˹right˺ for us to associate anything with Allah ˹in worship˺. This is part of Allah’s grace upon us and humanity, but most people are not grateful.",
    "O  my fellow-prisoners! Which is far better: many different lords or Allah—the One, the Supreme?",
    "Whatever ˹idols˺ you worship instead of Him are mere names which you and your forefathers have made up—a practice Allah has never authorized. It is only Allah Who decides. He has commanded that you worship none but Him. That is the upright faith, but most people do not know.",
    "“O my fellow-prisoners! ˹The first˺ one of you will serve wine to his master, and the other will be crucified and the birds will eat from his head. The matter about which you inquired has been decided.”",
    "Then he said to the one he knew would survive, “Mention me in the presence of your master.” But Satan made him forget to mention Joseph to his master, so he remained in prison for several years.",
    "And ˹one day˺ the King said, “I dreamt of seven fat cows eaten up by seven skinny ones; and seven green ears of grain and ˹seven˺ others dry. O  chiefs! Tell me the meaning of my dream if you can interpret dreams.”",
    "They replied, “These are confused visions and we do not know the interpretation of such dreams.”",
    "˹Finally,˺ the surviving ex-prisoner remembered ˹Joseph˺ after a long time and said, “I will tell you its interpretation, so send me forth ˹to Joseph˺.”",
    "˹He said,˺ “Joseph, O  man of truth! Interpret for us ˹the dream of˺ seven fat cows eaten up by seven skinny ones; and seven green ears of grain and ˹seven˺ others dry, so that I may return to the people and let them know.”",
    "Joseph replied, “You will plant ˹grain˺ for seven consecutive years, leaving in the ear whatever you will harvest, except for the little you will eat.",
    "Then after that will come seven years of great hardship which will consume whatever you have saved, except the little you will store ˹for seed˺.",
    "Then after that will come a year in which people will receive abundant rain and they will press ˹oil and wine˺.”",
    "The King ˹then˺ said, “Bring him to me.” When the messenger came to him, Joseph said, “Go back to your master and ask him about the case of the women who cut their hands. Surely my Lord has ˹full˺ knowledge of their cunning.”",
    "The King asked ˹the women˺, “What did you get when you tried to seduce Joseph?” They replied, “Allah forbid! We know nothing indecent about him.” Then the Chief Minister’s wife admitted, “Now the truth has come to light. It was I who tried to seduce him, and he is surely truthful.",
    "From this, Joseph should know that I did not speak dishonestly about him in his absence, for Allah certainly does not guide the scheming of the dishonest.",
    "And I do not seek to free myself from blame, for indeed the soul is ever inclined to evil, except those shown mercy by my Lord. Surely my Lord is All-Forgiving, Most Merciful.”",
    "The King said, “Bring him to me. I will employ him exclusively in my service.” And when Joseph spoke to him, the King said, “Today you are highly esteemed and fully trusted by us.”",
    "Joseph proposed, “Put me in charge of the store-houses of the land, for I am truly reliable and adept.”",
    "This is how We established Joseph in the land to settle wherever he pleased. We shower Our mercy on whoever We will, and We never discount the reward of the good-doers.",
    "And the reward of the Hereafter is far better for those who are faithful and are mindful ˹of Allah˺.",
    "And Joseph’s brothers came and entered his presence. He recognized them but they were unaware of who he really was.",
    "When he had provided them with their supplies, he demanded, “Bring me your brother on your father’s side. Do you not see that I give full measure and I am the best of hosts?",
    "But if you do not bring him to me ˹next time˺, I will have no grain for you, nor will you ever come close to me again.”",
    "They promised, “We will try to convince his father to let him come. We will certainly do ˹our best˺.”",
    "Joseph ordered his servants to put his brothers’ money back into their saddlebags so that they would find it when they returned to their family and perhaps they would come back.",
    "When Joseph’s brothers returned to their father, they pleaded, “O our father! We have been denied ˹further˺ supplies. So send our brother with us so that we may receive our measure, and we will definitely watch over him.”",
    "He responded, “Should I trust you with him as I once trusted you with his brother ˹Joseph˺? But ˹only˺ Allah is the best Protector, and He is the Most Merciful of the merciful.”",
    "When they opened their bags, they discovered that their money had been returned to them. They argued, “O our father! What more can we ask for? Here is our money, fully returned to us. Now we can buy more food for our family. We will watch over our brother, and obtain an extra camel-load of grain. That load can be easily secured.”",
    "Jacob insisted, “I will not send him with you until you give me a solemn oath by Allah that you will certainly bring him back to me, unless you are totally overpowered.” Then after they had given him their oaths, he concluded, “Allah is a Witness to what we have said.”",
    "He then instructed ˹them˺, “O my sons! Do not enter ˹the city˺ all through one gate, but through separate gates. I cannot help you against ˹what is destined by˺ Allah in the least. It is only Allah Who decides. In Him I put my trust. And in Him let the faithful put their trust.”",
    "Then when they entered as their father had instructed them, this did not help them against ˹the Will of˺ Allah whatsoever. It was just a desire in Jacob’s heart which he satisfied. He was truly blessed with ˹great˺ knowledge because of what We had taught him, but most people have no knowledge.",
    "When they entered Joseph’s presence, he called his brother ˹Benjamin˺ aside, and confided ˹to him˺, “I am indeed your brother ˹Joseph˺! So do not feel distressed about what they have been doing.”",
    "When Joseph had provided them with supplies, he slipped the royal cup into his brother’s bag. Then a herald cried, “O people of the caravan! You must be thieves!”",
    "They asked, turning back, “What have you lost?”",
    "The herald ˹along with the guards˺ replied, “We have lost the King’s measuring cup. And whoever brings it will be awarded a camel-load ˹of grain˺. I guarantee it.”",
    "Joseph’s brothers replied, “By Allah! You know well that we did not come to cause trouble in the land, nor are we thieves.”",
    "Joseph’s men asked, “What should be the price for theft, if you are lying?”",
    "Joseph’s brothers responded, “The price will be ˹the enslavement of˺ the one in whose bag the cup is found. That is how we punish the wrongdoers.”",
    "Joseph began searching their bags before that of his brother ˹Benjamin˺, then brought it out of Benjamin’s bag. This is how We inspired Joseph to plan. He could not have taken his brother under the King’s law, but Allah had so willed. We elevate in rank whoever We will. But above those ranking in knowledge is the One All-Knowing.",
    "˹To distance themselves,˺ Joseph’s brothers argued, “If he has stolen, so did his ˹full˺ brother before.” But Joseph suppressed his outrage—revealing nothing to them—and said ˹to himself˺, “You are in such an evil position, and Allah knows best ˹the truth of˺ what you claim.”",
    "They appealed, “O Chief Minister! He has a very old father, so take one of us instead. We surely see you as one of the good-doers.”",
    "Joseph responded, “Allah forbid that we should take other than the one with whom we found our property. Otherwise, we would surely be unjust.”",
    "When they lost all hope in him, they spoke privately. The eldest of them said, “Do you not know that your father had taken a solemn oath by Allah from you, nor how you failed him regarding Joseph before? So I am not leaving this land until my father allows me to, or Allah decides for me. For He is the Best of Judges.",
    "Return to your father and say, ‘O our father! Your son committed theft. We testify only to what we know. We could not guard against the unforeseen.",
    "Ask ˹the people of˺ the land where we were and the caravan we travelled with. We are certainly telling the truth.’”",
    "He cried, “No! Your souls must have tempted you to do something ˹evil˺. So ˹I am left with nothing but˺ beautiful patience! I trust Allah will return them all to me. Surely He ˹alone˺ is the All-Knowing, All-Wise.”",
    "He turned away from them, lamenting, “Alas, poor Joseph!” And his eyes turned white out of the grief he suppressed.",
    "They said, “By Allah! You will not cease to remember Joseph until you lose your health or ˹even˺ your life.”",
    "He replied, “I complain of my anguish and sorrow only to Allah, and I know from Allah what you do not know.",
    "O  my sons! Go and search ˹diligently˺ for Joseph and his brother. And do not lose hope in the mercy of Allah, for no one loses hope in Allah’s mercy except those with no faith.”",
    "When they entered Joseph’s presence, they pleaded, “O Chief Minister! We and our family have been touched with hardship, and we have brought only a few worthless coins, but ˹please˺ give us our supplies in full and be charitable to us. Indeed, Allah rewards the charitable.”",
    "He asked, “Do you remember what you did to Joseph and his brother in your ignorance?”",
    "They replied ˹in shock˺, “Are you really Joseph?” He said, “I am Joseph, and here is my brother ˹Benjamin˺! Allah has truly been gracious to us. Surely whoever is mindful ˹of Allah˺ and patient, then certainly Allah never discounts the reward of the good-doers.”",
    "They admitted, “By Allah! Allah has truly preferred you over us, and we have surely been sinful.”",
    "Joseph said, “There is no blame on you today. May Allah forgive you! He is the Most Merciful of the merciful!",
    "Go with this shirt of mine and cast it over my father’s face, and he will regain his sight. Then come back to me with your whole family.”",
    "When the caravan departed ˹from Egypt˺, their father said ˹to those around him˺, “You may think I am senile, but I certainly sense the smell of Joseph.”",
    "They replied, “By Allah! You are definitely still in your old delusion.”",
    "But when the bearer of the good news arrived, he cast the shirt over Jacob’s face, so he regained his sight. Jacob then said ˹to his children˺, “Did I not tell you that I truly know from Allah what you do not know?”",
    "They begged, “O our father! Pray for the forgiveness of our sins. We have certainly been sinful.”",
    "He said, “I will pray to my Lord for your forgiveness. He ˹alone˺ is indeed the All-Forgiving, Most Merciful.”",
    "When they entered Joseph’s presence, he received his parents ˹graciously˺ and said, “Enter Egypt, Allah willing, in security.”",
    "Then he raised his parents to the throne, and they all fell down in prostration to Joseph, who then said, “O my dear father! This is the interpretation of my old dream. My Lord has made it come true. He was truly kind to me when He freed me from prison, and brought you all from the desert after Satan had ignited rivalry between me and my siblings. Indeed my Lord is subtle in fulfilling what He wills. Surely He ˹alone˺ is the All-Knowing, All-Wise.”",
    "“My Lord! You have surely granted me authority and taught me the interpretation of dreams. ˹O˺ Originator of the heavens and the earth! You are my Guardian in this world and the Hereafter. Allow me to die as one who submits and join me with the righteous.”",
    "That is from the stories of the unseen which We reveal to you ˹O Prophet˺. You were not present when they ˹all˺ made up their minds, and when they plotted ˹against Joseph˺.",
    "And most people will not believe—no matter how keen you are—",
    "even though you are not asking them for a reward for this ˹Quran˺. It is only a reminder to the whole world.",
    "How many signs in the heavens and the earth do they pass by with indifference!",
    "And most of them do not believe in Allah without associating others with Him ˹in worship˺.",
    "Do they feel secure that an overwhelming torment from Allah will not overtake them, or that the Hour will not take them by surprise when they least expect ˹it˺?",
    "Say, ˹O Prophet,˺ “This is my way. I invite to Allah with insight—I and those who follow me. Glory be to Allah, and I am not one of the polytheists.”",
    "We only sent before you ˹O Prophet˺ men inspired by Us from among the people of each society. Have the deniers not travelled through the land to see what was the end of those ˹destroyed˺ before them? And surely the ˹eternal˺ Home of the Hereafter is far better for those mindful ˹of Allah˺. Will you not then understand?",
    "And when the messengers despaired and their people thought the messengers had been denied help, Our help came to them ˹at last˺. We then saved whoever We willed, and Our punishment is never averted from the wicked people.",
    "In their stories there is truly a lesson for people of reason. This message cannot be a fabrication, rather ˹it is˺ a confirmation of previous revelation, a detailed explanation of all things, a guide, and a mercy for people of faith."
  ],
  "arabic1": [
    "الٓرٰ ۫ تِلْكَ اٰیٰتُ الْكِتٰبِ الْمُبِیْنِ ۫",
    "اِنَّاۤ اَنْزَلْنٰهُ قُرْءٰنًا عَرَبِیًّا لَّعَلَّكُمْ تَعْقِلُوْنَ",
    "نَحْنُ نَقُصُّ عَلَیْكَ اَحْسَنَ الْقَصَصِ بِمَاۤ اَوْحَیْنَاۤ اِلَیْكَ هٰذَا الْقُرْاٰنَ ۖ وَاِنْ كُنْتَ مِنْ قَبْلِهٖ لَمِنَ الْغٰفِلِیْنَ",
    "اِذْ قَالَ یُوْسُفُ لِاَبِیْهِ یٰۤاَبَتِ اِنِّیْ رَاَیْتُ اَحَدَ عَشَرَ كَوْكَبًا وَّالشَّمْسَ وَالْقَمَرَ رَاَیْتُهُمْ لِیْ سٰجِدِیْنَ",
    "قَالَ یٰبُنَیَّ لَا تَقْصُصْ رُءْیَاكَ عَلٰۤی اِخْوَتِكَ فَیَكِیْدُوْا لَكَ كَیْدًا اِنَّ الشَّیْطٰنَ لِلْاِنْسَانِ عَدُوٌّ مُّبِیْنٌ",
    "وَكَذٰلِكَ یَجْتَبِیْكَ رَبُّكَ وَیُعَلِّمُكَ مِنْ تَاْوِیْلِ الْاَحَادِیْثِ وَیُتِمُّ نِعْمَتَهٗ عَلَیْكَ وَعَلٰۤی اٰلِ یَعْقُوْبَ كَمَاۤ اَتَمَّهَا عَلٰۤی اَبَوَیْكَ مِنْ قَبْلُ اِبْرٰهِیْمَ وَاِسْحٰقَ اِنَّ رَبَّكَ عَلِیْمٌ حَكِیْمٌ",
    "لَقَدْ كَانَ فِیْ یُوْسُفَ وَاِخْوَتِهٖۤ اٰیٰتٌ لِّلسَّآىِٕلِیْنَ",
    "اِذْ قَالُوْا لَیُوْسُفُ وَاَخُوْهُ اَحَبُّ اِلٰۤی اَبِیْنَا مِنَّا وَنَحْنُ عُصْبَةٌ اِنَّ اَبَانَا لَفِیْ ضَلٰلٍ مُّبِیْنِ ۖ",
    "١قْتُلُوْا یُوْسُفَ اَوِ اطْرَحُوْهُ اَرْضًا یَّخْلُ لَكُمْ وَجْهُ اَبِیْكُمْ وَتَكُوْنُوْا مِنْ بَعْدِهٖ قَوْمًا صٰلِحِیْنَ",
    "قَالَ قَآىِٕلٌ مِّنْهُمْ لَا تَقْتُلُوْا یُوْسُفَ وَاَلْقُوْهُ فِیْ غَیٰبَتِ الْجُبِّ یَلْتَقِطْهُ بَعْضُ السَّیَّارَةِ اِنْ كُنْتُمْ فٰعِلِیْنَ",
    "قَالُوْا یٰۤاَبَانَا مَا لَكَ لَا تَاْمَنَّا عَلٰی یُوْسُفَ وَاِنَّا لَهٗ لَنٰصِحُوْنَ",
    "اَرْسِلْهُ مَعَنَا غَدًا یَّرْتَعْ وَیَلْعَبْ وَاِنَّا لَهٗ لَحٰفِظُوْنَ",
    "قَالَ اِنِّیْ لَیَحْزُنُنِیْۤ اَنْ تَذْهَبُوْا بِهٖ وَاَخَافُ اَنْ یَّاْكُلَهُ الذِّئْبُ وَاَنْتُمْ عَنْهُ غٰفِلُوْنَ",
    "قَالُوْا لَىِٕنْ اَكَلَهُ الذِّئْبُ وَنَحْنُ عُصْبَةٌ اِنَّاۤ اِذًا لَّخٰسِرُوْنَ",
    "فَلَمَّا ذَهَبُوْا بِهٖ وَاَجْمَعُوْۤا اَنْ یَّجْعَلُوْهُ فِیْ غَیٰبَتِ الْجُبِّ وَاَوْحَیْنَاۤ اِلَیْهِ لَتُنَبِّئَنَّهُمْ بِاَمْرِهِمْ هٰذَا وَهُمْ لَا یَشْعُرُوْنَ",
    "وَجَآءُوْۤ اَبَاهُمْ عِشَآءً یَّبْكُوْنَ",
    "قَالُوْا یٰۤاَبَانَاۤ اِنَّا ذَهَبْنَا نَسْتَبِقُ وَتَرَكْنَا یُوْسُفَ عِنْدَ مَتَاعِنَا فَاَكَلَهُ الذِّئْبُ وَمَاۤ اَنْتَ بِمُؤْمِنٍ لَّنَا وَلَوْ كُنَّا صٰدِقِیْنَ",
    "وَجَآءُوْ عَلٰی قَمِیْصِهٖ بِدَمٍ كَذِبٍ قَالَ بَلْ سَوَّلَتْ لَكُمْ اَنْفُسُكُمْ اَمْرًا فَصَبْرٌ جَمِیْلٌ وَاللّٰهُ الْمُسْتَعَانُ عَلٰی مَا تَصِفُوْنَ",
    "وَجَآءَتْ سَیَّارَةٌ فَاَرْسَلُوْا وَارِدَهُمْ فَاَدْلٰی دَلْوَهٗ قَالَ یٰبُشْرٰی هٰذَا غُلٰمٌ وَاَسَرُّوْهُ بِضَاعَةً وَاللّٰهُ عَلِیْمٌۢ بِمَا یَعْمَلُوْنَ",
    "وَشَرَوْهُ بِثَمَنٍ بَخْسٍ دَرَاهِمَ مَعْدُوْدَةٍ وَكَانُوْا فِیْهِ مِنَ الزَّاهِدِیْنَ",
    "وَقَالَ الَّذِی اشْتَرٰىهُ مِنْ مِّصْرَ لِامْرَاَتِهٖۤ اَكْرِمِیْ مَثْوٰىهُ عَسٰۤی اَنْ یَّنْفَعَنَاۤ اَوْ نَتَّخِذَهٗ وَلَدًا وَكَذٰلِكَ مَكَّنَّا لِیُوْسُفَ فِی الْاَرْضِ وَلِنُعَلِّمَهٗ مِنْ تَاْوِیْلِ الْاَحَادِیْثِ وَاللّٰهُ غَالِبٌ عَلٰۤی اَمْرِهٖ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَعْلَمُوْنَ",
    "وَلَمَّا بَلَغَ اَشُدَّهٗۤ اٰتَیْنٰهُ حُكْمًا وَّعِلْمًا وَكَذٰلِكَ نَجْزِی الْمُحْسِنِیْنَ",
    "وَرَاوَدَتْهُ الَّتِیْ هُوَ فِیْ بَیْتِهَا عَنْ نَّفْسِهٖ وَغَلَّقَتِ الْاَبْوَابَ وَقَالَتْ هَیْتَ لَكَ قَالَ مَعَاذَ اللّٰهِ اِنَّهٗ رَبِّیْۤ اَحْسَنَ مَثْوَایَ اِنَّهٗ لَا یُفْلِحُ الظّٰلِمُوْنَ",
    "وَلَقَدْ هَمَّتْ بِهٖ وَهَمَّ بِهَا لَوْلَاۤ اَنْ رَّاٰ بُرْهَانَ رَبِّهٖ كَذٰلِكَ لِنَصْرِفَ عَنْهُ السُّوْٓءَ وَالْفَحْشَآءَ اِنَّهٗ مِنْ عِبَادِنَا الْمُخْلَصِیْنَ",
    "وَاسْتَبَقَا الْبَابَ وَقَدَّتْ قَمِیْصَهٗ مِنْ دُبُرٍ وَّاَلْفَیَا سَیِّدَهَا لَدَا الْبَابِ قَالَتْ مَا جَزَآءُ مَنْ اَرَادَ بِاَهْلِكَ سُوْٓءًا اِلَّاۤ اَنْ یُّسْجَنَ اَوْ عَذَابٌ اَلِیْمٌ",
    "قَالَ هِیَ رَاوَدَتْنِیْ عَنْ نَّفْسِیْ وَشَهِدَ شَاهِدٌ مِّنْ اَهْلِهَا اِنْ كَانَ قَمِیْصُهٗ قُدَّ مِنْ قُبُلٍ فَصَدَقَتْ وَهُوَ مِنَ الْكٰذِبِیْنَ",
    "وَاِنْ كَانَ قَمِیْصُهٗ قُدَّ مِنْ دُبُرٍ فَكَذَبَتْ وَهُوَ مِنَ الصّٰدِقِیْنَ",
    "فَلَمَّا رَاٰ قَمِیْصَهٗ قُدَّ مِنْ دُبُرٍ قَالَ اِنَّهٗ مِنْ كَیْدِكُنَّ اِنَّ كَیْدَكُنَّ عَظِیْمٌ",
    "یُوْسُفُ اَعْرِضْ عَنْ هٰذَا ٚ وَاسْتَغْفِرِیْ لِذَنْۢبِكِ اِنَّكِ كُنْتِ مِنَ الْخٰطِـِٕیْنَ",
    "وَقَالَ نِسْوَةٌ فِی الْمَدِیْنَةِ امْرَاَتُ الْعَزِیْزِ تُرَاوِدُ فَتٰىهَا عَنْ نَّفْسِهٖ قَدْ شَغَفَهَا حُبًّا اِنَّا لَنَرٰىهَا فِیْ ضَلٰلٍ مُّبِیْنٍ",
    "فَلَمَّا سَمِعَتْ بِمَكْرِهِنَّ اَرْسَلَتْ اِلَیْهِنَّ وَاَعْتَدَتْ لَهُنَّ مُتَّكَاً وَّاٰتَتْ كُلَّ وَاحِدَةٍ مِّنْهُنَّ سِكِّیْنًا وَّقَالَتِ اخْرُجْ عَلَیْهِنَّ فَلَمَّا رَاَیْنَهٗۤ اَكْبَرْنَهٗ وَقَطَّعْنَ اَیْدِیَهُنَّ وَقُلْنَ حَاشَ لِلّٰهِ مَا هٰذَا بَشَرًا اِنْ هٰذَاۤ اِلَّا مَلَكٌ كَرِیْمٌ",
    "قَالَتْ فَذٰلِكُنَّ الَّذِیْ لُمْتُنَّنِیْ فِیْهِ وَلَقَدْ رَاوَدْتُّهٗ عَنْ نَّفْسِهٖ فَاسْتَعْصَمَ وَلَىِٕنْ لَّمْ یَفْعَلْ مَاۤ اٰمُرُهٗ لَیُسْجَنَنَّ وَلَیَكُوْنًا مِّنَ الصّٰغِرِیْنَ",
    "قَالَ رَبِّ السِّجْنُ اَحَبُّ اِلَیَّ مِمَّا یَدْعُوْنَنِیْۤ اِلَیْهِ وَاِلَّا تَصْرِفْ عَنِّیْ كَیْدَهُنَّ اَصْبُ اِلَیْهِنَّ وَاَكُنْ مِّنَ الْجٰهِلِیْنَ",
    "فَاسْتَجَابَ لَهٗ رَبُّهٗ فَصَرَفَ عَنْهُ كَیْدَهُنَّ اِنَّهٗ هُوَ السَّمِیْعُ الْعَلِیْمُ",
    "ثُمَّ بَدَا لَهُمْ مِّنْ بَعْدِ مَا رَاَوُا الْاٰیٰتِ لَیَسْجُنُنَّهٗ حَتّٰی حِیْنٍ",
    "وَدَخَلَ مَعَهُ السِّجْنَ فَتَیٰنِ قَالَ اَحَدُهُمَاۤ اِنِّیْۤ اَرٰىنِیْۤ اَعْصِرُ خَمْرًا وَقَالَ الْاٰخَرُ اِنِّیْۤ اَرٰىنِیْۤ اَحْمِلُ فَوْقَ رَاْسِیْ خُبْزًا تَاْكُلُ الطَّیْرُ مِنْهُ نَبِّئْنَا بِتَاْوِیْلِهٖ اِنَّا نَرٰىكَ مِنَ الْمُحْسِنِیْنَ",
    "قَالَ لَا یَاْتِیْكُمَا طَعَامٌ تُرْزَقٰنِهٖۤ اِلَّا نَبَّاْتُكُمَا بِتَاْوِیْلِهٖ قَبْلَ اَنْ یَّاْتِیَكُمَا ذٰلِكُمَا مِمَّا عَلَّمَنِیْ رَبِّیْ اِنِّیْ تَرَكْتُ مِلَّةَ قَوْمٍ لَّا یُؤْمِنُوْنَ بِاللّٰهِ وَهُمْ بِالْاٰخِرَةِ هُمْ كٰفِرُوْنَ",
    "وَاتَّبَعْتُ مِلَّةَ اٰبَآءِیْۤ اِبْرٰهِیْمَ وَاِسْحٰقَ وَیَعْقُوْبَ مَا كَانَ لَنَاۤ اَنْ نُّشْرِكَ بِاللّٰهِ مِنْ شَیْءٍ ذٰلِكَ مِنْ فَضْلِ اللّٰهِ عَلَیْنَا وَعَلَی النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَشْكُرُوْنَ",
    "یٰصَاحِبَیِ السِّجْنِ ءَاَرْبَابٌ مُّتَفَرِّقُوْنَ خَیْرٌ اَمِ اللّٰهُ الْوَاحِدُ الْقَهَّارُ",
    "مَا تَعْبُدُوْنَ مِنْ دُوْنِهٖۤ اِلَّاۤ اَسْمَآءً سَمَّیْتُمُوْهَاۤ اَنْتُمْ وَاٰبَآؤُكُمْ مَّاۤ اَنْزَلَ اللّٰهُ بِهَا مِنْ سُلْطٰنٍ اِنِ الْحُكْمُ اِلَّا لِلّٰهِ اَمَرَ اَلَّا تَعْبُدُوْۤا اِلَّاۤ اِیَّاهُ ذٰلِكَ الدِّیْنُ الْقَیِّمُ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَعْلَمُوْنَ",
    "یٰصَاحِبَیِ السِّجْنِ اَمَّاۤ اَحَدُكُمَا فَیَسْقِیْ رَبَّهٗ خَمْرًا وَاَمَّا الْاٰخَرُ فَیُصْلَبُ فَتَاْكُلُ الطَّیْرُ مِنْ رَّاْسِهٖ قُضِیَ الْاَمْرُ الَّذِیْ فِیْهِ تَسْتَفْتِیٰنِ",
    "وَقَالَ لِلَّذِیْ ظَنَّ اَنَّهٗ نَاجٍ مِّنْهُمَا اذْكُرْنِیْ عِنْدَ رَبِّكَ فَاَنْسٰىهُ الشَّیْطٰنُ ذِكْرَ رَبِّهٖ فَلَبِثَ فِی السِّجْنِ بِضْعَ سِنِیْنَ",
    "وَقَالَ الْمَلِكُ اِنِّیْۤ اَرٰی سَبْعَ بَقَرٰتٍ سِمَانٍ یَّاْكُلُهُنَّ سَبْعٌ عِجَافٌ وَّسَبْعَ سُنْۢبُلٰتٍ خُضْرٍ وَّاُخَرَ یٰبِسٰتٍ یٰۤاَیُّهَا الْمَلَاُ اَفْتُوْنِیْ فِیْ رُءْیَایَ اِنْ كُنْتُمْ لِلرُّءْیَا تَعْبُرُوْنَ",
    "قَالُوْۤا اَضْغَاثُ اَحْلَامٍ وَمَا نَحْنُ بِتَاْوِیْلِ الْاَحْلَامِ بِعٰلِمِیْنَ",
    "وَقَالَ الَّذِیْ نَجَا مِنْهُمَا وَادَّكَرَ بَعْدَ اُمَّةٍ اَنَا اُنَبِّئُكُمْ بِتَاْوِیْلِهٖ فَاَرْسِلُوْنِ",
    "یُوْسُفُ اَیُّهَا الصِّدِّیْقُ اَفْتِنَا فِیْ سَبْعِ بَقَرٰتٍ سِمَانٍ یَّاْكُلُهُنَّ سَبْعٌ عِجَافٌ وَّسَبْعِ سُنْۢبُلٰتٍ خُضْرٍ وَّاُخَرَ یٰبِسٰتٍ لَّعَلِّیْۤ اَرْجِعُ اِلَی النَّاسِ لَعَلَّهُمْ یَعْلَمُوْنَ",
    "قَالَ تَزْرَعُوْنَ سَبْعَ سِنِیْنَ دَاَبًا فَمَا حَصَدْتُّمْ فَذَرُوْهُ فِیْ سُنْۢبُلِهٖۤ اِلَّا قَلِیْلًا مِّمَّا تَاْكُلُوْنَ",
    "ثُمَّ یَاْتِیْ مِنْ بَعْدِ ذٰلِكَ سَبْعٌ شِدَادٌ یَّاْكُلْنَ مَا قَدَّمْتُمْ لَهُنَّ اِلَّا قَلِیْلًا مِّمَّا تُحْصِنُوْنَ",
    "ثُمَّ یَاْتِیْ مِنْ بَعْدِ ذٰلِكَ عَامٌ فِیْهِ یُغَاثُ النَّاسُ وَفِیْهِ یَعْصِرُوْنَ",
    "وَقَالَ الْمَلِكُ ائْتُوْنِیْ بِهٖ فَلَمَّا جَآءَهُ الرَّسُوْلُ قَالَ ارْجِعْ اِلٰی رَبِّكَ فَسْـَٔلْهُ مَا بَالُ النِّسْوَةِ الّٰتِیْ قَطَّعْنَ اَیْدِیَهُنَّ اِنَّ رَبِّیْ بِكَیْدِهِنَّ عَلِیْمٌ",
    "قَالَ مَا خَطْبُكُنَّ اِذْ رَاوَدْتُّنَّ یُوْسُفَ عَنْ نَّفْسِهٖ قُلْنَ حَاشَ لِلّٰهِ مَا عَلِمْنَا عَلَیْهِ مِنْ سُوْٓءٍ قَالَتِ امْرَاَتُ الْعَزِیْزِ الْـٰٔنَ حَصْحَصَ الْحَقُّ اَنَا رَاوَدْتُّهٗ عَنْ نَّفْسِهٖ وَاِنَّهٗ لَمِنَ الصّٰدِقِیْنَ",
    "ذٰلِكَ لِیَعْلَمَ اَنِّیْ لَمْ اَخُنْهُ بِالْغَیْبِ وَاَنَّ اللّٰهَ لَا یَهْدِیْ كَیْدَ الْخَآىِٕنِیْنَ",
    "وَمَاۤ اُبَرِّئُ نَفْسِیْ اِنَّ النَّفْسَ لَاَمَّارَةٌ بِالسُّوْٓءِ اِلَّا مَا رَحِمَ رَبِّیْ اِنَّ رَبِّیْ غَفُوْرٌ رَّحِیْمٌ",
    "وَقَالَ الْمَلِكُ ائْتُوْنِیْ بِهٖۤ اَسْتَخْلِصْهُ لِنَفْسِیْ فَلَمَّا كَلَّمَهٗ قَالَ اِنَّكَ الْیَوْمَ لَدَیْنَا مَكِیْنٌ اَمِیْنٌ",
    "قَالَ اجْعَلْنِیْ عَلٰی خَزَآىِٕنِ الْاَرْضِ اِنِّیْ حَفِیْظٌ عَلِیْمٌ",
    "وَكَذٰلِكَ مَكَّنَّا لِیُوْسُفَ فِی الْاَرْضِ یَتَبَوَّاُ مِنْهَا حَیْثُ یَشَآءُ نُصِیْبُ بِرَحْمَتِنَا مَنْ نَّشَآءُ وَلَا نُضِیْعُ اَجْرَ الْمُحْسِنِیْنَ",
    "وَلَاَجْرُ الْاٰخِرَةِ خَیْرٌ لِّلَّذِیْنَ اٰمَنُوْا وَكَانُوْا یَتَّقُوْنَ",
    "وَجَآءَ اِخْوَةُ یُوْسُفَ فَدَخَلُوْا عَلَیْهِ فَعَرَفَهُمْ وَهُمْ لَهٗ مُنْكِرُوْنَ",
    "وَلَمَّا جَهَّزَهُمْ بِجَهَازِهِمْ قَالَ ائْتُوْنِیْ بِاَخٍ لَّكُمْ مِّنْ اَبِیْكُمْ اَلَا تَرَوْنَ اَنِّیْۤ اُوْفِی الْكَیْلَ وَاَنَا خَیْرُ الْمُنْزِلِیْنَ",
    "فَاِنْ لَّمْ تَاْتُوْنِیْ بِهٖ فَلَا كَیْلَ لَكُمْ عِنْدِیْ وَلَا تَقْرَبُوْنِ",
    "قَالُوْا سَنُرَاوِدُ عَنْهُ اَبَاهُ وَاِنَّا لَفٰعِلُوْنَ",
    "وَقَالَ لِفِتْیٰنِهِ اجْعَلُوْا بِضَاعَتَهُمْ فِیْ رِحَالِهِمْ لَعَلَّهُمْ یَعْرِفُوْنَهَاۤ اِذَا انْقَلَبُوْۤا اِلٰۤی اَهْلِهِمْ لَعَلَّهُمْ یَرْجِعُوْنَ",
    "فَلَمَّا رَجَعُوْۤا اِلٰۤی اَبِیْهِمْ قَالُوْا یٰۤاَبَانَا مُنِعَ مِنَّا الْكَیْلُ فَاَرْسِلْ مَعَنَاۤ اَخَانَا نَكْتَلْ وَاِنَّا لَهٗ لَحٰفِظُوْنَ",
    "قَالَ هَلْ اٰمَنُكُمْ عَلَیْهِ اِلَّا كَمَاۤ اَمِنْتُكُمْ عَلٰۤی اَخِیْهِ مِنْ قَبْلُ فَاللّٰهُ خَیْرٌ حٰفِظًا وَّهُوَ اَرْحَمُ الرّٰحِمِیْنَ",
    "وَلَمَّا فَتَحُوْا مَتَاعَهُمْ وَجَدُوْا بِضَاعَتَهُمْ رُدَّتْ اِلَیْهِمْ قَالُوْا یٰۤاَبَانَا مَا نَبْغِیْ هٰذِهٖ بِضَاعَتُنَا رُدَّتْ اِلَیْنَا وَنَمِیْرُ اَهْلَنَا وَنَحْفَظُ اَخَانَا وَنَزْدَادُ كَیْلَ بَعِیْرٍ ذٰلِكَ كَیْلٌ یَّسِیْرٌ",
    "قَالَ لَنْ اُرْسِلَهٗ مَعَكُمْ حَتّٰی تُؤْتُوْنِ مَوْثِقًا مِّنَ اللّٰهِ لَتَاْتُنَّنِیْ بِهٖۤ اِلَّاۤ اَنْ یُّحَاطَ بِكُمْ فَلَمَّاۤ اٰتَوْهُ مَوْثِقَهُمْ قَالَ اللّٰهُ عَلٰی مَا نَقُوْلُ وَكِیْلٌ",
    "وَقَالَ یٰبَنِیَّ لَا تَدْخُلُوْا مِنْ بَابٍ وَّاحِدٍ وَّادْخُلُوْا مِنْ اَبْوَابٍ مُّتَفَرِّقَةٍ وَمَاۤ اُغْنِیْ عَنْكُمْ مِّنَ اللّٰهِ مِنْ شَیْءٍ اِنِ الْحُكْمُ اِلَّا لِلّٰهِ عَلَیْهِ تَوَكَّلْتُ وَعَلَیْهِ فَلْیَتَوَكَّلِ الْمُتَوَكِّلُوْنَ",
    "وَلَمَّا دَخَلُوْا مِنْ حَیْثُ اَمَرَهُمْ اَبُوْهُمْ مَا كَانَ یُغْنِیْ عَنْهُمْ مِّنَ اللّٰهِ مِنْ شَیْءٍ اِلَّا حَاجَةً فِیْ نَفْسِ یَعْقُوْبَ قَضٰىهَا وَاِنَّهٗ لَذُوْ عِلْمٍ لِّمَا عَلَّمْنٰهُ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَعْلَمُوْنَ",
    "وَلَمَّا دَخَلُوْا عَلٰی یُوْسُفَ اٰوٰۤی اِلَیْهِ اَخَاهُ قَالَ اِنِّیْۤ اَنَا اَخُوْكَ فَلَا تَبْتَىِٕسْ بِمَا كَانُوْا یَعْمَلُوْنَ",
    "فَلَمَّا جَهَّزَهُمْ بِجَهَازِهِمْ جَعَلَ السِّقَایَةَ فِیْ رَحْلِ اَخِیْهِ ثُمَّ اَذَّنَ مُؤَذِّنٌ اَیَّتُهَا الْعِیْرُ اِنَّكُمْ لَسٰرِقُوْنَ",
    "قَالُوْا وَاَقْبَلُوْا عَلَیْهِمْ مَّاذَا تَفْقِدُوْنَ",
    "قَالُوْا نَفْقِدُ صُوَاعَ الْمَلِكِ وَلِمَنْ جَآءَ بِهٖ حِمْلُ بَعِیْرٍ وَّاَنَا بِهٖ زَعِیْمٌ",
    "قَالُوْا تَاللّٰهِ لَقَدْ عَلِمْتُمْ مَّا جِئْنَا لِنُفْسِدَ فِی الْاَرْضِ وَمَا كُنَّا سٰرِقِیْنَ",
    "قَالُوْا فَمَا جَزَآؤُهٗۤ اِنْ كُنْتُمْ كٰذِبِیْنَ",
    "قَالُوْا جَزَآؤُهٗ مَنْ وُّجِدَ فِیْ رَحْلِهٖ فَهُوَ جَزَآؤُهٗ كَذٰلِكَ نَجْزِی الظّٰلِمِیْنَ",
    "فَبَدَاَ بِاَوْعِیَتِهِمْ قَبْلَ وِعَآءِ اَخِیْهِ ثُمَّ اسْتَخْرَجَهَا مِنْ وِّعَآءِ اَخِیْهِ كَذٰلِكَ كِدْنَا لِیُوْسُفَ مَا كَانَ لِیَاْخُذَ اَخَاهُ فِیْ دِیْنِ الْمَلِكِ اِلَّاۤ اَنْ یَّشَآءَ اللّٰهُ نَرْفَعُ دَرَجٰتٍ مَّنْ نَّشَآءُ وَفَوْقَ كُلِّ ذِیْ عِلْمٍ عَلِیْمٌ",
    "قَالُوْۤا اِنْ یَّسْرِقْ فَقَدْ سَرَقَ اَخٌ لَّهٗ مِنْ قَبْلُ فَاَسَرَّهَا یُوْسُفُ فِیْ نَفْسِهٖ وَلَمْ یُبْدِهَا لَهُمْ قَالَ اَنْتُمْ شَرٌّ مَّكَانًا وَاللّٰهُ اَعْلَمُ بِمَا تَصِفُوْنَ",
    "قَالُوْا یٰۤاَیُّهَا الْعَزِیْزُ اِنَّ لَهٗۤ اَبًا شَیْخًا كَبِیْرًا فَخُذْ اَحَدَنَا مَكَانَهٗ اِنَّا نَرٰىكَ مِنَ الْمُحْسِنِیْنَ",
    "قَالَ مَعَاذَ اللّٰهِ اَنْ نَّاْخُذَ اِلَّا مَنْ وَّجَدْنَا مَتَاعَنَا عِنْدَهٗۤ اِنَّاۤ اِذًا لَّظٰلِمُوْنَ",
    "فَلَمَّا اسْتَیْـَٔسُوْا مِنْهُ خَلَصُوْا نَجِیًّا قَالَ كَبِیْرُهُمْ اَلَمْ تَعْلَمُوْۤا اَنَّ اَبَاكُمْ قَدْ اَخَذَ عَلَیْكُمْ مَّوْثِقًا مِّنَ اللّٰهِ وَمِنْ قَبْلُ مَا فَرَّطْتُّمْ فِیْ یُوْسُفَ فَلَنْ اَبْرَحَ الْاَرْضَ حَتّٰی یَاْذَنَ لِیْۤ اَبِیْۤ اَوْ یَحْكُمَ اللّٰهُ لِیْ وَهُوَ خَیْرُ الْحٰكِمِیْنَ",
    "اِرْجِعُوْۤا اِلٰۤی اَبِیْكُمْ فَقُوْلُوْا یٰۤاَبَانَاۤ اِنَّ ابْنَكَ سَرَقَ وَمَا شَهِدْنَاۤ اِلَّا بِمَا عَلِمْنَا وَمَا كُنَّا لِلْغَیْبِ حٰفِظِیْنَ",
    "وَسْـَٔلِ الْقَرْیَةَ الَّتِیْ كُنَّا فِیْهَا وَالْعِیْرَ الَّتِیْۤ اَقْبَلْنَا فِیْهَا وَاِنَّا لَصٰدِقُوْنَ",
    "قَالَ بَلْ سَوَّلَتْ لَكُمْ اَنْفُسُكُمْ اَمْرًا فَصَبْرٌ جَمِیْلٌ عَسَی اللّٰهُ اَنْ یَّاْتِیَنِیْ بِهِمْ جَمِیْعًا اِنَّهٗ هُوَ الْعَلِیْمُ الْحَكِیْمُ",
    "وَتَوَلّٰی عَنْهُمْ وَقَالَ یٰۤاَسَفٰی عَلٰی یُوْسُفَ وَابْیَضَّتْ عَیْنٰهُ مِنَ الْحُزْنِ فَهُوَ كَظِیْمٌ",
    "قَالُوْا تَاللّٰهِ تَفْتَؤُا تَذْكُرُ یُوْسُفَ حَتّٰی تَكُوْنَ حَرَضًا اَوْ تَكُوْنَ مِنَ الْهٰلِكِیْنَ",
    "قَالَ اِنَّمَاۤ اَشْكُوْا بَثِّیْ وَحُزْنِیْۤ اِلَی اللّٰهِ وَاَعْلَمُ مِنَ اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "یٰبَنِیَّ اذْهَبُوْا فَتَحَسَّسُوْا مِنْ یُّوْسُفَ وَاَخِیْهِ وَلَا تَایْـَٔسُوْا مِنْ رَّوْحِ اللّٰهِ اِنَّهٗ لَا یَایْـَٔسُ مِنْ رَّوْحِ اللّٰهِ اِلَّا الْقَوْمُ الْكٰفِرُوْنَ",
    "فَلَمَّا دَخَلُوْا عَلَیْهِ قَالُوْا یٰۤاَیُّهَا الْعَزِیْزُ مَسَّنَا وَاَهْلَنَا الضُّرُّ وَجِئْنَا بِبِضَاعَةٍ مُّزْجٰىةٍ فَاَوْفِ لَنَا الْكَیْلَ وَتَصَدَّقْ عَلَیْنَا اِنَّ اللّٰهَ یَجْزِی الْمُتَصَدِّقِیْنَ",
    "قَالَ هَلْ عَلِمْتُمْ مَّا فَعَلْتُمْ بِیُوْسُفَ وَاَخِیْهِ اِذْ اَنْتُمْ جٰهِلُوْنَ",
    "قَالُوْۤا ءَاِنَّكَ لَاَنْتَ یُوْسُفُ قَالَ اَنَا یُوْسُفُ وَهٰذَاۤ اَخِیْ قَدْ مَنَّ اللّٰهُ عَلَیْنَا اِنَّهٗ مَنْ یَّتَّقِ وَیَصْبِرْ فَاِنَّ اللّٰهَ لَا یُضِیْعُ اَجْرَ الْمُحْسِنِیْنَ",
    "قَالُوْا تَاللّٰهِ لَقَدْ اٰثَرَكَ اللّٰهُ عَلَیْنَا وَاِنْ كُنَّا لَخٰطِـِٕیْنَ",
    "قَالَ لَا تَثْرِیْبَ عَلَیْكُمُ الْیَوْمَ یَغْفِرُ اللّٰهُ لَكُمْ وَهُوَ اَرْحَمُ الرّٰحِمِیْنَ",
    "اِذْهَبُوْا بِقَمِیْصِیْ هٰذَا فَاَلْقُوْهُ عَلٰی وَجْهِ اَبِیْ یَاْتِ بَصِیْرًا وَاْتُوْنِیْ بِاَهْلِكُمْ اَجْمَعِیْنَ",
    "وَلَمَّا فَصَلَتِ الْعِیْرُ قَالَ اَبُوْهُمْ اِنِّیْ لَاَجِدُ رِیْحَ یُوْسُفَ لَوْلَاۤ اَنْ تُفَنِّدُوْنِ",
    "قَالُوْا تَاللّٰهِ اِنَّكَ لَفِیْ ضَلٰلِكَ الْقَدِیْمِ",
    "فَلَمَّاۤ اَنْ جَآءَ الْبَشِیْرُ اَلْقٰىهُ عَلٰی وَجْهِهٖ فَارْتَدَّ بَصِیْرًا قَالَ اَلَمْ اَقُلْ لَّكُمْ اِنِّیْۤ اَعْلَمُ مِنَ اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "قَالُوْا یٰۤاَبَانَا اسْتَغْفِرْ لَنَا ذُنُوْبَنَاۤ اِنَّا كُنَّا خٰطِـِٕیْنَ",
    "قَالَ سَوْفَ اَسْتَغْفِرُ لَكُمْ رَبِّیْ اِنَّهٗ هُوَ الْغَفُوْرُ الرَّحِیْمُ",
    "فَلَمَّا دَخَلُوْا عَلٰی یُوْسُفَ اٰوٰۤی اِلَیْهِ اَبَوَیْهِ وَقَالَ ادْخُلُوْا مِصْرَ اِنْ شَآءَ اللّٰهُ اٰمِنِیْنَ",
    "وَرَفَعَ اَبَوَیْهِ عَلَی الْعَرْشِ وَخَرُّوْا لَهٗ سُجَّدًا وَقَالَ یٰۤاَبَتِ هٰذَا تَاْوِیْلُ رُءْیَایَ مِنْ قَبْلُ قَدْ جَعَلَهَا رَبِّیْ حَقًّا وَقَدْ اَحْسَنَ بِیْۤ اِذْ اَخْرَجَنِیْ مِنَ السِّجْنِ وَجَآءَ بِكُمْ مِّنَ الْبَدْوِ مِنْ بَعْدِ اَنْ نَّزَغَ الشَّیْطٰنُ بَیْنِیْ وَبَیْنَ اِخْوَتِیْ اِنَّ رَبِّیْ لَطِیْفٌ لِّمَا یَشَآءُ اِنَّهٗ هُوَ الْعَلِیْمُ الْحَكِیْمُ",
    "رَبِّ قَدْ اٰتَیْتَنِیْ مِنَ الْمُلْكِ وَعَلَّمْتَنِیْ مِنْ تَاْوِیْلِ الْاَحَادِیْثِ فَاطِرَ السَّمٰوٰتِ وَالْاَرْضِ ۫ اَنْتَ وَلِیّٖ فِی الدُّنْیَا وَالْاٰخِرَةِ تَوَفَّنِیْ مُسْلِمًا وَّاَلْحِقْنِیْ بِالصّٰلِحِیْنَ",
    "ذٰلِكَ مِنْ اَنْۢبَآءِ الْغَیْبِ نُوْحِیْهِ اِلَیْكَ وَمَا كُنْتَ لَدَیْهِمْ اِذْ اَجْمَعُوْۤا اَمْرَهُمْ وَهُمْ یَمْكُرُوْنَ",
    "وَمَاۤ اَكْثَرُ النَّاسِ وَلَوْ حَرَصْتَ بِمُؤْمِنِیْنَ",
    "وَمَا تَسْـَٔلُهُمْ عَلَیْهِ مِنْ اَجْرٍ اِنْ هُوَ اِلَّا ذِكْرٌ لِّلْعٰلَمِیْنَ",
    "وَكَاَیِّنْ مِّنْ اٰیَةٍ فِی السَّمٰوٰتِ وَالْاَرْضِ یَمُرُّوْنَ عَلَیْهَا وَهُمْ عَنْهَا مُعْرِضُوْنَ",
    "وَمَا یُؤْمِنُ اَكْثَرُهُمْ بِاللّٰهِ اِلَّا وَهُمْ مُّشْرِكُوْنَ",
    "اَفَاَمِنُوْۤا اَنْ تَاْتِیَهُمْ غَاشِیَةٌ مِّنْ عَذَابِ اللّٰهِ اَوْ تَاْتِیَهُمُ السَّاعَةُ بَغْتَةً وَّهُمْ لَا یَشْعُرُوْنَ",
    "قُلْ هٰذِهٖ سَبِیْلِیْۤ اَدْعُوْۤا اِلَی اللّٰهِ ۫ عَلٰی بَصِیْرَةٍ اَنَا وَمَنِ اتَّبَعَنِیْ وَسُبْحٰنَ اللّٰهِ وَمَاۤ اَنَا مِنَ الْمُشْرِكِیْنَ",
    "وَمَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ اِلَّا رِجَالًا نُّوْحِیْۤ اِلَیْهِمْ مِّنْ اَهْلِ الْقُرٰی اَفَلَمْ یَسِیْرُوْا فِی الْاَرْضِ فَیَنْظُرُوْا كَیْفَ كَانَ عَاقِبَةُ الَّذِیْنَ مِنْ قَبْلِهِمْ وَلَدَارُ الْاٰخِرَةِ خَیْرٌ لِّلَّذِیْنَ اتَّقَوْا اَفَلَا تَعْقِلُوْنَ",
    "حَتّٰۤی اِذَا اسْتَیْـَٔسَ الرُّسُلُ وَظَنُّوْۤا اَنَّهُمْ قَدْ كُذِبُوْا جَآءَهُمْ نَصْرُنَا فَنُجِّیَ مَنْ نَّشَآءُ وَلَا یُرَدُّ بَاْسُنَا عَنِ الْقَوْمِ الْمُجْرِمِیْنَ",
    "لَقَدْ كَانَ فِیْ قَصَصِهِمْ عِبْرَةٌ لِّاُولِی الْاَلْبَابِ مَا كَانَ حَدِیْثًا یُّفْتَرٰی وَلٰكِنْ تَصْدِیْقَ الَّذِیْ بَیْنَ یَدَیْهِ وَتَفْصِیْلَ كُلِّ شَیْءٍ وَّهُدًی وَّرَحْمَةً لِّقَوْمٍ یُّؤْمِنُوْنَ"
  ],
  "bengali": [
    "আলিফ-লাম-রা। এগুলো সুস্পষ্ট কিতাবের আয়াত।",
    "নিশ্চয় আমি একে আরবী কুরআনরূপে নাযিল করেছি যাতে তোমরা বুঝতে পার।",
    "আমি তোমার নিকট সুন্দরতম কাহিনী বর্ণনা করছি, এ কুরআন আমার ওহী হিসেবে তোমার কাছে প্রেরণ করার মাধ্যমে। যদিও তুমি এর পূর্বে অনবহিতদের অন্তর্ভুক্ত ছিলে।",
    "যখন ইউসুফ তার পিতাকে বলল, ‘হে আমার পিতা, আমি দেখেছি এগারটি নক্ষত্র, সূর্য ও চাঁদকে, আমি দেখেছি তাদেরকে আমার প্রতি সিজদাবনত অবস্থায়’।",
    "সে বলল, ‘হে আমার পুত্র, তুমি তোমার ভাইদের নিকট তোমার স্বপ্নের বর্ণনা দিও না, তাহলে তারা তোমার বিরুদ্ধে গভীর ষড়যন্ত্র করবে। নিশ্চয় শয়তান মানুষের প্রকাশ্য দুশমন’।",
    "আর এভাবে তোমার রব তোমাকে মনোনীত করবেন এবং তোমাকে স্বপ্নের ব্যাখ্যা শিক্ষা দেবেন। আর তোমার উপর ও ইয়াকূবের পরিবারের উপর তাঁর নিআমত পূর্ণ করবেন যেভাবে তিনি তা পূর্বে পূর্ণ করেছিলেন তোমার পিতৃপুরুষ ইবরাহীম ও ইসহাকের উপর, নিশ্চয় তোমার রব সর্বজ্ঞ, প্রজ্ঞাময়।",
    "ইউসুফ ও তার ভাইদের কাহিনীতে জিজ্ঞাসুদের জন্য অবশ্যই অনেক নিদর্শন রয়েছে।",
    "যখন তারা বলেছিল, ‘নিশ্চয় ইউসুফ ও তার ভাই আমাদের পিতার নিকট আমাদের চেয়ে অধিক প্রিয়, অথচ আমরা একই দল। নিশ্চয় আমাদের পিতা সুস্পষ্ট বিভ্রান্তিতেই আছে’।",
    "‘তোমরা ইউসুফকে হত্যা কর অথবা তাকে কোন যমীনে ফেলে আস, তাহলে তোমাদের পিতার আনুকূল্য কেবল তোমাদের জন্য থাকবে এবং তোমরা সৎ লোক হয়ে যাবে’।",
    "তাদের মধ্য থেকে একজন বলল, ‘তোমরা ইউসুফকে হত্যা করো না, আর যদি কিছু করই, তাহলে তাকে কোন কূপের গভীরে ফেলে দাও, যাত্রীদলের কেউ তাকে তুলে নিয়ে যাবে’।",
    "তারা বলল, ‘হে আমাদের পিতা, কী হল আপনার, ইউসুফের ব্যাপারে আপনি আমাদেরকে নিরাপদ মনে করছেন না, অথচ আমরাই তার হিতাকাঙ্ক্ষী’?",
    "‘আপনি আগামী কাল তাকে আমাদের সাথে প্রেরণ করুন, সে সানন্দে ঘোরাফেরা করবে ও খেলবে। আর অবশ্যই আমরা তার হেফাযতকারী’।",
    "সে বলল, ‘নিশ্চয় এটা আমাকে কষ্ট দেবে যে, তোমরা তাকে নিয়ে যাবে এবং আমি আশঙ্কা করি, নেকড়ে তাকে খেয়ে ফেলবে, যখন তোমরা তার ব্যাপারে গাফিল থাকবে’।",
    "তারা বলল, ‘আমরা একই দলভুক্ত থাকা সত্ত্বেও যদি নেকড়ে তাকে খেয়ে ফেলে তাহলে তো আমরা অবশ্যই ক্ষতিগ্রস্ত’।",
    "অতঃপর যখন তারা তাকে নিয়ে গেল এবং তাকে কূপের গভীরে ফেলে দিতে একমত হল (তখন তারা তাই করল) এবং আমি তার নিকট ওহী প্রেরণ করলাম এই মর্মে যে,‘অবশ্যই তুমি তাদেরকে (ভবিষ্যতে) তাদের এই কর্ম সম্পর্কে জানাবে, এমতাবস্থায় যে, তারা উপলব্ধি করতে পারবে না’।* \n* অর্থাৎ এ অনুভূতি তাদের থাকবে না যে, তারা এরকম কান্ড ঘটিয়েছিল এবং ইউসুফকে দেখেও ভাই হিসেবে চিনতে পারবে না।",
    "আর তারা রাতের প্রথম ভাগে কাঁদতে কাঁদতে তাদের পিতার নিকট আসল।",
    "তারা বলল, ‘হে আমাদের পিতা, আমরা প্রতিযোগিতা করতে গিয়েছিলাম আর ইউসুফকে রেখে গিয়েছিলাম আমাদের মালপত্রের নিকট, অতঃপর নেকড়ে তাকে খেয়ে ফেলেছে। আর আপনি আমাদেরকে বিশ্বাস করবেন না, যদিও আমরা সত্যবাদী হই’।",
    "আর তারা তার জামায় মিথ্যা রক্ত লাগিয়ে নিয়ে এসেছিল। সে বলল, ‘বরং তোমাদের নফস তোমাদের জন্য একটি গল্প সাজিয়েছে। সুতরাং (আমার করণীয় হচ্ছে) সুন্দর ধৈর্য। আর তোমরা যা বর্ণনা করছ সে বিষয়ে আল্লাহই সাহায্যস্থল’।",
    "আর একটি যাত্রীদল আসল এবং তারা তাদের পানি সংগ্রহকারীকে প্রেরণ করল অতঃপর সে তার বালতি ফেলল। সে বলে উঠলো, ‘কী সুখবর! এ যে একটি বালক’ এবং তারা তাকে পণ্যদ্রব্য হিসেবে গোপন করে ফেলল। আর তারা যা কিছু করছিল সে বিষয়ে আল্লাহ সম্যক জ্ঞাত।",
    "আর তারা তাকে অতি নগণ্য মূল্যে কয়েক দিরহামের বিনিময়ে বিক্রি করে দিল এবং তারা তার ব্যাপারে ছিল অনাগ্রহী।",
    "আর মিসরের যে ব্যক্তি তাকে ক্রয় করেছিল, সে তার স্ত্রীকে বলল, ‘এর থাকার সুন্দর সম্মানজনক ব্যবস্থা কর। আশা করা যায়, সে আমাদের উপকার করবে অথবা আমরা তাকে পুত্ররূপে গ্রহণ করব’ এবং এভাবেই আমি যমীনে ইউসুফকে প্রতিষ্ঠিত করলাম এবং যেন আমি তাকে স্বপ্নের ব্যাখ্যা শিক্ষা দেই। আল্লাহ নিজ কর্ম সম্পাদনে প্রবল; কিন্তু অধিকাংশ মানুষ তা জানে না।",
    "আর সে যখন পূর্ণ যৌবনে উপনীত হল, আমি তাকে হিকমত ও জ্ঞান দান করলাম এবং এভাবেই আমি ইহসানকারীদের প্রতিদান দিয়ে থাকি।",
    "আর যে মহিলার ঘরে সে ছিল, সে তাকে কুপ্ররোচনা দিল এবং দরজাগুলো বন্ধ করে দিল আর বলল, ‘এসো’। সে বলল, আল্লাহর আশ্রয় (চাই)। নিশ্চয় তিনি আমার মনিব, তিনি আমার থাকার সুন্দর ব্যবস্থা করেছেন। নিশ্চয় যালিমগণ সফল হয় না।",
    "আর সে মহিলা তার প্রতি আসক্ত হল, আর সেও তার প্রতি আসক্ত হত, যদি না তার রবের স্পষ্ট প্রমাণ* প্রত্যক্ষ করত। এভাবেই, যাতে আমি তার থেকে অনিষ্ট ও অশ্লীলতা দূর করে দেই। নিশ্চয় সে আমার খালেস বান্দাদের অন্তর্ভুক্ত। \n* برهان অর্থ উজ্জ্বল প্রমাণ এখানে নিদর্শন অর্থে ব্যবহৃত হয়েছে। সে নিদর্শনটি কী ছিল এ সম্পর্কে বিভিন্ন মতামত পাওয়া যায় । তাফসীরে ইবনে কাছীরে এর বিশদ বর্ণনা এসেছে। কেউ কেউ বলেন, তিনি নিজ পিতা ইয়াকূবের মুখচ্ছবি এবং তাঁর পক্ষ থেকে সতর্ক ইঙ্গিত পেয়েছিলেন। আবার কেউ কেউ বলেছেন, আযীয মিসরের মুখচ্ছবি দেখেছিলেন। আর কারো কারো মতে সেই বুরহান হচ্ছে আল্লাহ প্রদত্ত বিবেকের নির্দেশ।",
    "আর তারা উভয়ে দরজার দিকে দৌড়ে গেল এবং মহিলা পেছন হতে তার জামা ছিঁড়ে ফেলল। আর তারা মহিলার স্বামীকে দরজার কাছে পেল। মহিলা বলল, ‘যে লোক তোমার পরিবারের সাথে মন্দকর্ম করতে চেয়েছে, তাকে কারাবন্দি করা বা যন্ত্রনাদায়ক শাস্তি দেয়া ছাড়া তার আর কী দন্ড হতে পারে’?",
    "সে বলল, ‘সে-ই আমাকে কুপ্ররোচনা দিয়েছে’। আর মহিলার পরিবার থেকে এক সাক্ষ্যদাতা সাক্ষ্য প্রদান করল, ‘যদি তার জামা সামনের দিক থেকে ছেঁড়া হয় তাহলে সে (মহিলা) সত্য বলেছে এবং সে (পুরুষ) মিথ্যাবাদীদের অন্তর্ভুক্ত’।",
    "‘আর তার জামা যদি পেছন থেকে ছেঁড়া হয় তাহলে সে (মহিলা) মিথ্যা বলেছে এবং সে (পুরুষ) হচ্ছে সত্যবাদীদের অন্তর্ভুক্ত’।",
    "অতঃপর যখন সে দেখল, তার জামা পেছন থেকে ছেঁড়া তখন বলল, ‘নিশ্চয় এটি তোমাদের ষড়যন্ত্র। নিশ্চয় তোমাদের ষড়যন্ত্র ভয়ানক’।",
    "‘ইউসুফ, তুমি এ প্রসঙ্গ এড়িয়ে যাও, আর (হে নারী) তুমি তোমার পাপের জন্য ইস্তেগফার কর। নিশ্চয় তুমিই পাপীদের অন্তর্ভূক্ত’।",
    "আর নগরীতে মহিলারা বলাবলি করল, ‘আযীয পত্নী স্বীয় যুবককে কুপ্ররোচনা দিচ্ছে। (যুবকের প্রতি) গভীর প্রেম তাকে আসক্ত করে ফেলেছে, নিশ্চয় আমরা তাকে প্রকাশ্য ভ্রান্তিতে দেখতে পাচ্ছি’।",
    "অতঃপর যখন সে তাদের কূটকৌশলের কথা শুনতে পেল, তখন তাদেরকে ডেকে পাঠাল এবং তাদের জন্য আসন প্রস্তুত করল, আর তাদের প্রত্যেককে একটি করে ছুরি প্রদান করল এবং ইউসুফকে বলল, ‘তাদের সামনে বেরিয়ে আস’। অতঃপর তারা যখন তাকে দেখল, তখন তাকে বিশাল সৌন্দর্যের অধিকারী মনে করল এবং তারা নিজদের হাত কেটে ফেলল আর বলল, ‘মহিমা আল্লাহর, এতো মানুষ নয়। এ তো এক সম্মানিত ফেরেশতা’।",
    "সে বলল, ‘এ-ই সে, যার ব্যাপারে তোমরা আমাকে ভৎর্সনা করেছিলে। আর আমিই তাকে কুপ্ররোচনা দিয়েছি; কিন্তু সে বিরত থেকেছে এবং আমি তাকে যা আদেশ করছি সে যদি তা না করে তবে অবশ্যই সে কারারুদ্ধ হবে এবং নিশ্চয় সে অপদস্থদের অন্তর্ভুক্ত হবে’।",
    "সে (ইউসুফ) বলল, ‘হে আমার রব, তারা আমাকে যে কাজের প্রতি আহবান করছে তা থেকে কারাগারই আমার নিকট অধিক প্রিয়। আর যদি আপনি আমার থেকে তাদের চক্রান্ত প্রতিহত না করেন তবে আমি তাদের প্রতি আকৃষ্ট হয়ে পড়ব এবং আমি মূর্খদের অন্তর্ভুক্ত হব’।",
    "অতঃপর তার রব তার আহবানে সাড়া দিলেন এবং তার থেকে তাদের চক্রান্ত প্রতিহত করলেন। নিশ্চয় তিনি সর্বশ্রোতা, সর্বজ্ঞ।",
    "তারপর নিদর্শনসমূহ দেখার পরে তাদের কাছে স্পষ্ট হল, কিছু কাল পর্যন্ত অবশ্যই তারা তাকে কারারুদ্ধ করে রাখবে।",
    "আর কারাগারে তার সাথে প্রবেশ করল দু’জন যুবক। তাদের একজন বলল, ‘আমি স্বপ্নে আমাকে দেখতে পেলাম যে, আমি মদ নিংড়াচ্ছি’। আর অপর জন বলল, ‘আমি স্বপ্নে আমাকে দেখেছি যে, আমি আমার মাথার উপর রুটি বহন করছি তা থেকে পাখি খাচ্ছে। আপনি আমাদেরকে এর ব্যাখ্যা অবহিত করুন। নিশ্চয় আমরা আপনাকে ইহসানকারীদের অন্তর্ভুক্ত দেখতে পাচ্ছি’।",
    "সে বলল, ‘তোমাদেরকে যে খাদ্য দেয়া হয় তা তোমাদের কাছে আসার পূর্বেই আমি তোমাদেরকে স্বপ্নের ব্যাখ্যা জানিয়ে দেব। সেটি এমন জ্ঞান থেকেই বলব যা আমার রব আমাকে শিক্ষা দিয়েছেন। নিশ্চয়ই আমি পরিত্যাগ করেছি সে কওমের ধর্ম যারা আল্লাহর প্রতি ঈমান আনে না এবং যারা আখিরাতকে অস্বীকারকারী’।",
    "‘আর আমি অনুসরণ করেছি আমার পিতৃপুরুষ ইবরাহীম, ইসহাক ও ইয়াকূবের ধর্ম। আল্লাহর সাথে কোন কিছুকে শরীক করা আমাদের জন্য সঙ্গত নয়। এটি আমাদের ও সকল মানুষের উপর আল্লাহর অনুগ্রহ। কিন্তু অধিকাংশ মানুষই কৃতজ্ঞতা প্রকাশ করে না’।",
    "হে আমার কারা সঙ্গীদ্বয়, বহু সংখ্যক ভিন্ন ভিন্ন রব ভাল নাকি মহাপরাক্রমশালী এক আল্লাহ’?",
    "‘তোমরা তাঁকে বাদ দিয়ে নিছক কতগুলো নামের ইবাদাত করছ, যাদের নামকরণ তোমরা ও তোমাদের পিতৃপুরুষরা করেছ, যাদের ব্যাপারে আল্লাহ প্রমাণ নাযিল করেননি। বিধান একমাত্র আল্লাহরই। তিনি নির্দেশ দিয়েছেন যে, ‘তাঁকে ছাড়া আর কারো ইবাদাত করো না’। এটিই সঠিক দীন, কিন্তু অধিকাংশ লোক জানে না’।",
    "‘হে আমার কারা সঙ্গীদ্বয়, তোমাদের একজন স্বীয় মনিবকে মদপান করাবে। আর অন্যজনকে শূলে চড়ানো হবে, অতঃপর পাখি তার মাথা থেকে আহার করবে। যে বিষয়ে তোমরা জানতে চাচ্ছ তার সিদ্ধান্ত হয়ে গিয়েছে।",
    "আর তাদের দু’জনের মধ্যে যে মুক্তি পাবে বলে সে ধারণা করল তাকে বলল, ‘তোমার মনিবের কাছে আমার কথা উল্লেখ করবে’। কিন্তু শয়তান তাকে স্বীয় মনিবের নিকট উল্লেখ করার বিষয়টি ভুলিয়ে দিল। ফলে সে কয়েক বছর কারাগারে অবস্থান করল।",
    "আর বাদশাহ বলল, ‘আমি স্বপ্নে দেখছি, সাতটি মোটা তাজা গাভী, তাদের খেয়ে ফেলছে সাতটি ক্ষীণকায় গাভী এবং সাতটি সবুজ শীষ ও অপর সাতটি শুষ্ক। হে পারিষদবর্গ, তোমরা আমাকে আমার স্বপ্ন সম্বন্ধে ব্যাখ্যা দাও যদি তোমরা স্বপ্নের ব্যাখ্যা দিয়ে থাক’।",
    "তারা বলল, ‘এটি এলোমেলো অলীক স্বপ্ন। আর আমরা এরূপ স্বপ্ন ব্যাখ্যায় জ্ঞানী নই’।",
    "আর সে দু’জনের মধ্যে যে মুক্তি পেয়েছিল, সে বলল এবং দীর্ঘ দিন পর তার স্মরণ হল, ‘আমি তোমাদেরকে এর ব্যাখ্যা জানিয়ে দিচ্ছি, অতএব তোমরা আমাকে পাঠিয়ে দাও’।",
    "‘হে ইউসুফ, হে সত্যবাদী, আপনি আমাদের ব্যাখ্যা দিন, সাতটি মোটা তাজা গাভী সম্বন্ধে, যাদের খাচ্ছে সাতটি ক্ষীণকায় গাভী এবং সাতটি সবুজ শীষ ও অপর সাতটি শুষ্ক শীষ সম্পর্কে, যাতে আমি লোকদের কাছে ফিরে যেতে পারি যেন তারা জানতে পারে’।",
    "সে বলল, ‘তোমরা সাত বছর একাধারে চাষাবাদ করবে অতঃপর যে শস্য কেটে ঘরে তুলবে তার মধ্য থেকে যে সামান্য পরিমাণ খাবে সেগুলো ছাড়া সব শীষের মধ্যে রেখে দেবে’।",
    "‘তারপর আসবে সাতটি কঠিন বছর। এর জন্য তোমরা পূর্বে যা সঞ্চয় করে রেখে দেবে এরা (ঐ সময়ের লোকেরা) সেগুলো খেয়ে ফেলবে, সামান্য কিছু ছাড়া যা তোমরা সংরক্ষণ করে রাখবে’।",
    "‘এরপর আসবে এমন এক বছর যাতে মানুষ বৃষ্টি সিক্ত হবে এবং যাতে তারা (ফলের ও যয়তুনের) রস নিংড়াবে’।",
    "আর বাদশাহ বলল, ‘তোমরা তাকে আমার কাছে নিয়ে আস’। অতঃপর যখন দূত তার কাছে আসল তখন, সে বলল, তুমি তোমার মনিবের নিকট ফিরে গিয়ে তাকে জিজ্ঞাসা কর, যে সব মহিলা নিজ নিজ হাত কেটে ফেলেছিল তাদের অবস্থা কী? নিশ্চয় আমার রব তাদের ষড়যন্ত্র সম্পর্কে সম্যক জ্ঞাত’।",
    "বাদশাহ বলল, ‘তোমরা যখন ইউসুফকে কুপ্ররোচনা দিয়েছিলে তখন তোমাদের কী হয়েছিল’? তারা বলল, ‘মহিমা আল্লাহর! আমরা তার ব্যাপারে খারাপ কিছু জানি না’। আযীয পত্নী বলল, ‘এখন সত্য প্রকাশ পেয়েছে, আমিই তাকে কুপ্ররোচনা দিয়েছি। আর নিশ্চয় সে সত্যবাদীদের অন্তর্ভুক্ত’।",
    "এটি এ জন্য যে, যাতে সে জানতে পারে, আমি তার অনুপস্থিতিতে তার সাথে বিশ্বাসঘাতকতা করিনি। আর আল্লাহ অবশ্যই বিশ্বাসঘাতকদের চক্রান্ত লক্ষ্যে পৌঁছতে দেন না।",
    "‘আর আমি আমার নাফ্সকে পবিত্র মনে করি না, নিশ্চয় নাফ্স মন্দ কজের নির্দেশ দিয়ে থাকে, আমার রব যাকে দয়া করেন সে ছাড়া। নিশ্চয় আমার রব ক্ষমাশীল, পরম দয়ালু’।",
    "আর বাদশাহ বলল, ‘তোমরা তাকে আমার নিকট নিয়ে আস, আমি তাকে নিজের জন্য আপন করে নেব’। অতঃপর যখন সে তার সাথে কথা বলল, তখন বলল, ‘নিশ্চয় আজ তুমি আমাদের নিকট মর্যাদাবান ও আস্থাভাজন’।",
    "সে বলল, ‘আমাকে রাষ্ট্রীয় কোষাগারের দায়িত্ব দিন, নিশ্চয় আমি যথাযথ হেফাযতকারী, সুবিজ্ঞ’।",
    "আর এমনিভাবে আমি ইউসুফকে যমীনে কর্তৃত্ব প্রদান করেছি, সে তার যেখানে ইচ্ছা অবস্থান করতে পারত। আমি যাকে ইচ্ছা স্বীয় রহমত দান করি, আর আমি সৎকর্মশীলদের প্রতিদান বিনষ্ট করি না।",
    "আর যারা ঈমান আনে ও তাকওয়া অবলম্বন করে, তাদের জন্য আখিরাতের প্রতিদানই উত্তম।",
    "আর ইউসুফের ভাইয়েরা আসল এবং তার কাছে প্রবেশ করল। অতঃপর সে তাদেরকে চিনল, অথচ তারা তাকে চিনতে পারল না।",
    "আর সে যখন তাদেরকে তাদের রসদসামগ্রী প্রস্তুত করে দিল, তখন বলল, ‘তোমরা তোমাদের পিতার পক্ষ হতে তোমাদের এক ভাইকে আমার কাছে নিয়ে আস, তোমরা কি দেখ না, আমি পরিমাপে পূর্ণমাত্রায় দেই এবং আমি উত্তম অতিথিপরায়ণ?",
    "আর যদি তোমরা তাকে নিয়ে না আস, তাহলে আমার নিকট তোমাদের জন্য কোন পরিমাপকৃত (রসদ) নেই এবং তোমরা আমার নিকটবর্তীও হয়ো না’।",
    "তারা বলল, ‘তার বিষয়ে আমরা তার পিতাকে রাজি করাব, আর এটি আমরা করবই’।",
    "আর সে তার যুবক কর্মচারীদেরকে বলল, ‘তাদের পণ্যমূল্য তাদের মালপত্রের মধ্যে রেখে দাও, যাতে পরিবারের নিকট ফিরে গিয়ে তারা তা চিনতে পারে। আশা করি তারা ফিরে আসবে’।",
    "অতঃপর যখন তারা তাদের বাবার কাছে ফিরে আসল, তখন বলল, ‘হে আমাদের পিতা, আমাদের জন্য পরিমাপকৃত রসদ নিষিদ্ধ করা হয়েছে। অতএব আমাদের সাথে আমাদের ভাইকে পাঠান, যেন আমরা পরিমাপ করে রসদ আনতে পারি। আর অবশ্যই আমরা তার হেফাযত করব’।",
    "সে বলল, ‘তোমাদেরকে কি আমি তার ব্যাপারে নিরাপদ মনে করব, যেমন নিরাপদ মনে করেছিলাম ইতঃপূর্বে তার ভাইয়ের ব্যাপারে? তবে আল্লাহ উত্তম হেফাযতকারী এবং তিনিই সর্বশ্রেষ্ঠ দয়ালু’।",
    "আর যখন তারা তাদের মাল-পত্র খুলল, তখন তারা দেখতে পেল তাদের পণ্যমূল্য তাদের কাছে ফেরত দেয়া হয়েছে। তারা বলল, ‘হে আমাদের পিতা, আমরা আর কী চাই? এই আমাদের পণ্যমূল্য, তা আমাদেরকে ফেরৎ দেয়া হয়েছে। আর আমরা আমাদের পরিবারবর্গের জন্য খাদ্যসামগ্রী নিয়ে আসব, আমাদের ভাইকে হেফাযত করব এবং আরো এক উট বোঝাই রসদ বেশি আনব, (বাদশাহ্র জন্য) ঐ রসদ (প্রদান) খুবই সহজ’।",
    "সে বলল, ‘আমি তোমাদের সাথে তাকে কখনো পাঠাব না, যতক্ষণ না তোমরা আমাকে আল্লাহর নামে অঙ্গীকার প্রদান কর যে, তাকে অবশ্যই আমার কাছে নিয়ে আসবে। তবে তোমরা (শত্রু বা বিপদ দ্বারা) বেষ্টিত হলে ভিন্ন কথা’। অতঃপর যখন তারা তাকে প্রতিশ্রুতি দিল, তখন সে বলল, ‘আমরা যা বলছি সে ব্যাপারে আল্লাহই সাক্ষী’।",
    "সে বলল, ‘হে আমার ছেলেরা, তোমরা এক দরজা দিয়ে প্রবেশ করো না, বরং ভিন্ন ভিন্ন দরজা দিয়ে প্রবেশ কর এবং আল্লাহর সিদ্ধান্তের বিপরীতে আমি তোমাদের কোন উপকার করতে পারব না। হুকুম একমাত্র আল্লাহরই। তাঁরই উপর আমি তাওয়াক্কুল করছি এবং তাঁরই উপর যেন সকল তাওয়াক্কুলকারী তাওয়াক্কুল করে’।",
    "আর যখন তারা প্রবেশ করল, যেভাবে তাদের পিতা তাদেরকে আদেশ করেছিল, তা আল্লাহর হুকুমের বিপরীতে তাদের কোন উপকারে আসেনি, তবে তা ছিল ইয়া‘কূবের মনের একটি ইচ্ছা, যা সে ব্যক্ত করেছিল। আর সে ছিল জ্ঞানী, কারণ আমি তাকে শিখিয়েছিলাম। কিন্তু অধিকাংশ মানুষ জানে না।",
    "আর যখন তারা ইউসুফের নিকট প্রবেশ করল, তখন সে তার ভাইকে নিজের কাছে স্থান দিল এবং বলল, ‘আমি তোমার ভাই, কাজেই ইতঃপূর্বে তারা যা করত, তাতে তুমি দুঃখ পেয়ো না’।",
    "অতঃপর সে যখন তাদেরকে তাদের রসদপত্র প্রস্তুত করে দিল, তখন তার ভাইয়ের মালপত্রে পানপাত্রটি রেখে দিল। তারপর একজন ঘোষক ঘোষণা করল, ‘ওহে কাফেলার লোকজন, নিশ্চয় তোমরা চোর’।",
    "তারা ওদের দিকে ফিরে বলল, ‘তোমরা কী হারিয়েছ’?",
    "তারা বলল, ‘আমরা বাদশাহ্র পানপাত্র হারিয়েছি, যে তা এনে দেবে, তার জন্য রয়েছে এক উট বোঝাই পুরস্কার। আর আমিই এর যামিন’।",
    "তারা বলল, ‘আল্লাহর কসম, তোমরা নিশ্চয়ই জেনে গিয়েছ, আমরা এ দেশে অশান্তি সৃষ্টি করতে আসিনি, আর আমরা চোর নই’।",
    "তারা বলল, ‘তাহলে তার শাস্তি কি হবে, যদি তোমরা মিথ্যাবাদী হও’?",
    "তারা বলল, ‘তার শাস্তি হবে, যার মালপত্রের ভিতর ওটি পাওয়া যাবে, সে-ই হবে তার বিনিময়। এভাবেই আমরা যালেমদেরকে শাস্তি দিয়ে থাকি’।",
    "তারপর সে তার ভাইয়ের পাত্রের পূর্বে তাদের পাত্রগুলো দিয়ে (তল্লাশী) শুরু করল, তারপর সেটি তার ভাইয়ের পাত্র থেকে বের করল, এভাবে আমি ইউসুফের জন্য কৌশল করলাম। আল্লাহর ইচ্ছা ছাড়া বাদশাহ্র আইনে সে তার ভাইকে রেখে দিতে পারত না, আমি যাকে ইচ্ছা তার মর্যাদা উঁচু করে দেই এবং প্রত্যেক জ্ঞানীর উপর রয়েছে একজন মহাজ্ঞানী।",
    "তারা বলল, ‘যদি সে চুরি করে থাকে, তবে ইতঃপূর্বে তার এক ভাই চুরি করেছিল’। ইউসুফ বিষয়টি নিজের কাছে গোপন রাখল, তাদের কাছে প্রকাশ করল না, সে (মনে মনে) বলল, ‘তোমাদের অবস্থান তো নিকৃষ্টতর, তোমরা যা বলছ, সে সম্পর্কে আল্লাহ ভালভাবেই অবগত’।",
    "তারা বলল, ‘হে আযীয, তার পিতা বড় বৃদ্ধ, আপনি তার স্থলে আমাদের একজনকে নিন, আমরা তো আপনাকে দেখছি সৎকর্মশীলদের অন্তর্ভুক্ত।",
    "সে বলল, ‘যার কাছে আমাদের মাল পেয়েছি তাকে ছাড়া অন্যকে পাকড়াও করা হতে আল্লাহর আশ্রয় চাচ্ছি, এমন করলে আমরা হয়ে যাব নিশ্চিত যালিম’।",
    "তারপর যখন তারা তার ব্যাপারে নিরাশ হল, তখন তারা পরামর্শ করতে একান্তে মিলিত হল। তাদের বড়জন বলল, ‘তোমরা কি জান না যে, তোমাদের পিতা তোমাদের কাছ থেকে আল্লাহর নামে অঙ্গীকার নিয়েছেন, আর ইতঃপূর্বে তোমরা ইউসুফের ব্যাপারে যে অন্যায় করেছ? সুতরাং যতক্ষণ না আমার পিতা আমাকে অনুমতি দেবেন অথবা আল্লাহ আমার ব্যাপারে ফয়সালা করবেন, ততক্ষণ পর্যন্ত আমি এদেশ ছেড়ে যাব না এবং তিনি সর্বোত্তম ফয়সালাকারী’।",
    "‘তোমরা তোমাদের পিতার নিকট ফিরে যাও এবং বল, হে আমাদের পিতা, আপনার ছেলে তো চুরি করেছে, আর আমরা যা জানি তাঁরই সাক্ষ্য দিয়েছি এবং আমরা গায়েব সংরক্ষণকারী নই’।",
    "‘আর যে জনপদে আমরা ছিলাম তাকে জিজ্ঞাসা করুন এবং যে কাফেলার সাথে আমরা এসেছি তাদেরকেও, আর অবশ্যই আমরা সত্যবাদী’।",
    "সে বলল, ‘বরং তোমাদের নাফ্স তোমাদের জন্য একটি গল্প সাজিয়েছে, সুতরাং (আমার করণীয় হচ্ছে) সুন্দর ধৈর্য। আশা করি, আল্লাহ তাদের সকলকে আমার কাছে ফিরিয়ে আনবেন, নিশ্চয়ই তিনি সর্বজ্ঞ, প্রজ্ঞাময়’।",
    "আর তাদের থেকে সে মুখ ফিরিয়ে নিল এবং বলল, ‘ইউসুফের জন্য আফসোস’! আর দুঃখে তার চক্ষুদ্বয় সাদা হয়ে গেল, কিন্তু সে তো সংবরণকারী।",
    "তারা বলল, ‘আল্লাহর কসম, আপনি তো ইউসুফকে স্মরণ করতেই থাকবেন, যতক্ষণ না আপনি ধ্বংসের দ্বারপ্রান্তে পৌঁছবেন অথবা ধ্বংস হয়ে যাবেন’।",
    "সে বলল, ‘আমি আল্লাহর কাছেই আমার দুঃখ বেদনার অভিযোগ জানাচ্ছি। আর আল্লাহর পক্ষ থেকে আমি যা জানি, তোমরা তা জান না’।",
    "‘হে আমার ছেলেরা, তোমরা যাও এবং ইউসুফ ও তার ভাইয়ের খোঁজ খবর নাও। আর তোমরা আল্লাহর রহমত থেকে নিরাশ হয়ো না, কেননা কাফির কওম ছাড়া কেউই আল্লাহর রহমত থেকে নিরাশ হয় না’।",
    "অতঃপর যখন তারা ইউসুফের কাছে প্রবেশ করল, তখন বলল, ‘হে আযীয, অভাব-অনটন আমাদেরকে ও আমাদের পরিবারকে স্পর্শ করেছে, আর আমরা তুচ্ছ পুঁজি নিয়ে এসেছি। অতএব, আমাদেরকে মাপে পূর্ণমাত্রায় দিন এবং আমাদের প্রতি অনুগ্রহ করুন, নিশ্চয় আল্লাহ অনুগ্রহকারীদের প্রতিদান দেন’।",
    "সে বলল, ‘তোমাদের জানা আছে কি, ইউসুফ ও তার ভাইয়ের সাথে তোমরা কিরূপ আচরণ করেছিলে, যখন তোমরা অজ্ঞ ছিলে’?",
    "তারা বলল, ‘তুমি কি সত্যিই ইউসুফ’? সে বলল, আমি ইউসুফ, আর এ আমার সহোদর। আল্লাহ আমাদের উপর অনুগ্রহ করেছেন। নিশ্চয় যে ব্যক্তি তাকওয়া অবলম্বন করে এবং সবর করে, তবে অবশ্যই আল্লাহ সৎকর্মশীলদের প্রতিদান বিনষ্ট করেন না’।",
    "তারা বলল, ‘আল্লাহর কসম, আল্লাহ আমাদের উপর তোমাকে প্রাধান্য দিয়েছেন, আর আমরাই ছিলাম অপরাধী’।",
    "সে বলল, ‘আজ তোমাদের উপর কোন ভৎর্সনা নেই, আল্লাহ তোমাদের ক্ষমা করুন। আর তিনি সবচেয়ে বেশি দয়ালু’।",
    "‘তোমরা আমার এ জামাটি নিয়ে যাও, অতঃপর সেটি আমার পিতার চেহারায় ফেল। এতে তিনি দৃষ্টিশক্তি ফিরে পাবেন। আর তোমরা তোমাদের পরিবারের সকলকে নিয়ে আমার কাছে চলে আস’।",
    "আর যখন কাফেলা বের হল, তাদের পিতা বলল, ‘নিশ্চয় আমি ইউসুফের ঘ্রাণ পাচ্ছি, যদি তোমরা আমাকে নির্বোধবৃদ্ধ মনে না কর’।",
    "তারা বলল, ‘আল্লাহর কসম, আপনি তো সেই পুরোন ভ্রান্তিতেই আছেন’।",
    "অতঃপর যখন সুসংবাদদাতা এল, তখন সে জামাটি তার চেহারায় ফেলল। এতে সে দৃষ্টিশক্তি ফিরে পেল, বলল, ‘আমি কি তোমাদেরকে বলিনি, নিশ্চয় আমি আল্লাহর পক্ষ থেকে যা জানি তোমরা তা জান না’।",
    "তারা বলল, ‘হে আমাদের পিতা, আপনি আমাদের পাপ মোচনের জন্য ক্ষমা চান। নিশ্চয় আমরা ছিলাম অপরাধী’।",
    "সে বলল, ‘অচিরেই আমি তোমাদের জন্য আমার রবের নিকট ক্ষমা চাইব, নিশ্চয় তিনি ক্ষমাশীল, পরম দয়ালু’।",
    "অতঃপর যখন তারা ইউসুফের নিকট প্রবেশ করল, তখন সে তার পিতামাতাকে নিজের কাছে স্থান করে দিল এবং বলল, ‘আল্লাহর ইচ্ছায় আপনারা নিরাপদে মিসরে প্রবেশ করুন’।",
    "আর সে তার পিতামাতাকে রাজাসনে উঠাল এবং তারা সকলে তার সামনে সেজদায় লুটিয়ে পড়ল এবং সে বলল, ‘হে আমার পিতা, এই হল আমার ইতঃপূর্বের স্বপ্নের ব্যাখ্যা, আমার রব তা বাস্তবে পরিণত করেছেন আর তিনি আমার উপর এহসান করেছেন, যখন আমাকে জেলখানা থেকে বের করেছেন এবং তোমাদেরকে গ্রাম থেকে নিয়ে এসেছেন, শয়তান আমার ও আমার ভাইদের মধ্যে সম্পর্ক নষ্ট করার পর। নিশ্চয় আমার রব যা ইচ্ছা করেন, তা বাস্তবায়নে তিনি সূক্ষ্মদর্শী। নিশ্চয় তিনি সম্যক জ্ঞানী, প্রজ্ঞাময়’।",
    "‘হে আমার রব, আপনি আমাকে কিছু রাজত্ব দান করেছেন এবং স্বপ্নের কিছু ব্যাখ্যা শিখিয়েছেন। হে আসমানসমূহ ও যমীনের স্রষ্টা, দুনিয়া ও আখিরাতে আপনিই আমার অভিভাবক, আমাকে মুসলিম অবস্থায় মৃত্যু দিন এবং নেককারদের সাথে আমাকে যুক্ত করুন’।",
    "এগুলো গায়েবের সংবাদ, যা আমি তোমার কাছে ওহী করছি। তুমি তো তাদের নিকট ছিলে না যখন তারা তাদের সিদ্ধান্তে একমত হয়েছিল অথচ তারা ষড়যন্ত্র করছিল।",
    "আর তুমি আকাঙ্খা করলেও অধিকাংশ মানুষ মুমিন হবার নয়।",
    "আর তুমি এর উপর তাদের কাছে কোন প্রতিদান চাও না, এ তো (কুরআন) সমগ্র সৃষ্টির জন্য উপদেশমাত্র।",
    "আর আসমানসমূহ ও যমীনে কত নিদর্শন রয়েছে, যা তারা অতিক্রম করে চলে যায়, অথচ সেগুলো থেকে তারা বিমুখ।",
    "তাদের অধিকাংশ আল্লাহর প্রতি বিশ্বাস করে, তবে (ইবাদাতে) শিরক করা অবস্থায়।",
    "আর তারা কি নিরাপদ বোধ করছে যে, তাদের উপর আল্লাহর পক্ষ থেকে কোন সর্বগ্রাসী আযাব আসবে না অথবা হঠাৎ তারা টের না পেতেই কিয়ামত উপস্থিত হবে না?",
    "বল, ‘এটা আমার পথ। আমি জেনে-বুঝে আল্লাহর দিকে দাওয়াত দেই এবং যারা আমার অনুসরণ করেছে তারাও। আর আল্লাহ পবিত্র মহান এবং আমি মুশরিকদের অন্তর্ভুক্ত নই’।",
    "আর আমি তোমার পূর্বে জনপদবাসী থেকে পুরুষদেরকেই কেবল রাসূল হিসেবে প্রেরণ করেছি, যাদের উপর আমি ওহী নাযিল করতাম। তারা কি যমীনে বিচরণ করে না। তাহলে দেখত, তাদের পূর্বে যারা ছিল তাদের পরিণতি কিরূপ হয়েছে? আর যারা তাকওয়া অবলম্বন করে তাদের জন্য আখিরাতের আবাসনই উত্তম, তবুও কি তোমরা বুঝ না?",
    "অবশেষে যখন রাসূলগণ (কওমের ঈমান থেকে) নিরাশ হয়ে গেল এবং তারা* মনে করল তাদের সাথে মিথ্যা বলা হয়েছে, তখন তাদের কাছে আমার সাহায্য আসল, অতঃপর আমি যাকে ইচ্ছা নাজাত দেই, আর অপরাধী কওম থেকে আমার শাস্তি ফেরানো হয় না। \n* (ক) এখানে ‘তারা’ বলতে রাসূলদের অনুসারীদের বুঝানো হয়েছে। অর্থ হবে- তাদের সাথে সাহায্যের মিথ্যা আশ্বাস দেয়া হয়েছে। (খ) অথবা বিরোধীদের বুঝানো হয়েছে। তখন অর্থ হবে- তাদেরকে শাস্তির মিথ্যা ভীতি প্রদর্শন করা হয়েছে। (গ) আর যদি ‘তারা’ বলতে স্বয়ং রাসূলদের বুঝানো হয়, তখন অর্থ হবে- রাসূলগণ ধারণা করেছেন, তাদের প্রতি মিথ্যারোপ করা হয়েছে।",
    "তাদের এ কাহিনীগুলোতে অবশ্যই বুদ্ধিমানদের জন্য রয়েছে শিক্ষা, এটা কোন বানানো গল্প নয়, বরং তাদের পূর্ববর্তী কিতাবের সত্যায়নকারী এবং প্রতিটি বিষয়ের বিস্তারিত বিবরণ। আর হিদায়াত ও রহমত ঐ কওমের জন্য যারা ঈমান আনে।"
  ]
}