{
  "surahName": "Al-A'raaf",
  "surahNameArabic": "الأعراف",
  "surahNameArabicLong": "سورة الأعراف",
  "surahNameTranslation": "The Heights",
  "revelationPlace": "Mecca",
  "totalAyah": 206,
  "surahNo": 7,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/7.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/007.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/7.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/007.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/7.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/007.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/7.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/007.mp3"
    }
  },
  "english": [
    "Alif-Lãm-Mĩm-Ṣãd.",
    "˹This is˺ a Book sent down to you ˹O Prophet˺—do not let anxiety into your heart regarding it—so with it you may warn ˹the disbelievers˺, and as a reminder to the believers.",
    "Follow what has been sent down to you from your Lord, and do not take others as guardians besides Him. How seldom are you mindful!",
    "˹Imagine˺ how many societies We have destroyed! Our torment took them by surprise ˹while sleeping˺ at night or midday.",
    "Their only cry—when overwhelmed by Our torment—was, “We have indeed been wrongdoers.”",
    "We will surely question those who received messengers and We will question the messengers ˹themselves˺.",
    "Then We will give them a full account with sure knowledge—for We were never absent.",
    "The weighing on that Day will be just. As for those whose scale will be heavy ˹with good deeds˺, ˹only˺ they will be successful.",
    "But those whose scale is light, they have doomed themselves for wrongfully denying Our signs.",
    "We have indeed established you on earth and provided you with a means of livelihood. ˹Yet˺ you seldom give any thanks.",
    "Surely We created you, then shaped you, then said to the angels, “Prostrate before Adam,” so they all did—but not Iblîs, who refused to prostrate with the others.",
    "Allah asked, “What prevented you from prostrating when I commanded you?” He replied, “I am better than he is: You created me from fire and him from clay.”",
    "Allah said, “Then get down from Paradise! It is not for you to be arrogant here. So get out! You are truly one of the disgraced.”",
    "He appealed, “Then delay my end until the Day of their resurrection.”",
    "Allah said, “You are delayed ˹until the appointed Day˺.”",
    "He said, “For leaving me to stray I will lie in ambush for them on Your Straight Path.",
    "I will approach them from their front, their back, their right, their left, and then You will find most of them ungrateful.”",
    "Allah said, “Get out of Paradise! You are disgraced and rejected! I will certainly fill up Hell with you and your followers all together.”",
    "˹Allah said,˺ “O Adam! Live with your wife in Paradise and eat from wherever you please, but do not approach this tree, or else you will be wrongdoers.”",
    "Then Satan tempted them in order to expose what was hidden of their nakedness. He said, “Your Lord has forbidden this tree to you only to prevent you from becoming angels or immortals.”",
    "And he swore to them, “I am truly your sincere advisor.”",
    "So he brought about their fall through deception. And when they tasted of the tree, their nakedness was exposed to them, prompting them to cover themselves with leaves from Paradise. Then their Lord called out to them, “Did I not forbid you from that tree and ˹did I not˺ tell you that Satan is your sworn enemy?”",
    "They replied, “Our Lord! We have wronged ourselves. If You do not forgive us and have mercy on us, we will certainly be losers.”",
    "Allah said, “Descend as enemies to each other. You will find in the earth a residence and provision for your appointed stay.”",
    "He added, “There you will live, there you will die, and from there you will be resurrected.”",
    "O children of Adam! We have provided for you clothing to cover your nakedness and as an adornment. However, the best clothing is righteousness. This is one of Allah’s bounties, so perhaps you will be mindful.",
    "O children of Adam! Do not let Satan deceive you as he tempted your parents out of Paradise and caused their cover to be removed in order to expose their nakedness. Surely he and his soldiers watch you from where you cannot see them. We have made the devils allies of those who disbelieve.",
    "Whenever they commit a shameful deed, they say, “We found our forefathers doing it and Allah has commanded us to do it.” Say, “No! Allah never commands what is shameful. How can you attribute to Allah what you do not know?”",
    "Say, ˹O Prophet,˺ “My Lord has commanded uprightness and dedication ˹to Him alone˺ in worship, calling upon Him with sincere devotion. Just as He first brought you into being, you will be brought to life again.”",
    "He has guided some, while others are destined to stray. They have taken devils as their masters instead of Allah—thinking they are ˹rightly˺ guided.",
    "O Children of Adam! Dress properly whenever you are at worship. Eat and drink, but do not waste. Surely He does not like the wasteful.",
    "Ask, ˹O Prophet,˺ “Who has forbidden the adornments and lawful provisions Allah has brought forth for His servants?” Say, “They are for the enjoyment of the believers in this worldly life, but they will be exclusively theirs on the Day of Judgment. This is how We make Our revelations clear for people of knowledge.”",
    "Say, “My Lord has only forbidden open and secret indecencies, sinfulness, unjust aggression, associating ˹others˺ with Allah ˹in worship˺—a practice He has never authorized—and attributing to Allah what you do not know.”",
    "For each community there is an appointed term. When their time arrives, they can neither delay it for a moment, nor could they advance it.",
    "O children of Adam! When messengers from among yourselves come to you reciting My revelations—whoever shuns evil and mends their ways, there will be no fear for them, nor will they grieve.",
    "But those who receive Our revelations with denial and arrogance will be the residents of the Fire. They will be there forever.",
    "Who does more wrong than those who fabricate lies against Allah or deny His revelations? They will receive what is destined for them, until Our messenger-angels arrive to take their souls, asking them, “Where are those ˹false gods˺ you used to invoke besides Allah?” They will cry, “They have failed us,” and they will confess against themselves that they were indeed disbelievers.",
    "Allah will say, “Enter the Fire along with the ˹evil˺ groups of jinn and humans that preceded you.” Whenever a group enters Hell, it will curse the preceding one until they are all gathered inside, the followers will say about their leaders, “Our Lord! They have misled us, so multiply their torment in the Fire.” He will answer, “It has already been multiplied for all, but you do not know.”",
    "Then the leaders will say to their followers, “You were no better than us! So taste the torment for what you used to commit.”",
    "Surely those who receive our revelations with denial and arrogance, the gates of heaven will not be opened for them, nor will they enter Paradise until a camel passes through the eye of a needle. This is how We reward the wicked.",
    "Hell will be their bed; flames will be their cover. This is how We reward the wrongdoers.",
    "As for those who believe and do good—We never require of any soul more than what it can afford—it is they who will be the residents of Paradise. They will be there forever.",
    "We will remove whatever bitterness they had in their hearts. Rivers will flow under their feet. And they will say, “Praise be to Allah for guiding us to this. We would have never been guided if Allah had not guided us. The messengers of our Lord had certainly come with the truth.” It will be announced to them, “This is Paradise awarded to you for what you used to do.”",
    "The residents of Paradise will call out to the residents of the Fire, “We have certainly found our Lord’s promise to be true. Have you too found your Lord’s promise to be true?” They will reply, “Yes, we have!” Then a caller will announce to both, “May Allah’s condemnation be upon the wrongdoers",
    "those who hindered ˹others˺ from Allah’s Way, strived to make it ˹appear˺ crooked, and disbelieved in the Hereafter.”",
    "There will be a barrier between Paradise and Hell. And on the heights ˹of that barrier˺ will be people who will recognize ˹the residents of˺ both by their appearance. They will call out to the residents of Paradise, “Peace be upon you!” They will have not yet entered Paradise, but eagerly hope to.",
    "When their eyes will turn towards the residents of Hell, they will pray, “Our Lord! Do not join us with the wrongdoing people.”",
    "Those on the heights will call out to some ˹tyrants in the Fire˺, who they will recognize by their appearance, saying, “Your large numbers and arrogance are of no use ˹today˺!",
    "Are these ˹humble believers˺ the ones you swore would never be shown Allah’s mercy?” ˹Finally, those on the heights will be told:˺ “Enter Paradise! There will be no fear for you, nor will you grieve.”",
    "The residents of the Fire will then cry out to the residents of Paradise, “Aid us with some water or any provision Allah has granted you.” They will reply, “Allah has forbidden both to the disbelievers",
    "those who took this faith ˹of Islam˺ as mere amusement and play and were deluded by ˹their˺ worldly life.” ˹Allah will say,˺ “Today We will ignore them just as they ignored the coming of this Day of theirs and for rejecting Our revelations.”",
    "We have certainly brought them a Book which We explained with knowledge—a guide and mercy for those who believe.",
    "Do they only await the fulfilment ˹of its warning˺? The Day it will be fulfilled, those who ignored it before will say, “The messengers of our Lord certainly came with the truth. Are there any intercessors who can plead on our behalf? Or can we be sent back so we may do ˹good,˺ unlike what we used to do?” They will have certainly ruined themselves, and whatever ˹gods˺ they fabricated will fail them.",
    "Indeed your Lord is Allah Who created the heavens and the earth in six Days, then established Himself on the Throne. He makes the day and night overlap in rapid succession. He created the sun, the moon, and the stars—all subjected by His command. The creation and the command belong to Him ˹alone˺. Blessed is Allah—Lord of all worlds!",
    "Call upon your Lord humbly and secretly. Surely He does not like the transgressors.",
    "Do not spread corruption in the land after it has been set in order. And call upon Him with hope and fear. Indeed, Allah’s mercy is always close to the good-doers.",
    "He is the One Who sends the winds ushering in His mercy. When they bear heavy clouds, We drive them to a lifeless land and then cause rain to fall, producing every type of fruit. Similarly, We will bring the dead to life, so perhaps you will be mindful.",
    "The fertile land produces abundantly by the Will of its Lord, whereas the infertile land hardly produces anything. This is how We vary ˹Our˺ lessons to those who are thankful.",
    "Indeed, We sent Noah to his people. He said, “O my people! Worship Allah—you have no other god except Him. I truly fear for you the torment of a tremendous Day.”",
    "But the chiefs of his people said, “We surely see that you are clearly misguided.”",
    "He replied, “O my people! I am not misguided! But I am a messenger from the Lord of all worlds",
    "conveying to you my Lord’s messages and giving you ˹sincere˺ advice. And I know from Allah what you do not know.",
    "Do you find it astonishing that a reminder should come to you from your Lord through one of your own, warning you, so you may beware and perhaps be shown mercy?”",
    "But they rejected him, so We saved him and those with him in the Ark, and drowned those who rejected Our signs. They were certainly a blind people.",
    "And to the people of ’Âd We sent their brother Hûd. He said, “O my people! Worship Allah—you have no other god except Him. Will you not then fear Him?”",
    "The disbelieving chiefs of his people responded, “We surely see you as a fool, and we certainly think you are a liar.”",
    "Hûd replied, “O my people! I am no fool! But I am a messenger from the Lord of all worlds",
    "conveying to you my Lord’s messages. And I am your sincere advisor.",
    "Do you find it astonishing that a reminder should come to you from your Lord through one of your own so he may warn you? Remember that He made you successors after the people of Noah and increased you greatly in stature. So remember Allah’s favours, so you may be successful.”",
    "They said, “Have you come to us so that we would worship Allah alone and abandon what our forefathers used to worship? Then bring us what you threaten us with, if what you say is true!”",
    "He said, “You will certainly be subjected to your Lord’s torment and wrath. Do you dispute with me regarding the so-called gods which you and your forefathers have made up—a practice Allah has never authorized? Then wait! I too am waiting with you.”",
    "So We saved him and those with him by Our mercy and uprooted those who denied Our signs. They were not believers.",
    "And to the people of Thamûd We sent their brother Ṣâliḥ. He said, “O my people! Worship Allah—you have no other god except Him. A clear proof has come to you from your Lord: this is Allah’s she-camel as a sign to you. So leave her to graze ˹freely˺ on Allah’s land and do not harm her, or else you will be overcome by a painful punishment.",
    "Remember when He made you successors after ’Âd and established you in the land—˹and˺ you built palaces on its plains and carved homes into mountains. So remember Allah’s favours, and do not go about spreading corruption in the land.”",
    "The arrogant chiefs of his people asked the lowly who believed among them, “Are you certain that Ṣâliḥ has been sent by his Lord?” They replied, “We certainly believe in what he has been sent with.”",
    "The arrogant said, “We surely reject what you believe in.”",
    "Then they killed the she-camel—defying their Lord’s command—and challenged ˹Ṣâliḥ˺, “Bring us what you threaten us with, if you are ˹truly˺ one of the messengers.”",
    "Then an ˹overwhelming˺ earthquake struck them, and they fell lifeless in their homes.",
    "So he turned away from them, saying, “O my people! Surely I conveyed to you my Lord’s message and gave you ˹sincere˺ advice, but you do not like ˹sincere˺ advisors.”",
    "And ˹remember˺ when Lot scolded ˹the men of˺ his people, ˹saying,˺ “Do you commit a shameful deed that no man has ever done before?",
    "You lust after men instead of women! You are certainly transgressors.”",
    "But his people’s only response was to say, “Expel them from your land! They are a people who wish to remain chaste!”",
    "So We saved him and his family except his wife, who was one of the doomed.",
    "We poured upon them a rain ˹of brimstone˺. See what was the end of the wicked!",
    "And to the people of Midian We sent their brother Shu’aib. He said, “O my people! Worship Allah—you have no other god except Him. A clear proof has already come to you from your Lord. So give just measure and weight, do not defraud people of their property, nor spread corruption in the land after it has been set in order. This is for your own good, if you are ˹truly˺ believers.",
    "And do not lie in ambush on every road—threatening and hindering those who believe in Allah from His Path and striving to make it ˹appear˺ crooked. Remember when you were few, then He increased you in number. And consider the fate of the corruptors!",
    "If some of you do believe in what I have been sent with while others do not, then be patient until Allah judges between us. He is the Best of Judges.”",
    "The arrogant chiefs of his people threatened, “O Shu’aib! We will certainly expel you and your fellow believers from our land, unless you return to our faith.” He replied, “Even if we hate it?",
    "We would surely be fabricating a lie against Allah if we were to return to your faith after Allah has saved us from it. It does not befit us to return to it unless it is the Will of Allah, our Lord. Our Lord has encompassed everything in ˹His˺ knowledge. In Allah we trust. Our Lord! Judge between us and our people with truth. You are the best of those who judge.”",
    "The disbelieving chiefs of his people threatened, “If you follow Shu’aib, you will surely be losers!”",
    "Then an ˹overwhelming˺ earthquake struck them and they fell lifeless in their homes.",
    "Those who rejected Shu’aib were ˹wiped out˺ as if they had never lived there. Those who rejected Shu’aib were the true losers.",
    "He turned away from them, saying, “O my people! Indeed, I have delivered to you the messages of my Lord and gave you ˹sincere˺ advice. How can I then grieve for those who chose to disbelieve?”",
    "Whenever We sent a prophet to a society, We afflicted its ˹disbelieving˺ people with suffering and adversity, so perhaps they would be humbled.",
    "Then We changed their adversity to prosperity until they flourished and argued ˹falsely˺, “Our forefathers ˹too˺ had been visited by adversity and prosperity.” So We seized them by surprise, while they were unaware.",
    "Had the people of those societies been faithful and mindful ˹of Allah˺, We would have overwhelmed them with blessings from heaven and earth. But they disbelieved, so We seized them for what they used to commit.",
    "Did the people of those societies feel secure that Our punishment would not come upon them by night while they were asleep?",
    "Or did they feel secure that Our punishment would not come upon them by day while they were at play?",
    "Did they feel secure against Allah’s planning? None would feel secure from Allah’s planning except the losers.",
    "Is it not clear to those who take over the land after ˹the destruction of˺ its former residents that—if We will—We can punish them ˹too˺ for their sins and seal their hearts so they will not hear ˹the truth˺?",
    "We have narrated to you ˹O Prophet˺ some of the stories of those societies. Surely, their messengers came to them with clear proofs, but still they would not believe in what they had already denied. This is how Allah seals the hearts of the disbelievers.",
    "We did not find most of them true to their covenant. Rather, We found most of them truly rebellious.",
    "Then after them We sent Moses with Our signs to Pharaoh and his chiefs, but they wrongfully rejected them. See what was the end of the corruptors!",
    "And Moses said, “O Pharaoh! I am truly a messenger from the Lord of all worlds",
    "obliged to say nothing about Allah except the truth. Indeed, I have come to you with clear proof from your Lord, so let the children of Israel go with me.”",
    "Pharaoh said, “If you have come with a sign, then bring it if what you say is true.”",
    "So Moses threw down his staff and—behold!—it became a real snake.",
    "Then he drew his hand ˹out of his collar˺ and it was ˹shining˺ white for all to see.",
    "The chiefs of Pharaoh’s people said, “He is indeed a skilled magician",
    "who seeks to drive you from your land.” ˹So Pharaoh asked,˺ “What do you propose?”",
    "They replied, “Let him and his brother wait and send mobilizers to all cities",
    "to bring you every clever magician.”",
    "The magicians came to Pharaoh, saying, “Shall we receive a ˹suitable˺ reward if we prevail?”",
    "He replied, “Yes, and you will certainly be among those closest to me.”",
    "They asked, “O Moses! Will you cast, or shall we be the first to cast?”",
    "Moses said, “You first.” So when they did, they deceived the eyes of the people, stunned them, and made a great display of magic.",
    "Then We inspired Moses, “Throw down your staff,” and—behold!—it devoured the objects of their illusion!",
    "So the truth prevailed and their illusions failed.",
    "So Pharaoh and his people were defeated right there and put to shame.",
    "And the magicians fell down, prostrating.",
    "They declared, “We ˹now˺ believe in the Lord of all worlds—",
    "the Lord of Moses and Aaron.”",
    "Pharaoh threatened, “How dare you believe in him before I give you permission? This must be a conspiracy you devised in the city to drive out its people, but soon you will see.",
    "I will certainly cut off your hands and feet on opposite sides, then crucify you all.”",
    "They responded, “Surely to our Lord we will ˹all˺ return.",
    "Your rage towards us is only because we believed in the signs of our Lord when they came to us. Our Lord! Shower us with perseverance, and let us die while submitting ˹to You˺.”",
    "The chiefs of Pharaoh’s people protested, “Are you going to leave Moses and his people free to spread corruption in the land and abandon you and your gods?” He responded, “We will kill their sons and keep their women. We will completely dominate them.”",
    "Moses reassured his people, “Seek Allah’s help and be patient. Indeed, the earth belongs to Allah ˹alone˺. He grants it to whoever He chooses of His servants. The ultimate outcome belongs ˹only˺ to the righteous.”",
    "They complained, “We have always been oppressed—before and after you came to us ˹with the message˺.” He replied, “Perhaps your Lord will destroy your enemy and make you successors in the land to see what you will do.”",
    "Indeed, We afflicted Pharaoh’s people with famine and shortage of crops so they might come back ˹to their senses˺.",
    "In times of prosperity, they said, “This is what we deserve,” but in adversity, they blamed it on Moses and those with him. Surely all is destined by Allah. Yet most of them did not know.",
    "They said, “No matter what sign you may bring to deceive us, we will never believe in you.”",
    "So We plagued them with floods, locusts, lice, frogs, and blood—all as clear signs, but they persisted in arrogance and were a wicked people.",
    "When tormented, they pleaded, “O Moses! Pray to your Lord on our behalf, by virtue of the covenant He made with you. If you help remove this torment from us, we will certainly believe in you and let the Children of Israel go with you.”",
    "But as soon as We removed the torment from them—until they met their inevitable fate—they broke their promise.",
    "So We inflicted punishment upon them, drowning them in the sea for denying Our signs and being heedless of them.",
    "And ˹so˺ We made the oppressed people successors of the eastern and western lands, which We had showered with blessings. ˹In this way˺ the noble Word of your Lord was fulfilled for the Children of Israel for what they had endured. And We destroyed what Pharaoh and his people constructed and what they established.",
    "We brought the Children of Israel across the sea and they came upon a people devoted to idols. They demanded, “O Moses! Make for us a god like their gods.” He replied, “Indeed, you are a people acting ignorantly!",
    "What they follow is certainly doomed to destruction and their deeds are in vain.”",
    "He added, “Shall I seek for you a god other than Allah, while He has honoured you above the others?”",
    "And ˹remember˺ when We rescued you from the people of Pharaoh, who afflicted you with dreadful torment—killing your sons and keeping your women. That was a severe test from your Lord.",
    "We appointed for Moses thirty nights then added another ten—completing his Lord’s term of forty nights. Moses commanded his brother Aaron, “Take my place among my people, do what is right, and do not follow the way of the corruptors.”",
    "When Moses came at the appointed time and his Lord spoke to him, he asked, “My Lord! Reveal Yourself to me so I may see You.” Allah answered, “You cannot see Me! But look at the mountain. If it remains firm in its place, only then will you see Me.” When his Lord appeared to the mountain, He levelled it to dust and Moses collapsed unconscious. When he recovered, he cried, “Glory be to You! I turn to You in repentance and I am the first of the believers.”",
    "Allah said, “O Moses! I have ˹already˺ elevated you above all others by My messages and speech. So hold firmly to what I have given you and be grateful.”",
    "We wrote for him on the Tablets ˹the fundamentals˺ of everything; commandments and explanations of all things. ˹We commanded,˺ “Hold to this firmly and ask your people to take the best of it. I will soon show ˹all of˺ you the home of the rebellious.",
    "I will turn away from My signs those who act unjustly with arrogance in the land. And even if they were to see every sign, they still would not believe in them. If they see the Right Path, they will not take it. But if they see a crooked path, they will follow it. This is because they denied Our signs and were heedless of them.",
    "The deeds of those who deny Our signs and the meeting ˹with Allah˺ in the Hereafter will be in vain. Will they be rewarded except for what they have done?”",
    "In the absence of Moses, his people made from their ˹golden˺ jewellery an idol of a calf that made a lowing sound. Did they not see that it could neither speak to them nor guide them to the ˹Right˺ Path? Still they took it as a god and were wrongdoers.",
    "Later, when they were filled with remorse and realized they had gone astray, they cried, “If our Lord does not have mercy on us and forgive us, we will certainly be losers.”",
    "Upon Moses’ return to his people, ˹totally˺ furious and sorrowful, he said, “What an evil thing you committed in my absence! Did you want to hasten your Lord’s torment?” Then he threw down the Tablets and grabbed his brother by the hair, dragging him closer. Aaron pleaded, “O son of my mother! The people overpowered me and were about to kill me. So do not ˹humiliate me and˺ make my enemies rejoice, nor count me among the wrongdoing people.”",
    "Moses prayed, “My Lord! Forgive me and my brother! And admit us into Your mercy. You are the Most Merciful of the merciful.”",
    "Those who worshipped the calf will certainly be afflicted with Allah’s wrath as well as disgrace in the life of this world. This is how We reward those who invent falsehood.",
    "But those who commit evil, then repent and become ˹true˺ believers, your Lord will certainly be All-Forgiving, Most-Merciful.",
    "When Moses’ anger subsided, he took up the Tablets whose text contained guidance and mercy for those who stand in awe of their Lord.",
    "Moses chose seventy men from among his people for Our appointment and, when they were seized by an earthquake, he cried, “My Lord! Had You willed, You could have destroyed them long ago, and me as well. Will You destroy us for what the foolish among us have done? This is only a test from You—by which You allow whoever you will to stray and guide whoever You will. You are our Guardian. So forgive us and have mercy on us. You are the best forgiver.",
    "Ordain for us what is good in this life and the next. Indeed, we have turned to You ˹in repentance˺.” Allah replied, “I will inflict My torment on whoever I will. But My mercy encompasses everything. I will ordain mercy for those who shun evil, pay alms-tax, and believe in Our revelations.",
    "“˹They are˺ the ones who follow the Messenger, the unlettered Prophet, whose description they find in their Torah and the Gospel. He commands them to do good and forbids them from evil, permits for them what is lawful and forbids to them what is impure, and relieves them from their burdens and the shackles that bound them. ˹Only˺ those who believe in him, honour and support him, and follow the light sent down to him will be successful.”",
    "Say, ˹O Prophet,˺ “O humanity! I am Allah’s Messenger to you all. To Him ˹alone˺ belongs the kingdom of the heavens and the earth. There is no god ˹worthy of worship˺ except Him. He gives life and causes death.” So believe in Allah and His Messenger, the unlettered Prophet, who believes in Allah and His revelations. And follow him, so you may be ˹rightly˺ guided.",
    "There are some among the people of Moses who guide with the truth and establish justice accordingly.",
    "We divided them into twelve tribes—each as a community. And We revealed to Moses, when his people asked for water, “Strike the rock with your staff.” Then twelve springs gushed out. Each tribe knew its drinking place. We shaded them with clouds and sent down to them manna and quails, ˹saying˺, “Eat from the good things We have provided for you.” They ˹certainly˺ did not wrong Us, but wronged themselves.",
    "And ˹remember˺ when it was said to them, “Enter this city ˹of Jerusalem˺ and eat from wherever you please. Say, ‘Absolve us,’ and enter the gate with humility. We will forgive your sins, ˹and˺ We will multiply the reward for the good-doers.”",
    "But the wrongdoers among them changed the words they were commanded to say. So We sent down a punishment from the heavens upon them for their wrongdoing.",
    "Ask them ˹O Prophet˺ about ˹the people of˺ the town which was by the sea, who broke the Sabbath. During the Sabbath, ˹abundant˺ fish would come to them clearly visible, but on other days the fish were never seen. In this way We tested them for their rebelliousness.",
    "When some of ˹the righteous among˺ them questioned ˹their fellow Sabbath-keepers˺, “Why do you ˹bother to˺ warn those ˹Sabbath-breakers˺ who will either be destroyed or severely punished by Allah?” They replied, “Just to be free from your Lord’s blame, and so perhaps they may abstain.”",
    "When they ignored the warning they were given, We rescued those who used to warn against evil and overtook the wrongdoers with a dreadful punishment for their rebelliousness.",
    "But when they stubbornly persisted in violation, We said to them, “Be disgraced apes!”",
    "And ˹remember, O  Prophet,˺ when your Lord declared that He would send against them others who would make them suffer terribly until the Day of Judgment. Indeed, your Lord is swift in punishment, but He is certainly All-Forgiving, Most Merciful.",
    "We dispersed them through the land in groups—some were righteous, others were less so. We tested them with prosperity and adversity, so perhaps they would return ˹to the Right Path˺.",
    "Then they were succeeded by other generations who inherited the Scripture. They indulged in unlawful gains, claiming, “We will be forgiven ˹after all˺.” And if similar gain came their way, they would seize it. Was a covenant not taken from them in the Scripture that they would not say anything about Allah except the truth? And they were already well-versed in its teachings. But the ˹eternal˺ Home of the Hereafter is far better for those mindful ˹of Allah˺. Will you not then understand?",
    "As for those who firmly abide by the Scripture and establish prayer—surely We never discount the reward of those acting righteously.",
    "And ˹remember˺ when We raised the mountain over them as if it were a cloud and they thought it would fall on them. ˹We said,˺ “Hold firmly to that ˹Scripture˺ which We have given you and observe its teachings so perhaps you will become mindful ˹of Allah˺.”",
    "And ˹remember˺ when your Lord brought forth from the loins of the children of Adam their descendants and had them testify regarding themselves. ˹Allah asked,˺ “Am I not your Lord?” They replied, “Yes, You are! We testify.” ˹He cautioned,˺ “Now you have no right to say on Judgment Day, ‘We were not aware of this.’",
    "Nor say, ‘It was our forefathers who had associated others ˹with Allah in worship˺ and we, as their descendants, followed in their footsteps. Will you then destroy us for the falsehood they invented?’”",
    "This is how We make our signs clear, so perhaps they will return ˹to the Right Path˺.",
    "And relate to them ˹O Prophet˺ the story of the one to whom We gave Our signs, but he abandoned them, so Satan took hold of him, and he became a deviant.",
    "If We had willed, We would have elevated him with Our signs, but he clung to this life—following his evil desires. His example is that of a dog: if you chase it away, it pants, and if you leave it, it ˹still˺ pants. This is the example of the people who deny Our signs. So narrate ˹to them˺ stories ˹of the past˺, so perhaps they will reflect.",
    "What an evil example of those who denied Our signs! They ˹only˺ wronged their own souls.",
    "Whoever Allah guides is truly guided. And whoever He leaves to stray, they are the ˹true˺ losers.",
    "Indeed, We have destined many jinn and humans for Hell. They have hearts they do not understand with, eyes they do not see with, and ears they do not hear with. They are like cattle. In fact, they are even less guided! Such ˹people˺ are ˹entirely˺ heedless.",
    "Allah has the Most Beautiful Names. So call upon Him by them, and keep away from those who abuse His Names. They will be punished for what they used to do.",
    "And among those We created is a group that guides with the truth and establishes justice accordingly.",
    "As for those who deny Our signs, We will gradually draw them to destruction in ways they cannot comprehend.",
    "I ˹only˺ delay their end for a while, but My planning is flawless.",
    "Have they not ever given it a thought? Their fellow man is not insane. He is only sent with a clear warning.",
    "Have they ever reflected on the wonders of the heavens and the earth, and everything Allah has created, and that perhaps their end is near? So what message after this ˹Quran˺ would they believe in?",
    "Whoever Allah allows to stray, none can guide, leaving them to wander blindly in their defiance.",
    "They ask you ˹O Prophet˺ regarding the Hour, “When will it be?” Say, “That knowledge is only with my Lord. He alone will reveal it when the time comes. It is too tremendous for the heavens and the earth and will only take you by surprise.” They ask you as if you had full knowledge of it. Say, “That knowledge is only with Allah, but most people do not know.”",
    "Say, “I have no power to benefit or protect myself, except by the Will of Allah. If I had known the unknown, I would have benefited myself enormously, and no harm would have ever touched me. I am only a warner and deliverer of good news for those who believe.”",
    "He is the One Who created you from a single soul, then from it made its spouse so he may find comfort in her. After he had been united with her, she carried a light burden that developed gradually. When it grew heavy, they prayed to Allah, their Lord, “If you grant us good offspring, we will certainly be grateful.”",
    "But when He granted their descendants good offspring, they associated false gods in what He has given them. Exalted is Allah above what they associate ˹with Him˺!",
    "Do they associate ˹with Allah˺ those ˹idols˺ which cannot create anything, but are in fact created;",
    "which cannot help them, or even help themselves?",
    "And if you ˹idolaters˺ call upon them for guidance, they cannot respond to you. It is all the same whether you call them or remain silent.",
    "Those ˹idols˺ you invoke besides Allah are created beings like yourselves. So call upon them and see if they will answer you, if your claims are true!",
    "Do they have feet to walk with? Or hands to hold with? Or eyes to see with? Or ears to hear with? Say, ˹O Prophet,˺ “Call upon your associate-gods and conspire against me without delay!",
    "“Indeed, my Protector is Allah Who has revealed this Book. For He ˹alone˺ protects the righteous.",
    "But those ˹false gods˺ you call besides Him can neither help you nor even themselves.”",
    "If you ˹idolaters˺ call them to guidance, they cannot hear. And you ˹O Prophet˺ may see them facing towards you, but they cannot see.",
    "Be gracious, enjoin what is right, and turn away from those who act ignorantly.",
    "If you are tempted by Satan, then seek refuge with Allah. Surely He is All-Hearing, All-Knowing.",
    "Indeed, when Satan whispers to those mindful ˹of Allah˺, they remember ˹their Lord˺ then they start to see ˹things˺ clearly.",
    "But the devils persistently plunge their ˹human˺ associates deeper into wickedness, sparing no effort.",
    "If you ˹O Prophet˺ do not bring them a sign ˹which they demanded˺, they ask, “Why do you not make it yourself?” Say, “I only follow what is revealed to me from my Lord. This ˹Quran˺ is an insight from your Lord—a guide and a mercy for those who believe.”",
    "When the Quran is recited, listen to it attentively and be silent, so you may be shown mercy.",
    "Remember your Lord inwardly with humility and reverence and in a moderate tone of voice, both morning and evening. And do not be one of the heedless.",
    "Surely those ˹angels˺ nearest to your Lord are not too proud to worship Him. They glorify Him. And to Him they prostrate."
  ],
  "arabic1": [
    "الٓمّٓصٓ",
    "كِتٰبٌ اُنْزِلَ اِلَیْكَ فَلَا یَكُنْ فِیْ صَدْرِكَ حَرَجٌ مِّنْهُ لِتُنْذِرَ بِهٖ وَذِكْرٰی لِلْمُؤْمِنِیْنَ",
    "اِتَّبِعُوْا مَاۤ اُنْزِلَ اِلَیْكُمْ مِّنْ رَّبِّكُمْ وَلَا تَتَّبِعُوْا مِنْ دُوْنِهٖۤ اَوْلِیَآءَ قَلِیْلًا مَّا تَذَكَّرُوْنَ",
    "وَكَمْ مِّنْ قَرْیَةٍ اَهْلَكْنٰهَا فَجَآءَهَا بَاْسُنَا بَیَاتًا اَوْ هُمْ قَآىِٕلُوْنَ",
    "فَمَا كَانَ دَعْوٰىهُمْ اِذْ جَآءَهُمْ بَاْسُنَاۤ اِلَّاۤ اَنْ قَالُوْۤا اِنَّا كُنَّا ظٰلِمِیْنَ",
    "فَلَنَسْـَٔلَنَّ الَّذِیْنَ اُرْسِلَ اِلَیْهِمْ وَلَنَسْـَٔلَنَّ الْمُرْسَلِیْنَ",
    "فَلَنَقُصَّنَّ عَلَیْهِمْ بِعِلْمٍ وَّمَا كُنَّا غَآىِٕبِیْنَ",
    "وَالْوَزْنُ یَوْمَىِٕذِ ١لْحَقُّ فَمَنْ ثَقُلَتْ مَوَازِیْنُهٗ فَاُولٰٓىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "وَمَنْ خَفَّتْ مَوَازِیْنُهٗ فَاُولٰٓىِٕكَ الَّذِیْنَ خَسِرُوْۤا اَنْفُسَهُمْ بِمَا كَانُوْا بِاٰیٰتِنَا یَظْلِمُوْنَ",
    "وَلَقَدْ مَكَّنّٰكُمْ فِی الْاَرْضِ وَجَعَلْنَا لَكُمْ فِیْهَا مَعَایِشَ قَلِیْلًا مَّا تَشْكُرُوْنَ",
    "وَلَقَدْ خَلَقْنٰكُمْ ثُمَّ صَوَّرْنٰكُمْ ثُمَّ قُلْنَا لِلْمَلٰٓىِٕكَةِ اسْجُدُوْا لِاٰدَمَ ۖ فَسَجَدُوْۤا اِلَّاۤ اِبْلِیْسَ لَمْ یَكُنْ مِّنَ السّٰجِدِیْنَ",
    "قَالَ مَا مَنَعَكَ اَلَّا تَسْجُدَ اِذْ اَمَرْتُكَ قَالَ اَنَا خَیْرٌ مِّنْهُ خَلَقْتَنِیْ مِنْ نَّارٍ وَّخَلَقْتَهٗ مِنْ طِیْنٍ",
    "قَالَ فَاهْبِطْ مِنْهَا فَمَا یَكُوْنُ لَكَ اَنْ تَتَكَبَّرَ فِیْهَا فَاخْرُجْ اِنَّكَ مِنَ الصّٰغِرِیْنَ",
    "قَالَ اَنْظِرْنِیْۤ اِلٰی یَوْمِ یُبْعَثُوْنَ",
    "قَالَ اِنَّكَ مِنَ الْمُنْظَرِیْنَ",
    "قَالَ فَبِمَاۤ اَغْوَیْتَنِیْ لَاَقْعُدَنَّ لَهُمْ صِرَاطَكَ الْمُسْتَقِیْمَ",
    "ثُمَّ لَاٰتِیَنَّهُمْ مِّنْ بَیْنِ اَیْدِیْهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ اَیْمَانِهِمْ وَعَنْ شَمَآىِٕلِهِمْ وَلَا تَجِدُ اَكْثَرَهُمْ شٰكِرِیْنَ",
    "قَالَ اخْرُجْ مِنْهَا مَذْءُوْمًا مَّدْحُوْرًا لَمَنْ تَبِعَكَ مِنْهُمْ لَاَمْلَـَٔنَّ جَهَنَّمَ مِنْكُمْ اَجْمَعِیْنَ",
    "وَیٰۤاٰدَمُ اسْكُنْ اَنْتَ وَزَوْجُكَ الْجَنَّةَ فَكُلَا مِنْ حَیْثُ شِئْتُمَا وَلَا تَقْرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوْنَا مِنَ الظّٰلِمِیْنَ",
    "فَوَسْوَسَ لَهُمَا الشَّیْطٰنُ لِیُبْدِیَ لَهُمَا مَا وٗرِیَ عَنْهُمَا مِنْ سَوْاٰتِهِمَا وَقَالَ مَا نَهٰىكُمَا رَبُّكُمَا عَنْ هٰذِهِ الشَّجَرَةِ اِلَّاۤ اَنْ تَكُوْنَا مَلَكَیْنِ اَوْ تَكُوْنَا مِنَ الْخٰلِدِیْنَ",
    "وَقَاسَمَهُمَاۤ اِنِّیْ لَكُمَا لَمِنَ النّٰصِحِیْنَ",
    "فَدَلّٰىهُمَا بِغُرُوْرٍ فَلَمَّا ذَاقَا الشَّجَرَةَ بَدَتْ لَهُمَا سَوْاٰتُهُمَا وَطَفِقَا یَخْصِفٰنِ عَلَیْهِمَا مِنْ وَّرَقِ الْجَنَّةِ وَنَادٰىهُمَا رَبُّهُمَاۤ اَلَمْ اَنْهَكُمَا عَنْ تِلْكُمَا الشَّجَرَةِ وَاَقُلْ لَّكُمَاۤ اِنَّ الشَّیْطٰنَ لَكُمَا عَدُوٌّ مُّبِیْنٌ",
    "قَالَا رَبَّنَا ظَلَمْنَاۤ اَنْفُسَنَا ٚ وَاِنْ لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِیْنَ",
    "قَالَ اهْبِطُوْا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ وَلَكُمْ فِی الْاَرْضِ مُسْتَقَرٌّ وَّمَتَاعٌ اِلٰی حِیْنٍ",
    "قَالَ فِیْهَا تَحْیَوْنَ وَفِیْهَا تَمُوْتُوْنَ وَمِنْهَا تُخْرَجُوْنَ",
    "یٰبَنِیْۤ اٰدَمَ قَدْ اَنْزَلْنَا عَلَیْكُمْ لِبَاسًا یُّوَارِیْ سَوْاٰتِكُمْ وَرِیْشًا وَلِبَاسُ التَّقْوٰی ذٰلِكَ خَیْرٌ ذٰلِكَ مِنْ اٰیٰتِ اللّٰهِ لَعَلَّهُمْ یَذَّكَّرُوْنَ",
    "یٰبَنِیْۤ اٰدَمَ لَا یَفْتِنَنَّكُمُ الشَّیْطٰنُ كَمَاۤ اَخْرَجَ اَبَوَیْكُمْ مِّنَ الْجَنَّةِ یَنْزِعُ عَنْهُمَا لِبَاسَهُمَا لِیُرِیَهُمَا سَوْاٰتِهِمَا اِنَّهٗ یَرٰىكُمْ هُوَ وَقَبِیْلُهٗ مِنْ حَیْثُ لَا تَرَوْنَهُمْ اِنَّا جَعَلْنَا الشَّیٰطِیْنَ اَوْلِیَآءَ لِلَّذِیْنَ لَا یُؤْمِنُوْنَ",
    "وَاِذَا فَعَلُوْا فَاحِشَةً قَالُوْا وَجَدْنَا عَلَیْهَاۤ اٰبَآءَنَا وَاللّٰهُ اَمَرَنَا بِهَا قُلْ اِنَّ اللّٰهَ لَا یَاْمُرُ بِالْفَحْشَآءِ اَتَقُوْلُوْنَ عَلَی اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "قُلْ اَمَرَ رَبِّیْ بِالْقِسْطِ ۫ وَاَقِیْمُوْا وُجُوْهَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَّادْعُوْهُ مُخْلِصِیْنَ لَهُ الدِّیْنَ كَمَا بَدَاَكُمْ تَعُوْدُوْنَ",
    "فَرِیْقًا هَدٰی وَفَرِیْقًا حَقَّ عَلَیْهِمُ الضَّلٰلَةُ اِنَّهُمُ اتَّخَذُوا الشَّیٰطِیْنَ اَوْلِیَآءَ مِنْ دُوْنِ اللّٰهِ وَیَحْسَبُوْنَ اَنَّهُمْ مُّهْتَدُوْنَ",
    "یٰبَنِیْۤ اٰدَمَ خُذُوْا زِیْنَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَّكُلُوْا وَاشْرَبُوْا وَلَا تُسْرِفُوْا اِنَّهٗ لَا یُحِبُّ الْمُسْرِفِیْنَ",
    "قُلْ مَنْ حَرَّمَ زِیْنَةَ اللّٰهِ الَّتِیْۤ اَخْرَجَ لِعِبَادِهٖ وَالطَّیِّبٰتِ مِنَ الرِّزْقِ قُلْ هِیَ لِلَّذِیْنَ اٰمَنُوْا فِی الْحَیٰوةِ الدُّنْیَا خَالِصَةً یَّوْمَ الْقِیٰمَةِ كَذٰلِكَ نُفَصِّلُ الْاٰیٰتِ لِقَوْمٍ یَّعْلَمُوْنَ",
    "قُلْ اِنَّمَا حَرَّمَ رَبِّیَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَالْاِثْمَ وَالْبَغْیَ بِغَیْرِ الْحَقِّ وَاَنْ تُشْرِكُوْا بِاللّٰهِ مَا لَمْ یُنَزِّلْ بِهٖ سُلْطٰنًا وَّاَنْ تَقُوْلُوْا عَلَی اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "وَلِكُلِّ اُمَّةٍ اَجَلٌ فَاِذَا جَآءَ اَجَلُهُمْ لَا یَسْتَاْخِرُوْنَ سَاعَةً وَّلَا یَسْتَقْدِمُوْنَ",
    "یٰبَنِیْۤ اٰدَمَ اِمَّا یَاْتِیَنَّكُمْ رُسُلٌ مِّنْكُمْ یَقُصُّوْنَ عَلَیْكُمْ اٰیٰتِیْ فَمَنِ اتَّقٰی وَاَصْلَحَ فَلَا خَوْفٌ عَلَیْهِمْ وَلَا هُمْ یَحْزَنُوْنَ",
    "وَالَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا وَاسْتَكْبَرُوْا عَنْهَاۤ اُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "فَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰی عَلَی اللّٰهِ كَذِبًا اَوْ كَذَّبَ بِاٰیٰتِهٖ اُولٰٓىِٕكَ یَنَالُهُمْ نَصِیْبُهُمْ مِّنَ الْكِتٰبِ حَتّٰۤی اِذَا جَآءَتْهُمْ رُسُلُنَا یَتَوَفَّوْنَهُمْ قَالُوْۤا اَیْنَ مَا كُنْتُمْ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ قَالُوْا ضَلُّوْا عَنَّا وَشَهِدُوْا عَلٰۤی اَنْفُسِهِمْ اَنَّهُمْ كَانُوْا كٰفِرِیْنَ",
    "قَالَ ادْخُلُوْا فِیْۤ اُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِكُمْ مِّنَ الْجِنِّ وَالْاِنْسِ فِی النَّارِ كُلَّمَا دَخَلَتْ اُمَّةٌ لَّعَنَتْ اُخْتَهَا حَتّٰۤی اِذَا ادَّارَكُوْا فِیْهَا جَمِیْعًا قَالَتْ اُخْرٰىهُمْ لِاُوْلٰىهُمْ رَبَّنَا هٰۤؤُلَآءِ اَضَلُّوْنَا فَاٰتِهِمْ عَذَابًا ضِعْفًا مِّنَ النَّارِ قَالَ لِكُلٍّ ضِعْفٌ وَّلٰكِنْ لَّا تَعْلَمُوْنَ",
    "وَقَالَتْ اُوْلٰىهُمْ لِاُخْرٰىهُمْ فَمَا كَانَ لَكُمْ عَلَیْنَا مِنْ فَضْلٍ فَذُوْقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْسِبُوْنَ",
    "اِنَّ الَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا وَاسْتَكْبَرُوْا عَنْهَا لَا تُفَتَّحُ لَهُمْ اَبْوَابُ السَّمَآءِ وَلَا یَدْخُلُوْنَ الْجَنَّةَ حَتّٰی یَلِجَ الْجَمَلُ فِیْ سَمِّ الْخِیَاطِ وَكَذٰلِكَ نَجْزِی الْمُجْرِمِیْنَ",
    "لَهُمْ مِّنْ جَهَنَّمَ مِهَادٌ وَّمِنْ فَوْقِهِمْ غَوَاشٍ وَكَذٰلِكَ نَجْزِی الظّٰلِمِیْنَ",
    "وَالَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَا نُكَلِّفُ نَفْسًا اِلَّا وُسْعَهَاۤ اُولٰٓىِٕكَ اَصْحٰبُ الْجَنَّةِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "وَنَزَعْنَا مَا فِیْ صُدُوْرِهِمْ مِّنْ غِلٍّ تَجْرِیْ مِنْ تَحْتِهِمُ الْاَنْهٰرُ وَقَالُوا الْحَمْدُ لِلّٰهِ الَّذِیْ هَدٰىنَا لِهٰذَا ۫ وَمَا كُنَّا لِنَهْتَدِیَ لَوْلَاۤ اَنْ هَدٰىنَا اللّٰهُ لَقَدْ جَآءَتْ رُسُلُ رَبِّنَا بِالْحَقِّ وَنُوْدُوْۤا اَنْ تِلْكُمُ الْجَنَّةُ اُوْرِثْتُمُوْهَا بِمَا كُنْتُمْ تَعْمَلُوْنَ",
    "وَنَادٰۤی اَصْحٰبُ الْجَنَّةِ اَصْحٰبَ النَّارِ اَنْ قَدْ وَجَدْنَا مَا وَعَدَنَا رَبُّنَا حَقًّا فَهَلْ وَجَدْتُّمْ مَّا وَعَدَ رَبُّكُمْ حَقًّا قَالُوْا نَعَمْ فَاَذَّنَ مُؤَذِّنٌ بَیْنَهُمْ اَنْ لَّعْنَةُ اللّٰهِ عَلَی الظّٰلِمِیْنَ",
    "الَّذِیْنَ یَصُدُّوْنَ عَنْ سَبِیْلِ اللّٰهِ وَیَبْغُوْنَهَا عِوَجًا وَهُمْ بِالْاٰخِرَةِ كٰفِرُوْنَ",
    "وَبَیْنَهُمَا حِجَابٌ وَعَلَی الْاَعْرَافِ رِجَالٌ یَّعْرِفُوْنَ كُلًّا بِسِیْمٰىهُمْ وَنَادَوْا اَصْحٰبَ الْجَنَّةِ اَنْ سَلٰمٌ عَلَیْكُمْ ۫ لَمْ یَدْخُلُوْهَا وَهُمْ یَطْمَعُوْنَ",
    "وَاِذَا صُرِفَتْ اَبْصَارُهُمْ تِلْقَآءَ اَصْحٰبِ النَّارِ قَالُوْا رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظّٰلِمِیْنَ",
    "وَنَادٰۤی اَصْحٰبُ الْاَعْرَافِ رِجَالًا یَّعْرِفُوْنَهُمْ بِسِیْمٰىهُمْ قَالُوْا مَاۤ اَغْنٰی عَنْكُمْ جَمْعُكُمْ وَمَا كُنْتُمْ تَسْتَكْبِرُوْنَ",
    "اَهٰۤؤُلَآءِ الَّذِیْنَ اَقْسَمْتُمْ لَا یَنَالُهُمُ اللّٰهُ بِرَحْمَةٍ اُدْخُلُوا الْجَنَّةَ لَا خَوْفٌ عَلَیْكُمْ وَلَاۤ اَنْتُمْ تَحْزَنُوْنَ",
    "وَنَادٰۤی اَصْحٰبُ النَّارِ اَصْحٰبَ الْجَنَّةِ اَنْ اَفِیْضُوْا عَلَیْنَا مِنَ الْمَآءِ اَوْ مِمَّا رَزَقَكُمُ اللّٰهُ قَالُوْۤا اِنَّ اللّٰهَ حَرَّمَهُمَا عَلَی الْكٰفِرِیْنَ",
    "الَّذِیْنَ اتَّخَذُوْا دِیْنَهُمْ لَهْوًا وَّلَعِبًا وَّغَرَّتْهُمُ الْحَیٰوةُ الدُّنْیَا فَالْیَوْمَ نَنْسٰىهُمْ كَمَا نَسُوْا لِقَآءَ یَوْمِهِمْ هٰذَا وَمَا كَانُوْا بِاٰیٰتِنَا یَجْحَدُوْنَ",
    "وَلَقَدْ جِئْنٰهُمْ بِكِتٰبٍ فَصَّلْنٰهُ عَلٰی عِلْمٍ هُدًی وَّرَحْمَةً لِّقَوْمٍ یُّؤْمِنُوْنَ",
    "هَلْ یَنْظُرُوْنَ اِلَّا تَاْوِیْلَهٗ یَوْمَ یَاْتِیْ تَاْوِیْلُهٗ یَقُوْلُ الَّذِیْنَ نَسُوْهُ مِنْ قَبْلُ قَدْ جَآءَتْ رُسُلُ رَبِّنَا بِالْحَقِّ فَهَلْ لَّنَا مِنْ شُفَعَآءَ فَیَشْفَعُوْا لَنَاۤ اَوْ نُرَدُّ فَنَعْمَلَ غَیْرَ الَّذِیْ كُنَّا نَعْمَلُ قَدْ خَسِرُوْۤا اَنْفُسَهُمْ وَضَلَّ عَنْهُمْ مَّا كَانُوْا یَفْتَرُوْنَ",
    "اِنَّ رَبَّكُمُ اللّٰهُ الَّذِیْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ فِیْ سِتَّةِ اَیَّامٍ ثُمَّ اسْتَوٰی عَلَی الْعَرْشِ ۫ یُغْشِی الَّیْلَ النَّهَارَ یَطْلُبُهٗ حَثِیْثًا وَّالشَّمْسَ وَالْقَمَرَ وَالنُّجُوْمَ مُسَخَّرٰتٍ بِاَمْرِهٖ اَلَا لَهُ الْخَلْقُ وَالْاَمْرُ تَبٰرَكَ اللّٰهُ رَبُّ الْعٰلَمِیْنَ",
    "اُدْعُوْا رَبَّكُمْ تَضَرُّعًا وَّخُفْیَةً اِنَّهٗ لَا یُحِبُّ الْمُعْتَدِیْنَ",
    "وَلَا تُفْسِدُوْا فِی الْاَرْضِ بَعْدَ اِصْلَاحِهَا وَادْعُوْهُ خَوْفًا وَّطَمَعًا اِنَّ رَحْمَتَ اللّٰهِ قَرِیْبٌ مِّنَ الْمُحْسِنِیْنَ",
    "وَهُوَ الَّذِیْ یُرْسِلُ الرِّیٰحَ بُشْرًاۢ بَیْنَ یَدَیْ رَحْمَتِهٖ حَتّٰۤی اِذَاۤ اَقَلَّتْ سَحَابًا ثِقَالًا سُقْنٰهُ لِبَلَدٍ مَّیِّتٍ فَاَنْزَلْنَا بِهِ الْمَآءَ فَاَخْرَجْنَا بِهٖ مِنْ كُلِّ الثَّمَرٰتِ كَذٰلِكَ نُخْرِجُ الْمَوْتٰی لَعَلَّكُمْ تَذَكَّرُوْنَ",
    "وَالْبَلَدُ الطَّیِّبُ یَخْرُجُ نَبَاتُهٗ بِاِذْنِ رَبِّهٖ وَالَّذِیْ خَبُثَ لَا یَخْرُجُ اِلَّا نَكِدًا كَذٰلِكَ نُصَرِّفُ الْاٰیٰتِ لِقَوْمٍ یَّشْكُرُوْنَ",
    "لَقَدْ اَرْسَلْنَا نُوْحًا اِلٰی قَوْمِهٖ فَقَالَ یٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَیْرُهٗ اِنِّیْۤ اَخَافُ عَلَیْكُمْ عَذَابَ یَوْمٍ عَظِیْمٍ",
    "قَالَ الْمَلَاُ مِنْ قَوْمِهٖۤ اِنَّا لَنَرٰىكَ فِیْ ضَلٰلٍ مُّبِیْنٍ",
    "قَالَ یٰقَوْمِ لَیْسَ بِیْ ضَلٰلَةٌ وَّلٰكِنِّیْ رَسُوْلٌ مِّنْ رَّبِّ الْعٰلَمِیْنَ",
    "اُبَلِّغُكُمْ رِسٰلٰتِ رَبِّیْ وَاَنْصَحُ لَكُمْ وَاَعْلَمُ مِنَ اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "اَوَعَجِبْتُمْ اَنْ جَآءَكُمْ ذِكْرٌ مِّنْ رَّبِّكُمْ عَلٰی رَجُلٍ مِّنْكُمْ لِیُنْذِرَكُمْ وَلِتَتَّقُوْا وَلَعَلَّكُمْ تُرْحَمُوْنَ",
    "فَكَذَّبُوْهُ فَاَنْجَیْنٰهُ وَالَّذِیْنَ مَعَهٗ فِی الْفُلْكِ وَاَغْرَقْنَا الَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا اِنَّهُمْ كَانُوْا قَوْمًا عَمِیْنَ",
    "وَاِلٰی عَادٍ اَخَاهُمْ هُوْدًا قَالَ یٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَیْرُهٗ اَفَلَا تَتَّقُوْنَ",
    "قَالَ الْمَلَاُ الَّذِیْنَ كَفَرُوْا مِنْ قَوْمِهٖۤ اِنَّا لَنَرٰىكَ فِیْ سَفَاهَةٍ وَّاِنَّا لَنَظُنُّكَ مِنَ الْكٰذِبِیْنَ",
    "قَالَ یٰقَوْمِ لَیْسَ بِیْ سَفَاهَةٌ وَّلٰكِنِّیْ رَسُوْلٌ مِّنْ رَّبِّ الْعٰلَمِیْنَ",
    "اُبَلِّغُكُمْ رِسٰلٰتِ رَبِّیْ وَاَنَا لَكُمْ نَاصِحٌ اَمِیْنٌ",
    "اَوَعَجِبْتُمْ اَنْ جَآءَكُمْ ذِكْرٌ مِّنْ رَّبِّكُمْ عَلٰی رَجُلٍ مِّنْكُمْ لِیُنْذِرَكُمْ وَاذْكُرُوْۤا اِذْ جَعَلَكُمْ خُلَفَآءَ مِنْ بَعْدِ قَوْمِ نُوْحٍ وَّزَادَكُمْ فِی الْخَلْقِ بَصْطَةً فَاذْكُرُوْۤا اٰلَآءَ اللّٰهِ لَعَلَّكُمْ تُفْلِحُوْنَ",
    "قَالُوْۤا اَجِئْتَنَا لِنَعْبُدَ اللّٰهَ وَحْدَهٗ وَنَذَرَ مَا كَانَ یَعْبُدُ اٰبَآؤُنَا فَاْتِنَا بِمَا تَعِدُنَاۤ اِنْ كُنْتَ مِنَ الصّٰدِقِیْنَ",
    "قَالَ قَدْ وَقَعَ عَلَیْكُمْ مِّنْ رَّبِّكُمْ رِجْسٌ وَّغَضَبٌ اَتُجَادِلُوْنَنِیْ فِیْۤ اَسْمَآءٍ سَمَّیْتُمُوْهَاۤ اَنْتُمْ وَاٰبَآؤُكُمْ مَّا نَزَّلَ اللّٰهُ بِهَا مِنْ سُلْطٰنٍ فَانْتَظِرُوْۤا اِنِّیْ مَعَكُمْ مِّنَ الْمُنْتَظِرِیْنَ",
    "فَاَنْجَیْنٰهُ وَالَّذِیْنَ مَعَهٗ بِرَحْمَةٍ مِّنَّا وَقَطَعْنَا دَابِرَ الَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا وَمَا كَانُوْا مُؤْمِنِیْنَ",
    "وَاِلٰی ثَمُوْدَ اَخَاهُمْ صٰلِحًا قَالَ یٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَیْرُهٗ قَدْ جَآءَتْكُمْ بَیِّنَةٌ مِّنْ رَّبِّكُمْ هٰذِهٖ نَاقَةُ اللّٰهِ لَكُمْ اٰیَةً فَذَرُوْهَا تَاْكُلْ فِیْۤ اَرْضِ اللّٰهِ وَلَا تَمَسُّوْهَا بِسُوْٓءٍ فَیَاْخُذَكُمْ عَذَابٌ اَلِیْمٌ",
    "وَاذْكُرُوْۤا اِذْ جَعَلَكُمْ خُلَفَآءَ مِنْ بَعْدِ عَادٍ وَّبَوَّاَكُمْ فِی الْاَرْضِ تَتَّخِذُوْنَ مِنْ سُهُوْلِهَا قُصُوْرًا وَّتَنْحِتُوْنَ الْجِبَالَ بُیُوْتًا فَاذْكُرُوْۤا اٰلَآءَ اللّٰهِ وَلَا تَعْثَوْا فِی الْاَرْضِ مُفْسِدِیْنَ",
    "قَالَ الْمَلَاُ الَّذِیْنَ اسْتَكْبَرُوْا مِنْ قَوْمِهٖ لِلَّذِیْنَ اسْتُضْعِفُوْا لِمَنْ اٰمَنَ مِنْهُمْ اَتَعْلَمُوْنَ اَنَّ صٰلِحًا مُّرْسَلٌ مِّنْ رَّبِّهٖ قَالُوْۤا اِنَّا بِمَاۤ اُرْسِلَ بِهٖ مُؤْمِنُوْنَ",
    "قَالَ الَّذِیْنَ اسْتَكْبَرُوْۤا اِنَّا بِالَّذِیْۤ اٰمَنْتُمْ بِهٖ كٰفِرُوْنَ",
    "فَعَقَرُوا النَّاقَةَ وَعَتَوْا عَنْ اَمْرِ رَبِّهِمْ وَقَالُوْا یٰصٰلِحُ ائْتِنَا بِمَا تَعِدُنَاۤ اِنْ كُنْتَ مِنَ الْمُرْسَلِیْنَ",
    "فَاَخَذَتْهُمُ الرَّجْفَةُ فَاَصْبَحُوْا فِیْ دَارِهِمْ جٰثِمِیْنَ",
    "فَتَوَلّٰی عَنْهُمْ وَقَالَ یٰقَوْمِ لَقَدْ اَبْلَغْتُكُمْ رِسَالَةَ رَبِّیْ وَنَصَحْتُ لَكُمْ وَلٰكِنْ لَّا تُحِبُّوْنَ النّٰصِحِیْنَ",
    "وَلُوْطًا اِذْ قَالَ لِقَوْمِهٖۤ اَتَاْتُوْنَ الْفَاحِشَةَ مَا سَبَقَكُمْ بِهَا مِنْ اَحَدٍ مِّنَ الْعٰلَمِیْنَ",
    "اِنَّكُمْ لَتَاْتُوْنَ الرِّجَالَ شَهْوَةً مِّنْ دُوْنِ النِّسَآءِ بَلْ اَنْتُمْ قَوْمٌ مُّسْرِفُوْنَ",
    "وَمَا كَانَ جَوَابَ قَوْمِهٖۤ اِلَّاۤ اَنْ قَالُوْۤا اَخْرِجُوْهُمْ مِّنْ قَرْیَتِكُمْ اِنَّهُمْ اُنَاسٌ یَّتَطَهَّرُوْنَ",
    "فَاَنْجَیْنٰهُ وَاَهْلَهٗۤ اِلَّا امْرَاَتَهٗ ۖ كَانَتْ مِنَ الْغٰبِرِیْنَ",
    "وَاَمْطَرْنَا عَلَیْهِمْ مَّطَرًا فَانْظُرْ كَیْفَ كَانَ عَاقِبَةُ الْمُجْرِمِیْنَ",
    "وَاِلٰی مَدْیَنَ اَخَاهُمْ شُعَیْبًا قَالَ یٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَیْرُهٗ قَدْ جَآءَتْكُمْ بَیِّنَةٌ مِّنْ رَّبِّكُمْ فَاَوْفُوا الْكَیْلَ وَالْمِیْزَانَ وَلَا تَبْخَسُوا النَّاسَ اَشْیَآءَهُمْ وَلَا تُفْسِدُوْا فِی الْاَرْضِ بَعْدَ اِصْلَاحِهَا ذٰلِكُمْ خَیْرٌ لَّكُمْ اِنْ كُنْتُمْ مُّؤْمِنِیْنَ",
    "وَلَا تَقْعُدُوْا بِكُلِّ صِرَاطٍ تُوْعِدُوْنَ وَتَصُدُّوْنَ عَنْ سَبِیْلِ اللّٰهِ مَنْ اٰمَنَ بِهٖ وَتَبْغُوْنَهَا عِوَجًا وَاذْكُرُوْۤا اِذْ كُنْتُمْ قَلِیْلًا فَكَثَّرَكُمْ وَانْظُرُوْا كَیْفَ كَانَ عَاقِبَةُ الْمُفْسِدِیْنَ",
    "وَاِنْ كَانَ طَآىِٕفَةٌ مِّنْكُمْ اٰمَنُوْا بِالَّذِیْۤ اُرْسِلْتُ بِهٖ وَطَآىِٕفَةٌ لَّمْ یُؤْمِنُوْا فَاصْبِرُوْا حَتّٰی یَحْكُمَ اللّٰهُ بَیْنَنَا وَهُوَ خَیْرُ الْحٰكِمِیْنَ",
    "قَالَ الْمَلَاُ الَّذِیْنَ اسْتَكْبَرُوْا مِنْ قَوْمِهٖ لَنُخْرِجَنَّكَ یٰشُعَیْبُ وَالَّذِیْنَ اٰمَنُوْا مَعَكَ مِنْ قَرْیَتِنَاۤ اَوْ لَتَعُوْدُنَّ فِیْ مِلَّتِنَا قَالَ اَوَلَوْ كُنَّا كٰرِهِیْنَ",
    "قَدِ افْتَرَیْنَا عَلَی اللّٰهِ كَذِبًا اِنْ عُدْنَا فِیْ مِلَّتِكُمْ بَعْدَ اِذْ نَجّٰىنَا اللّٰهُ مِنْهَا وَمَا یَكُوْنُ لَنَاۤ اَنْ نَّعُوْدَ فِیْهَاۤ اِلَّاۤ اَنْ یَّشَآءَ اللّٰهُ رَبُّنَا وَسِعَ رَبُّنَا كُلَّ شَیْءٍ عِلْمًا عَلَی اللّٰهِ تَوَكَّلْنَا رَبَّنَا افْتَحْ بَیْنَنَا وَبَیْنَ قَوْمِنَا بِالْحَقِّ وَاَنْتَ خَیْرُ الْفٰتِحِیْنَ",
    "وَقَالَ الْمَلَاُ الَّذِیْنَ كَفَرُوْا مِنْ قَوْمِهٖ لَىِٕنِ اتَّبَعْتُمْ شُعَیْبًا اِنَّكُمْ اِذًا لَّخٰسِرُوْنَ",
    "فَاَخَذَتْهُمُ الرَّجْفَةُ فَاَصْبَحُوْا فِیْ دَارِهِمْ جٰثِمِیْنَ",
    "الَّذِیْنَ كَذَّبُوْا شُعَیْبًا كَاَنْ لَّمْ یَغْنَوْا فِیْهَا اَلَّذِیْنَ كَذَّبُوْا شُعَیْبًا كَانُوْا هُمُ الْخٰسِرِیْنَ",
    "فَتَوَلّٰی عَنْهُمْ وَقَالَ یٰقَوْمِ لَقَدْ اَبْلَغْتُكُمْ رِسٰلٰتِ رَبِّیْ وَنَصَحْتُ لَكُمْ فَكَیْفَ اٰسٰی عَلٰی قَوْمٍ كٰفِرِیْنَ",
    "وَمَاۤ اَرْسَلْنَا فِیْ قَرْیَةٍ مِّنْ نَّبِیٍّ اِلَّاۤ اَخَذْنَاۤ اَهْلَهَا بِالْبَاْسَآءِ وَالضَّرَّآءِ لَعَلَّهُمْ یَضَّرَّعُوْنَ",
    "ثُمَّ بَدَّلْنَا مَكَانَ السَّیِّئَةِ الْحَسَنَةَ حَتّٰی عَفَوْا وَّقَالُوْا قَدْ مَسَّ اٰبَآءَنَا الضَّرَّآءُ وَالسَّرَّآءُ فَاَخَذْنٰهُمْ بَغْتَةً وَّهُمْ لَا یَشْعُرُوْنَ",
    "وَلَوْ اَنَّ اَهْلَ الْقُرٰۤی اٰمَنُوْا وَاتَّقَوْا لَفَتَحْنَا عَلَیْهِمْ بَرَكٰتٍ مِّنَ السَّمَآءِ وَالْاَرْضِ وَلٰكِنْ كَذَّبُوْا فَاَخَذْنٰهُمْ بِمَا كَانُوْا یَكْسِبُوْنَ",
    "اَفَاَمِنَ اَهْلُ الْقُرٰۤی اَنْ یَّاْتِیَهُمْ بَاْسُنَا بَیَاتًا وَّهُمْ نَآىِٕمُوْنَ",
    "اَوَاَمِنَ اَهْلُ الْقُرٰۤی اَنْ یَّاْتِیَهُمْ بَاْسُنَا ضُحًی وَّهُمْ یَلْعَبُوْنَ",
    "اَفَاَمِنُوْا مَكْرَ اللّٰهِ فَلَا یَاْمَنُ مَكْرَ اللّٰهِ اِلَّا الْقَوْمُ الْخٰسِرُوْنَ",
    "اَوَلَمْ یَهْدِ لِلَّذِیْنَ یَرِثُوْنَ الْاَرْضَ مِنْ بَعْدِ اَهْلِهَاۤ اَنْ لَّوْ نَشَآءُ اَصَبْنٰهُمْ بِذُنُوْبِهِمْ وَنَطْبَعُ عَلٰی قُلُوْبِهِمْ فَهُمْ لَا یَسْمَعُوْنَ",
    "تِلْكَ الْقُرٰی نَقُصُّ عَلَیْكَ مِنْ اَنْۢبَآىِٕهَا وَلَقَدْ جَآءَتْهُمْ رُسُلُهُمْ بِالْبَیِّنٰتِ فَمَا كَانُوْا لِیُؤْمِنُوْا بِمَا كَذَّبُوْا مِنْ قَبْلُ كَذٰلِكَ یَطْبَعُ اللّٰهُ عَلٰی قُلُوْبِ الْكٰفِرِیْنَ",
    "وَمَا وَجَدْنَا لِاَكْثَرِهِمْ مِّنْ عَهْدٍ وَاِنْ وَّجَدْنَاۤ اَكْثَرَهُمْ لَفٰسِقِیْنَ",
    "ثُمَّ بَعَثْنَا مِنْ بَعْدِهِمْ مُّوْسٰی بِاٰیٰتِنَاۤ اِلٰی فِرْعَوْنَ وَمَلَاۡىِٕهٖ فَظَلَمُوْا بِهَا فَانْظُرْ كَیْفَ كَانَ عَاقِبَةُ الْمُفْسِدِیْنَ",
    "وَقَالَ مُوْسٰی یٰفِرْعَوْنُ اِنِّیْ رَسُوْلٌ مِّنْ رَّبِّ الْعٰلَمِیْنَ",
    "حَقِیْقٌ عَلٰۤی اَنْ لَّاۤ اَقُوْلَ عَلَی اللّٰهِ اِلَّا الْحَقَّ قَدْ جِئْتُكُمْ بِبَیِّنَةٍ مِّنْ رَّبِّكُمْ فَاَرْسِلْ مَعِیَ بَنِیْۤ اِسْرَآءِیْلَ",
    "قَالَ اِنْ كُنْتَ جِئْتَ بِاٰیَةٍ فَاْتِ بِهَاۤ اِنْ كُنْتَ مِنَ الصّٰدِقِیْنَ",
    "فَاَلْقٰی عَصَاهُ فَاِذَا هِیَ ثُعْبَانٌ مُّبِیْنٌ ۖ",
    "وَّنَزَعَ یَدَهٗ فَاِذَا هِیَ بَیْضَآءُ لِلنّٰظِرِیْنَ",
    "قَالَ الْمَلَاُ مِنْ قَوْمِ فِرْعَوْنَ اِنَّ هٰذَا لَسٰحِرٌ عَلِیْمٌ",
    "یُّرِیْدُ اَنْ یُّخْرِجَكُمْ مِّنْ اَرْضِكُمْ فَمَاذَا تَاْمُرُوْنَ",
    "قَالُوْۤا اَرْجِهْ وَاَخَاهُ وَاَرْسِلْ فِی الْمَدَآىِٕنِ حٰشِرِیْنَ",
    "یَاْتُوْكَ بِكُلِّ سٰحِرٍ عَلِیْمٍ",
    "وَجَآءَ السَّحَرَةُ فِرْعَوْنَ قَالُوْۤا اِنَّ لَنَا لَاَجْرًا اِنْ كُنَّا نَحْنُ الْغٰلِبِیْنَ",
    "قَالَ نَعَمْ وَاِنَّكُمْ لَمِنَ الْمُقَرَّبِیْنَ",
    "قَالُوْا یٰمُوْسٰۤی اِمَّاۤ اَنْ تُلْقِیَ وَاِمَّاۤ اَنْ نَّكُوْنَ نَحْنُ الْمُلْقِیْنَ",
    "قَالَ اَلْقُوْا فَلَمَّاۤ اَلْقَوْا سَحَرُوْۤا اَعْیُنَ النَّاسِ وَاسْتَرْهَبُوْهُمْ وَجَآءُوْ بِسِحْرٍ عَظِیْمٍ",
    "وَاَوْحَیْنَاۤ اِلٰی مُوْسٰۤی اَنْ اَلْقِ عَصَاكَ فَاِذَا هِیَ تَلْقَفُ مَا یَاْفِكُوْنَ",
    "فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوْا یَعْمَلُوْنَ",
    "فَغُلِبُوْا هُنَالِكَ وَانْقَلَبُوْا صٰغِرِیْنَ",
    "وَاُلْقِیَ السَّحَرَةُ سٰجِدِیْنَ",
    "قَالُوْۤا اٰمَنَّا بِرَبِّ الْعٰلَمِیْنَ",
    "رَبِّ مُوْسٰی وَهٰرُوْنَ",
    "قَالَ فِرْعَوْنُ اٰمَنْتُمْ بِهٖ قَبْلَ اَنْ اٰذَنَ لَكُمْ اِنَّ هٰذَا لَمَكْرٌ مَّكَرْتُمُوْهُ فِی الْمَدِیْنَةِ لِتُخْرِجُوْا مِنْهَاۤ اَهْلَهَا فَسَوْفَ تَعْلَمُوْنَ",
    "لَاُقَطِّعَنَّ اَیْدِیَكُمْ وَاَرْجُلَكُمْ مِّنْ خِلَافٍ ثُمَّ لَاُصَلِّبَنَّكُمْ اَجْمَعِیْنَ",
    "قَالُوْۤا اِنَّاۤ اِلٰی رَبِّنَا مُنْقَلِبُوْنَ",
    "وَمَا تَنْقِمُ مِنَّاۤ اِلَّاۤ اَنْ اٰمَنَّا بِاٰیٰتِ رَبِّنَا لَمَّا جَآءَتْنَا رَبَّنَاۤ اَفْرِغْ عَلَیْنَا صَبْرًا وَّتَوَفَّنَا مُسْلِمِیْنَ",
    "وَقَالَ الْمَلَاُ مِنْ قَوْمِ فِرْعَوْنَ اَتَذَرُ مُوْسٰی وَقَوْمَهٗ لِیُفْسِدُوْا فِی الْاَرْضِ وَیَذَرَكَ وَاٰلِهَتَكَ قَالَ سَنُقَتِّلُ اَبْنَآءَهُمْ وَنَسْتَحْیٖ نِسَآءَهُمْ وَاِنَّا فَوْقَهُمْ قٰهِرُوْنَ",
    "قَالَ مُوْسٰی لِقَوْمِهِ اسْتَعِیْنُوْا بِاللّٰهِ وَاصْبِرُوْا اِنَّ الْاَرْضَ لِلّٰهِ ۫ یُوْرِثُهَا مَنْ یَّشَآءُ مِنْ عِبَادِهٖ وَالْعَاقِبَةُ لِلْمُتَّقِیْنَ",
    "قَالُوْۤا اُوْذِیْنَا مِنْ قَبْلِ اَنْ تَاْتِیَنَا وَمِنْ بَعْدِ مَا جِئْتَنَا قَالَ عَسٰی رَبُّكُمْ اَنْ یُّهْلِكَ عَدُوَّكُمْ وَیَسْتَخْلِفَكُمْ فِی الْاَرْضِ فَیَنْظُرَ كَیْفَ تَعْمَلُوْنَ",
    "وَلَقَدْ اَخَذْنَاۤ اٰلَ فِرْعَوْنَ بِالسِّنِیْنَ وَنَقْصٍ مِّنَ الثَّمَرٰتِ لَعَلَّهُمْ یَذَّكَّرُوْنَ",
    "فَاِذَا جَآءَتْهُمُ الْحَسَنَةُ قَالُوْا لَنَا هٰذِهٖ وَاِنْ تُصِبْهُمْ سَیِّئَةٌ یَّطَّیَّرُوْا بِمُوْسٰی وَمَنْ مَّعَهٗ اَلَاۤ اِنَّمَا طٰٓىِٕرُهُمْ عِنْدَ اللّٰهِ وَلٰكِنَّ اَكْثَرَهُمْ لَا یَعْلَمُوْنَ",
    "وَقَالُوْا مَهْمَا تَاْتِنَا بِهٖ مِنْ اٰیَةٍ لِّتَسْحَرَنَا بِهَا فَمَا نَحْنُ لَكَ بِمُؤْمِنِیْنَ",
    "فَاَرْسَلْنَا عَلَیْهِمُ الطُّوْفَانَ وَالْجَرَادَ وَالْقُمَّلَ وَالضَّفَادِعَ وَالدَّمَ اٰیٰتٍ مُّفَصَّلٰتٍ ۫ فَاسْتَكْبَرُوْا وَكَانُوْا قَوْمًا مُّجْرِمِیْنَ",
    "وَلَمَّا وَقَعَ عَلَیْهِمُ الرِّجْزُ قَالُوْا یٰمُوْسَی ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِنْدَكَ لَىِٕنْ كَشَفْتَ عَنَّا الرِّجْزَ لَنُؤْمِنَنَّ لَكَ وَلَنُرْسِلَنَّ مَعَكَ بَنِیْۤ اِسْرَآءِیْلَ",
    "فَلَمَّا كَشَفْنَا عَنْهُمُ الرِّجْزَ اِلٰۤی اَجَلٍ هُمْ بٰلِغُوْهُ اِذَا هُمْ یَنْكُثُوْنَ",
    "فَانْتَقَمْنَا مِنْهُمْ فَاَغْرَقْنٰهُمْ فِی الْیَمِّ بِاَنَّهُمْ كَذَّبُوْا بِاٰیٰتِنَا وَكَانُوْا عَنْهَا غٰفِلِیْنَ",
    "وَاَوْرَثْنَا الْقَوْمَ الَّذِیْنَ كَانُوْا یُسْتَضْعَفُوْنَ مَشَارِقَ الْاَرْضِ وَمَغَارِبَهَا الَّتِیْ بٰرَكْنَا فِیْهَا وَتَمَّتْ كَلِمَتُ رَبِّكَ الْحُسْنٰی عَلٰی بَنِیْۤ اِسْرَآءِیْلَ بِمَا صَبَرُوْا وَدَمَّرْنَا مَا كَانَ یَصْنَعُ فِرْعَوْنُ وَقَوْمُهٗ وَمَا كَانُوْا یَعْرِشُوْنَ",
    "وَجٰوَزْنَا بِبَنِیْۤ اِسْرَآءِیْلَ الْبَحْرَ فَاَتَوْا عَلٰی قَوْمٍ یَّعْكُفُوْنَ عَلٰۤی اَصْنَامٍ لَّهُمْ قَالُوْا یٰمُوْسَی اجْعَلْ لَّنَاۤ اِلٰهًا كَمَا لَهُمْ اٰلِهَةٌ قَالَ اِنَّكُمْ قَوْمٌ تَجْهَلُوْنَ",
    "اِنَّ هٰۤؤُلَآءِ مُتَبَّرٌ مَّا هُمْ فِیْهِ وَبٰطِلٌ مَّا كَانُوْا یَعْمَلُوْنَ",
    "قَالَ اَغَیْرَ اللّٰهِ اَبْغِیْكُمْ اِلٰهًا وَّهُوَ فَضَّلَكُمْ عَلَی الْعٰلَمِیْنَ",
    "وَاِذْ اَنْجَیْنٰكُمْ مِّنْ اٰلِ فِرْعَوْنَ یَسُوْمُوْنَكُمْ سُوْٓءَ الْعَذَابِ یُقَتِّلُوْنَ اَبْنَآءَكُمْ وَیَسْتَحْیُوْنَ نِسَآءَكُمْ وَفِیْ ذٰلِكُمْ بَلَآءٌ مِّنْ رَّبِّكُمْ عَظِیْمٌ",
    "وَوٰعَدْنَا مُوْسٰی ثَلٰثِیْنَ لَیْلَةً وَّاَتْمَمْنٰهَا بِعَشْرٍ فَتَمَّ مِیْقَاتُ رَبِّهٖۤ اَرْبَعِیْنَ لَیْلَةً وَقَالَ مُوْسٰی لِاَخِیْهِ هٰرُوْنَ اخْلُفْنِیْ فِیْ قَوْمِیْ وَاَصْلِحْ وَلَا تَتَّبِعْ سَبِیْلَ الْمُفْسِدِیْنَ",
    "وَلَمَّا جَآءَ مُوْسٰی لِمِیْقَاتِنَا وَكَلَّمَهٗ رَبُّهٗ قَالَ رَبِّ اَرِنِیْۤ اَنْظُرْ اِلَیْكَ قَالَ لَنْ تَرٰىنِیْ وَلٰكِنِ انْظُرْ اِلَی الْجَبَلِ فَاِنِ اسْتَقَرَّ مَكَانَهٗ فَسَوْفَ تَرٰىنِیْ فَلَمَّا تَجَلّٰی رَبُّهٗ لِلْجَبَلِ جَعَلَهٗ دَكًّا وَّخَرَّ مُوْسٰی صَعِقًا فَلَمَّاۤ اَفَاقَ قَالَ سُبْحٰنَكَ تُبْتُ اِلَیْكَ وَاَنَا اَوَّلُ الْمُؤْمِنِیْنَ",
    "قَالَ یٰمُوْسٰۤی اِنِّی اصْطَفَیْتُكَ عَلَی النَّاسِ بِرِسٰلٰتِیْ وَبِكَلَامِیْ ۖ فَخُذْ مَاۤ اٰتَیْتُكَ وَكُنْ مِّنَ الشّٰكِرِیْنَ",
    "وَكَتَبْنَا لَهٗ فِی الْاَلْوَاحِ مِنْ كُلِّ شَیْءٍ مَّوْعِظَةً وَّتَفْصِیْلًا لِّكُلِّ شَیْءٍ فَخُذْهَا بِقُوَّةٍ وَّاْمُرْ قَوْمَكَ یَاْخُذُوْا بِاَحْسَنِهَا سَاُورِیْكُمْ دَارَ الْفٰسِقِیْنَ",
    "سَاَصْرِفُ عَنْ اٰیٰتِیَ الَّذِیْنَ یَتَكَبَّرُوْنَ فِی الْاَرْضِ بِغَیْرِ الْحَقِّ وَاِنْ یَّرَوْا كُلَّ اٰیَةٍ لَّا یُؤْمِنُوْا بِهَا وَاِنْ یَّرَوْا سَبِیْلَ الرُّشْدِ لَا یَتَّخِذُوْهُ سَبِیْلًا وَاِنْ یَّرَوْا سَبِیْلَ الْغَیِّ یَتَّخِذُوْهُ سَبِیْلًا ذٰلِكَ بِاَنَّهُمْ كَذَّبُوْا بِاٰیٰتِنَا وَكَانُوْا عَنْهَا غٰفِلِیْنَ",
    "وَالَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا وَلِقَآءِ الْاٰخِرَةِ حَبِطَتْ اَعْمَالُهُمْ هَلْ یُجْزَوْنَ اِلَّا مَا كَانُوْا یَعْمَلُوْنَ",
    "وَاتَّخَذَ قَوْمُ مُوْسٰی مِنْ بَعْدِهٖ مِنْ حُلِیِّهِمْ عِجْلًا جَسَدًا لَّهٗ خُوَارٌ اَلَمْ یَرَوْا اَنَّهٗ لَا یُكَلِّمُهُمْ وَلَا یَهْدِیْهِمْ سَبِیْلًا اِتَّخَذُوْهُ وَكَانُوْا ظٰلِمِیْنَ",
    "وَلَمَّا سُقِطَ فِیْۤ اَیْدِیْهِمْ وَرَاَوْا اَنَّهُمْ قَدْ ضَلُّوْا قَالُوْا لَىِٕنْ لَّمْ یَرْحَمْنَا رَبُّنَا وَیَغْفِرْ لَنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِیْنَ",
    "وَلَمَّا رَجَعَ مُوْسٰۤی اِلٰی قَوْمِهٖ غَضْبَانَ اَسِفًا قَالَ بِئْسَمَا خَلَفْتُمُوْنِیْ مِنْ بَعْدِیْ اَعَجِلْتُمْ اَمْرَ رَبِّكُمْ وَاَلْقَی الْاَلْوَاحَ وَاَخَذَ بِرَاْسِ اَخِیْهِ یَجُرُّهٗۤ اِلَیْهِ قَالَ ابْنَ اُمَّ اِنَّ الْقَوْمَ اسْتَضْعَفُوْنِیْ وَكَادُوْا یَقْتُلُوْنَنِیْ ۖ فَلَا تُشْمِتْ بِیَ الْاَعْدَآءَ وَلَا تَجْعَلْنِیْ مَعَ الْقَوْمِ الظّٰلِمِیْنَ",
    "قَالَ رَبِّ اغْفِرْ لِیْ وَلِاَخِیْ وَاَدْخِلْنَا فِیْ رَحْمَتِكَ ۖ وَاَنْتَ اَرْحَمُ الرّٰحِمِیْنَ",
    "اِنَّ الَّذِیْنَ اتَّخَذُوا الْعِجْلَ سَیَنَالُهُمْ غَضَبٌ مِّنْ رَّبِّهِمْ وَذِلَّةٌ فِی الْحَیٰوةِ الدُّنْیَا وَكَذٰلِكَ نَجْزِی الْمُفْتَرِیْنَ",
    "وَالَّذِیْنَ عَمِلُوا السَّیِّاٰتِ ثُمَّ تَابُوْا مِنْ بَعْدِهَا وَاٰمَنُوْۤا اِنَّ رَبَّكَ مِنْ بَعْدِهَا لَغَفُوْرٌ رَّحِیْمٌ",
    "وَلَمَّا سَكَتَ عَنْ مُّوْسَی الْغَضَبُ اَخَذَ الْاَلْوَاحَ وَفِیْ نُسْخَتِهَا هُدًی وَّرَحْمَةٌ لِّلَّذِیْنَ هُمْ لِرَبِّهِمْ یَرْهَبُوْنَ",
    "وَاخْتَارَ مُوْسٰی قَوْمَهٗ سَبْعِیْنَ رَجُلًا لِّمِیْقَاتِنَا فَلَمَّاۤ اَخَذَتْهُمُ الرَّجْفَةُ قَالَ رَبِّ لَوْ شِئْتَ اَهْلَكْتَهُمْ مِّنْ قَبْلُ وَاِیَّایَ اَتُهْلِكُنَا بِمَا فَعَلَ السُّفَهَآءُ مِنَّا اِنْ هِیَ اِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَنْ تَشَآءُ وَتَهْدِیْ مَنْ تَشَآءُ اَنْتَ وَلِیُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَاَنْتَ خَیْرُ الْغٰفِرِیْنَ",
    "وَاكْتُبْ لَنَا فِیْ هٰذِهِ الدُّنْیَا حَسَنَةً وَّفِی الْاٰخِرَةِ اِنَّا هُدْنَاۤ اِلَیْكَ قَالَ عَذَابِیْۤ اُصِیْبُ بِهٖ مَنْ اَشَآءُ وَرَحْمَتِیْ وَسِعَتْ كُلَّ شَیْءٍ فَسَاَكْتُبُهَا لِلَّذِیْنَ یَتَّقُوْنَ وَیُؤْتُوْنَ الزَّكٰوةَ وَالَّذِیْنَ هُمْ بِاٰیٰتِنَا یُؤْمِنُوْنَ",
    "اَلَّذِیْنَ یَتَّبِعُوْنَ الرَّسُوْلَ النَّبِیَّ الْاُمِّیَّ الَّذِیْ یَجِدُوْنَهٗ مَكْتُوْبًا عِنْدَهُمْ فِی التَّوْرٰىةِ وَالْاِنْجِیْلِ یَاْمُرُهُمْ بِالْمَعْرُوْفِ وَیَنْهٰىهُمْ عَنِ الْمُنْكَرِ وَیُحِلُّ لَهُمُ الطَّیِّبٰتِ وَیُحَرِّمُ عَلَیْهِمُ الْخَبٰٓىِٕثَ وَیَضَعُ عَنْهُمْ اِصْرَهُمْ وَالْاَغْلٰلَ الَّتِیْ كَانَتْ عَلَیْهِمْ فَالَّذِیْنَ اٰمَنُوْا بِهٖ وَعَزَّرُوْهُ وَنَصَرُوْهُ وَاتَّبَعُوا النُّوْرَ الَّذِیْۤ اُنْزِلَ مَعَهٗۤ اُولٰٓىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "قُلْ یٰۤاَیُّهَا النَّاسُ اِنِّیْ رَسُوْلُ اللّٰهِ اِلَیْكُمْ جَمِیْعَا ١لَّذِیْ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ لَاۤ اِلٰهَ اِلَّا هُوَ یُحْیٖ وَیُمِیْتُ فَاٰمِنُوْا بِاللّٰهِ وَرَسُوْلِهِ النَّبِیِّ الْاُمِّیِّ الَّذِیْ یُؤْمِنُ بِاللّٰهِ وَكَلِمٰتِهٖ وَاتَّبِعُوْهُ لَعَلَّكُمْ تَهْتَدُوْنَ",
    "وَمِنْ قَوْمِ مُوْسٰۤی اُمَّةٌ یَّهْدُوْنَ بِالْحَقِّ وَبِهٖ یَعْدِلُوْنَ",
    "وَقَطَّعْنٰهُمُ اثْنَتَیْ عَشْرَةَ اَسْبَاطًا اُمَمًا وَاَوْحَیْنَاۤ اِلٰی مُوْسٰۤی اِذِ اسْتَسْقٰىهُ قَوْمُهٗۤ اَنِ اضْرِبْ بِّعَصَاكَ الْحَجَرَ فَانْۢبَجَسَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَیْنًا قَدْ عَلِمَ كُلُّ اُنَاسٍ مَّشْرَبَهُمْ وَظَلَّلْنَا عَلَیْهِمُ الْغَمَامَ وَاَنْزَلْنَا عَلَیْهِمُ الْمَنَّ وَالسَّلْوٰی كُلُوْا مِنْ طَیِّبٰتِ مَا رَزَقْنٰكُمْ وَمَا ظَلَمُوْنَا وَلٰكِنْ كَانُوْۤا اَنْفُسَهُمْ یَظْلِمُوْنَ",
    "وَاِذْ قِیْلَ لَهُمُ اسْكُنُوْا هٰذِهِ الْقَرْیَةَ وَكُلُوْا مِنْهَا حَیْثُ شِئْتُمْ وَقُوْلُوْا حِطَّةٌ وَّادْخُلُوا الْبَابَ سُجَّدًا نَّغْفِرْ لَكُمْ خَطِیْٓـٰٔتِكُمْ سَنَزِیْدُ الْمُحْسِنِیْنَ",
    "فَبَدَّلَ الَّذِیْنَ ظَلَمُوْا مِنْهُمْ قَوْلًا غَیْرَ الَّذِیْ قِیْلَ لَهُمْ فَاَرْسَلْنَا عَلَیْهِمْ رِجْزًا مِّنَ السَّمَآءِ بِمَا كَانُوْا یَظْلِمُوْنَ",
    "وَسْـَٔلْهُمْ عَنِ الْقَرْیَةِ الَّتِیْ كَانَتْ حَاضِرَةَ الْبَحْرِ اِذْ یَعْدُوْنَ فِی السَّبْتِ اِذْ تَاْتِیْهِمْ حِیْتَانُهُمْ یَوْمَ سَبْتِهِمْ شُرَّعًا وَّیَوْمَ لَا یَسْبِتُوْنَ لَا تَاْتِیْهِمْ كَذٰلِكَ نَبْلُوْهُمْ بِمَا كَانُوْا یَفْسُقُوْنَ",
    "وَاِذْ قَالَتْ اُمَّةٌ مِّنْهُمْ لِمَ تَعِظُوْنَ قَوْمَا ١للّٰهُ مُهْلِكُهُمْ اَوْ مُعَذِّبُهُمْ عَذَابًا شَدِیْدًا قَالُوْا مَعْذِرَةً اِلٰی رَبِّكُمْ وَلَعَلَّهُمْ یَتَّقُوْنَ",
    "فَلَمَّا نَسُوْا مَا ذُكِّرُوْا بِهٖۤ اَنْجَیْنَا الَّذِیْنَ یَنْهَوْنَ عَنِ السُّوْٓءِ وَاَخَذْنَا الَّذِیْنَ ظَلَمُوْا بِعَذَابٍۭ بَىِٕیْسٍ بِمَا كَانُوْا یَفْسُقُوْنَ",
    "فَلَمَّا عَتَوْا عَنْ مَّا نُهُوْا عَنْهُ قُلْنَا لَهُمْ كُوْنُوْا قِرَدَةً خٰسِىِٕیْنَ",
    "وَاِذْ تَاَذَّنَ رَبُّكَ لَیَبْعَثَنَّ عَلَیْهِمْ اِلٰی یَوْمِ الْقِیٰمَةِ مَنْ یَّسُوْمُهُمْ سُوْٓءَ الْعَذَابِ اِنَّ رَبَّكَ لَسَرِیْعُ الْعِقَابِ وَاِنَّهٗ لَغَفُوْرٌ رَّحِیْمٌ",
    "وَقَطَّعْنٰهُمْ فِی الْاَرْضِ اُمَمًا مِنْهُمُ الصّٰلِحُوْنَ وَمِنْهُمْ دُوْنَ ذٰلِكَ وَبَلَوْنٰهُمْ بِالْحَسَنٰتِ وَالسَّیِّاٰتِ لَعَلَّهُمْ یَرْجِعُوْنَ",
    "فَخَلَفَ مِنْ بَعْدِهِمْ خَلْفٌ وَّرِثُوا الْكِتٰبَ یَاْخُذُوْنَ عَرَضَ هٰذَا الْاَدْنٰی وَیَقُوْلُوْنَ سَیُغْفَرُ لَنَا وَاِنْ یَّاْتِهِمْ عَرَضٌ مِّثْلُهٗ یَاْخُذُوْهُ اَلَمْ یُؤْخَذْ عَلَیْهِمْ مِّیْثَاقُ الْكِتٰبِ اَنْ لَّا یَقُوْلُوْا عَلَی اللّٰهِ اِلَّا الْحَقَّ وَدَرَسُوْا مَا فِیْهِ وَالدَّارُ الْاٰخِرَةُ خَیْرٌ لِّلَّذِیْنَ یَتَّقُوْنَ اَفَلَا تَعْقِلُوْنَ",
    "وَالَّذِیْنَ یُمَسِّكُوْنَ بِالْكِتٰبِ وَاَقَامُوا الصَّلٰوةَ اِنَّا لَا نُضِیْعُ اَجْرَ الْمُصْلِحِیْنَ",
    "وَاِذْ نَتَقْنَا الْجَبَلَ فَوْقَهُمْ كَاَنَّهٗ ظُلَّةٌ وَّظَنُّوْۤا اَنَّهٗ وَاقِعٌ بِهِمْ خُذُوْا مَاۤ اٰتَیْنٰكُمْ بِقُوَّةٍ وَّاذْكُرُوْا مَا فِیْهِ لَعَلَّكُمْ تَتَّقُوْنَ",
    "وَاِذْ اَخَذَ رَبُّكَ مِنْ بَنِیْۤ اٰدَمَ مِنْ ظُهُوْرِهِمْ ذُرِّیَّتَهُمْ وَاَشْهَدَهُمْ عَلٰۤی اَنْفُسِهِمْ اَلَسْتُ بِرَبِّكُمْ قَالُوْا بَلٰی شَهِدْنَا اَنْ تَقُوْلُوْا یَوْمَ الْقِیٰمَةِ اِنَّا كُنَّا عَنْ هٰذَا غٰفِلِیْنَ",
    "اَوْ تَقُوْلُوْۤا اِنَّمَاۤ اَشْرَكَ اٰبَآؤُنَا مِنْ قَبْلُ وَكُنَّا ذُرِّیَّةً مِّنْ بَعْدِهِمْ اَفَتُهْلِكُنَا بِمَا فَعَلَ الْمُبْطِلُوْنَ",
    "وَكَذٰلِكَ نُفَصِّلُ الْاٰیٰتِ وَلَعَلَّهُمْ یَرْجِعُوْنَ",
    "وَاتْلُ عَلَیْهِمْ نَبَاَ الَّذِیْۤ اٰتَیْنٰهُ اٰیٰتِنَا فَانْسَلَخَ مِنْهَا فَاَتْبَعَهُ الشَّیْطٰنُ فَكَانَ مِنَ الْغٰوِیْنَ",
    "وَلَوْ شِئْنَا لَرَفَعْنٰهُ بِهَا وَلٰكِنَّهٗۤ اَخْلَدَ اِلَی الْاَرْضِ وَاتَّبَعَ هَوٰىهُ فَمَثَلُهٗ كَمَثَلِ الْكَلْبِ اِنْ تَحْمِلْ عَلَیْهِ یَلْهَثْ اَوْ تَتْرُكْهُ یَلْهَثْ ذٰلِكَ مَثَلُ الْقَوْمِ الَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا فَاقْصُصِ الْقَصَصَ لَعَلَّهُمْ یَتَفَكَّرُوْنَ",
    "سَآءَ مَثَلَا ١لْقَوْمُ الَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا وَاَنْفُسَهُمْ كَانُوْا یَظْلِمُوْنَ",
    "مَنْ یَّهْدِ اللّٰهُ فَهُوَ الْمُهْتَدِیْ وَمَنْ یُّضْلِلْ فَاُولٰٓىِٕكَ هُمُ الْخٰسِرُوْنَ",
    "وَلَقَدْ ذَرَاْنَا لِجَهَنَّمَ كَثِیْرًا مِّنَ الْجِنِّ وَالْاِنْسِ ۖ لَهُمْ قُلُوْبٌ لَّا یَفْقَهُوْنَ بِهَا وَلَهُمْ اَعْیُنٌ لَّا یُبْصِرُوْنَ بِهَا وَلَهُمْ اٰذَانٌ لَّا یَسْمَعُوْنَ بِهَا اُولٰٓىِٕكَ كَالْاَنْعَامِ بَلْ هُمْ اَضَلُّ اُولٰٓىِٕكَ هُمُ الْغٰفِلُوْنَ",
    "وَلِلّٰهِ الْاَسْمَآءُ الْحُسْنٰی فَادْعُوْهُ بِهَا وَذَرُوا الَّذِیْنَ یُلْحِدُوْنَ فِیْۤ اَسْمَآىِٕهٖ سَیُجْزَوْنَ مَا كَانُوْا یَعْمَلُوْنَ",
    "وَمِمَّنْ خَلَقْنَاۤ اُمَّةٌ یَّهْدُوْنَ بِالْحَقِّ وَبِهٖ یَعْدِلُوْنَ",
    "وَالَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا سَنَسْتَدْرِجُهُمْ مِّنْ حَیْثُ لَا یَعْلَمُوْنَ",
    "وَاُمْلِیْ لَهُمْ اِنَّ كَیْدِیْ مَتِیْنٌ",
    "اَوَلَمْ یَتَفَكَّرُوْا ٚ مَا بِصَاحِبِهِمْ مِّنْ جِنَّةٍ اِنْ هُوَ اِلَّا نَذِیْرٌ مُّبِیْنٌ",
    "اَوَلَمْ یَنْظُرُوْا فِیْ مَلَكُوْتِ السَّمٰوٰتِ وَالْاَرْضِ وَمَا خَلَقَ اللّٰهُ مِنْ شَیْءٍ وَّاَنْ عَسٰۤی اَنْ یَّكُوْنَ قَدِ اقْتَرَبَ اَجَلُهُمْ فَبِاَیِّ حَدِیْثٍ بَعْدَهٗ یُؤْمِنُوْنَ",
    "مَنْ یُّضْلِلِ اللّٰهُ فَلَا هَادِیَ لَهٗ وَیَذَرُهُمْ فِیْ طُغْیَانِهِمْ یَعْمَهُوْنَ",
    "یَسْـَٔلُوْنَكَ عَنِ السَّاعَةِ اَیَّانَ مُرْسٰىهَا قُلْ اِنَّمَا عِلْمُهَا عِنْدَ رَبِّیْ لَا یُجَلِّیْهَا لِوَقْتِهَاۤ اِلَّا هُوَ ثَقُلَتْ فِی السَّمٰوٰتِ وَالْاَرْضِ لَا تَاْتِیْكُمْ اِلَّا بَغْتَةً یَسْـَٔلُوْنَكَ كَاَنَّكَ حَفِیٌّ عَنْهَا قُلْ اِنَّمَا عِلْمُهَا عِنْدَ اللّٰهِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَعْلَمُوْنَ",
    "قُلْ لَّاۤ اَمْلِكُ لِنَفْسِیْ نَفْعًا وَّلَا ضَرًّا اِلَّا مَا شَآءَ اللّٰهُ وَلَوْ كُنْتُ اَعْلَمُ الْغَیْبَ لَاسْتَكْثَرْتُ مِنَ الْخَیْرِ وَمَا مَسَّنِیَ السُّوْٓءُ اِنْ اَنَا اِلَّا نَذِیْرٌ وَّبَشِیْرٌ لِّقَوْمٍ یُّؤْمِنُوْنَ",
    "هُوَ الَّذِیْ خَلَقَكُمْ مِّنْ نَّفْسٍ وَّاحِدَةٍ وَّجَعَلَ مِنْهَا زَوْجَهَا لِیَسْكُنَ اِلَیْهَا فَلَمَّا تَغَشّٰىهَا حَمَلَتْ حَمْلًا خَفِیْفًا فَمَرَّتْ بِهٖ فَلَمَّاۤ اَثْقَلَتْ دَّعَوَا اللّٰهَ رَبَّهُمَا لَىِٕنْ اٰتَیْتَنَا صَالِحًا لَّنَكُوْنَنَّ مِنَ الشّٰكِرِیْنَ",
    "فَلَمَّاۤ اٰتٰىهُمَا صَالِحًا جَعَلَا لَهٗ شُرَكَآءَ فِیْمَاۤ اٰتٰىهُمَا فَتَعٰلَی اللّٰهُ عَمَّا یُشْرِكُوْنَ",
    "اَیُشْرِكُوْنَ مَا لَا یَخْلُقُ شَیْـًٔا وَّهُمْ یُخْلَقُوْنَ",
    "وَلَا یَسْتَطِیْعُوْنَ لَهُمْ نَصْرًا وَّلَاۤ اَنْفُسَهُمْ یَنْصُرُوْنَ",
    "وَاِنْ تَدْعُوْهُمْ اِلَی الْهُدٰی لَا یَتَّبِعُوْكُمْ سَوَآءٌ عَلَیْكُمْ اَدَعَوْتُمُوْهُمْ اَمْ اَنْتُمْ صَامِتُوْنَ",
    "اِنَّ الَّذِیْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ عِبَادٌ اَمْثَالُكُمْ فَادْعُوْهُمْ فَلْیَسْتَجِیْبُوْا لَكُمْ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "اَلَهُمْ اَرْجُلٌ یَّمْشُوْنَ بِهَاۤ اَمْ لَهُمْ اَیْدٍ یَّبْطِشُوْنَ بِهَاۤ اَمْ لَهُمْ اَعْیُنٌ یُّبْصِرُوْنَ بِهَاۤ اَمْ لَهُمْ اٰذَانٌ یَّسْمَعُوْنَ بِهَا قُلِ ادْعُوْا شُرَكَآءَكُمْ ثُمَّ كِیْدُوْنِ فَلَا تُنْظِرُوْنِ",
    "اِنَّ وَلِیِّ اللّٰهُ الَّذِیْ نَزَّلَ الْكِتٰبَ ۖ وَهُوَ یَتَوَلَّی الصّٰلِحِیْنَ",
    "وَالَّذِیْنَ تَدْعُوْنَ مِنْ دُوْنِهٖ لَا یَسْتَطِیْعُوْنَ نَصْرَكُمْ وَلَاۤ اَنْفُسَهُمْ یَنْصُرُوْنَ",
    "وَاِنْ تَدْعُوْهُمْ اِلَی الْهُدٰی لَا یَسْمَعُوْا وَتَرٰىهُمْ یَنْظُرُوْنَ اِلَیْكَ وَهُمْ لَا یُبْصِرُوْنَ",
    "خُذِ الْعَفْوَ وَاْمُرْ بِالْعُرْفِ وَاَعْرِضْ عَنِ الْجٰهِلِیْنَ",
    "وَاِمَّا یَنْزَغَنَّكَ مِنَ الشَّیْطٰنِ نَزْغٌ فَاسْتَعِذْ بِاللّٰهِ اِنَّهٗ سَمِیْعٌ عَلِیْمٌ",
    "اِنَّ الَّذِیْنَ اتَّقَوْا اِذَا مَسَّهُمْ طٰٓىِٕفٌ مِّنَ الشَّیْطٰنِ تَذَكَّرُوْا فَاِذَا هُمْ مُّبْصِرُوْنَ",
    "وَاِخْوَانُهُمْ یَمُدُّوْنَهُمْ فِی الْغَیِّ ثُمَّ لَا یُقْصِرُوْنَ",
    "وَاِذَا لَمْ تَاْتِهِمْ بِاٰیَةٍ قَالُوْا لَوْلَا اجْتَبَیْتَهَا قُلْ اِنَّمَاۤ اَتَّبِعُ مَا یُوْحٰۤی اِلَیَّ مِنْ رَّبِّیْ هٰذَا بَصَآىِٕرُ مِنْ رَّبِّكُمْ وَهُدًی وَّرَحْمَةٌ لِّقَوْمٍ یُّؤْمِنُوْنَ",
    "وَاِذَا قُرِئَ الْقُرْاٰنُ فَاسْتَمِعُوْا لَهٗ وَاَنْصِتُوْا لَعَلَّكُمْ تُرْحَمُوْنَ",
    "وَاذْكُرْ رَّبَّكَ فِیْ نَفْسِكَ تَضَرُّعًا وَّخِیْفَةً وَّدُوْنَ الْجَهْرِ مِنَ الْقَوْلِ بِالْغُدُوِّ وَالْاٰصَالِ وَلَا تَكُنْ مِّنَ الْغٰفِلِیْنَ",
    "اِنَّ الَّذِیْنَ عِنْدَ رَبِّكَ لَا یَسْتَكْبِرُوْنَ عَنْ عِبَادَتِهٖ وَیُسَبِّحُوْنَهٗ وَلَهٗ یَسْجُدُوْنَ"
  ],
  "bengali": [
    "আলিফ-লাম-মীম-সাদ।",
    "এটি কিতাব, যা তোমার প্রতি নাযিল করা হয়েছে। সুতরাং তার সম্পর্কে তোমার মনে যেন কোন সংকীর্ণতা না থাকে। যাতে তুমি তার মাধ্যমে সতর্ক করতে পার এবং তা মুমিনদের জন্য উপদেশ।",
    "তোমাদের প্রতি তোমাদের রবের পক্ষ থেকে যা নাযিল করা হয়েছে, তা অনুসরণ কর এবং তাকে ছাড়া অন্য অভিভাবকের অনুসরণ করো না। তোমরা সামান্যই উপদেশ গ্রহণ কর।",
    "আর এমন বহু জনবসতি রয়েছে, যা আমি ধ্বংস করে দিয়েছি। বস্তুত সেখানে আমার আযাব এসেছে রাতে, কিংবা যখন তারা দ্বিপ্রহরে বিশ্রামরত ছিল।",
    "সুতরাং যখন তাদের নিকট আমার আযাব এসেছে, তখন তাদের দাবী কেবল এই ছিল যে, তারা বলল, ‘নিশ্চয় আমরা যালিম ছিলাম’।",
    "সুতরাং আমি অবশ্যই তাদেরকে জিজ্ঞাসাবাদ করব যাদের নিকট রাসূল প্রেরিত হয়েছিল এবং অবশ্যই আমি প্রেরিতদেরকে জিজ্ঞাসাবাদ করব।",
    "অতঃপর অবশ্যই আমি তাদের নিকট জ্ঞানের ভিত্তিতে বর্ণনা করব। আর আমি তো অনুপস্থিত ছিলাম না।",
    "আর সেদিন পরিমাপ হবে যথাযথ। সুতরাং যাদের পাল্লা ভারি হবে তারাই হবে সফলকাম।",
    "আর যাদের পাল্লা হালকা হবে, তারাই হবে সেই সব লোক, যারা নিজদেরকে ক্ষতিগ্রস্ত করেছে। কারণ তারা আমার আয়াতসমূহের প্রতি (অস্বীকার করার মাধ্যমে) যুলম করত।",
    "আর অবশ্যই আমি তো তোমাদেরকে যমীনে প্রতিষ্ঠিত করেছি এবং তোমাদের জন্য তাতে রেখেছি জীবনোপকরণ। তোমরা অল্পই কৃতজ্ঞ হও।",
    "আর অবশ্যই আমি তোমাদেরকে সৃষ্টি করেছি। তারপর তোমাদের আকৃতি দিয়েছি। তারপর ফেরেশতাদেরকে বলেছি, ‘তোমরা আদমকে সিজদা কর’। অতঃপর তারা সিজদা করেছে, ইবলীস ছাড়া। সে সিজদাকারীদের অন্তর্ভুক্ত ছিল না।",
    "তিনি বললেন, ‘কিসে তোমাকে বাধা দিয়েছে যে, সিজদা করছ না, যখন আমি তোমাকে নির্দেশ দিয়েছি’? সে বলল, ‘আমি তার চেয়ে উত্তম। আপনি আমাকে আগুন থেকে সৃষ্টি করেছেন, আর তাকে সৃষ্টি করেছেন কাদামাটি থেকে’।",
    "তিনি বললেন, ‘সুতরাং তুমি এখান থেকে নেমে যাও। তোমার এ অধিকার নেই যে, এখানে তুমি অহঙ্কার করবে। সুতরাং বের হও। নিশ্চয় তুমি লাঞ্ছিতদের অন্তর্ভুক্ত’।",
    "সে বলল, ‘সেদিন পর্যন্ত আমাকে অবকাশ দিন, যেদিন তাদেরকে পুনরুজ্জীবিত করা হবে’।",
    "তিনি বললেন, ‘নিশ্চয় তুমি অবকাশপ্রাপ্তদের অন্তর্ভুক্ত’।",
    "সে বলল, ‘আপনি আমাকে পথভ্রষ্ট করেছেন, সে কারণে অবশ্যই আমি তাদের জন্য আপনার সোজা পথে বসে থাকব।",
    "‘তারপর অবশ্যই তাদের নিকট উপস্থিত হব, তাদের সামনে থেকে ও তাদের পেছন থেকে এবং তাদের ডান দিক থেকে ও তাদের বাম দিক থেকে। আর আপনি তাদের অধিকাংশকে কৃতজ্ঞ পাবেন না’।",
    "তিনি বললেন, ‘তুমি এখান থেকে বের হও লাঞ্ছিত বিতাড়িত অবস্থায়। অবশ্যই তাদের মধ্য থেকে যে তোমার অনুসরণ করবে, আমি তোমাদের সবাইকে দিয়ে জাহান্নাম ভরে দেবই’।",
    "‘আর হে আদম, তুমি ও তোমার স্ত্রী জান্নাতে বাস কর। অতঃপর তোমরা আহার কর যেখান থেকে চাও এবং এই গাছটির নিকটবর্তী হয়ো না। তাহলে তোমরা উভয়ে যালিমদের অন্তর্ভুক্ত হবে’।",
    "অতঃপর শয়তান তাদেরকে প্ররোচনা দিল, যাতে সে তাদের জন্য প্রকাশ করে দেয় তাদের লজ্জাস্থান, যা তাদের থেকে গোপন করা হয়েছিল এবং সে বলল, ‘তোমাদের রব তোমাদেরকে কেবল এ জন্য এ গাছ থেকে নিষেধ করেছেন যে, (খেলে) তোমরা ফেরেশতা হয়ে যাবে অথবা তোমরা চিরস্থায়ীদের অন্তর্ভুক্ত হয়ে যাবে’।",
    "আর সে তাদের নিকট শপথ করল যে, ‘নিশ্চয় আমি তোমাদের উভয়ের জন্য কল্যাণকামীদের একজন’।",
    "অতঃপর সে তাদেরকে প্রতারণার মাধ্যমে পদস্খলিত করল। তাই তারা যখন গাছটির ফল আস্বাদন করল, তাদের সামনে তাদের লজ্জাস্থান প্রকাশিত হয়ে গেল। আর তারা জান্নাতের পাতা দিয়ে নিজদেরকে ঢাকতে লাগল এবং তাদের রব তাদেরকে ডাকলেন যে, ‘আমি কি তোমাদেরকে ঐ গাছটি থেকে নিষেধ করিনি এবং তোমাদেরকে বলিনি যে নিশ্চয় শয়তান তোমাদের জন্য স্পষ্ট শত্রু’?",
    "তারা বলল, ‘হে আমাদের রব, আমরা নিজদের উপর যুলম করেছি। আর যদি আপনি আমাদেরকে ক্ষমা না করেন এবং আমাদেরকে দয়া না করেন তবে অবশ্যই আমরা ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হব’।",
    "তিনি বললেন, ‘তোমরা নেমে যাও। তোমরা একে অপরের শত্রু এবং যমীনে তোমাদের জন্য ক্ষণস্থায়ী আবাস ও ভোগ-উপকরণ রয়েছে’।",
    "তিনি বললেন, ‘তোমরা তাতে জীবন যাপন করবে এবং তাতে মারা যাবে। আর তা থেকে তোমাদেরকে বের করা হবে’।",
    "হে বনী আদম, আমি তো তোমাদের জন্য পোশাক অবতীর্ণ করেছি, যা তোমাদের লজ্জাস্থান ঢাকবে এবং যা সৌন্দর্যস্বরূপ। আর তাকওয়ার পোশাক, তা উত্তম। এগুলো আল্লাহর আয়াতসমূহের অন্তর্ভুক্ত। যাতে তারা উপদেশ গ্রহণ করে।",
    "হে বনী আদম, শয়তান যেন তোমাদেরকে বিভ্রান্ত না করে, যেভাবে সে তোমাদের পিতা-মাতাকে জান্নাত থেকে বের করেছিল; সে তাদের পোশাক টেনে নিচ্ছিল, যাতে সে তাদেরকে তাদের লজ্জাস্থান দেখাতে পারে। নিশ্চয় সে ও তার দলবল তোমাদেরকে দেখে যেখানে তোমরা তাদেরকে দেখ না। নিশ্চয় আমি শয়তানদেরকে তাদের জন্য অভিভাবক বানিয়েছি, যারা ঈমান গ্রহণ করে না।",
    "আর যখন তারা কোন অশ্লীল কাজ করে তখন বলে, ‘আমরা এতে আমাদের পিতৃপুরুষদেরকে পেয়েছি এবং আল্লাহ আমাদেরকে এর নির্দেশ দিয়েছেন’। বল, ‘নিশ্চয় আল্লাহ অশ্লীল কাজের নির্দেশ দেন না। তোমরা কি আল্লাহর ব্যাপারে এমন কিছু বলছ, যা তোমরা জান না’?",
    "বল, ‘আমার রব ন্যায়বিচারের নির্দেশ দিয়েছেন আর তোমরা প্রত্যেক সিজদার সময় তোমাদের চেহারা সোজা রাখবে এবং তাঁরই ইবাদাতের জন্য একনিষ্ঠ হয়ে তাঁকে ডাক’। যেভাবে তিনি তোমাদেরকে সৃষ্টি করেছেন, সেভাবে তোমরা প্রথমে ফিরে আসবে।",
    "এক দলকে তিনি হিদায়াত দিয়েছেন এবং আরেক দলের উপর পথভ্রষ্টতা সাব্যস্ত হয়েছে। নিশ্চয় তারা শয়তানদেরকে আল্লাহ ছাড়া অভিভাবকরূপে গ্রহণ করেছে। আর তারা মনে করে যে, নিশ্চয় তারা হিদায়াতপ্রাপ্ত।",
    "হে বনী আদম, তোমরা প্রতি সালাতে তোমাদের বেশ-ভূষা গ্রহণ কর এবং খাও, পান কর ও অপচয় করো না। নিশ্চয় তিনি অপচয়কারীদেরকে পছন্দ করেন না।",
    "বল, ‘কে হারাম করেছে আল্লাহর সৌন্দর্যোপকরণ, যা তিনি তাঁর বান্দাদের জন্য সৃষ্টি করেছেন এবং পবিত্র রিয্ক’? বল, ‘তা দুনিয়ার জীবনে মুমিনদের জন্য, বিশেষভাবে কিয়ামত দিবসে’। এভাবে আমি আয়াতসমূহ বিস্তারিত বর্ণনা করি এমন কওমের জন্য, যারা জানে।",
    "বল,‘আমার রব তো হারাম করেছেন অশ্লীল কাজ- যা প্রকাশ পায় এবং যা গোপন থাকে, আর পাপ ও অন্যায়ভাবে সীমালঙ্ঘন এবং আল্লাহর সাথে তোমাদের শরীক করা, যে ব্যাপারে আল্লাহ কোন প্রমাণ অবতীর্ণ করেননি এবং আল্লাহর উাপরে এমন কিছু বলা যা তোমরা জান না’।",
    "আর প্রত্যেক জাতির রয়েছে একটি নির্দিষ্ট সময়। অতঃপর যখন তাদের সময় আসবে, তখন তারা এক মুহূর্ত বিলম্ব করতে পারবে না এবং এগিয়েও আনতে পারবে না।",
    "হে বনী আদম, যদি তোমাদের নিকট তোমাদের মধ্য থেকে রাসূলগণ আসে যারা তোমাদের নিকট আমার আয়াতসমূহ বর্ণনা করবে, তবে যারা তাকওয়া অবলম্বন করবে এবং (আমল) সংশোধন করবে, তাদের উপর কোন ভয় নেই এবং তারা দুঃখিতও হবে না।",
    "আর যারা আমার আয়াতসমূহকে অস্বীকার করেছে এবং তার ব্যাপারে অহঙ্কার করেছে, তারাই আগুনের অধিবাসী। তারা সেখানে হবে স্থায়ী।",
    "সুতরাং তার চেয়ে কে অধিক যালিম, যে আল্লাহর উপর মিথ্যা অপবাদ রটায় কিংবা তাঁর আয়াতসমূহকে অস্বীকার করে। তাদের ভাগ্যে লিখিত অংশ তাদের কাছে পৌঁছবে। অবশেষে যখন আমার ফেরেশতারা তাদের নিকট আসবে তাদের জান কবজ করতে, তখন তারা বলবে, ‘কোথায় তারা, আল্লাহ ছাড়া যাদেরকে তোমরা ডাকতে’? তারা বলবে, ‘তারা আমাদের থেকে হারিয়ে গিয়েছে’ এবং তারা নিজদের বিরুদ্ধে সাক্ষ্য দেবে যে, নিশ্চয় তারা ছিল কাফির ।",
    "তিনি বলবেন, ‘আগুনে প্রবেশ কর জিন ও মানুষের দলগুলোর সাথে, যারা তোমাদের পূর্বে গত হয়েছে’। যখনই একটি দল প্রবেশ করবে, তখন পূর্বের দলকে তারা লা‘নত করবে। অবশেষে যখন তারা সবাই তাতে একত্রিত হবে তখন তাদের পরবর্তী দলটি পূর্বের দল সম্পর্কে বলবে, ‘হে আমাদের রব, এরা আমাদেরকে পথভ্রষ্ট করেছে। তাই আপনি তাদেরকে আগুনের দ্বিগুণ আযাব দিন’। তিনি বলবেন, ‘সবার জন্য দ্বিগুণ, কিন্তু তোমরা জান না’।",
    "আর তাদের পূর্ববর্তী দল পরবর্তী দলকে বলবে, ‘তাহলে আমাদের উপর তোমাদের কোন শ্রেষ্ঠত্ব নেই। অতএব তোমরা যা অর্জন করেছিলে, তার কারণে তোমরা আযাব আস্বাদন কর’।",
    "নিশ্চয় যারা আমার আয়াতসমূহকে অস্বীকার করেছে এবং তার ব্যাপারে অহঙ্কার করেছে, তাদের জন্য আসমানের দরজাসমূহ খোলা হবে না এবং তারা জান্নাতে প্রবেশ করবে না, যতক্ষণ না উট সূঁচের ছিদ্রতে প্রবেশ করে।* আর এভাবেই আমি অপরাধীদেরকে প্রতিদান দেই। \n* এ দ্বারা তাদের জান্নাতে প্রবেশ করা অসম্ভব বুঝানো হয়েছে।",
    "তাদের জন্য থাকবে জাহান্নামের বিছানা এবং তাদের উপরে থাকবে (আগুনের) আচ্ছাদন। আর এভাবেই আমি যালিমদেরকে প্রতিদান দেই।",
    "আর যারা ঈমান এনেছে ও সৎকাজ করেছে, আমি কোন ব্যক্তিকে তার সাধ্যের বাইরে দায়িত্ব অর্পণ করি না। তারাই জান্নাতের অধিবাসী। তারা সেখানে হবে স্থায়ী।",
    "আর তাদের অন্তরে যে ঈর্ষা ছিল, আমি তা বের করে নিয়েছি। তাদের নীচ দিয়ে নহরসমূহ প্রবাহিত হবে। আর তারা বলবে, ‘সমস্ত প্রশংসা আল্লাহর, যিনি এর জন্য আমাদেরকে হিদায়াত দিয়েছেন। আর আমরা হিদায়াত পাওয়ার ছিলাম না, যদি না আল্লাহ আমাদেরকে হিদায়াত দিতেন। অবশ্যই আমার রবের রাসূলগণ সত্য নিয়ে এসেছেন’ এবং তাদেরকে ডাকা হবে যে, ‘ঐ হল জান্নাত, তোমরা যা আমল করেছ, তার বিনিময়ে তোমাদেরকে এর ওয়ারিস করা হয়েছে’।",
    "আর তখন জান্নাতবাসীরা জাহান্নামবাসীদেরকে (উপহাস করে) বলবেঃ আমাদের রাব্ব যেসব অঙ্গীকার ও প্রতিশ্রুতি আমাদেরকে দিয়েছিলেন, আমরা বাস্তবে তা সত্য রূপে পেয়েছি, তোমরাও কি তোমাদের রাব্বের ও‘য়াদা সত্য ও বাস্তব রূপে পেয়েছো? তখন তারা বলবেঃ হ্যাঁ পেয়েছি। অতঃপর জনৈক ঘোষক ঘোষণা করবে, যালিমদের উপর আল্লাহর অভিসম্পাত।",
    "‘যারা আল্লাহর পথে বাধা প্রদান করত এবং তাতে বক্রতা সন্ধান করত এবং তারা ছিল আখিরাতকে অস্বীকারকারী’।",
    "আর তাদের মধ্যে থাকবে পর্দা এবং আ‘রাফের* উপর থাকবে কিছু লোক, যারা প্রত্যেককে তাদের চি‎‎হ্ন দ্বারা চিনবে। আর তারা জান্নাতের অধিবাসীদেরকে ডাকবে যে,‘তোমাদের উপর সালাম’। তারা (এখনো) তাতে প্রবেশ করেনি তবে তারা আশা করবে। \n* জান্নাত ও জাহান্নামের মধ্যবর্তী প্রাচীরকে আ‘রাফ বলে।",
    "আর যখন তাদের দৃষ্টিকে আগুনের অধিবাসীদের প্রতি ফেরানো হবে, তখন তারা বলবে, ‘হে আমাদের রব, আমাদেরকে যালিম কওমের অন্তর্ভুক্ত করবেন না’।",
    "আর আ‘রাফের অধিবাসীরা এমন লোকদেরকে ডাকবে, যাদেরকে তারা চিনবে তাদের চি‎‎হ্নর মাধ্যমে, তারা বলবে, ‘তোমাদের দল এবং যে বড়াই তোমরা করতে তা তোমাদের উপকারে আসেনি’।",
    "এরাই কি তারা যাদের ব্যাপারে তোমরা কসম করতে যে, আল্লাহ তাদেরকে রহমতে শামিল করবেন না? ‘তোমরা জান্নাতে প্রবেশ কর। তোমাদের উপর কোন ভয় নেই এবং তোমরা দুঃখিত হবে না’।",
    "আর আগুনের অধিবাসীরা জান্নাতের অধিবাসীদেরকে ডেকে বলবে, ‘আমাদের উপর কিছু পানি অথবা তোমাদেরকে আল্লাহ যে রিয্ক দিয়েছেন, তা ঢেলে দাও’। তারা বলবে, ‘নিশ্চয় আল্লাহ তা কাফিরদের উপর হারাম করেছেন’।",
    "‘যারা তাদের দীনকে গ্রহণ করেছে খেলা ও তামাশারূপে এবং তাদেরকে দুনিয়ার জীবন প্রতারিত করেছে’। সুতরাং আজ আমি তাদেরকে (জাহান্নামে) ছেড়ে রাখব*, যেমন তারা তাদের এ দিনের সাক্ষাতের জন্য কাজ করা ছেড়ে দিয়েছিল। আর (যেভাবে) তারা আমার আয়াতসমূহকে অস্বীকার করত। \n* نسيان শব্দটি দু’টি অর্থে ব্যবহৃত হয়। (১) ভুলে যাওয়া-এ অর্থটি আল্লাহর জন্য সঙ্গতিপূর্ণ নয়। (২) ছেড়ে দেয়া। এখানে দ্বিতীয় অর্থটি নেয়া হয়েছে।",
    "আর আমি তো তাদের নিকট এমন কিতাব নিয়ে এসেছি, যা আমি জ্ঞানের ভিত্তিতে বিস্তারিত বর্ণনা করেছি। তা হিদায়াত ও রহমতস্বরূপ এমন জাতির জন্য, যারা ঈমান রাখে।",
    "তারা কি শুধু তার পরিণামের অপেক্ষা করছে? যেদিন তার পরিণাম প্রকাশ হবে, তখন পূর্বে যারা তাকে ভুলে ছিল, তারা বলবে, ‘আমাদের রবের রাসূলগণ তো সত্য নিয়ে এসেছিলেন। সুতরাং আমাদের জন্য কি সুপারিশকারীদের কেউ আছে, যে আমাদের জন্য সুপারিশ করবে, কিংবা আমাদের প্রত্যাবর্তন করানো হবে, তারপর আমরা যা করতাম তা ভিন্ন অন্য আমল করব’? তারা তো নিজদেরকে ক্ষতিগ্রস্ত করেছে এবং তারা যে মিথ্যা রটাত, তা তাদের থেকে বিলুপ্ত হয়ে গিয়েছে।",
    "নিশ্চয় তোমাদের রব আসমানসমূহ ও যমীন ছয় দিনে সৃষ্টি করেছেন। অতঃপর আরশে উঠেছেন। তিনি রাতকে দ্বারা দিনকে ঢেকে দেন। প্রত্যেকটি একে অপরকে দ্রুত অনুসরণ করে। আর (সৃষ্টি করেছেন) সূর্য, চাঁদ ও তারকারাজী, যা তাঁর নির্দেশে নিয়োজিত। জেনে রাখ, সৃষ্টি ও নির্দেশ তাঁরই। আল্লাহ মহান, যিনি সকল সৃষ্টির রব।",
    "তোমরা তোমাদের রবকে ডাক অনুনয় বিনয় করে ও চুপিসারে। নিশ্চয় তিনি পছন্দ করেন না সীমালঙ্ঘনকারীদেরকে।",
    "আর তোমরা যমীনে ফাসাদ করো না তার সংশোধনের পর এবং তাঁকে ডাক ভয় ও আশা নিয়ে। নিশ্চয় আল্লাহর রহমত সৎকর্মশীলদের নিকটবর্তী।",
    "আর তিনিই তাঁর রহমতের পূর্বে সুসংবাদরূপে বাতাস প্রেরণ করেন। অবশেষে যখন তা ভারি মেঘ ধারণ করে, তখন আমি তাকে চালাই মৃত ভূমিতে, ফলে তার দ্বারা পানি অবতীর্ণ করি। অতঃপর তার মাধ্যমে বের করি প্রত্যেক প্রকারের ফল। এভাবেই আমি মৃতদেরকে বের করি, যাতে তোমরা উপদেশ গ্রহণ কর।",
    "আর উত্তম ভূমি- তার ফসল বের হয় তার রবের অনুমতিতে। আর যা নিকৃষ্ট, তাতে তো কমই উৎপন্ন হয়। এভাবেই আমি আয়াতসমূহ বিভিন্নভাবে বর্ণনা করি এমন কওমের জন্য, যারা কৃতজ্ঞ হয়।",
    "আমি তো নূহকে তার কওমের নিকট প্রেরণ করেছি। অতঃপর সে বলেছে, ‘হে আমার কওম, তোমরা আল্লাহর ইবাদাত কর। তিনি ছাড়া তোমাদের কোন (সত্য) ইলাহ নেই। নিশ্চয় আমি তোমাদের মহাদিনের আযাবের ভয় করছি’।",
    "তার কওম থেকে নেতৃবর্গ বলল, ‘নিশ্চয় আমরা তোমাকে স্পষ্ট ভ্রান্তিতে দেখতে পাচ্ছি’।",
    "সে বলল, ‘হে আমার কওম, আমার মধ্যে কোন ভ্রান্তি নেই; কিন্তু আমি সকল সৃষ্টির রবের পক্ষ থেকে রাসূল’।",
    "‘আমি তোমাদের নিকট পৌঁছাচ্ছি আমার রবের রিসালাতসমূহ এবং তোমাদের কল্যাণ কামনা করছি। আর আমি আল্লাহর কাছ থেকে এমন কিছু জানি, যা তোমরা জান না’।",
    "‘তোমরা কি আশ্চর্য হচ্ছো যে, তোমাদের রবের পক্ষ থেকে তোমাদের মধ্য থেকে এক ব্যক্তির নিকট উপদেশ এসেছে, যাতে সে তোমাদেরকে সতর্ক করে, আর যাতে তোমরা তাকওয়া অবলম্বন কর এবং যাতে তোমরা রহমতপ্রাপ্ত হও’?",
    "অতঃপর তারা তাকে মিথ্যাবাদী বলল। ফলে আমি তাকে ও তার সাথে নৌকায় যারা ছিল তাদেরকে রক্ষা করলাম; আর যারা আমার আয়াতসমূহকে অস্বীকার করেছিল তাদেরকে আমি ডুবিয়ে দিলাম। নিশ্চয় তারা ছিল অন্ধ কওম।",
    "আর (প্রেরণ করলাম) আদ জাতির নিকট তাদের ভাই হূদকে। সে বলল, ‘হে আমার কওম, তোমরা আল্লাহর ইবাদাত কর। তিনি ছাড়া তোমাদের কোন (সত্য) ইলাহ নেই। তোমরা কি তাকওয়া অবলম্বন করবে না’?",
    "তার কওমের কাফির নেতৃবৃন্দ বলল, ‘নিশ্চয় আমরা তোমাকে নির্বুদ্ধিতায় দেখতে পাচ্ছি এবং আমরা অবশ্যই তোমাকে মিথ্যাবাদীদের অন্তর্ভুক্ত মনে করি’।",
    "সে বলল, ‘হে আমার কওম, আমার মধ্যে কোন নির্বুদ্ধিতা নেই; কিন্তু আমি সকল সৃষ্টির রবের পক্ষ থেকে রাসূল’।",
    "‘আমি তোমাদের নিকট আমার রবের রিসালাতসমূহ পৌঁছাচ্ছি, আর আমি তোমাদের জন্য কল্যাণকামী বিশ্বস্ত’।",
    "‘তোমরা কি আশ্চর্য হচ্ছো যে, তোমাদের রবের পক্ষ থেকে তোমাদের মধ্য থেকে এক ব্যক্তির নিকট উপদেশ এসেছে, যাতে সে তোমাদেরকে সতর্ক করে? আর তোমরা স্মরণ কর, যখন তিনি তোমাদেরকে নূহের কওমের পর স্থলাভিষিক্ত করেছিলেন এবং সৃষ্টিতে তোমাদেরকে দৈহিক গঠন ও শক্তিতে সমৃদ্ধ করেছেন। সুতরাং তোমরা স্মরণ কর আল্লাহর নিআমতসমূহকে, যাতে তোমরা সফলকাম হও’।",
    "তারা বলল, ‘তুমি কি আমাদের নিকট এজন্য এসেছ যে, আমরা এক আল্লাহর ইবাদাত করি এবং ত্যাগ করি আমাদের পিতৃপুরুষগণ যার ইবাদাত করত? সুতরাং তুমি আমাদেরকে যে ওয়াদা দিচ্ছ, তা আমাদের কাছে নিয়ে এসো, যদি তুমি সত্যবাদী হও’।",
    "সে বলল, ‘নিশ্চয় তোমাদের উপর তোমাদের রবের পক্ষ থেকে আযাব ও ক্রোধ পতিত হয়েছে। তোমরা কি এমন নামসমূহের ব্যাপারে আমার সাথে বিবাদ করছ, যার নামকরণ করেছ তোমরা ও তোমাদের পিতৃপুরুষরা, যার ব্যাপারে আল্লাহ কোন প্রমাণ নাযিল করেননি? সুতরাং তোমরা অপেক্ষা কর। আমিও তোমাদের সাথে অপেক্ষা করছি’।",
    "অতঃপর আমি তাকে ও তার সাথে যারা ছিল, তাদেরকে আমার পক্ষ থেকে রহমত দ্বারা রক্ষা করেছি এবং তাদের মূল কেটে দিয়েছি, যারা আমার আয়াতসমূহ অস্বীকার করেছিল। আর তারা মুমিন ছিল না।",
    "আর সামূদের নিকট (প্রেরণ করেছি) তাদের ভাই সালিহকে। সে বলল, ‘হে আমার কওম, তোমরা আল্লাহর ইবাদাত কর। তিনি ছাড়া তোমাদের কোন (সত্য) ইলাহ নেই। নিশ্চয় তোমাদের নিকট তোমাদের রবের পক্ষ থেকে স্পষ্ট প্রমাণ এসেছে। এটি আল্লাহর উষ্ট্রী, তোমাদের জন্য নিদর্শনস্বরূপ। সুতরাং তোমরা তাকে ছেড়ে দাও, সে আল্লাহর যমীনে আহার করুক। আর তোমরা তাকে মন্দ দ্বারা স্পর্শ করো না। তাহলে তোমাদেরকে যন্ত্রণাদায়ক আযাব পাকড়াও করবে’।",
    "আর স্মরণ কর, যখন আদ জাতির পর তিনি তোমাদেরকে স্থলাভিষিক্ত করলেন এবং তোমাদেরকে যমীনে আবাস দিলেন। তোমরা তার সমতল ভূমিতে প্রাসাদ নির্মাণ করছ এবং পাহাড় কেটে বাড়ি বানাচ্ছ। সুতরাং তোমরা আল্লাহর নিআমতসমূহকে স্মরণ কর এবং যমীনে ফাসাদকারীরূপে ঘুরে বেড়িয়ো না।",
    "তার কওমের অহঙ্কারী নেতৃবৃন্দ তাদের সেই মুমিনদেরকে বলল যাদেরকে দুর্বল মনে করা হত, ‘তোমরা কি জান যে, সালিহ তার রবের পক্ষ থেকে প্রেরিত’? তারা বলল, ‘নিশ্চয় সে যা নিয়ে প্রেরিত হয়েছে, আমরা তাতে বিশ্বাসী’।",
    "যারা অহঙ্কার করেছিল তারা বলল, ‘নিশ্চয় তোমরা যার প্রতি ঈমান এনেছ, আমরা তার প্রতি অস্বীকারকারী’।",
    "অতঃপর তারা উষ্ট্রীকে যবেহ করল এবং তাদের রবের আদেশ অমান্য করল। আর তারা বলল, ‘হে সালিহ, তুমি আমাদেরকে যে ওয়াদা দিয়েছ, তা আমাদের কাছে নিয়ে এসো, যদি তুমি রাসূলদের অন্তর্ভুক্ত হয়ে থাক’।",
    "ফলে তাদেরকে ভূমিকম্প পাকড়াও করল, তাই সকালে তারা তাদের গৃহে উপুড় হয়ে মরে রইল।",
    "অতঃপর সে তাদের থেকে মুখ ফিরিয়ে নিল এবং বলল, ‘হে আমার কওম, আমি তো তোমাদের নিকট আমার রবের রিসালাত পৌঁছে দিয়েছি এবং তোমাদের জন্য কল্যাণ কামনা করেছি; কিন্তু তোমরা কল্যাণকামীদেরকে পছন্দ কর না’।",
    "আর (প্রেরণ করেছি) লূতকে। যখন সে তার কওমকে বলল, ‘তোমরা কি এমন অশ্লীল কাজ করছ, যা তোমাদের পূর্বে সৃষ্টিকুলের কেউ করেনি’?",
    "‘তোমরা তো নারীদের ছাড়া পুরুষদের সাথে কামনা পূর্ণ করছ, বরং তোমরা সীমালঙ্ঘনকারী কওম’।",
    "আর তার কওমের উত্তর কেবল এই ছিল যে, তারা বলল, ‘তাদেরকে তোমরা তোমাদের জনপদ থেকে বের করে দাও। নিশ্চয় তারা এমন লোক, যারা অতি পবিত্র হতে চায়’।",
    "তাই আমি তাকে ও তার পরিবারকে রক্ষা করলাম তার স্ত্রী ছাড়া। সে ছিল পেছনে থেকে যাওয়া লোকদের অন্তর্ভুক্ত।",
    "আর আমি তাদের উপর বর্ষণ করেছিলাম বৃষ্টি। সুতরাং দেখ, অপরাধীদের পরিণতি কিরূপ ছিল।",
    "আর মাদইয়ানে (প্রেরণ করেছিলাম) তাদের ভাই শু‘আইবকে। সে বলল, ‘হে আমার কওম, তোমরা আল্লাহর ইবাদাত কর। তিনি ছাড়া তোমাদের কোন (সত্য) ইলাহ নেই। তোমাদের রবের পক্ষ থেকে তোমাদের নিকট স্পষ্ট প্রমাণ এসেছে। সুতরাং তোমরা পরিমাণে ও ওজনে পরিপূর্ণ দাও এবং মানুষকে তাদের পণ্যে কম দেবে না; আর তোমরা যমীনে ফাসাদ করবে না তা সংশোধনের পর। এগুলো তোমাদের জন্য উত্তম যদি তোমরা মুমিন হও’।",
    "‘আর যারা তাঁর প্রতি ঈমান এনেছে তাদেরকে ভয় দেখাতে, আল্লাহর পথ থেকে বাধা দিতে এবং তাতে বক্রতা অনুসন্ধান করতে তোমরা প্রতিটি পথে বসে থেকো না’। আর স্মরণ কর, যখন তোমরা ছিলে কম, অতঃপর তিনি তোমাদেরকে অধিক করেছেন এবং দেখ, কিরূপ হয়েছে ফাসাদকারীদের পরিণতি।",
    "আমি যা নিয়ে প্রেরিত হয়েছি, তার প্রতি যদি তোমাদের একটি দল ঈমান আনে আর অন্য দল ঈমান না আনে, তাহলে ধৈর্যধারণ কর, যতক্ষণ না আল্লাহ আমাদের মধ্যে ফয়সালা করেন। আর তিনি উত্তম ফয়সালাকারী।",
    "তার কওম থেকে যে নেতৃবৃন্দ অহঙ্কার করেছিল তারা বলল, ‘হে শু‘আইব, আমরা তোমাকে ও তোমার সাথে যারা ঈমান এনেছে তাদেরকে অবশ্যই আমাদের জনপদ থেকে বের করে দেব অথবা তোমরা আমাদের ধর্মে ফিরে আসবে।’ সে বলল, ‘যদিও আমরা তা অপছন্দ করি তবুও?’",
    "আমরা তো আল্লাহর প্রতি মিথ্যারোপ করলাম যদি আমরা তোমাদের ধর্মে ফিরে যাই- সেই ধর্ম থেকে আল্লাহ আমাদেরকে নাজাত দেয়ার পর। আর আমাদের জন্য উচিত হবে না তাতে ফিরে যাওয়া। তবে আমাদের রব আল্লাহ চাইলে (সেটা ভিন্ন কথা)। আমাদের রব জ্ঞান দ্বারা সব কিছু পরিব্যাপ্ত করে আছেন। আল্লাহরই উপর আমরা তাওয়াক্কুল করি। হে আমাদের রব, আমাদের ও আমাদের কওমের মধ্যে যথার্থ ফয়সালা করে দিন। আর আপনি শ্রেষ্ঠ ফয়সালাকারী।",
    "আর তার কওম থেকে যে নেতৃবৃন্দ কুফরী করেছিল তারা বলল, ‘যদি তোমরা শু‘আইবকে অনুসরণ কর তাহলে নিশ্চয় তোমরা ক্ষতিগ্রস্ত হবে।’",
    "অতঃপর ভূমিকম্প তাদের পাকড়াও করল। তারপর তারা তাদের গৃহে উপুড় হয়ে মরে রইল।",
    "যারা শু‘আইবকে মিথ্যাবাদী বলেছিল, মনে হয় যেন তারা সেখানে বসবাসই করেনি। যারা শু‘আইবকে মিথ্যাবাদী বলেছিল তারাই ছিল ক্ষতিগ্রস্ত।",
    "অতঃপর সে তাদের থেকে মুখ ফিরিয়ে নিল এবং বলল, হে আমার কওম, আমি তো তোমাদের কাছে আমার রবের রিসালাতের দায়িত্ব পৌঁছে দিয়েছি এবং তোমাদের জন্য কল্যাণ কামনা করেছি। সুতরাং আমি কীভাবে কাফির জাতির ব্যাপারে দুঃখ করব!",
    "যে জনপদেই আমি নবী প্রেরণ করেছি, তার অধিবাসীকে আমি অর্থ-সংকট ও দুঃখ-কষ্ট দ্বারা পাকড়াও করেছি, যেন তারা অনুনয় বিনয় করে।",
    "তারপর আমি মন্দ অবস্থাকে ভাল অবস্থা দ্বারা বদলে দিয়েছি। অবশেষে তারা প্রাচুর্য লাভ করেছে এবং বলেছে, ‘আমাদের বাপ-দাদাদেরকেও দুর্দশা ও আনন্দ স্পর্শ করেছে।’ অতঃপর আমি তাদেরকে হঠাৎ পাকড়াও করেছি এমনভাবে যে, তারা উপলব্ধিও করতে পারেনি।",
    "আর যদি জনপদসমূহের অধিবাসীরা ঈমান আনত এবং তাকওয়া অবলম্বন করত তাহলে আমি অবশ্যই আসমান ও যমীন থেকে বরকতসমূহ তাদের উপর খুলে দিতাম; কিন্তু তারা অস্বীকার করল। অতঃপর তারা যা অর্জন করত তার কারণে আমি তাদেরকে পাকড়াও করলাম।",
    "জনপদগুলোর অধিবাসীরা কি রাতের বেলা তাদের কাছে আমার আযাব এসে যাওয়া থেকে নিরাপদ হয়ে গিয়েছে যখন তারা ঘুমিয়ে থাকবে?",
    "অথবা জনপদগুলোর অধিবাসীরা কি দ্বিপ্রহরে তাদের কাছে আমার আযাব এসে যাওয়া থেকে নিরাপদ হয়ে গিয়েছে যখন তারা খেলা-ধুলা করতে থাকবে?",
    "তারা কি আল্লাহর কৌশল থেকে নিরাপদ হয়ে গিয়েছে? বস্তুত ক্ষতিগ্রস্ত কওম ছাড়া আল্লাহর কৌশল থেকে আর কেউ (নিজদেরকে) নিরাপদ মনে করে না।",
    "যমীনের অধিবাসীদের (চলে যাবার) পর যারা তার উত্তরাধিকারী হয়, তাদের কাছে কি এ কথা পরিষ্কার হয়নি যে, আমি যদি চাই, তাদের পাপের কারণে তাদেরকে শাস্তি দিতে পারি? আর আমি মোহর মেরে দেই তাদের হৃদয়ে। অতঃপর তারা শোনে না।",
    "এ হল সে সব জনপদ, যার কিছু কাহিনী আমি তোমার কাছে বর্ণনা করছি। আর তাদের কাছে তো স্পষ্ট প্রমাণাদিসহ তাদের রাসূলগণ এসেছিল। কিন্তু যা তারা পূর্বে অস্বীকার করেছিল তার প্রতি তারা ঈমান আনার ছিল না। এমনিভাবে আল্লাহ কাফিরদের অন্তরে মোহর মেরে দেন।",
    "আর তাদের অধিকাংশ লোককে আমি অঙ্গীকার রক্ষাকারী পাইনি। বরং তাদের অধিকাংশকে আমি ফাসিক-ই পেয়েছি।",
    "অতঃপর তাদের পরে আমি মূসাকে আমার আয়াতসমূহ সহকারে ফির‘আউন ও তার সভাসদদের কাছে পাঠিয়েছি। অতঃপর তারা এর সাথে যুলম করেছে। সুতরাং লক্ষ্য কর, ফাসাদকারীদের পরিণাম কীরূপ হয়েছিল।",
    "মূসা বলল, ‘হে ফির‘আউন, আমি তো সকল সৃষ্টির রবের পক্ষ থেকে রাসূল।’",
    "সমীচীন যে, আমি আল্লাহ সম্পর্কে সত্য ছাড়া বলব না। আমি তোমাদের রবের নিকট থেকে স্পষ্ট প্রমাণ নিয়ে তোমাদের কাছে এসেছি। সুতরাং তুমি বনী ইসরাঈলকে আমার সাথে পাঠিয়ে দাও।’",
    "সে বলল, ‘তুমি যদি কোন আয়াত নিয়ে আস তবে তা পেশ কর, যদি তুমি সত্যবাদীদের অন্তর্ভুক্ত হও।’",
    "তখন সে ছেড়ে দিল তার লাঠি। তৎক্ষণাৎ তা এক স্পষ্ট অজগর হয়ে গেল।",
    "আর সে বের করল তার হাত, তৎক্ষণাৎ তা দর্শকদের কাছে ধবধবে সাদা (দেখাচ্ছিল)।",
    "ফির‘আউনের কওমের সভাসদরা বলল, ‘নিশ্চয় এ হল বিজ্ঞ যাদুকর।’",
    "‘সে তোমাদেরকে তোমাদের দেশ থেকে বের করতে চায়, সুতরাং তোমরা কী নির্দেশ দেবে?’",
    "তারা বলল, ‘আপনি তাকে ও তার ভাইকে সুযোগ দিন এবং শহরগুলোতে সংগ্রহকারী পাঠিয়ে দিন।’",
    "‘তারা আপনার কাছে সকল বিজ্ঞ যাদুকরকে নিয়ে আসবে।’",
    "আর যাদুকররা ফির‘আউনের কাছে আসল। তারা বলল, ‘নিশ্চয় আমাদের জন্য পারিশ্রমিক আছে, যদি আমরা বিজয়ী হই?’",
    "সে বলল, ‘হ্যাঁ, আর অবশ্যই তোমরা আমার ঘনিষ্ঠ লোকদের অন্তর্ভুক্ত হবে।’",
    "তারা বলল, ‘হে মূসা, হয় তুমি নিক্ষেপ করবে, নয়তো আমরাই নিক্ষেপ করব।’",
    "সে বলল, ‘তোমরা নিক্ষেপ কর।’ অতঃপর যখন তারা নিক্ষেপ করল তখন তারা লোকদের চোখে যাদু করল এবং তাদেরকে ভীত করে তুলল। তারা বড় যাদু প্রদর্শন করল।",
    "আর আমি মূসার প্রতি ওহী পাঠালাম যে, ‘তুমি তোমার লাঠি ছেড়ে দাও’ তৎক্ষণাৎ সে গিলতে লাগল সেগুলিকে যে অলীক বস্তু তারা বানিয়েছিল।",
    "ফলে সত্য প্রকাশ হয়ে গেল এবং তারা যা কিছু করছিল তা বাতিল হয়ে গেল।",
    "তাই সেখানে তারা পরাজিত হল এবং লাঞ্ছিত হয়ে গেল।",
    "আর যাদুকররা সিজদায় পড়ে গেল।",
    "তারা বলল, ‘আমরা সকল সৃষ্টির রবের প্রতি ঈমান আনলাম,",
    "মূসা ও হারূনের রবের প্রতি।’",
    "ফির‘আউন বলল, ‘আমি তোমাদেরকে অনুমতি দেয়ার আগে তোমরা তার প্রতি ঈমান আনলে! নিশ্চয় এটা এমন এক চক্রান্ত যা তোমরা শহরে করেছ সেখান থেকে তার অধিবাসীদেরকে বের করার জন্য। সুতরাং তোমরা অচিরেই জানতে পারবে।’",
    "আমি অবশ্যই তোমাদের হাত ও পা বিপরীত দিক থেকে কেটে দেব। তারপর অবশ্যই তোমাদের সবাইকে শূলে চড়াব।’",
    "তারা বলল, ‘নিশ্চয় আমরা আমাদের রবের কাছে প্রত্যাবর্তন করব।",
    "আর তুমি আমাদের থেকে প্রতিশোধ গ্রহণ করছ শুধু এ কারণে যে, আমরা আমাদের রবের আয়াতসমূহের প্রতি ঈমান এনেছি, যখন তা আমাদের কাছে এসেছে। হে আমাদের রব, আমাদেরকে পরিপূর্ণ ধৈর্য দান করুন এবং মুসলিম হিসাবে আমাদেরকে মৃত্যু দান করুন।’",
    "আর ফির‘আউনের কওমের সভাসদগণ বলল, ‘আপনি কি মূসা ও তার কওমকে ছেড়ে দেবেন যাতে তারা যমীনে ফাসাদ করে এবং আপনাকে ও আপনার উপাস্যগুলোকে বর্জন করে?’ সে বলল, ‘আমরা অতিসত্বর তাদের ছেলেদেরকে হত্যা করব আর মেয়েদেরকে জীবিত রাখব। আর নিশ্চয় আমরা তাদের উপর ক্ষমতাবান।’",
    "মূসা তার কওমকে বলল, ‘আল্লাহর কাছে সাহায্য চাও এবং ধৈর্য ধারণ কর। নিশ্চয় যমীন আল্লাহর। তাঁর বান্দাদের মধ্যে যাকে তিনি চান তাকে তার উত্তরাধিকারী বানিয়ে দেন। আর পরিণাম মুত্তাকীদের জন্য।’",
    "তারা বলল, ‘তুমি আমাদের কাছে আসার পূর্বে আমাদেরকে কষ্ট দেয়া হয়েছে এবং তুমি আমাদের কাছে আসার পরেও।’ সে বলল, ‘আশা করা যায়, তোমাদের রব তোমাদের শত্রুকে ধ্বংস করবেন এবং যমীনে তোমাদেরকে স্থলাভিষিক্ত করবেন, অতঃপর তিনি দেখবেন তোমরা কীভাবে আমল কর।’",
    "আর আমি পাকড়াও করেছি ফির‘আউনের অনুসারীদেরকে দুর্ভিক্ষ ও ফল- ফলাদির ক্ষয়-ক্ষতির মাধ্যমে, যাতে তারা উপদেশ গ্রহণ করে।",
    "অতঃপর যখন তাদের কাছে কল্যাণ আসত, তখন তারা বলত, ‘এটা আমাদের জন্য।’ আর যখন তাদের কাছে অকল্যাণ পৌঁছত তখন তারা মূসা ও তার সঙ্গীদেরকে অশুভলক্ষুণে মনে করত। তাদের কল্যাণ-অকল্যাণ তো আল্লাহর কাছে। কিন্তু তাদের অধিকাংশ জানে না।",
    "আর তারা বলল, ‘তুমি আমাদেরকে যাদু করার জন্য যে কোন নিদর্শন আমাদের কাছে নিয়ে আস না কেন আমরা তো তোমার প্রতি ঈমান আনব না।’",
    "সুতরাং আমি তাদের বিরুদ্ধে বিস্তারিত নিদর্শনাবলী হিসাবে পাঠালাম তুফান, পঙ্গপাল, উকুন, ব্যাঙ ও রক্ত। তার পরেও তারা অহঙ্কার করল। আর তারা ছিল এক অপরাধী কওম।",
    "আর যখন তাদের উপর আযাব পতিত হল তখন তারা বলল, ‘হে মূসা আমাদের জন্য তুমি তোমার রবের কাছে দুআ কর তিনি যে ওয়াদা তোমার সাথে করেছেন সে অনুযায়ী। যদি তুমি আমাদের উপর থেকে আযাব সরিয়ে দাও তাহলে অবশ্যই আমরা তোমার প্রতি ঈমান আনব এবং অবশ্যই তোমার সাথে বনী ইসরাঈলকে পাঠিয়ে দেব।’",
    "অতঃপর যখনই আমি তাদের থেকে আযাব সরিয়ে নিতাম কিছু কালের জন্য যা তাদের জন্য নির্ধারিত ছিল, তখনই তারা অঙ্গীকার ভঙ্গ করত।",
    "অতঃপর আমি তাদের থেকে প্রতিশোধ নিলাম, ফলে তাদেরকে সমুদ্রে ডুবিয়ে দিলাম। কারণ তারা আমার আয়াতসমূহকে অস্বীকার করেছে এবং এ সম্পর্কে তারা ছিল গাফেল ।",
    "আর যে জাতিকে দুর্বল মনে করা হত আমি তাদেরকে যমীনের পূর্ব ও তার পশ্চিমের উত্তরাধিকারী বানালাম, যেখানে আমি বরকত দিয়েছি এবং বনী ইসরাঈলের উপর তোমার রবের উত্তম বাণী পরিপূর্ণ হল। কারণ তারা ধৈর্য ধারণ করেছে। আর ধ্বংস করে দিলাম যা কিছু তৈরি করেছিল ফির‘আউন ও তার কওম এবং তারা যা নির্মাণ করেছিল।",
    "আর বনী ইসরাঈলকে আমি সমুদ্র পার করিয়ে দিলাম। অতঃপর তারা আসল এমন এক কওমের কাছে যারা নিজদের মূর্তিগুলোর পূজায় রত ছিল। তারা বলল, ‘হে মূসা, তাদের যেমন উপাস্য আছে আমাদের জন্য তেমনি উপাস্য নির্ধারণ করে দাও। সে বলল, ‘নিশ্চয় তোমরা এমন এক কওম যারা মূর্খ’।",
    "নিশ্চয় এরা যাতে আছে, তা ধ্বংসশীল এবং তারা যা করত তা বাতিল।",
    "সে বলল, ‘আল্লাহ ছাড়া আমি কি তোমাদের জন্য অন্য ইলাহ সন্ধান করব অথচ তিনি তোমাদেরকে সকল সৃষ্টির উপর শ্রেষ্ঠত্ব দিয়েছেন?’",
    "আর স্মরণ কর, যখন আমি ফির‘আউনের লোকদের থেকে তোমাদেরকে রক্ষা করলাম, যারা তোমাদের নিকৃষ্ট শাস্তি দিত। যারা তোমাদের ছেলেদের হত্যা করত এবং নারীদের জীবিত রাখত। এতে ছিল তোমাদের রবের পক্ষ থেকে এক মহাপরীক্ষা।",
    "আর স্মরণ কর, ‘আমি মূসাকে ত্রিশ রাতের ওয়াদা দিয়েছিলাম এবং আরো দশ দ্বারা তা পূর্ণ করেছিলাম। সুতরাং তার রবের নির্ধারিত মেয়াদ চলি¬শ রাত পূর্ণ হল এবং মূসা তার ভাই হারূনকে বলল, ‘আমার কওমের মধ্যে তুমি আমার প্রতিনিধিত্ব কর, সংশোধন কর এবং ফাসাদকারীদের পথ অনুসরণ করো না’।",
    "আর যখন আমার নির্ধারিত সময়ে মূসা এসে গেল এবং তার রব তার সাথে কথা বললেন। সে বলল, ‘হে আমার রব, আপনি আমাকে দেখা দিন, আমি আপনাকে দেখব।’ তিনি বললেন, তুমি আমাকে কখনো দেখবে না। বরং তুমি পাহাড়ের দিকে তাকাও, অতঃপর তা যদি নিজ স্থানে স্থির থাকে তবে তুমি অচিরেই আমাকে দেখবে। অতঃপর যখন তার রব পাহাড়ের উপর নূর প্রকাশ করলেন তখন তা তাকে চূর্ণ করে দিল এবং মূসা বেহুঁশ হয়ে পড়ে গেল। অতঃপর যখন তার হুঁশ আসল তখন সে বলল, ‘আপনি পবিত্র মহান, আমি আপনার নিকট তাওবা করলাম এবং আমি মুমিনদের মধ্যে প্রথম।’",
    "তিনি বললেন, ‘হে মূসা, আমি আমার রিসালাত ও বাক্যালাপ দ্বারা তোমাকে মানুষের উপর বেছে নিয়েছি। সুতরাং যা কিছু আমি তোমাকে প্রদান করলাম তা গ্রহণ কর এবং শোকর আদায়কারীদের অন্তর্ভুক্ত হও।’",
    "আর আমি তার জন্য ফলকসমূহে লিখে দিয়েছি প্রত্যেক বিষয়ের উপদেশ এবং প্রত্যেক বিষয়ের বিস্তারিত ব্যাখ্যা। সুতরাং তা শক্ত করে ধর এবং তোমার কওমকে নির্দেশ দাও, যেন তারা গ্রহণ করে এর উত্তম বিষয়গুলো। আমি অচিরেই তোমাদেরকে দেখাব ফাসিকদের আবাস।",
    "যারা অন্যায়ভাবে যমীনে অহঙ্কার করে আমার আয়াতসমূহ থেকে তাদেরকে আমি অবশ্যই ফিরিয়ে রাখব। আর তারা সকল আয়াত দেখলেও তাতে ঈমান আনবে না এবং তারা সঠিক পথ দেখলেও তাকে পথ হিসাবে গ্রহণ করবে না। আর তারা ভ্রান্ত পথ দেখলে তা পথ হিসাবে গ্রহণ করবে। এটা এ জন্য যে, তারা আমার আয়াতসমূহকে অস্বীকার করেছে এবং সে সম্পর্কে তারা ছিল গাফেল।",
    "আর যারা আমার আয়াতসমূহ ও আখিরাতের সাক্ষাতকে অস্বীকার করেছে তাদের কর্মসমূহ বিনষ্ট হয়ে গেছে। তারা যা করে তদনুযায়ী তাদের প্রতিদান দেয়া হবে।",
    "আর মূসার কওম তার (বের হওয়ার) পরে তাদের অলংকারাদি দিয়ে বানিয়ে নিল একটি গো বাছুর- দেহ, তার ছিল গরুর আওয়ায। তারা কি দেখল না যে, এটা তো তাদের সাথে কথা বলে না এবং তাদের পথ দেখায় না? তারা তাকে গ্রহণ করল এবং তারা ছিল যালিম।",
    "আর যখন তারা অনুতপ্ত হল এবং দেখল যে, তারা তো পথভ্রষ্ট হয়েছে, তখন তারা বলল, ‘যদি আমাদের রব আমাদের প্রতি রহম না করেন এবং আমাদেরকে ক্ষমা না করেন তবে অবশ্যই আমরা ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হব’।",
    "আর মূসা যখন নিজ কওমের কাছে ফিরে আসল রাগান্বিত বিক্ষুদ্ধ অবস্থায়, তখন বলল, ‘আমার পরে তোমরা আমার কত খারাপ প্রতিনিধিত্ব করেছ! তোমাদের রবের নির্দেশের পূর্বে তোমরা তাড়াহুড়া করলে?’ আর সে ফলকগুলো ফেলে দিল এবং স্বীয় ভাইয়ের মাথা ধরে নিজের দিকে টেনে আনতে লাগল। সে বলল, ‘হে আমার মায়ের পুত্র, এ জাতি আমাকে দুর্বল মনে করেছে এবং আমাকে হত্যা করতে উদ্যত হয়েছে, তাই তুমি আমার ব্যাপারে শত্রুদেরকে আনন্দিত করো না এবং আমাকে যালিম কওমের অন্তর্ভুক্ত করো না।",
    "সে বলল, ‘আমার রব, ক্ষমা করুন আমাকে ও আমার ভাইকে এবং আপনার রহমতে আমাদের প্রবেশ করান। আর আপনিই রহমকারীদের মধ্যে শ্রেষ্ঠ।",
    "নিশ্চয় যারা গো বাছুরকে (উপাস্য হিসাবে) গ্রহণ করেছে, দুনিয়ার জীবনে তাদেরকে আক্রান্ত করবে তাদের রবের পক্ষ থেকে গযব ও লাঞ্ছনা। আর এভাবে আমি মিথ্যা রটনাকারীদের প্রতিফল দেই।",
    "আর যারা খারাপ কাজ করল, তারপর তাওবা করল এবং ঈমান আনল, নিশ্চয় তোমার রব এরপরও ক্ষমাশীল, পরম দয়ালু।",
    "আর যখন মূসার ক্রোধ থেমে গেল তখন সে ফলকগুলো তুলে নিল। তার লেখাতে ছিল হিদায়াত ও রহমত, তাদের জন্য যারা নিজদের রবকেই ভয় করে।",
    "আর মূসা নিজ কওম থেকে সত্তর জন লোককে আমার নির্ধারিত স্থানের জন্য নির্বাচন করল। অতঃপর যখন ভূমিকম্প তাদেরকে পাকড়াও করল তখন সে বলল, ‘হে আমার রব, আপনি চাইলে ইতঃপূর্বে এদের ধ্বংস করতে পারতেন এবং আমাকেও। আমাদের মধ্যে নির্বোধরা যা করেছে তার কারণে কি আমাদেরকে ধ্বংস করবেন? এটাতো আপনার পরীক্ষা ছাড়া কিছু না। এর মাধ্যমে যাকে চান আপনি পথভ্রষ্ট করেন এবং যাকে চান হিদায়াত দান করেন। আপনি আমাদের অভিভাবক। সুতরাং আমাদের ক্ষমা করে দিন এবং আপনি উত্তম ক্ষমাশীল।",
    "আর আমাদের জন্য এ দুনিয়াতে ও আখিরাতে কল্যাণ লিখে দিন। নিশ্চয় আমরা আপনার দিকে প্রত্যাবর্তন করেছি।’ তিনি বললেন, ‘আমি যাকে চাই তাকে আমার আযাব দেই। আর আমার রহমত সব বস্তুকে পরিব্যাপ্ত করেছে। সুতরাং আমি তা লিখে দেব তাদের জন্য যারা তাকওয়া অবলম্বন করে এবং যাকাত প্রদান করে। আর যারা আমার আয়াতসমূহের প্রতি ঈমান আনে।",
    "যারা অনুসরণ করে রাসূলের, যে উম্মী নবী; যার গুণাবলী তারা নিজদের কাছে তাওরাত ও ইঞ্জিলে লিখিত পায়, যে তাদেরকে সৎ কাজের আদেশ দেয় ও বারণ করে অসৎ কাজ থেকে এবং তাদের জন্য পবিত্র বস্তু হালাল করে আর অপবিত্র বস্তু হারাম করে। আর তাদের থেকে বোঝা ও শৃংখল- যা তাদের উপরে ছিল- অপসারণ করে। সুতরাং যারা তার প্রতি ঈমান আনে, তাকে সম্মান করে, তাকে সাহায্য করে এবং তার সাথে যে নূর নাযিল করা হয়েছে তা অনুসরণ করে তারাই সফলকাম।",
    "বল, ‘হে মানুষ, আমি তোমাদের সবার প্রতি আল্লাহর রাসূল, যার রয়েছে আসমানসমূহ ও যমীনের রাজত্ব। তিনি ছাড়া কোন (সত্য) ইলাহ নেই। তিনি জীবন দান করেন ও মৃত্যু দেন। সুতরাং তোমরা আল্লাহর প্রতি ঈমান আন ও তাঁর প্রেরিত উম্মী নবীর প্রতি, যে আল্লাহ ও তাঁর বাণীসমূহের প্রতি ঈমান রাখে। আর তোমরা তার অনুসরণ কর, আশা করা যায়, তোমরা হিদায়াত লাভ করবে।",
    "মূসার কওম থেকে এমন এক দল রয়েছে যারা সঠিকভাবে পথ প্রদর্শন করে এবং তা দ্বারা ইনসাফ করে।",
    "আর আমি তাদেরকে বিভক্ত করেছি বারোটি জাতি-গোত্রে। আমি মূসার কাছে ওহী পাঠালাম- যখন তার কওম তার কাছে পানি চাইল- যে, ‘তুমি তোমার লাঠি দিয়ে পাথরে আঘাত কর’। ফলে এ থেকে উৎসারিত হল বারোটি ঝর্ণা। প্রত্যেক গোত্র চিনে নিল নিজদের পানস্থান। আর আমি তাদের উপর মেঘের ছায়া দিয়েছিলাম এবং তাদের উপর নাযিল করেছিলাম মান্না* ও সালওয়া** । ‘তোমাদেরকে যে রিযিক দিয়েছি তা থেকে পবিত্র বস্তু আহার কর’। আর তারা আমার প্রতি যুলম করেনি, বরং তারা নিজদের উপরই যুলম করত। \n* মান্না’ এক ধরণের সুস্বাদু খাবার, যা শিশিরের মত গাছের পাতায় ও ঘাসের উপর জমে থাকত। আল্লাহ বিশেষভাবে তা বনী ইসরাঈলের জন্য প্রেরণ করেছিলেন।",
    "আর স্মরণ কর, যখন তাদেরকে বলা হল, ‘তোমরা এ জনপদে* বসবাস কর এবং যেখানে চাও সেখান থেকে আহার কর এবং বল ‘হিত্তাহ’** । আর অবনত মস্তকে দরজায় প্রবেশ কর। আমি তোমাদের অপরাধগুলো ক্ষমা করে দেব। অবশ্যই আমি সৎকর্মশীলদেরকে বাড়িয়ে দেব।’ \n* বাইতুল মুকাদ্দাস অঞ্চল।",
    "অতঃপর তাদের মধ্য থেকে যারা যুলম করেছিল, তাদেরকে যা বলা হয়েছিল তার পরিবর্তে তারা অন্য কথা বলল। ফলে আমি আসমান থেকে তাদের উপর শাস্তি পাঠালাম, কারণ তারা যুলম করত।",
    "আর তাদের কাছে জিজ্ঞেস কর সাগরের নিকটে অবস্থিত জনপদটি* সম্পর্কে, যখন তারা শনিবারে সীমালংঘন করত। যখন তাদের কাছে শনিবারে তাদের মাছগুলো ভেসে আসত। আর যেদিন তারা শনিবার যাপন করত না, সেদিন তাদের কাছে আসত না। এভাবে আমি তাদেরকে পরীক্ষা করতাম। কারণ তারা পাপাচার করত। \n* লোহিত সাগর তীরবর্তী ‘আয়লা’ নামক জনপদ।",
    "আর স্মরণ কর, যখন তাদের একদল বলল, ‘তোমরা কেন উপদেশ দিচ্ছ এমন কওমকে, যাদেরকে আল্লাহ ধ্বংস করবেন অথবা কঠিন আযাব দেবেন’? তারা বলল, ‘তোমাদের রবের নিকট ওযর পেশ করার উদ্দেশ্যে। আশা করা যায় তারা সাবধান হবে’।",
    "অতঃপর যে উপদেশ তাদেরকে দেয়া হয়েছিল, যখন তারা তা ভুলে গেল তখন আমি মুক্তি দিলাম তাদেরকে যারা মন্দ হতে নিষেধ করে। আর যারা যুলম করেছে তাদেরকে কঠিন আযাব দ্বারা পাকড়াও করলাম। কারণ, তারা পাপাচার করত।",
    "অতঃপর যা থেকে তাদেরকে নিষেধ করা হয়েছিল তারা যখন সে বিষয়ে সীমালঙ্ঘন করল, তখন আমি তাদেরকে বললাম, ‘তোমরা নিকৃষ্ট বানর হয়ে যাও’।",
    "আর যখন তোমার রব ঘোষণা দিলেন, অবশ্যই তিনি তাদের উপর কিয়ামতের দিন পর্যন্ত এমন লোকদেরকে পাঠাবেন, যারা তাদেরকে আস্বাদন করাবে নিকৃষ্ট আযাব। নিশ্চয় তোমার রব আযাব প্রদানে খুব দ্রুত এবং নিশ্চয় তিনি ক্ষমাশীল, পরম দয়ালু।",
    "আর যমীনে আমি তাদেরকে বিভক্ত করেছি বিভিন্ন জাতিতে। তাদের কেউ নেককার আর কেউ অন্যরূপ এবং আমি তাদেরকে পরীক্ষা করেছি ভাল ও মন্দ দ্বারা, হয়তো তারা ফিরে আসবে।",
    "অতঃপর তাদের পরে স্থলাভিষিক্ত হয়েছে এমন বংশধর যারা কিতাবের উত্তরাধিকারী হয়েছে, তারা এ নগণ্য (দুনিয়ার) সামগ্রী গ্রহণ করে এবং বলে, ‘শীঘ্রই আমাদের ক্ষমা করে দেয়া হবে’। বস্তুত যদি তার অনুরূপ সামগ্রী (আবারও) তাদের নিকট আসে তবে তারা তা গ্রহণ করবে। তাদের কাছ থেকে কি কিতাবের অঙ্গীকার নেয়া হয়নি যে, তারা আল্লাহর ব্যাপারে সত্য ছাড়া বলবে না? আর তারা এতে যা আছে, তা পাঠ করেছে এবং আখিরাতের আবাস তাদের জন্য উত্তম, যারা তাকওয়া অবলম্বন করে। তোমরা কি বুঝ না?",
    "আর যারা কিতাবকে দৃঢ়ভাবে আঁকড়ে ধরে এবং সালাত কায়েম করে, নিশ্চয় আমি সৎকর্মশীলদের প্রতিদান বিনষ্ট’ করি না।",
    "আর স্মরণ কর, যখন আমি তাদের উপর পাহাড় তুলে ধরলাম, যেন তা একখন্ড মেঘ এবং তারা মনে করল যে, নিশ্চয় তা তাদের উপর পড়বে। ‘আমি তোমাদের যা দিয়েছি, তা শক্তভাবে ধর এবং তাতে যা আছে তা স্মরণ কর, যেন তোমরা তাকওয়া অবলম্বন করতে পার।’",
    "আর স্মরণ কর, যখন তোমার রব বনী-আদমের পৃষ্ঠদেশ হতে তাদের বংশধরকে বের করলেন এবং তাদেরকে তাদের নিজদের উপর সাক্ষী করলেন যে, ‘আমি কি তোমাদের রব নই’? তারা বলল, ‘হ্যাঁ, আমরা সাক্ষ্য দিলাম।’ যাতে কিয়ামতের দিন তোমরা বলতে না পার যে, নিশ্চয় আমরা এ বিষয়ে অনবহিত ছিলাম।",
    "অথবা তোমরা যাতে বলতে না পার, ‘আমাদের পিতৃ-পুরুষরাই পূর্বে শির্ক করেছে, আর আমরা ছিলাম তাদের পরবর্তী বংশধর। সুতরাং বাতিলপন্থিরা যা করেছে, তার কারণে আপনি কি আমাদেরকে ধ্বংস করবেন’?",
    "আর এভাবেই আমি আয়াতসমূহ বিস্তারিত বর্ণনা করি, যাতে তারা ফিরে আসে।",
    "আর তুমি তাদের উপর সে ব্যক্তির সংবাদ পাঠ কর, যাকে আমি আমার আয়াতসমূহ দিয়েছিলাম। অতঃপর সে তা হতে বিচ্ছিন্ন হয়ে গিয়েছিল এবং শয়তান তার পেছনে লেগেছিল। ফলে সে বিপথগামীদের অন্তর্ভুক্ত হয়ে গিয়েছিল।",
    "আর আমি ইচ্ছা করলে উক্ত নিদর্শনাবলীর মাধ্যমে তাকে অবশ্যই উচ্চ মর্যাদা দিতাম, কিন্তু সে পৃথিবীর প্রতি ঝুঁকে পড়েছে এবং নিজ প্রবৃত্তির অনুসরণ করেছে। সুতরাং তার দৃষ্টান্ত হচ্ছে কুকুরের মত। যদি তার উপর বোঝা চাপিয়ে দাও তাহলে সে জিহবা বের করে হাঁপাবে অথবা যদি তাকে ছেড়ে দাও তাহলেও সে জিহবা বের করে হাঁপাবে। এটি হচ্ছে সে কওমের দৃষ্টান্ত যারা আমার আয়াতসমূহকে অস্বীকার করেছে। অতএব তুমি কাহিনী বর্ণনা কর, যাতে তারা চিন্তা করে।",
    "উপমা হিসাবে খুবই মন্দ সে কওম যারা আমার আয়াতসমূহকে অস্বীকার করেছে এবং তারা নিজদের প্রতিই যুলম করত।",
    "যাকে আল্লাহ হিদায়াত করেন সে-ই হিদায়াতপ্রাপ্ত আর যাদেরকে তিনি পথভ্রষ্ট করেন তারাই ক্ষতিগ্রস্ত।",
    "আর অবশ্যই আমি সৃষ্টি করেছি জাহান্নামের জন্য বহু জিন ও মানুষকে। তাদের রয়েছে অন্তর, তা দ্বারা তারা বুঝে না; তাদের রয়েছে চোখ, তা দ্বারা তারা দেখে না এবং তাদের রয়েছে কান, তা দ্বারা তারা শুনে না। তারা চতুষ্পদ জন্তুর মত; বরং তারা অধিক পথভ্রষ্ট। তারাই হচ্ছে গাফেল।",
    "আর আল্লাহর জন্যই রয়েছে সুন্দরতম নামসমূহ। সুতরাং তোমরা তাঁকে সেসব নামেই ডাক। আর তাদেরকে বর্জন কর যারা তাঁর নামে বিকৃতি ঘটায়। তারা যা করত অচিরেই তাদেরকে তার প্রতিফল দেয়া হবে।",
    "আর যাদেরকে আমি সৃষ্টি করেছি তাদের মধ্যে এমন একদল আছে যারা যথাযথভাবে পথ দেখায় এবং তদ্বারা ইনসাফ করে।",
    "আর যারা আমার আয়াতসমূহকে অস্বীকার করেছে, অচিরেই আমি তাদেরকে ধীরে ধীরে এমনভাবে পাকড়াও করব যে, তারা জানতেও পারবে না।",
    "আর আমি তাদেরকে অবকাশ দিচ্ছি। নিশ্চয় আমার কৌশল শক্তিশালী।",
    "তারা কি চিন্তা করেনি যে, তাদের সঙ্গীর মধ্যে কোন মস্তিষ্ক বিকৃতি নেই; সে তো স্পষ্ট সতর্ককারী।",
    "তারা কি দৃষ্টিপাত করেনি আসমানসমূহ ও যমীনের রাজত্বে এবং আল্লাহ যা কিছু সৃষ্টি করেছেন তার প্রতি? আর (এর প্রতি যে) হয়তো তাদের নির্দিষ্ট সময় নিকটে এসে গিয়েছে? সুতরাং তারা এরপর আর কোন্ কথার প্রতি ঈমান আনবে?",
    "আল্লাহ যাকে পথভ্রষ্ট করেন তার কোন হিদায়াতকারী নেই এবং তিনি তাদেরকে তাদের অবাধ্যতায় ছেড়ে দেন, তারা দিশেহারা হয়ে ঘুরে বেড়ায়।",
    "তারা তোমাকে কিয়ামত সম্পর্কে প্রশ্ন করে, ‘তা কখন ঘটবে’? তুমি বল, ‘এর জ্ঞান তো রয়েছে আমার রবের নিকট। তিনিই এর নির্ধারিত সময়ে তা প্রকাশ করবেন। আসমানসমূহ ও যমীনের উপর তা (কিয়ামত) কঠিন হবে। তা তোমাদের নিকট হঠাৎ এসে পড়বে। তারা তোমাকে প্রশ্ন করছে যেন তুমি এ সম্পর্কে বিশেষভাবে অবহিত। বল, ‘এ বিষয়ের জ্ঞান কেবল আল্লাহর নিকট আছে। কিন্তু অধিকাংশ মানুষ জানে না’।",
    "বল, ‘আমি আমার নিজের কোন উপকার ও ক্ষতির ক্ষমতা রাখি না, তবে আল্লাহ যা চান। আর আমি যদি গায়েব জানতাম তাহলে অধিক কল্যাণ লাভ করতাম এবং আমাকে কোন ক্ষতি স্পর্শ করত না। আমিতো একজন সতর্ককারী ও সুসংবাদদাতা এমন কওমের জন্য, যারা বিশ্বাস করে’।",
    "তিনিই সে সত্তা যিনি তোমাদেরকে সৃষ্টি করেছেন এক ব্যক্তি থেকে এবং তার থেকে বানিয়েছেন তার সঙ্গিনীকে, যাতে সে তার নিকট প্রশান্তি লাভ করে। অতঃপর যখন সে তার সঙ্গিনীর সাথে মিলিত হল, তখন সে হালকা গর্ভ ধারণ করল এবং তা নিয়ে চলাফেরা করতে থাকল। অতঃপর যখন সে ভারী হল, তখন উভয়ে তাদের রব আল্লাহকে ডাকল, ‘যদি আপনি আমাদেরকে সুসন্তান দান করেন তবে অবশ্যই আমরা কৃতজ্ঞদের অন্তর্ভুক্ত হব’।",
    "অতঃপর যখন তিনি তাদেরকে এক সুসন্তান দান করলেন, তখন তাদেরকে তিনি যা প্রদান করেছেন সে বিষয়ে তারা তাঁর বহু শরীক নির্ধারণ করল। বস্তুত তারা যাদের শরীক করে তাদের থেকে আল্লাহ অনেক ঊর্ধ্বে।",
    "তারা কি এমন কিছুকে শরীক করে, যারা কোন কিছু সৃষ্টি করে না, বরং তাদেরকেই সৃষ্টি করা হয়?",
    "আর তারা তাদেরকে কোন সাহায্য করতে পারে না এবং তারা নিজদেরকেও সাহায্য করতে পারে না।",
    "আর তোমরা যদি তাদেরকে হিদায়াতের দিকে আহবান কর, তারা তোমাদের অনুসরণ করবে না। তোমরা তাদেরকে ডাক অথবা তোমরা চুপ থাক, তা তোমাদের নিকট সমান।",
    "আল্লাহ ছাড়া যাদেরকে তোমরা ডাক তারা তোমাদের মত বান্দা। সুতরাং তোমরা তাদেরকে ডাক। অতঃপর তারা যেন তোমাদের ডাকে সাড়া দেয়, যদি তোমরা সত্যবাদী হও।",
    "তাদের কি পা আছে যার সাহায্যে তারা চলে? বা তাদের কি হাত আছে যা দ্বারা তারা ধরে? বা তাদের কি চক্ষু আছে যার মাধ্যমে তারা দেখে? অথবা তাদের কি কান আছে যা দ্বারা তারা শুনে? বল, ‘তোমরা তোমাদের শরীকদের ডাক। তারপর আমার বিরুদ্ধে ষড়যন্ত্র কর এবং আমাকে অবকাশ দিয়ো না’।",
    "‘নিশ্চয় আমার অভিভাবক আল্লাহ, যিনি কিতাব নাযিল করেছেন। আর তিনি নেককারদের দেখাশোনা করেন’।",
    "আর তাঁকে ছাড়া তোমরা যাদেরকে ডাক তারা তোমাদেরকে সাহায্য করতে পারে না এবং তারা নিজদেরকেও সাহায্য করতে পারে না।",
    "তুমি যদি তাদেরকে হিদায়াতের দিকে আহবান কর, তারা শুনবে না। আর তুমি তাদেরকে দেখবে যে, তারা তোমার দিকে তাকিয়ে আছে, অথচ তারা দেখছে না।",
    "তুমি ক্ষমা প্রদর্শন কর এবং ভালো কাজের আদেশ দাও। আর মূর্খদের থেকে বিমুখ থাক।",
    "আর যদি শয়তানের পক্ষ হতে কোন প্ররোচনা তোমাকে প্ররোচিত করে, তবে তুমি আল্লাহর আশ্রয় চাও। নিশ্চয় তিনি সর্বশ্রোতা, সর্বজ্ঞ।",
    "নিশ্চয় যারা তাকওয়া অবলম্বন করেছে যখন তাদেরকে শয়তানের পক্ষ থেকে কোন কুমন্ত্রণা স্পর্শ করে তখন তারা আল্লাহকে স্মরণ করে। তখনই তাদের দৃষ্টি খুলে যায়।",
    "আর শয়তানের ভাইয়েরা ভ্রষ্টতায় তাদেরকে সহযোগিতা করে। অতঃপর তারা ত্রুটি করে না।",
    "আর যখন তুমি তাদের নিকট কোন আয়াত নিয়ে না আস, তখন তারা বলে, ‘তুমি কেন নিজেই তা বানিয়ে নাও না?’ বল, ‘আমিতো তারই অনুসরণ করি, যা আমার কাছে আমার রবের পক্ষ থেকে ওহীরূপে প্রেরণ করা হয়। এটি তোমাদের রবের পক্ষ থেকে স্পষ্ট প্রমাণ। আর তা হিদায়াত ও রহমত সে কওমের জন্য যারা ঈমান আনে’।",
    "আর যখন কুরআন পাঠ করা হয়, তখন তা মনোযোগ দিয়ে শোন এবং চুপ থাক, যাতে তোমরা রহমত লাভ কর।",
    "আর তুমি নিজ মনে আপন রবকে স্মরণ কর সকাল-সন্ধ্যায় অনুনয়-বিনয় ও ভীতি সহকারে এবং অনুচ্চ স্বরে। আর গাফেলদের অন্তর্ভুক্ত হয়ো না।",
    "নিশ্চয় যারা তোমার রবের নিকট আছে তারা তাঁর ইবাদাতের ব্যাপারে অহঙ্কার করে না এবং তার তাসবীহ পাঠ করে, আর তাঁর জন্যই সিজদা করে।[সাজদাহ]"
  ]
}