{
  "surahName": "Al-Mujaadila",
  "surahNameArabic": "المجادلة",
  "surahNameArabicLong": "سورة المجادلة",
  "surahNameTranslation": "The Pleading Woman",
  "revelationPlace": "Madina",
  "totalAyah": 22,
  "surahNo": 58,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/58.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/058.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/58.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/058.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/58.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/058.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/58.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/058.mp3"
    }
  },
  "english": [
    "Indeed, Allah has heard the argument of the woman who pleaded with you ˹O Prophet˺ concerning her husband, and appealed to Allah. Allah has heard your exchange. Surely Allah is All-Hearing, All-Seeing.",
    "Those of you who ˹sinfully˺ divorce their wives by comparing them to their mothers ˹should know that˺ their wives are in no way their mothers. None can be their mothers except those who gave birth to them. What they say is certainly detestable and false. Yet Allah is truly Ever-Pardoning, All-Forgiving.",
    "Those who divorce their wives in this manner, then ˹wish to˺ retract what they said, must free a slave before they touch each other. This ˹penalty˺ is meant to deter you. And Allah is All-Aware of what you do.",
    "But if the husband cannot afford this, let him then fast two consecutive months before the couple touch each other. But if he is unable ˹to fast˺, then let him feed sixty poor people. This is to re-affirm your faith in Allah and His Messenger. These are the limits set by Allah. And the disbelievers will suffer a painful punishment.",
    "Indeed, those who defy Allah and His Messenger will be debased, just like those before them. We have certainly sent down clear revelations. And the disbelievers will suffer a humiliating punishment.",
    "On the Day Allah resurrects them all together, He will then inform them of what they have done. Allah has kept account of it all, while they have forgotten it. For Allah is a Witness over all things.",
    "Do you not see that Allah knows whatever is in the heavens and whatever is on the earth? If three converse privately, He is their fourth. If five, He is their sixth. Whether fewer or more, He is with them wherever they may be. Then, on the Day of Judgment, He will inform them of what they have done. Surely Allah has ˹perfect˺ knowledge of all things.",
    "Have you not seen those who were forbidden from secret talks, yet they ˹always˺ return to what they were forbidden from, conspiring in sin, aggression, and disobedience to the Messenger? And when they come to you ˹O Prophet˺, they greet you not as Allah greets you, and say to one another, “Why does Allah not punish us for what we say?” Hell is enough for them—they will burn in it. And what an evil destination!",
    "O believers! When you converse privately, let it not be for sin, aggression, or disobedience to the Messenger, but let it be for goodness and righteousness. And fear Allah, to Whom you will ˹all˺ be gathered.",
    "Secret talks are only inspired by Satan to grieve the believers. Yet he cannot harm them whatsoever except by Allah’s Will. So in Allah let the believers put their trust.",
    "O believers! When you are told to make room in gatherings, then do so. Allah will make room for you ˹in His grace˺. And if you are told to rise, then do so. Allah will elevate those of you who are faithful, and ˹raise˺ those gifted with knowledge in rank. And Allah is All-Aware of what you do.",
    "O believers! When you consult the Messenger privately, give something in charity before your consultation. That is better and purer for you. But if you lack the means, then Allah is truly All-Forgiving, Most Merciful.",
    "Are you afraid of spending in charity before your private consultations ˹with him˺? Since you are unable to do so, and Allah has turned to you in mercy, then ˹continue to˺ establish prayer, pay alms-tax, and obey Allah and His Messenger. And Allah is All-Aware of what you do.",
    "Have you not seen those ˹hypocrites˺ who ally themselves with a people with whom Allah is displeased? They are neither with you nor with them. And they swear to lies knowingly.",
    "Allah has prepared for them a severe punishment. Evil indeed is what they do.",
    "They have made their ˹false˺ oaths as a shield, hindering ˹others˺ from the cause of Allah. So they will suffer a humiliating punishment.",
    "Neither their wealth nor children will be of any help to them against Allah whatsoever. It is they who will be the residents of the Fire. They will be there forever.",
    "On the Day Allah resurrects them all, they will ˹falsely˺ swear to Him as they swear to you, thinking they have something to stand on. Indeed, it is they who are the ˹total˺ liars.",
    "Satan has taken hold of them, causing them to forget the remembrance of Allah. They are the party of Satan. Surely Satan’s party is bound to lose.",
    "˹As for˺ those who defy Allah and His Messenger, they will definitely be among the most debased.",
    "Allah has decreed, “I and My messengers will certainly prevail.” Surely Allah is All-Powerful, Almighty.",
    "You will never find a people who ˹truly˺ believe in Allah and the Last Day loyal to those who defy Allah and His Messenger, even if they were their parents, children, siblings, or extended family. For those ˹believers˺, Allah has instilled faith in their hearts and strengthened them with a spirit from Him. He will admit them into Gardens under which rivers flow, to stay there forever. Allah is pleased with them and they are pleased with Him. They are the party of Allah. Indeed, Allah’s party is bound to succeed."
  ],
  "arabic1": [
    "قَدْ سَمِعَ اللّٰهُ قَوْلَ الَّتِیْ تُجَادِلُكَ فِیْ زَوْجِهَا وَتَشْتَكِیْۤ اِلَی اللّٰهِ ۖ وَاللّٰهُ یَسْمَعُ تَحَاوُرَكُمَا اِنَّ اللّٰهَ سَمِیْعٌ بَصِیْرٌ",
    "اَلَّذِیْنَ یُظٰهِرُوْنَ مِنْكُمْ مِّنْ نِّسَآىِٕهِمْ مَّا هُنَّ اُمَّهٰتِهِمْ اِنْ اُمَّهٰتُهُمْ اِلَّا الّٰٓـِٔیْ وَلَدْنَهُمْ وَاِنَّهُمْ لَیَقُوْلُوْنَ مُنْكَرًا مِّنَ الْقَوْلِ وَزُوْرًا وَاِنَّ اللّٰهَ لَعَفُوٌّ غَفُوْرٌ",
    "وَالَّذِیْنَ یُظٰهِرُوْنَ مِنْ نِّسَآىِٕهِمْ ثُمَّ یَعُوْدُوْنَ لِمَا قَالُوْا فَتَحْرِیْرُ رَقَبَةٍ مِّنْ قَبْلِ اَنْ یَّتَمَآسَّا ذٰلِكُمْ تُوْعَظُوْنَ بِهٖ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِیْرٌ",
    "فَمَنْ لَّمْ یَجِدْ فَصِیَامُ شَهْرَیْنِ مُتَتَابِعَیْنِ مِنْ قَبْلِ اَنْ یَّتَمَآسَّا فَمَنْ لَّمْ یَسْتَطِعْ فَاِطْعَامُ سِتِّیْنَ مِسْكِیْنًا ذٰلِكَ لِتُؤْمِنُوْا بِاللّٰهِ وَرَسُوْلِهٖ وَتِلْكَ حُدُوْدُ اللّٰهِ وَلِلْكٰفِرِیْنَ عَذَابٌ اَلِیْمٌ",
    "اِنَّ الَّذِیْنَ یُحَآدُّوْنَ اللّٰهَ وَرَسُوْلَهٗ كُبِتُوْا كَمَا كُبِتَ الَّذِیْنَ مِنْ قَبْلِهِمْ وَقَدْ اَنْزَلْنَاۤ اٰیٰتٍۢ بَیِّنٰتٍ وَلِلْكٰفِرِیْنَ عَذَابٌ مُّهِیْنٌ",
    "یَوْمَ یَبْعَثُهُمُ اللّٰهُ جَمِیْعًا فَیُنَبِّئُهُمْ بِمَا عَمِلُوْا اَحْصٰىهُ اللّٰهُ وَنَسُوْهُ وَاللّٰهُ عَلٰی كُلِّ شَیْءٍ شَهِیْدٌ",
    "اَلَمْ تَرَ اَنَّ اللّٰهَ یَعْلَمُ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ مَا یَكُوْنُ مِنْ نَّجْوٰی ثَلٰثَةٍ اِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ اِلَّا هُوَ سَادِسُهُمْ وَلَاۤ اَدْنٰی مِنْ ذٰلِكَ وَلَاۤ اَكْثَرَ اِلَّا هُوَ مَعَهُمْ اَیْنَ مَا كَانُوْا ثُمَّ یُنَبِّئُهُمْ بِمَا عَمِلُوْا یَوْمَ الْقِیٰمَةِ اِنَّ اللّٰهَ بِكُلِّ شَیْءٍ عَلِیْمٌ",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ نُهُوْا عَنِ النَّجْوٰی ثُمَّ یَعُوْدُوْنَ لِمَا نُهُوْا عَنْهُ وَیَتَنٰجَوْنَ بِالْاِثْمِ وَالْعُدْوَانِ وَمَعْصِیَتِ الرَّسُوْلِ وَاِذَا جَآءُوْكَ حَیَّوْكَ بِمَا لَمْ یُحَیِّكَ بِهِ اللّٰهُ وَیَقُوْلُوْنَ فِیْۤ اَنْفُسِهِمْ لَوْلَا یُعَذِّبُنَا اللّٰهُ بِمَا نَقُوْلُ حَسْبُهُمْ جَهَنَّمُ یَصْلَوْنَهَا فَبِئْسَ الْمَصِیْرُ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اِذَا تَنَاجَیْتُمْ فَلَا تَتَنَاجَوْا بِالْاِثْمِ وَالْعُدْوَانِ وَمَعْصِیَتِ الرَّسُوْلِ وَتَنَاجَوْا بِالْبِرِّ وَالتَّقْوٰی وَاتَّقُوا اللّٰهَ الَّذِیْۤ اِلَیْهِ تُحْشَرُوْنَ",
    "اِنَّمَا النَّجْوٰی مِنَ الشَّیْطٰنِ لِیَحْزُنَ الَّذِیْنَ اٰمَنُوْا وَلَیْسَ بِضَآرِّهِمْ شَیْـًٔا اِلَّا بِاِذْنِ اللّٰهِ وَعَلَی اللّٰهِ فَلْیَتَوَكَّلِ الْمُؤْمِنُوْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اِذَا قِیْلَ لَكُمْ تَفَسَّحُوْا فِی الْمَجٰلِسِ فَافْسَحُوْا یَفْسَحِ اللّٰهُ لَكُمْ وَاِذَا قِیْلَ انْشُزُوْا فَانْشُزُوْا یَرْفَعِ اللّٰهُ الَّذِیْنَ اٰمَنُوْا مِنْكُمْ وَالَّذِیْنَ اُوْتُوا الْعِلْمَ دَرَجٰتٍ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِیْرٌ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اِذَا نَاجَیْتُمُ الرَّسُوْلَ فَقَدِّمُوْا بَیْنَ یَدَیْ نَجْوٰىكُمْ صَدَقَةً ذٰلِكَ خَیْرٌ لَّكُمْ وَاَطْهَرُ فَاِنْ لَّمْ تَجِدُوْا فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِیْمٌ",
    "ءَاَشْفَقْتُمْ اَنْ تُقَدِّمُوْا بَیْنَ یَدَیْ نَجْوٰىكُمْ صَدَقٰتٍ فَاِذْ لَمْ تَفْعَلُوْا وَتَابَ اللّٰهُ عَلَیْكُمْ فَاَقِیْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاَطِیْعُوا اللّٰهَ وَرَسُوْلَهٗ وَاللّٰهُ خَبِیْرٌ بِمَا تَعْمَلُوْنَ",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ تَوَلَّوْا قَوْمًا غَضِبَ اللّٰهُ عَلَیْهِمْ مَا هُمْ مِّنْكُمْ وَلَا مِنْهُمْ وَیَحْلِفُوْنَ عَلَی الْكَذِبِ وَهُمْ یَعْلَمُوْنَ",
    "اَعَدَّ اللّٰهُ لَهُمْ عَذَابًا شَدِیْدًا اِنَّهُمْ سَآءَ مَا كَانُوْا یَعْمَلُوْنَ",
    "اِتَّخَذُوْۤا اَیْمَانَهُمْ جُنَّةً فَصَدُّوْا عَنْ سَبِیْلِ اللّٰهِ فَلَهُمْ عَذَابٌ مُّهِیْنٌ",
    "لَنْ تُغْنِیَ عَنْهُمْ اَمْوَالُهُمْ وَلَاۤ اَوْلَادُهُمْ مِّنَ اللّٰهِ شَیْـًٔا اُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "یَوْمَ یَبْعَثُهُمُ اللّٰهُ جَمِیْعًا فَیَحْلِفُوْنَ لَهٗ كَمَا یَحْلِفُوْنَ لَكُمْ وَیَحْسَبُوْنَ اَنَّهُمْ عَلٰی شَیْءٍ اَلَاۤ اِنَّهُمْ هُمُ الْكٰذِبُوْنَ",
    "اِسْتَحْوَذَ عَلَیْهِمُ الشَّیْطٰنُ فَاَنْسٰىهُمْ ذِكْرَ اللّٰهِ اُولٰٓىِٕكَ حِزْبُ الشَّیْطٰنِ اَلَاۤ اِنَّ حِزْبَ الشَّیْطٰنِ هُمُ الْخٰسِرُوْنَ",
    "اِنَّ الَّذِیْنَ یُحَآدُّوْنَ اللّٰهَ وَرَسُوْلَهٗۤ اُولٰٓىِٕكَ فِی الْاَذَلِّیْنَ",
    "كَتَبَ اللّٰهُ لَاَغْلِبَنَّ اَنَا وَرُسُلِیْ اِنَّ اللّٰهَ قَوِیٌّ عَزِیْزٌ",
    "لَا تَجِدُ قَوْمًا یُّؤْمِنُوْنَ بِاللّٰهِ وَالْیَوْمِ الْاٰخِرِ یُوَآدُّوْنَ مَنْ حَآدَّ اللّٰهَ وَرَسُوْلَهٗ وَلَوْ كَانُوْۤا اٰبَآءَهُمْ اَوْ اَبْنَآءَهُمْ اَوْ اِخْوَانَهُمْ اَوْ عَشِیْرَتَهُمْ اُولٰٓىِٕكَ كَتَبَ فِیْ قُلُوْبِهِمُ الْاِیْمَانَ وَاَیَّدَهُمْ بِرُوْحٍ مِّنْهُ وَیُدْخِلُهُمْ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِیْنَ فِیْهَا رَضِیَ اللّٰهُ عَنْهُمْ وَرَضُوْا عَنْهُ اُولٰٓىِٕكَ حِزْبُ اللّٰهِ اَلَاۤ اِنَّ حِزْبَ اللّٰهِ هُمُ الْمُفْلِحُوْنَ"
  ],
  "bengali": [
    "আল্লাহ অবশ্যই সে রমনীর কথা শুনেছেন যে তার স্বামীর ব্যাপারে তোমার সাথে বাদানুবাদ করছিল আর আল্লাহর কাছে ফরিয়াদ করছিল। আল্লাহ তোমাদের কথোপকথন শোনেন। নিশ্চয় আল্লাহ সর্বশ্রোতা, সর্বদ্রষ্টা।",
    "তোমাদের মধ্যে যারা তাদের স্ত্রীদের সাথে যিহার* করে, তাদের স্ত্রীগণ তাদের মাতা নয়। তাদের মাতা তো কেবল তারাই যারা তাদেরকে জন্ম দিয়েছে। আর তারা অবশ্যই অসঙ্গত ও অসত্য কথা বলে। আর নিশ্চয় আল্লাহ অধিক পাপ মোচনকারী, বড়ই ক্ষমাশীল। \n* স্ত্রীকে মায়ের সাথে অথবা মায়ের কোন অংগের সাথে তুলনা করাকে ‘যিহার’ বলে। প্রাচীন আরব সমাজে স্ত্রীকে মায়ের সাথে তুলনা করার মাধ্যমে বৈবাহিক সম্পর্ক ছিন্ন করা হত। ইসলামে এর মাধ্যমে সরাসরি বৈবাহিক সম্পর্ক ছিন্ন হয় না। তবে অসঙ্গত কথা বলার কারণে কাফ্ফারা দিতে হয়।",
    "আর যারা তাদের স্ত্রীদের সাথে ‘যিহার’ করে অতঃপর তারা যা বলেছে তা থেকে ফিরে আসে, তবে একে অপরকে স্পর্শ করার পূর্বে একটি দাস মুক্ত করবে। এর মাধ্যমে তোমাদেরকে উপদেশ দেয়া হচ্ছে। আর তোমরা যা কর, সে সম্পর্কে আল্লাহ সম্যক অবহিত।",
    "কিন্তু যে তা পাবে না, সে লাগাতার দু’মাস সিয়াম পালন করবে, একে অপরকে স্পর্শ করার পূর্বে। আর যে (এরূপ করার) সামর্থ্য রাখে না সে ষাটজন মিসকীনকে খাবার খাওয়াবে। এ বিধান এ জন্য যে, তোমরা যাতে আল্লাহ ও তাঁর রাসূলের প্রতি ঈমান আন। আর এগুলো আল্লাহর (নির্ধারিত) সীমা এবং কাফিরদের জন্য রয়েছে যন্ত্রণাদায়ক আযাব।",
    "যারা আল্লাহ ও তাঁর রাসূলের বিরোধিতা করে তাদেরকে অপদস্থ করা হবে যেভাবে অপদস্থ করা হয়েছিল তাদের পূর্ববর্তীদেরকে। আর আমি নাযিল করেছি সুস্পষ্ট প্রমাণাদি। আর কাফিরদের জন্য রয়েছে অপমানজনক আযাব।",
    "যে দিন আল্লাহ তাদের সকলকে পুনরুজ্জীবিত করে উঠাবেন অতঃপর তারা যে আমল করেছিল তা তাদেরকে জানিয়ে দেবেন। আল্লাহ তা হিসাব করে রেখেছেন যদিও তারা তা ভুলে গেছে। আর আল্লাহ প্রত্যেক বিষয়ে প্রত্যক্ষদর্শী।",
    "তুমি কি লক্ষ্য করনি যে, আসমানসমূহ ও যমীনে যা কিছু আছে নিশ্চয় আল্লাহ তা জানেন? তিন জনের কোন গোপন পরামর্শ হয় না যাতে চতুর্থজন হিসেবে আল্লাহ থাকেন না, আর পাঁচ জনেরও হয় না, যাতে ষষ্ঠজন হিসেবে তিনি থাকেন না। এর চেয়ে কম হোক কিংবা বেশি হোক, তিনি তো তাদের সঙ্গেই আছেন, তারা যেখানেই থাকুক না কেন। তারপর কিয়ামতের দিন তিনি তাদেরকে তাদের কৃতকর্ম সম্পর্কে জানিয়ে দেবেন। নিশ্চয় আল্লাহ সব বিষয়ে সম্যক অবগত।",
    "তুমি কি তাদের প্রতি লক্ষ্য করনি, যাদেরকে গোপন পরামর্শ করতে নিষেধ করা হয়েছিল? তারপরও তারা তারই পুনরাবৃত্তি করল যা করতে তাদেরকে নিষেধ করা হয়েছিল। আর তারা পাপাচার, সীমালঙ্ঘন ও রাসূলের বিরুদ্ধাচরণের জন্য গোপন পরামর্শ করে। আর তারা যখন তোমার কাছে আসে তখন তারা তোমাকে এমন (কথার দ্বারা) অভিবাদন জানায় যেভাবে আল্লাহ তোমাকে অভিবাদন করেননি। আর তারা মনে মনে বলে, ‘আমরা যা বলি তার জন্য আল্লাহ আমাদেরকে শাস্তি দেন না কেন? তাদের জন্য জাহান্নামই যথেষ্ট। তারা তাতে প্রবেশ করবে। আর তা কতইনা নিকৃষ্ট গন্তব্যস্থল!",
    "হে মুমিনগণ, তোমরা যখন গোপনে পরামর্শ করবে তখন তোমরা যেন গুনাহ, সীমালঙ্ঘন ও রাসূলের বিরুদ্ধাচরণের ব্যাপারে গোপন পরামর্শ না কর। আর তোমরা সৎকর্ম ও তাকওয়ার বিষয়ে গোপন পরামর্শ কর। তোমরা আল্লাহকে ভয় কর, যাঁর কাছে তোমাদেরকে সমবেত করা হবে।",
    "গোপন পরামর্শ তো হল মুমিনরা যাতে দুঃখ পায় সে উদ্দেশ্যে কৃত শয়তানের কুমন্ত্রণা মাত্র। আর আল্লাহর অনুমতি ছাড়া সে তাদের কিছুই ক্ষতি করতে পারে না। অতএব আল্লাহরই ওপর মুমিনরা যেন তাওয়াক্কুল করে।",
    "হে মুমিনগণ, তোমাদেরকে যখন বলা হয়, ‘মজলিসে স্থান করে দাও’, তখন তোমরা স্থান করে দেবে। আল্লাহ তোমাদের জন্য স্থান করে দেবেন। আর যখন তোমাদেরকে বলা হয়, ‘তোমরা উঠে যাও’, তখন তোমরা উঠে যাবে। তোমাদের মধ্যে যারা ঈমান এনেছে এবং যাদেরকে জ্ঞান দান করা হয়েছে আল্লাহ তাদেরকে মর্যাদায় সমুন্নত করবেন। আর তোমরা যা কর আল্লাহ সে সম্পর্কে সম্যক অবহিত।",
    "হে মুমিনগণ, তোমরা যখন রাসূলের সাথে একান্তে কথা বলতে চাও, তখন তোমাদের এরূপ কথার পূর্বে কিছু সদাকা পেশ কর। এটি তোমাদের জন্য শ্রেয়তর ও পবিত্রতর; কিন্তু যদি তোমরা সক্ষম না হও তবে আল্লাহ পরম ক্ষমাশীল, অতিশয় দয়ালু।",
    "তোমরা কি ভয় পেয়ে গেলে যে, একান্ত পরামর্শের পূর্বে সদাকা পেশ করবে? হ্যাঁ, যখন তোমরা তা করতে পারলে না, আর আল্লাহও তোমাদের ক্ষমা করে দিলেন, তখন তোমরা সালাত কায়েম কর, যাকাত দাও এবং আল্লাহ ও তাঁর রাসূলের আনুগত্য কর। তোমরা যা কর, আল্লাহ সে সম্পর্কে সম্যক অবগত।",
    "তুমি কি তাদের লক্ষ্য করনি, যারা এমন এক কওমের সাথে বন্ধুত্ব করে যাদের উপর আল্লাহর গযব নিপতিত হয়েছে? তারা তোমাদের দলভুক্ত নয় এবং তোমরাও তাদের দলভুক্ত নও। আর তারা জেনে শুনেই মিথ্যার উপর কসম করে।",
    "আল্লাহ তাদের জন্য কঠোর আযাব প্রস্তুত করে রেখেছেন। নিশ্চয় তারা যা করত তা কতইনা মন্দ!",
    "তারা তাদের কসমগুলোকে ঢাল হিসেবে নিয়েছে। অতঃপর তারা আল্লাহর পথে বাধা প্রদান করেছে। ফলে তাদের জন্য রয়েছে লাঞ্ছনাদায়ক আযাব।",
    "আল্লাহর বিপরীতে তাদের ধন-সম্পদ ও সন্তান-সন্ততি তাদের আদৌ কোন কাজে আসবে না। এরাই জাহান্নামের অধিবাসী। তারা সেখানে স্থায়ী হবে।",
    "সেদিন আল্লাহ তাদের সকলকে পুনরুত্থিত করবেন, তখন তারা আল্লাহর নিকট এমন কসম করবে যেমন কসম তোমাদের নিকট করে থাকে এবং তারা মনে করে যে, তারা কোন কিছুর উপর আছে। জেনে রাখ, নিশ্চয় এরা মিথ্যাবাদী।",
    "শয়তান এদের ওপর চেপে বসেছে এবং তাদেরকে আল্লাহর যিকির ভুলিয়ে দিয়েছে। এরাই শয়তানের দল। জেনে রাখ, নিশ্চয় শয়তানের দল ক্ষতিগ্রস্ত।",
    "নিশ্চয় যারা আল্লাহ ও তাঁর রাসূলের বিরোধিতা করে তারা চরম লাঞ্ছিতদের অন্তর্ভুক্ত।",
    "আল্লাহ লিখে দিয়েছেন যে, ‘আমি ও আমার রাসূলগণ অবশ্যই বিজয়ী হব।’ নিশ্চয় আল্লাহ মহা শক্তিমান, মহা পরাক্রমশালী।",
    "তুমি পাবে না এমন জাতিকে যারা আল্লাহ ও পরকালের প্রতি ঈমান আনে, বন্ধুত্ব করে তার সাথে যে আল্লাহ ও তাঁর রাসূলের বিরোধীতা করে, যদিও তারা তাদের পিতা, অথবা পুত্র, অথবা ভাই, অথবা জ্ঞাতি-গোষ্ঠী হয়। এরাই, যাদের অন্তরে আল্লাহ ঈমান লিখে দিয়েছেন এবং তাঁর পক্ষ থেকে রূহ দ্বারা তাদের শক্তিশালী করেছেন। তিনি তাদের প্রবেশ করাবেন এমন জান্নাতসমূহে যার নিচে দিয়ে ঝর্ণাধারাসমূহ প্রবাহিত হয়। সেখানে তারা স্থায়ী হবে। আল্লাহ তাদের প্রতি সন্তুষ্ট হয়েছেন এবং তারাও আল্লাহর প্রতি সন্তুষ্ট হয়েছে। এরাই আল্লাহর দল। জেনে রাখ, নিশ্চয় আল্লাহর দলই সফলকাম।"
  ]
}