{
  "surahName": "An-Noor",
  "surahNameArabic": "النور",
  "surahNameArabicLong": "سورة النور",
  "surahNameTranslation": "The Light",
  "revelationPlace": "Madina",
  "totalAyah": 64,
  "surahNo": 24,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/24.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/024.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/24.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/024.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/24.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/024.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/24.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/024.mp3"
    }
  },
  "english": [
    "˹This is˺ a sûrah which We have revealed and made ˹its rulings˺ obligatory, and revealed in it clear commandments so that you may be mindful.",
    "As for female and male fornicators, give each of them one hundred lashes, and do not let pity for them make you lenient in ˹enforcing˺ the law of Allah, if you ˹truly˺ believe in Allah and the Last Day. And let a number of believers witness their punishment.",
    "A male fornicator would only marry a female fornicator or idolatress. And a female fornicator would only be married to a fornicator or idolater. This is ˹all˺ forbidden to the believers.",
    "Those who accuse chaste women ˹of adultery˺ and fail to produce four witnesses, give them eighty lashes ˹each˺. And do not ever accept any testimony from them—for they are indeed the rebellious—",
    "except those who repent afterwards and mend their ways, then surely Allah is All-Forgiving, Most Merciful.",
    "And those who accuse their wives ˹of adultery˺ but have no witness except themselves, the accuser must testify, swearing four times by Allah that he is telling the truth",
    "and a fifth oath that Allah may condemn him if he is lying.",
    "For her to be spared the punishment, she must swear four times by Allah that he is telling a lie",
    "and a fifth oath that Allah may be displeased with her if he is telling the truth.",
    "˹You would have suffered,˺ had it not been for Allah’s grace and mercy upon you, and had Allah not been Accepting of Repentance, All-Wise.",
    "Indeed, those who came up with that ˹outrageous˺ slander are a group of you. Do not think this is bad for you. Rather, it is good for you. They will be punished, each according to their share of the sin. As for their mastermind, he will suffer a tremendous punishment.",
    "If only the believing men and women had thought well of one another, when you heard this ˹rumour˺, and said, “This is clearly ˹an outrageous˺ slander!”",
    "Why did they not produce four witnesses? Now, since they have failed to produce witnesses, they are ˹truly˺ liars in the sight of Allah.",
    "Had it not been for Allah’s grace and mercy upon you in this world and the Hereafter, you would have certainly been touched with a tremendous punishment for what you plunged into—",
    "when you passed it from one tongue to the other, and said with your mouths what you had no knowledge of, taking it lightly while it is ˹extremely˺ serious in the sight of Allah.",
    "If only you had said upon hearing it, “How can we speak about such a thing! Glory be to You ˹O Lord˺! This is a heinous slander!”",
    "Allah forbids you from ever doing something like this again, if you are ˹true˺ believers.",
    "And Allah makes ˹His˺ commandments clear to you, for Allah is All-Knowing, All-Wise.",
    "Indeed, those who love to see indecency spread among the believers will suffer a painful punishment in this life and the Hereafter. Allah knows and you do not know.",
    "˹You would have suffered,˺ had it not been for Allah’s grace and mercy upon you, and had Allah not been Ever Gracious, Most Merciful.",
    "O believers! Do not follow the footsteps of Satan. Whoever follows Satan’s footsteps, then ˹let them know that˺ he surely bids ˹all to˺ immorality and wickedness. Had it not been for Allah’s grace and mercy upon you, none of you would have ever been purified. But Allah purifies whoever He wills. And Allah is All-Hearing, All-Knowing.",
    "Do not let the people of virtue and affluence among you swear to suspend donations to their relatives, the needy, and the emigrants in the cause of Allah. Let them pardon and forgive. Do you not love to be forgiven by Allah? And Allah is All-Forgiving, Most Merciful.",
    "Surely those who accuse chaste, unsuspecting, believing women are cursed in this life and the Hereafter. And they will suffer a tremendous punishment",
    "on the Day their tongues, hands, and feet will testify against them for what they used to do.",
    "On that Day, Allah will give them their just penalty in full, and they will ˹come to˺ know that Allah ˹alone˺ is the Ultimate Truth.",
    "Wicked women are for wicked men, and wicked men are for wicked women. And virtuous women are for virtuous men, and virtuous men are for virtuous women. The virtuous are innocent of what the wicked say. They will have forgiveness and an honourable provision.",
    "O believers! Do not enter any house other than your own until you have asked for permission and greeted its occupants. This is best for you, so perhaps you will be mindful.",
    "If you find no one at home, do not enter it until you have been given permission. And if you are asked to leave, then leave. That is purer for you. And Allah has ˹perfect˺ knowledge of what you do.",
    "There is no blame on you if you enter public places where there is something of benefit for you. And Allah knows what you reveal and what you conceal.",
    "˹O Prophet!˺ Tell the believing men to lower their gaze and guard their chastity. That is purer for them. Surely Allah is All-Aware of what they do.",
    "And tell the believing women to lower their gaze and guard their chastity, and not to reveal their adornments except what normally appears. Let them draw their veils over their chests, and not reveal their ˹hidden˺ adornments except to their husbands, their fathers, their fathers-in-law, their sons, their stepsons, their brothers, their brothers’ sons or sisters’ sons, their fellow women, those ˹bondwomen˺ in their possession, male attendants with no desire, or children who are still unaware of women’s nakedness. Let them not stomp their feet, drawing attention to their hidden adornments. Turn to Allah in repentance all together, O  believers, so that you may be successful.",
    "Marry off the ˹free˺ singles among you, as well as the righteous of your bondmen and bondwomen. If they are poor, Allah will enrich them out of His bounty. For Allah is All-Bountiful, All-Knowing.",
    "And let those who do not have the means to marry keep themselves chaste until Allah enriches them out of His bounty. And if any of those ˹bondspeople˺ in your possession desires a deed of emancipation, make it possible for them, if you find goodness in them. And give them some of Allah’s wealth which He has granted you. Do not force your ˹slave˺ girls into prostitution for your own worldly gains while they wish to remain chaste. And if someone coerces them, then after such a coercion Allah is certainly All-Forgiving, Most Merciful ˹to them˺.",
    "Indeed, We have sent down to you clear revelations, along with examples of those who had gone before you, and a lesson to the God-fearing.",
    "Allah is the Light of the heavens and the earth. His light is like a niche in which there is a lamp, the lamp is in a crystal, the crystal is like a shining star, lit from ˹the oil of˺ a blessed olive tree, ˹located˺ neither to the east nor the west, whose oil would almost glow, even without being touched by fire. Light upon light! Allah guides whoever He wills to His light. And Allah sets forth parables for humanity. For Allah has ˹perfect˺ knowledge of all things.",
    "˹That light shines˺ through houses ˹of worship˺ which Allah has ordered to be raised, and where His Name is mentioned. He is glorified there morning and evening",
    "by men who are not distracted—either by buying or selling—from Allah’s remembrance, or performing prayer, or paying alms-tax. They fear a Day when hearts and eyes will tremble",
    "˹hoping˺ that Allah may reward them according to the best of their deeds, and increase them out of His grace. And Allah provides for whoever He wills without limit.",
    "As for the disbelievers, their deeds are like a mirage in a desert, which the thirsty perceive as water, but when they approach it, they find it to be nothing. Instead, they find Allah there ˹in the Hereafter, ready˺ to settle their account. And Allah is swift in reckoning.",
    "Or ˹their deeds are˺ like the darkness in a deep sea, covered by waves upon waves, topped by ˹dark˺ clouds. Darkness upon darkness! If one stretches out their hand, they can hardly see it. And whoever Allah does not bless with light will have no light!",
    "Do you not see that Allah is glorified by all those in the heavens and the earth, even the birds as they soar? Each ˹instinctively˺ knows their manner of prayer and glorification. And Allah has ˹perfect˺ knowledge of all they do.",
    "To Allah ˹alone˺ belongs the kingdom of the heavens and the earth. And to Allah is the final return.",
    "Do you not see that Allah gently drives the clouds, then joins them together, piling them up into masses, from which you see raindrops come forth? And He sends down from the sky mountains ˹of clouds˺ loaded with hail, pouring it on whoever He wills and averting it from whoever He wills. The flash of the clouds’ lightning nearly takes away eyesight.",
    "Allah alternates the day and night. Surely in this is a lesson for people of insight.",
    "And Allah has created from water every living creature. Some of them crawl on their bellies, some walk on two legs, and some walk on four. Allah creates whatever He wills. Surely Allah is Most Capable of everything.",
    "We have indeed sent down revelations clarifying ˹the truth˺. But Allah ˹only˺ guides whoever He wills to the Straight Path.",
    "And the hypocrites say, “We believe in Allah and the Messenger, and we obey.” Then a group of them turns away soon after that. These are not ˹true˺ believers.",
    "And as soon as they are called to Allah and His Messenger so he may judge between them, a group of them turns away.",
    "But if the truth is in their favour, they come to him, fully submitting.",
    "Is there a sickness in their hearts? Or are they in doubt? Or do they fear that Allah and His Messenger will be unjust to them? In fact, it is they who are the ˹true˺ wrongdoers.",
    "The only response of the ˹true˺ believers, when they are called to Allah and His Messenger so he may judge between them, is to say, “We hear and obey.” It is they who will ˹truly˺ succeed.",
    "For whoever obeys Allah and His Messenger, and fears Allah and is mindful of Him, then it is they who will ˹truly˺ triumph.",
    "They swear by Allah their most solemn oaths that if you ˹O Prophet˺ were to command them, they would certainly march forth ˹in Allah’s cause˺. Say, “˹You˺ do not ˹have to˺ swear; your obedience is well known!” Surely Allah is All-Aware of what you do.”",
    "Say, “Obey Allah and obey the Messenger. But if you turn away, then he is only responsible for his duty and you are responsible for yours. And if you obey him, you will be ˹rightly˺ guided. The Messenger’s duty is only to deliver ˹the message˺ clearly.”",
    "Allah has promised those of you who believe and do good that He will certainly make them successors in the land, as He did with those before them; and will surely establish for them their faith which He has chosen for them; and will indeed change their fear into security—˹provided that˺ they worship Me, associating nothing with Me. But whoever disbelieves after this ˹promise˺, it is they who will be the rebellious.",
    "Moreover, establish prayer, pay alms-tax, and obey the Messenger, so you may be shown mercy.",
    "Do not think ˹O Prophet˺ that the disbelievers can escape in the land. The Fire will be their home. Indeed, what an evil destination!",
    "O believers! Let those ˹bondspeople˺ in your possession and those of you who are still under age ask for your permission ˹to come in˺ at three times: before dawn prayer, when you take off your ˹outer˺ clothes at noon, and after the late evening prayer. ˹These are˺ three times of privacy for you. Other than these times, there is no blame on you or them to move freely, attending to one another. This is how Allah makes the revelations clear to you, for Allah is All-Knowing, All-Wise.",
    "And when your children reach the age of puberty, let them seek permission ˹to come in˺, as their seniors do. This is how Allah makes His revelations clear to you, for Allah is All-Knowing, All-Wise.",
    "As for elderly women past the age of marriage, there is no blame on them if they take off their ˹outer˺ garments, without revealing their adornments. But it is better for them if they avoid this ˹altogether˺. And Allah is All-Hearing, All-Knowing.",
    "There is no restriction on the blind, or the disabled, or the sick. Nor on yourselves if you eat from your homes, or the homes of your fathers, or your mothers, or your brothers, or your sisters, or your paternal uncles, or your paternal aunts, or your maternal uncles, or your maternal aunts, or from the homes in your trust, or ˹the homes of˺ your friends. There is no blame on you eating together or separately. However, when you enter houses, greet one another with a greeting ˹of peace˺ from Allah, blessed and good. This is how Allah makes His revelations clear to you, so perhaps you will understand.",
    "The ˹true˺ believers are only those who believe in Allah and His Messenger, and when they are with him on a public matter, they do not leave without his permission. Indeed, those who ask your permission ˹O Prophet˺ are the ones who ˹truly˺ believe in Allah and His Messenger. So when they ask your permission for a private matter, grant permission to whoever you wish and ask Allah’s forgiveness for them. Surely Allah is All-Forgiving, Most Merciful.",
    "Do not treat the Messenger’s summons to you ˹as lightly˺ as your summons to one another. Allah certainly knows those of you who slip away, hiding behind others. So let those who disobey his orders beware, for an affliction may befall them, or a painful torment may overtake them.",
    "Surely to Allah belongs whatever is in the heavens and the earth. He knows well what you stand for. And ˹on˺ the Day all will be returned to Him, He will inform them of what they did. For Allah has ˹perfect˺ knowledge of all things."
  ],
  "arabic1": [
    "سُوْرَةٌ اَنْزَلْنٰهَا وَفَرَضْنٰهَا وَاَنْزَلْنَا فِیْهَاۤ اٰیٰتٍۢ بَیِّنٰتٍ لَّعَلَّكُمْ تَذَكَّرُوْنَ",
    "اَلزَّانِیَةُ وَالزَّانِیْ فَاجْلِدُوْا كُلَّ وَاحِدٍ مِّنْهُمَا مِائَةَ جَلْدَةٍ وَّلَا تَاْخُذْكُمْ بِهِمَا رَاْفَةٌ فِیْ دِیْنِ اللّٰهِ اِنْ كُنْتُمْ تُؤْمِنُوْنَ بِاللّٰهِ وَالْیَوْمِ الْاٰخِرِ وَلْیَشْهَدْ عَذَابَهُمَا طَآىِٕفَةٌ مِّنَ الْمُؤْمِنِیْنَ",
    "اَلزَّانِیْ لَا یَنْكِحُ اِلَّا زَانِیَةً اَوْ مُشْرِكَةً وَّالزَّانِیَةُ لَا یَنْكِحُهَاۤ اِلَّا زَانٍ اَوْ مُشْرِكٌ وَحُرِّمَ ذٰلِكَ عَلَی الْمُؤْمِنِیْنَ",
    "وَالَّذِیْنَ یَرْمُوْنَ الْمُحْصَنٰتِ ثُمَّ لَمْ یَاْتُوْا بِاَرْبَعَةِ شُهَدَآءَ فَاجْلِدُوْهُمْ ثَمٰنِیْنَ جَلْدَةً وَّلَا تَقْبَلُوْا لَهُمْ شَهَادَةً اَبَدًا وَاُولٰٓىِٕكَ هُمُ الْفٰسِقُوْنَ",
    "اِلَّا الَّذِیْنَ تَابُوْا مِنْ بَعْدِ ذٰلِكَ وَاَصْلَحُوْا فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِیْمٌ",
    "وَالَّذِیْنَ یَرْمُوْنَ اَزْوَاجَهُمْ وَلَمْ یَكُنْ لَّهُمْ شُهَدَآءُ اِلَّاۤ اَنْفُسُهُمْ فَشَهَادَةُ اَحَدِهِمْ اَرْبَعُ شَهٰدٰتٍۢ بِاللّٰهِ اِنَّهٗ لَمِنَ الصّٰدِقِیْنَ",
    "وَالْخَامِسَةُ اَنَّ لَعْنَتَ اللّٰهِ عَلَیْهِ اِنْ كَانَ مِنَ الْكٰذِبِیْنَ",
    "وَیَدْرَؤُا عَنْهَا الْعَذَابَ اَنْ تَشْهَدَ اَرْبَعَ شَهٰدٰتٍۢ بِاللّٰهِ اِنَّهٗ لَمِنَ الْكٰذِبِیْنَ",
    "وَالْخَامِسَةَ اَنَّ غَضَبَ اللّٰهِ عَلَیْهَاۤ اِنْ كَانَ مِنَ الصّٰدِقِیْنَ",
    "وَلَوْلَا فَضْلُ اللّٰهِ عَلَیْكُمْ وَرَحْمَتُهٗ وَاَنَّ اللّٰهَ تَوَّابٌ حَكِیْمٌ",
    "اِنَّ الَّذِیْنَ جَآءُوْ بِالْاِفْكِ عُصْبَةٌ مِّنْكُمْ لَا تَحْسَبُوْهُ شَرًّا لَّكُمْ بَلْ هُوَ خَیْرٌ لَّكُمْ لِكُلِّ امْرِئٍ مِّنْهُمْ مَّا اكْتَسَبَ مِنَ الْاِثْمِ وَالَّذِیْ تَوَلّٰی كِبْرَهٗ مِنْهُمْ لَهٗ عَذَابٌ عَظِیْمٌ",
    "لَوْلَاۤ اِذْ سَمِعْتُمُوْهُ ظَنَّ الْمُؤْمِنُوْنَ وَالْمُؤْمِنٰتُ بِاَنْفُسِهِمْ خَیْرًا وَّقَالُوْا هٰذَاۤ اِفْكٌ مُّبِیْنٌ",
    "لَوْلَا جَآءُوْ عَلَیْهِ بِاَرْبَعَةِ شُهَدَآءَ فَاِذْ لَمْ یَاْتُوْا بِالشُّهَدَآءِ فَاُولٰٓىِٕكَ عِنْدَ اللّٰهِ هُمُ الْكٰذِبُوْنَ",
    "وَلَوْلَا فَضْلُ اللّٰهِ عَلَیْكُمْ وَرَحْمَتُهٗ فِی الدُّنْیَا وَالْاٰخِرَةِ لَمَسَّكُمْ فِیْ مَاۤ اَفَضْتُمْ فِیْهِ عَذَابٌ عَظِیْمٌ",
    "اِذْ تَلَقَّوْنَهٗ بِاَلْسِنَتِكُمْ وَتَقُوْلُوْنَ بِاَفْوَاهِكُمْ مَّا لَیْسَ لَكُمْ بِهٖ عِلْمٌ وَّتَحْسَبُوْنَهٗ هَیِّنًا ۖ وَّهُوَ عِنْدَ اللّٰهِ عَظِیْمٌ",
    "وَلَوْلَاۤ اِذْ سَمِعْتُمُوْهُ قُلْتُمْ مَّا یَكُوْنُ لَنَاۤ اَنْ نَّتَكَلَّمَ بِهٰذَا ۖ سُبْحٰنَكَ هٰذَا بُهْتَانٌ عَظِیْمٌ",
    "یَعِظُكُمُ اللّٰهُ اَنْ تَعُوْدُوْا لِمِثْلِهٖۤ اَبَدًا اِنْ كُنْتُمْ مُّؤْمِنِیْنَ",
    "وَیُبَیِّنُ اللّٰهُ لَكُمُ الْاٰیٰتِ وَاللّٰهُ عَلِیْمٌ حَكِیْمٌ",
    "اِنَّ الَّذِیْنَ یُحِبُّوْنَ اَنْ تَشِیْعَ الْفَاحِشَةُ فِی الَّذِیْنَ اٰمَنُوْا لَهُمْ عَذَابٌ اَلِیْمٌ فِی الدُّنْیَا وَالْاٰخِرَةِ وَاللّٰهُ یَعْلَمُ وَاَنْتُمْ لَا تَعْلَمُوْنَ",
    "وَلَوْلَا فَضْلُ اللّٰهِ عَلَیْكُمْ وَرَحْمَتُهٗ وَاَنَّ اللّٰهَ رَءُوْفٌ رَّحِیْمٌ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا تَتَّبِعُوْا خُطُوٰتِ الشَّیْطٰنِ وَمَنْ یَّتَّبِعْ خُطُوٰتِ الشَّیْطٰنِ فَاِنَّهٗ یَاْمُرُ بِالْفَحْشَآءِ وَالْمُنْكَرِ وَلَوْلَا فَضْلُ اللّٰهِ عَلَیْكُمْ وَرَحْمَتُهٗ مَا زَكٰی مِنْكُمْ مِّنْ اَحَدٍ اَبَدًا وَّلٰكِنَّ اللّٰهَ یُزَكِّیْ مَنْ یَّشَآءُ وَاللّٰهُ سَمِیْعٌ عَلِیْمٌ",
    "وَلَا یَاْتَلِ اُولُوا الْفَضْلِ مِنْكُمْ وَالسَّعَةِ اَنْ یُّؤْتُوْۤا اُولِی الْقُرْبٰی وَالْمَسٰكِیْنَ وَالْمُهٰجِرِیْنَ فِیْ سَبِیْلِ اللّٰهِ ۖ وَلْیَعْفُوْا وَلْیَصْفَحُوْا اَلَا تُحِبُّوْنَ اَنْ یَّغْفِرَ اللّٰهُ لَكُمْ وَاللّٰهُ غَفُوْرٌ رَّحِیْمٌ",
    "اِنَّ الَّذِیْنَ یَرْمُوْنَ الْمُحْصَنٰتِ الْغٰفِلٰتِ الْمُؤْمِنٰتِ لُعِنُوْا فِی الدُّنْیَا وَالْاٰخِرَةِ وَلَهُمْ عَذَابٌ عَظِیْمٌ",
    "یَّوْمَ تَشْهَدُ عَلَیْهِمْ اَلْسِنَتُهُمْ وَاَیْدِیْهِمْ وَاَرْجُلُهُمْ بِمَا كَانُوْا یَعْمَلُوْنَ",
    "یَوْمَىِٕذٍ یُّوَفِّیْهِمُ اللّٰهُ دِیْنَهُمُ الْحَقَّ وَیَعْلَمُوْنَ اَنَّ اللّٰهَ هُوَ الْحَقُّ الْمُبِیْنُ",
    "اَلْخَبِیْثٰتُ لِلْخَبِیْثِیْنَ وَالْخَبِیْثُوْنَ لِلْخَبِیْثٰتِ وَالطَّیِّبٰتُ لِلطَّیِّبِیْنَ وَالطَّیِّبُوْنَ لِلطَّیِّبٰتِ اُولٰٓىِٕكَ مُبَرَّءُوْنَ مِمَّا یَقُوْلُوْنَ لَهُمْ مَّغْفِرَةٌ وَّرِزْقٌ كَرِیْمٌ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا تَدْخُلُوْا بُیُوْتًا غَیْرَ بُیُوْتِكُمْ حَتّٰی تَسْتَاْنِسُوْا وَتُسَلِّمُوْا عَلٰۤی اَهْلِهَا ذٰلِكُمْ خَیْرٌ لَّكُمْ لَعَلَّكُمْ تَذَكَّرُوْنَ",
    "فَاِنْ لَّمْ تَجِدُوْا فِیْهَاۤ اَحَدًا فَلَا تَدْخُلُوْهَا حَتّٰی یُؤْذَنَ لَكُمْ وَاِنْ قِیْلَ لَكُمُ ارْجِعُوْا فَارْجِعُوْا هُوَ اَزْكٰی لَكُمْ وَاللّٰهُ بِمَا تَعْمَلُوْنَ عَلِیْمٌ",
    "لَیْسَ عَلَیْكُمْ جُنَاحٌ اَنْ تَدْخُلُوْا بُیُوْتًا غَیْرَ مَسْكُوْنَةٍ فِیْهَا مَتَاعٌ لَّكُمْ وَاللّٰهُ یَعْلَمُ مَا تُبْدُوْنَ وَمَا تَكْتُمُوْنَ",
    "قُلْ لِّلْمُؤْمِنِیْنَ یَغُضُّوْا مِنْ اَبْصَارِهِمْ وَیَحْفَظُوْا فُرُوْجَهُمْ ذٰلِكَ اَزْكٰی لَهُمْ اِنَّ اللّٰهَ خَبِیْرٌ بِمَا یَصْنَعُوْنَ",
    "وَقُلْ لِّلْمُؤْمِنٰتِ یَغْضُضْنَ مِنْ اَبْصَارِهِنَّ وَیَحْفَظْنَ فُرُوْجَهُنَّ وَلَا یُبْدِیْنَ زِیْنَتَهُنَّ اِلَّا مَا ظَهَرَ مِنْهَا وَلْیَضْرِبْنَ بِخُمُرِهِنَّ عَلٰی جُیُوْبِهِنَّ وَلَا یُبْدِیْنَ زِیْنَتَهُنَّ اِلَّا لِبُعُوْلَتِهِنَّ اَوْ اٰبَآىِٕهِنَّ اَوْ اٰبَآءِ بُعُوْلَتِهِنَّ اَوْ اَبْنَآىِٕهِنَّ اَوْ اَبْنَآءِ بُعُوْلَتِهِنَّ اَوْ اِخْوَانِهِنَّ اَوْ بَنِیْۤ اِخْوَانِهِنَّ اَوْ بَنِیْۤ اَخَوٰتِهِنَّ اَوْ نِسَآىِٕهِنَّ اَوْ مَا مَلَكَتْ اَیْمَانُهُنَّ اَوِ التّٰبِعِیْنَ غَیْرِ اُولِی الْاِرْبَةِ مِنَ الرِّجَالِ اَوِ الطِّفْلِ الَّذِیْنَ لَمْ یَظْهَرُوْا عَلٰی عَوْرٰتِ النِّسَآءِ وَلَا یَضْرِبْنَ بِاَرْجُلِهِنَّ لِیُعْلَمَ مَا یُخْفِیْنَ مِنْ زِیْنَتِهِنَّ وَتُوْبُوْۤا اِلَی اللّٰهِ جَمِیْعًا اَیُّهَ الْمُؤْمِنُوْنَ لَعَلَّكُمْ تُفْلِحُوْنَ",
    "وَاَنْكِحُوا الْاَیَامٰی مِنْكُمْ وَالصّٰلِحِیْنَ مِنْ عِبَادِكُمْ وَاِمَآىِٕكُمْ اِنْ یَّكُوْنُوْا فُقَرَآءَ یُغْنِهِمُ اللّٰهُ مِنْ فَضْلِهٖ وَاللّٰهُ وَاسِعٌ عَلِیْمٌ",
    "وَلْیَسْتَعْفِفِ الَّذِیْنَ لَا یَجِدُوْنَ نِكَاحًا حَتّٰی یُغْنِیَهُمُ اللّٰهُ مِنْ فَضْلِهٖ وَالَّذِیْنَ یَبْتَغُوْنَ الْكِتٰبَ مِمَّا مَلَكَتْ اَیْمَانُكُمْ فَكَاتِبُوْهُمْ اِنْ عَلِمْتُمْ فِیْهِمْ خَیْرًا ۖ وَّاٰتُوْهُمْ مِّنْ مَّالِ اللّٰهِ الَّذِیْۤ اٰتٰىكُمْ وَلَا تُكْرِهُوْا فَتَیٰتِكُمْ عَلَی الْبِغَآءِ اِنْ اَرَدْنَ تَحَصُّنًا لِّتَبْتَغُوْا عَرَضَ الْحَیٰوةِ الدُّنْیَا وَمَنْ یُّكْرِهْهُّنَّ فَاِنَّ اللّٰهَ مِنْ بَعْدِ اِكْرَاهِهِنَّ غَفُوْرٌ رَّحِیْمٌ",
    "وَلَقَدْ اَنْزَلْنَاۤ اِلَیْكُمْ اٰیٰتٍ مُّبَیِّنٰتٍ وَّمَثَلًا مِّنَ الَّذِیْنَ خَلَوْا مِنْ قَبْلِكُمْ وَمَوْعِظَةً لِّلْمُتَّقِیْنَ",
    "اَللّٰهُ نُوْرُ السَّمٰوٰتِ وَالْاَرْضِ مَثَلُ نُوْرِهٖ كَمِشْكٰوةٍ فِیْهَا مِصْبَاحٌ اَلْمِصْبَاحُ فِیْ زُجَاجَةٍ اَلزُّجَاجَةُ كَاَنَّهَا كَوْكَبٌ دُرِّیٌّ یُّوْقَدُ مِنْ شَجَرَةٍ مُّبٰرَكَةٍ زَیْتُوْنَةٍ لَّا شَرْقِیَّةٍ وَّلَا غَرْبِیَّةٍ یَّكَادُ زَیْتُهَا یُضِیْٓءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ نُوْرٌ عَلٰی نُوْرٍ یَهْدِی اللّٰهُ لِنُوْرِهٖ مَنْ یَّشَآءُ وَیَضْرِبُ اللّٰهُ الْاَمْثَالَ لِلنَّاسِ وَاللّٰهُ بِكُلِّ شَیْءٍ عَلِیْمٌ",
    "فِیْ بُیُوْتٍ اَذِنَ اللّٰهُ اَنْ تُرْفَعَ وَیُذْكَرَ فِیْهَا اسْمُهٗ یُسَبِّحُ لَهٗ فِیْهَا بِالْغُدُوِّ وَالْاٰصَالِ",
    "رِجَالٌ لَّا تُلْهِیْهِمْ تِجَارَةٌ وَّلَا بَیْعٌ عَنْ ذِكْرِ اللّٰهِ وَاِقَامِ الصَّلٰوةِ وَاِیْتَآءِ الزَّكٰوةِ یَخَافُوْنَ یَوْمًا تَتَقَلَّبُ فِیْهِ الْقُلُوْبُ وَالْاَبْصَارُ",
    "لِیَجْزِیَهُمُ اللّٰهُ اَحْسَنَ مَا عَمِلُوْا وَیَزِیْدَهُمْ مِّنْ فَضْلِهٖ وَاللّٰهُ یَرْزُقُ مَنْ یَّشَآءُ بِغَیْرِ حِسَابٍ",
    "وَالَّذِیْنَ كَفَرُوْۤا اَعْمَالُهُمْ كَسَرَابٍۭ بِقِیْعَةٍ یَّحْسَبُهُ الظَّمْاٰنُ مَآءً حَتّٰۤی اِذَا جَآءَهٗ لَمْ یَجِدْهُ شَیْـًٔا وَّوَجَدَ اللّٰهَ عِنْدَهٗ فَوَفّٰىهُ حِسَابَهٗ وَاللّٰهُ سَرِیْعُ الْحِسَابِ",
    "اَوْ كَظُلُمٰتٍ فِیْ بَحْرٍ لُّجِّیٍّ یَّغْشٰىهُ مَوْجٌ مِّنْ فَوْقِهٖ مَوْجٌ مِّنْ فَوْقِهٖ سَحَابٌ ظُلُمٰتٌ بَعْضُهَا فَوْقَ بَعْضٍ اِذَاۤ اَخْرَجَ یَدَهٗ لَمْ یَكَدْ یَرٰىهَا وَمَنْ لَّمْ یَجْعَلِ اللّٰهُ لَهٗ نُوْرًا فَمَا لَهٗ مِنْ نُّوْرٍ",
    "اَلَمْ تَرَ اَنَّ اللّٰهَ یُسَبِّحُ لَهٗ مَنْ فِی السَّمٰوٰتِ وَالْاَرْضِ وَالطَّیْرُ صٰٓفّٰتٍ كُلٌّ قَدْ عَلِمَ صَلَاتَهٗ وَتَسْبِیْحَهٗ وَاللّٰهُ عَلِیْمٌۢ بِمَا یَفْعَلُوْنَ",
    "وَلِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَاِلَی اللّٰهِ الْمَصِیْرُ",
    "اَلَمْ تَرَ اَنَّ اللّٰهَ یُزْجِیْ سَحَابًا ثُمَّ یُؤَلِّفُ بَیْنَهٗ ثُمَّ یَجْعَلُهٗ رُكَامًا فَتَرَی الْوَدْقَ یَخْرُجُ مِنْ خِلٰلِهٖ وَیُنَزِّلُ مِنَ السَّمَآءِ مِنْ جِبَالٍ فِیْهَا مِنْ بَرَدٍ فَیُصِیْبُ بِهٖ مَنْ یَّشَآءُ وَیَصْرِفُهٗ عَنْ مَّنْ یَّشَآءُ یَكَادُ سَنَا بَرْقِهٖ یَذْهَبُ بِالْاَبْصَارِ",
    "یُقَلِّبُ اللّٰهُ الَّیْلَ وَالنَّهَارَ اِنَّ فِیْ ذٰلِكَ لَعِبْرَةً لِّاُولِی الْاَبْصَارِ",
    "وَاللّٰهُ خَلَقَ كُلَّ دَآبَّةٍ مِّنْ مَّآءٍ فَمِنْهُمْ مَّنْ یَّمْشِیْ عَلٰی بَطْنِهٖ وَمِنْهُمْ مَّنْ یَّمْشِیْ عَلٰی رِجْلَیْنِ وَمِنْهُمْ مَّنْ یَّمْشِیْ عَلٰۤی اَرْبَعٍ یَخْلُقُ اللّٰهُ مَا یَشَآءُ اِنَّ اللّٰهَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "لَقَدْ اَنْزَلْنَاۤ اٰیٰتٍ مُّبَیِّنٰتٍ وَاللّٰهُ یَهْدِیْ مَنْ یَّشَآءُ اِلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "وَیَقُوْلُوْنَ اٰمَنَّا بِاللّٰهِ وَبِالرَّسُوْلِ وَاَطَعْنَا ثُمَّ یَتَوَلّٰی فَرِیْقٌ مِّنْهُمْ مِّنْ بَعْدِ ذٰلِكَ وَمَاۤ اُولٰٓىِٕكَ بِالْمُؤْمِنِیْنَ",
    "وَاِذَا دُعُوْۤا اِلَی اللّٰهِ وَرَسُوْلِهٖ لِیَحْكُمَ بَیْنَهُمْ اِذَا فَرِیْقٌ مِّنْهُمْ مُّعْرِضُوْنَ",
    "وَاِنْ یَّكُنْ لَّهُمُ الْحَقُّ یَاْتُوْۤا اِلَیْهِ مُذْعِنِیْنَ",
    "اَفِیْ قُلُوْبِهِمْ مَّرَضٌ اَمِ ارْتَابُوْۤا اَمْ یَخَافُوْنَ اَنْ یَّحِیْفَ اللّٰهُ عَلَیْهِمْ وَرَسُوْلُهٗ بَلْ اُولٰٓىِٕكَ هُمُ الظّٰلِمُوْنَ",
    "اِنَّمَا كَانَ قَوْلَ الْمُؤْمِنِیْنَ اِذَا دُعُوْۤا اِلَی اللّٰهِ وَرَسُوْلِهٖ لِیَحْكُمَ بَیْنَهُمْ اَنْ یَّقُوْلُوْا سَمِعْنَا وَاَطَعْنَا وَاُولٰٓىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "وَمَنْ یُّطِعِ اللّٰهَ وَرَسُوْلَهٗ وَیَخْشَ اللّٰهَ وَیَتَّقْهِ فَاُولٰٓىِٕكَ هُمُ الْفَآىِٕزُوْنَ",
    "وَاَقْسَمُوْا بِاللّٰهِ جَهْدَ اَیْمَانِهِمْ لَىِٕنْ اَمَرْتَهُمْ لَیَخْرُجُنَّ قُلْ لَّا تُقْسِمُوْا طَاعَةٌ مَّعْرُوْفَةٌ اِنَّ اللّٰهَ خَبِیْرٌ بِمَا تَعْمَلُوْنَ",
    "قُلْ اَطِیْعُوا اللّٰهَ وَاَطِیْعُوا الرَّسُوْلَ فَاِنْ تَوَلَّوْا فَاِنَّمَا عَلَیْهِ مَا حُمِّلَ وَعَلَیْكُمْ مَّا حُمِّلْتُمْ وَاِنْ تُطِیْعُوْهُ تَهْتَدُوْا وَمَا عَلَی الرَّسُوْلِ اِلَّا الْبَلٰغُ الْمُبِیْنُ",
    "وَعَدَ اللّٰهُ الَّذِیْنَ اٰمَنُوْا مِنْكُمْ وَعَمِلُوا الصّٰلِحٰتِ لَیَسْتَخْلِفَنَّهُمْ فِی الْاَرْضِ كَمَا اسْتَخْلَفَ الَّذِیْنَ مِنْ قَبْلِهِمْ وَلَیُمَكِّنَنَّ لَهُمْ دِیْنَهُمُ الَّذِی ارْتَضٰی لَهُمْ وَلَیُبَدِّلَنَّهُمْ مِّنْ بَعْدِ خَوْفِهِمْ اَمْنًا یَعْبُدُوْنَنِیْ لَا یُشْرِكُوْنَ بِیْ شَیْـًٔا وَمَنْ كَفَرَ بَعْدَ ذٰلِكَ فَاُولٰٓىِٕكَ هُمُ الْفٰسِقُوْنَ",
    "وَاَقِیْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاَطِیْعُوا الرَّسُوْلَ لَعَلَّكُمْ تُرْحَمُوْنَ",
    "لَا تَحْسَبَنَّ الَّذِیْنَ كَفَرُوْا مُعْجِزِیْنَ فِی الْاَرْضِ وَمَاْوٰىهُمُ النَّارُ وَلَبِئْسَ الْمَصِیْرُ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لِیَسْتَاْذِنْكُمُ الَّذِیْنَ مَلَكَتْ اَیْمَانُكُمْ وَالَّذِیْنَ لَمْ یَبْلُغُوا الْحُلُمَ مِنْكُمْ ثَلٰثَ مَرّٰتٍ مِنْ قَبْلِ صَلٰوةِ الْفَجْرِ وَحِیْنَ تَضَعُوْنَ ثِیَابَكُمْ مِّنَ الظَّهِیْرَةِ وَمِنْ بَعْدِ صَلٰوةِ الْعِشَآءِ ۫ ثَلٰثُ عَوْرٰتٍ لَّكُمْ لَیْسَ عَلَیْكُمْ وَلَا عَلَیْهِمْ جُنَاحٌ بَعْدَهُنَّ طَوّٰفُوْنَ عَلَیْكُمْ بَعْضُكُمْ عَلٰی بَعْضٍ كَذٰلِكَ یُبَیِّنُ اللّٰهُ لَكُمُ الْاٰیٰتِ وَاللّٰهُ عَلِیْمٌ حَكِیْمٌ",
    "وَاِذَا بَلَغَ الْاَطْفَالُ مِنْكُمُ الْحُلُمَ فَلْیَسْتَاْذِنُوْا كَمَا اسْتَاْذَنَ الَّذِیْنَ مِنْ قَبْلِهِمْ كَذٰلِكَ یُبَیِّنُ اللّٰهُ لَكُمْ اٰیٰتِهٖ وَاللّٰهُ عَلِیْمٌ حَكِیْمٌ",
    "وَالْقَوَاعِدُ مِنَ النِّسَآءِ الّٰتِیْ لَا یَرْجُوْنَ نِكَاحًا فَلَیْسَ عَلَیْهِنَّ جُنَاحٌ اَنْ یَّضَعْنَ ثِیَابَهُنَّ غَیْرَ مُتَبَرِّجٰتٍ بِزِیْنَةٍ وَاَنْ یَّسْتَعْفِفْنَ خَیْرٌ لَّهُنَّ وَاللّٰهُ سَمِیْعٌ عَلِیْمٌ",
    "لَیْسَ عَلَی الْاَعْمٰی حَرَجٌ وَّلَا عَلَی الْاَعْرَجِ حَرَجٌ وَّلَا عَلَی الْمَرِیْضِ حَرَجٌ وَّلَا عَلٰۤی اَنْفُسِكُمْ اَنْ تَاْكُلُوْا مِنْ بُیُوْتِكُمْ اَوْ بُیُوْتِ اٰبَآىِٕكُمْ اَوْ بُیُوْتِ اُمَّهٰتِكُمْ اَوْ بُیُوْتِ اِخْوَانِكُمْ اَوْ بُیُوْتِ اَخَوٰتِكُمْ اَوْ بُیُوْتِ اَعْمَامِكُمْ اَوْ بُیُوْتِ عَمّٰتِكُمْ اَوْ بُیُوْتِ اَخْوَالِكُمْ اَوْ بُیُوْتِ خٰلٰتِكُمْ اَوْ مَا مَلَكْتُمْ مَّفَاتِحَهٗۤ اَوْ صَدِیْقِكُمْ لَیْسَ عَلَیْكُمْ جُنَاحٌ اَنْ تَاْكُلُوْا جَمِیْعًا اَوْ اَشْتَاتًا فَاِذَا دَخَلْتُمْ بُیُوْتًا فَسَلِّمُوْا عَلٰۤی اَنْفُسِكُمْ تَحِیَّةً مِّنْ عِنْدِ اللّٰهِ مُبٰرَكَةً طَیِّبَةً كَذٰلِكَ یُبَیِّنُ اللّٰهُ لَكُمُ الْاٰیٰتِ لَعَلَّكُمْ تَعْقِلُوْنَ",
    "اِنَّمَا الْمُؤْمِنُوْنَ الَّذِیْنَ اٰمَنُوْا بِاللّٰهِ وَرَسُوْلِهٖ وَاِذَا كَانُوْا مَعَهٗ عَلٰۤی اَمْرٍ جَامِعٍ لَّمْ یَذْهَبُوْا حَتّٰی یَسْتَاْذِنُوْهُ اِنَّ الَّذِیْنَ یَسْتَاْذِنُوْنَكَ اُولٰٓىِٕكَ الَّذِیْنَ یُؤْمِنُوْنَ بِاللّٰهِ وَرَسُوْلِهٖ فَاِذَا اسْتَاْذَنُوْكَ لِبَعْضِ شَاْنِهِمْ فَاْذَنْ لِّمَنْ شِئْتَ مِنْهُمْ وَاسْتَغْفِرْ لَهُمُ اللّٰهَ اِنَّ اللّٰهَ غَفُوْرٌ رَّحِیْمٌ",
    "لَا تَجْعَلُوْا دُعَآءَ الرَّسُوْلِ بَیْنَكُمْ كَدُعَآءِ بَعْضِكُمْ بَعْضًا قَدْ یَعْلَمُ اللّٰهُ الَّذِیْنَ یَتَسَلَّلُوْنَ مِنْكُمْ لِوَاذًا فَلْیَحْذَرِ الَّذِیْنَ یُخَالِفُوْنَ عَنْ اَمْرِهٖۤ اَنْ تُصِیْبَهُمْ فِتْنَةٌ اَوْ یُصِیْبَهُمْ عَذَابٌ اَلِیْمٌ",
    "اَلَاۤ اِنَّ لِلّٰهِ مَا فِی السَّمٰوٰتِ وَالْاَرْضِ قَدْ یَعْلَمُ مَاۤ اَنْتُمْ عَلَیْهِ وَیَوْمَ یُرْجَعُوْنَ اِلَیْهِ فَیُنَبِّئُهُمْ بِمَا عَمِلُوْا وَاللّٰهُ بِكُلِّ شَیْءٍ عَلِیْمٌ"
  ],
  "bengali": [
    "এটি একটি সূরা, যা আমি নাযিল করেছি এবং এটাকে অবশ্য পালনীয় করেছি। আর আমি এতে সুস্পষ্ট আয়াতসমূহ নাযিল করেছি, যাতে তোমরা উপদেশ গ্রহণ কর।",
    "ব্যভিচারিণী ও ব্যভিচারী তাদের প্রত্যেককে একশ’টি করে বেত্রাঘাত কর। আর যদি তোমরা আল্লাহ ও শেষ দিবসের প্রতি ঈমান এনে থাক তবে আল্লাহর দীনের ব্যাপারে তাদের প্রতি দয়া যেন তোমাদেরকে পেয়ে না বসে। আর মুমিনদের একটি দল যেন তাদের শাস্তি প্রত্যক্ষ করে।",
    "ব্যভিচারী কেবল ব্যভিচারিণী অথবা মুশরিক নারীকে ছাড়া বিয়ে করবে না এবং ব্যভিচারিণীকে কেবল ব্যভিচারী অথবা মুশরিক ছাড়া বিয়ে করবে না। আর মুমিনদের উপর এটা হারাম করা হয়েছে।",
    "আর যারা সচ্চরিত্র নারীর প্রতি অপবাদ আরোপ করে, তারপর তারা চারজন সাক্ষী নিয়ে আসে না, তবে তাদেরকে আশিটি বেত্রাঘাত কর এবং তোমরা কখনই তাদের সাক্ষ্য গ্রহণ করো না। আর এরাই হলো ফাসিক।",
    "তবে যারা এরপরে তাওবা করে এবং নিজদের সংশোধন করে, তাহলে নিশ্চয় আল্লাহ বড়ই ক্ষমাশীল, পরম দয়ালু।",
    "আর যারা নিজদের স্ত্রীর প্রতি অপবাদ আরোপ করে, অথচ নিজেরা ছাড়া তাদের আর কোন সাক্ষী নেই, তাহলে তাদের প্রত্যেকের সাক্ষ্য হবে আল্লাহর নামে চারবার সাক্ষ্য দেবে যে, সে নিশ্চয়ই সত্যবাদীদের অন্তর্ভুক্ত।",
    "আর পঞ্চমবারে সাক্ষ্য দেবে যে, সে যদি মিথ্যাবাদী হয়, তবে নিশ্চয় তার উপর আল্লাহর লা‘নত।",
    "আর তারা স্ত্রীলোকটি থেকে শাস্তি রহিত করবে, যদি সে আল্লাহর নামে চারবার সাক্ষ্য দেয় যে, নিশ্চয় তার স্বামী মিথ্যাবাদীদের অন্তর্ভুক্ত।",
    "আর পঞ্চমবারে সাক্ষ্য দেবে যে, যদি তার স্বামী সত্যবাদী হয়, তবে নিশ্চয় তার উপর আল্লাহর গযব।",
    "যদি তোমাদের উপর আল্লাহর অনুগ্রহ ও তাঁর দয়া না থাকত, (তাহলে তোমরা ধ্বংস হয়ে যেতে) আর নিশ্চয় আল্লাহ অধিক তাওবা গ্রহণকারী, প্রজ্ঞাময়।",
    "নিশ্চয়ই যারা এ অপবাদ* রটনা করেছে, তারা তোমাদেরই একটি দল। এটাকে তোমরা তোমাদের জন্য অকল্যাণকর মনে করো না, বরং এটা তোমাদের জন্য কল্যাণকর। তাদের থেকে প্রত্যেক ব্যক্তির জন্য রয়েছে, যতটুকু পাপ সে অর্জন করেছে। আর তাদের থেকে যে ব্যক্তি এ ব্যাপারে প্রধান ভূমিকা পালন করেছে, তার জন্য রয়েছে মহাআযাব। \n* এটি উম্মুল মুমিনীন আয়েশা (রা) এর প্রতি মিথ্যা অপবাদের ঘটনা। ৬ষ্ঠ হিজরীতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনূ মুস্তালিক যুদ্ধ থেকে ফিরার পথে একস্থানে রাত্রিযাপনের জন্য অবস্থান করেন। রাতের শেষ ভাগে আয়েশা (রা) প্রাকৃতিক প্রয়োজনে একটু দূরে যান। কিন্তু পথে তিনি তাঁর গলার হারটি হারিয়ে ফেলেন। তিনি তাঁর হার খুঁজতে থাকেন। এদিকে কাফেলা রওনা হয়ে যায়। তিনি হাওদার ভিতরেই আছেন মনে করে কেউ তাঁর খোঁজ করেনি কারণ তাঁর শারীরিক গড়ন ছিল হালকা। হার খুঁজে পেয়ে তিনি এসে দেখেন যে, কাফেলা চলে গেছে। তখন তিনি ছুটাছুটি না করে সেখানেই বসে পড়েন। এ আশায় যে কাফেলার রেখে যাওয়া মালামালের সন্ধানে নিয়োজিত কোন লোক আসবেন। অবশেষে এ কাজে নিয়োজিত সাফওয়ান (রা.) সকাল বেলায় আয়েশা (রা.) কে দেখতে পেলেন এবং নিজের উটে তাঁকে আরোহণ করিয়ে নিজে পায়ে হেটে উটের রশি টেনে সসম্মানে তাঁকে নিয়ে কাফেলার সাথে মিলিত হন। এ ঘটনাকে কেন্দ্র করে মুনাফিক সর্দার আব্দুল্লাহ ইবনে উবাই কয়েকজনকে সাথে নিয়ে আয়েশা (রা.) এর ব্যাপারে মিথ্যা অপবাদ রটাতে থাকে। অবশেষে আল্লাহ তা‘আলা এ আয়াতগুলো নাযিল করে আয়েশা (রা) কে নির্দোষ ঘোষণা করেন এবং অপবাদ রটনাকারীদের কঠোর শাস্তির কথা জানিয়ে দেন। এই ঘটনাটি ‘ইফক’ এর ঘটনা হিসেবে প্রসিদ্ধ।",
    "যখন তোমরা এটা শুনলে, তখন কেন মুমিন পুরুষ ও মুমিন নারীরা তাদের নিজদের সম্পর্কে ভাল ধারণা পোষণ করল না এবং বলল না যে, ‘এটা তো সুস্পষ্ট অপবাদ’?",
    "তারা কেন এ ব্যাপারে চারজন সাক্ষী নিয়ে আসল না? সুতরাং যখন তারা সাক্ষী নিয়ে আসেনি, তখন তারাই আল্লাহর কাছে মিথ্যাবাদী।",
    "আর যদি দুনিয়া ও আখেরাতে তোমাদের উপর আল্লাহর দয়া ও তাঁর অনুগ্রহ না থাকত, তবে তোমরা যাতে লিপ্ত ছিলে, তার জন্য তোমাদেরকে অবশ্যই কঠিন আযাব স্পর্শ করত।",
    "যখন এটা তোমরা তোমাদের মুখে মুখে ছড়াচ্ছিলে এবং তোমরা তোমাদের মুখ দিয়ে এমন কথা বলছিলে, যাতে তোমাদের কোন জ্ঞান ছিল না; আর তোমরা এটাকে খুবই তুচ্ছ মনে করছিলে, অথচ এটা আল্লাহর নিকট খুবই গুরুতর।",
    "আর তোমরা যখন এটা শুনলে, তখন তোমরা কেন বললে না যে, ‘এ নিয়ে কথা বলা আমাদের পক্ষে সম্ভব নয়। তুমি অতি পবিত্র মহান, এটা এক গুরুতর অপবাদ’।",
    "আল্লাহ তোমাদেরকে উপদেশ দিচ্ছেন যে, যদি তোমরা মুমিন হও, তাহলে আর কখনো এর পুনরাবৃত্তি করবে না।",
    "আর আল্লাহ তোমাদের জন্য আয়াতসমূহ স্পষ্টভাবে বর্ণনা করছেন এবং আল্লাহ মহাজ্ঞানী, প্রজ্ঞাময়।",
    "নিশ্চয় যারা এটা পছন্দ করে যে, মুমিনদের মধ্যে অশ্লীলতা ছড়িয়ে পড়ুক, তাদের জন্য দুনিয়া ও আখেরাতে রয়েছে যন্ত্রণাদায়ক আযাব। আর আল্লাহ জানেন এবং তোমরা জান না।",
    "আর যদি তোমাদের উপর আল্লাহর অনুগ্রহ ও তাঁর দয়া না থাকত, (তাহলে তোমরা ধ্বংস হয়ে যেতে) আর নিশ্চয় আল্লাহ বড় মেহেরবান, পরম দয়ালু।",
    "হে মুমিনগণ, তোমরা শয়তানের পদাঙ্কসমূহ অনুসরণ করো না। আর যে শয়তানের পদাঙ্কসমূহ অনুসরণ করবে, নিশ্চয় সে অশ্লীলতা ও মন্দ কাজের নির্দেশ দেবে। আর যদি তোমাদের প্রতি আল্লাহর অনুগ্রহ ও তাঁর দয়া না থাকত, তাহলে তোমাদের কেউই কখনো পবিত্র হতে পারত না; কিন্তু আল্লাহ যাকে ইচ্ছা করেন, পবিত্র করেন। আর আল্লাহ সর্বশ্রোতা, মহাজ্ঞানী।",
    "আর তোমাদের মধ্যে যারা মর্যাদা ও প্রাচুর্যের অধিকারী, তারা যেন এমন কসম না করে যে, তারা নিকটাত্মীয়দের, মিসকীনদের ও আল্লাহর পথে হিজরতকারীদের কিছুই দেবে না। আর তারা যেন তাদের ক্ষমা করে এবং তাদের দোষত্রুটি উপেক্ষা করে। তোমরা কি পছন্দ কর না যে, আল্লাহ তোমাদের ক্ষমা করে দেন? আর আল্লাহ বড়ই ক্ষমাশীল, পরম দয়ালু।",
    "যারা সচ্চরিত্রা সরলমনা মুমিন নারীদের প্রতি অপবাদ আরোপ করে, তারা দুনিয়া ও আখিরাতে অভিশপ্ত। আর তাদের জন্য রয়েছে মহাআযাব।",
    "যেদিন তাদের জিহবাগুলো, তাদের হাতগুলো ও তাদের পাগুলো তারা যা করত, সে ব্যাপারে তাদের বিরুদ্ধে সাক্ষ্য দেবে।",
    "সেদিন আল্লাহ তাদেরকে তাদের ন্যায্য প্রতিদান পুরোপুরি দিয়ে দেবেন, আর তারা জানবে যে, আল্লাহই সুস্পষ্ট সত্য।",
    "দুশ্চরিত্রা নারীরা দুশ্চরিত্র পুরুষদের জন্য এবং দুশ্চরিত্র পুরুষরা দুশ্চরিত্রা নারীদের জন্য। আর সচ্চরিত্রা নারীরা সচ্চরিত্র পুরুষদের জন্য এবং সচ্চরিত্র পুরুষরা সচ্চরিত্রা নারীদের জন্য; লোকেরা যা বলে, তারা তা থেকে মুক্ত। তাদের জন্য রয়েছে ক্ষমা ও সম্মানজনক রিয্ক।",
    "হে মুমিনগণ, তোমরা নিজদের গৃহ ছাড়া অন্য কারও গৃহে প্রবেশ করো না, যতক্ষণ না তোমরা অনুমতি নেবে এবং গৃহবাসীদেরকে সালাম দেবে। এটাই তোমাদের জন্য কল্যাণকর, যাতে তোমরা উপদেশ গ্রহণ কর।",
    "অতঃপর যদি তোমরা সেখানে কাউকে না পাও তাহলে তোমাদেরকে অনুমতি না দেয়া পর্যন্ত তোমরা সেখানে প্রবেশ করো না। আর যদি তোমাদেরকে বলা হয়, ‘ফিরে যাও’ তাহলে ফিরে যাবে। এটাই তোমাদের জন্য অধিক পবিত্র। তোমরা যা কর আল্লাহ সে বিষয়ে সম্যক অবগত।",
    "যে ঘরে কেউ বাস করে না, তাতে তোমাদের কোন ভোগসামগ্রী থাকলে, সেখানে তোমাদের প্রবেশে কোন পাপ হবে না। আর আল্লাহ জানেন যা তোমরা প্রকাশ কর আর যা তোমরা গোপন কর।",
    "মুমিন পুরুষদেরকে বল, তারা তাদের দৃষ্টিকে সংযত রাখবে এবং তাদের লজ্জাস্থানের হিফাযত করবে। এটাই তাদের জন্য অধিক পবিত্র। নিশ্চয় তারা যা করে সে সম্পর্কে আল্লাহ সম্যক অবহিত।",
    "আর মুমিন নারীদেরকে বল, যেন তারা তাদের দৃষ্টিকে সংযত রাখবে এবং তাদের লজ্জাস্থানের হিফাযত করে। আর যা সাধারণত প্রকাশ পায় তা ছাড়া তাদের সৌন্দর্য তারা প্রকাশ করবে না। তারা যেন তাদের ওড়না দিয়ে বক্ষদেশকে আবৃত করে রাখে। আর তারা যেন তাদের স্বামী, পিতা, শ্বশুর, নিজদের ছেলে, স্বামীর ছেলে, ভাই, ভাই এর ছেলে, বোনের ছেলে, আপন নারীগণ, তাদের ডান হাত যার মালিক হয়েছে, অধীনস্থ যৌনকামনামুক্ত পুরুষ অথবা নারীদের গোপন অঙ্গ সম্পর্কে অজ্ঞ বালক ছাড়া কারো কাছে নিজদের সৌন্দর্য প্রকাশ না করে। আর তারা যেন নিজদের গোপন সৌন্দর্য প্রকাশ করার জন্য সজোরে পদচারণা না করে। হে মুমিনগণ, তোমরা সকলেই আল্লাহর নিকট তাওবা কর, যাতে তোমরা সফলকাম হতে পার।",
    "আর তোমরা তোমাদের মধ্যকার অবিবাহিত নারী-পুরুষ ও সৎকর্মশীল দাস দাসীদের বিবাহ দাও। তারা অভাবী হলে আল্লাহ নিজ অনুগ্রহে তাদেরকে অভাবমুক্ত করে দেবেন। আল্লাহ প্রাচুর্যময় ও মহাজ্ঞানী।",
    "আর যাদের বিবাহের সামর্থ্য নেই আল্লাহ তাদেরকে নিজ অনুগ্রহে অভাবমুক্ত না করা পর্যন্ত তারা যেন সংযম অবলম্বন করে। আর তোমাদের মালিকানাধীন দাস-দাসীদের মধ্যে যারা মুক্তির জন্য লিখিত চুক্তি করতে চায় তাদের সাথে তোমরা লিখিত চুক্তি কর, যদি তোমরা তাদের মধ্যে কল্যাণ আছে বলে জানতে পার এবং আল্লাহ তোমাদেরকে যে সম্পদ দিয়েছেন তা থেকে তোমরা তাদেরকে দাও। তোমাদের দাসীরা সতীত্ব রক্ষা করতে চাইলে তোমরা দুনিয়ার জীবনের সম্পদের কামনায় তাদেরকে ব্যভিচারে বাধ্য করো না। আর যারা তাদেরকে বাধ্য করবে, নিশ্চয় তাদেরকে বাধ্য করার পর আল্লাহ তাদের প্রতি অত্যন্ত ক্ষমাশীল পরম দয়ালু।",
    "আর নিশ্চয় আমি তোমাদের কাছে নাযিল করেছি সুস্পষ্ট আয়াতসমূহ এবং তোমাদের পূর্বে যারা চলে গেছে তাদের দৃষ্টান্ত ও মুত্তাকীদের জন্য উপদেশ।",
    "আল্লাহ আসমানসমূহ ও যমীনের নূর। তাঁর নূরের উপমা একটি তাকের মতই। তাতে রয়েছে একটি প্রদীপ, প্রদীপটি রয়েছে একটি চিমনির মধ্যে। চিমনিটি উজ্জ্বল তারকার মতই। প্রদীপটি বরকতময় যাইতূন গাছের তেল দ্বারা জ্বালানো হয়, যা পূর্ব দিকেরও নয় এবং পশ্চিম দিকেরও নয়। এর তেল যেন আলো বিকিরণ করে, যদিও তাতে আগুন স্পর্শ না করে। নূরের উপর নূর। আল্লাহ যাকে ইচ্ছা হিদায়াত করেন তাঁর নূরের দিকে। আর আল্লাহ মানুষের জন্য উপমাসমূহ উপস্থাপন করেন। আর আল্লাহ প্রতিটি বস্তু সম্পর্কে সম্যক জ্ঞাত।",
    "সেসব ঘরে যাকে সমুন্নত করতে এবং যেখানে আল্লাহর নাম যিক্র করতে আল্লাহই অনুমতি দিয়েছেন। সেখানে সকাল ও সন্ধ্যায় তাঁর তাসবীহ পাঠ করে-",
    "সেসব লোক, যাদেরকে ব্যবসা-বাণিজ্য ও ক্রয়-বিক্রয় আল্লাহর যিক্র, সালাত কায়েম করা ও যাকাত প্রদান করা থেকে বিরত রাখে না। তারা সেদিনকে ভয় করে, যেদিন অন্তর ও দৃষ্টিসমূহ উল্টে যাবে।",
    "যাতে তাদের কৃত উত্তম আমলের জন্য আল্লাহ তাদেরকে প্রতিদান দেন এবং তিনি স্বীয় অনুগ্রহে তাদেরকে আরো বাড়িয়ে দেন। আর আল্লাহ যাকে ইচ্ছা করেন অপরিমিত রিয্ক দান করেন।",
    "আর যারা কুফরী করে, তাদের আমলসমূহ মরুভূমির মরিচিকার মত, পিপাসিত ব্যক্তি যাকে পানি মনে করে। অবশেষে যখন সে তার কাছে আসবে, তখন সে দেখবে সেটা কিছুই নয়। আর সে সেখানে আল্লাহকে দেখতে পাবে। অতঃপর তিনি তাকে তার হিসাব পরিপূর্ণ করে দেবেন। আর আল্লাহ অতি দ্রুত হিসাব গ্রহণকারী।",
    "অথবা (তাদের আমলসমূহ) গভীর সমূদ্রে ঘনিভূত অন্ধকারের মত, যাকে আচ্ছন্ন করে ঢেউয়ের উপরে ঢেউ, তার উপরে মেঘমালা। অনেক অন্ধকার; এক স্তরের উপর অপর স্তর। কেউ হাত বের করলে আদৌ তা দেখতে পায় না। আর আল্লাহ যাকে নূর দেন না তার জন্য কোন নূর নেই।",
    "তুমি কি দেখনি যে, আসমান ও যমীনে যারা আছে তারা এবং সারিবদ্ধ হয়ে উড়ন্ত পাখিরা আল্লাহর তাসবীহ পাঠ করে? প্রত্যেকেই তাঁর সালাত ও তাসবীহ জানে। তারা যা করে সে সম্পর্কে আল্লাহ সম্যক অবগত।",
    "আর আসমান ও যমীনের মালিকানা আল্লাহর জন্যই। আর আল্লাহর দিকেই প্রত্যাবর্তন।",
    "তুমি কি দেখনি যে, আল্লাহ মেঘমালাকে পরিচালিত করেন, তারপর তিনি সেগুলোকে একত্রে জুড়ে দেন, তারপর সেগুলো স্তুপীকৃত করেন, তারপর তুমি দেখতে পাও তার মধ্য থেকে বৃষ্টির বের হয়। আর তিনি আকাশে স্থিত মেঘমালার পাহাড় থেকে শিলা বর্ষণ করেন। তারপর তা দ্বারা যাকে ইচ্ছা আঘাত করেন। আর যার কাছ থেকে ইচ্ছা তা সরিয়ে দেন। এর বিদ্যুতের ঝলক দৃষ্টিশক্তি প্রায় কেড়ে নেয়।",
    "আল্লাহ দিন ও রাতের আবর্তন ঘটান, নিশ্চয়ই এতে অন্তরদৃষ্টিসম্পন্নদের জন্য শিক্ষা রয়েছে।",
    "আর আল্লাহ প্রত্যেক জীবকে পানি থেকে সৃষ্টি করেছেন। অতঃপর তাদের কোনটি পেটে ভর দিয়ে চলে, কোনটি চলে দু’পায়ের উপর, আবার কোনটি চার পায়ের উপর চলে। আল্লাহ যা ইচ্ছা সৃষ্টি করেন। নিশ্চয় আল্লাহ সব কিছুর উপর সর্বশক্তিমান।",
    "অবশ্যই আমি সুস্পষ্ট আয়াতসমূহ নাযিল করেছি। আর আল্লাহ যাকে ইচ্ছা সরল সঠিক পথ দেখান।",
    "তারা বলে, ‘আমরা আল্লাহ ও রাসূলের প্রতি ঈমান এনেছি এবং আমরা আনুগত্য করেছি’, তারপর তাদের একটি দল এর পরে মুখ ফিরিয়ে নেয়। আর তারা মুমিন নয়।",
    "আর যখন তাদেরকে আল্লাহ ও তাঁর রাসূলের প্রতি এ মর্মে আহবান করা হয় যে, তিনি তাদের মধ্যে বিচারমীমাংসা করবেন, তখন তাদের একটি দল মুখ ফিরিয়ে নেয়।",
    "কিন্তু যদি সত্য তাদের পক্ষে থাকে, তাহলে তারা তার কাছে একান্ত বিনীতভাবে ছুটে আসে।",
    "তাদের অন্তরে কি ব্যাধি রয়েছে? নাকি তারা সন্দেহ পোষণ করে, না তারা ভয় করে যে, আল্লাহ ও তাঁর রাসূল তাদের উপর যুলম করবেন? বরং তারাই তো যালিম।",
    "মুমিনদেরকে যখন আল্লাহ ও তাঁর রাসূলের প্রতি এ মর্মে আহবান করা হয় যে, তিনি তাদের মধ্যে বিচার, মীমাংসা করবেন, তাদের কথা তো এই হয় যে, তখন তারা বলে: ‘আমরা শুনলাম ও আনুগত্য করলাম।’ আর তারাই সফলকাম।",
    "আর যে কেউ আল্লাহ ও তাঁর রাসূলের আনুগত্য করে, আল্লাহকে ভয় করে এবং তাঁর তাকওয়া অবলম্বন করে, তারাই কৃতকার্য।",
    "আর তারা তাদের সুদৃঢ় শপথের মাধ্যমে আল্লাহর নামে কসম করে বলে যে, ‘তুমি যদি তাদের আদেশ কর তবে তারা বের হবেই। তুমি বল, ‘তোমরা কসম করো না। [তোমাদের] আনুগত্য তো জানাই আছে। তোমরা যা কিছু কর, নিশ্চয় আল্লাহ সে বিষয়ে সবিশেষ অবহিত’।",
    "বল, ‘তোমরা আল্লাহর আনুগত্য কর এবং রাসূলের আনুগত্য কর।’ তারপর যদি তোমরা মুখ ফিরিয়ে নাও, তবে সে শুধু তার উপর অর্পিত দায়িত্বের জন্য দায়ী এবং তোমাদের উপর অর্পিত দায়িত্বের জন্য তোমরাই দায়ী। আর যদি তোমরা তার আনুগত্য কর তবে তোমরা হিদায়াতপ্রাপ্ত হবে। আর রাসূলের দায়িত্ব শুধু স্পষ্টভাবে পৌঁছে দেয়া।",
    "তোমাদের মধ্যে যারা ঈমান আনে এবং সৎকর্ম করে আল্লাহ তাদেরকে এ মর্মে ওয়াদা দিয়েছেন যে, তিনি নিশ্চিতভাবে তাদেরকে যমীনের প্রতিনিধিত্ব প্রদান করবেন, যেমন তিনি প্রতিনিধিত্ব প্রদান করেছিলেন তাদের পূর্ববর্তীদেরকে এবং তিনি অবশ্যই তাদের জন্য শক্তিশালী ও সুপ্রতিষ্ঠিত করবেন তাদের দীনকে, যা তিনি তাদের জন্য পছন্দ করেছেন এবং তিনি তাদের ভয়-ভীতি শান্তি-নিরাপত্তায় পরিবর্তিত করে দেবেন। তারা আমারই ইবাদাত করবে, আমার সাথে কোন কিছুকে শরীক করবে না। আর এরপর যারা কুফরী করবে তারাই ফাসিক।",
    "আর তোমরা সালাত কায়েম কর, যাকাত দাও এবং রাসূলের আনুগত্য কর, যাতে তোমরা রহমতপ্রাপ্ত হতে পার।",
    "তুমি কাফিরদেরকে যমীনে অপারগকারী মনে করো না; তাদের আশ্রয়স্থল আগুন। আর কতই না নিকৃষ্ট এই প্রত্যাবর্তনস্থল!",
    "হে মুমিনগণ, তোমাদের ডানহাত যার মালিক হয়েছে এবং তোমাদের মধ্যে যারা প্রাপ্তবয়স্ক হয়নি তারা যেন অবশ্যই তিন সময়ে অনুমতি গ্রহণ করে। ফজরের সালাতের পূর্বে, দুপুরে যখন তোমরা তোমাদের পোশাক খুলে রাখ, এবং ‘ইশার সালাতের পর; এই তিনটি তোমাদের [গোপনীয়তার] সময়। এই তিন সময়ের পর তোমাদের এবং তাদের কোন দোষ নেই। তোমাদের একে অন্যের কাছে যাতায়াত করতেই হয়। এভাবে আল্লাহ তোমাদের উদ্দেশ্যে তাঁর আয়াতসমূহ বর্ণনা করেন। আল্লাহ মহাজ্ঞানী, প্রজ্ঞাময়।",
    "আর তোমাদের সন্তান-সন্ততি যখন প্রাপ্তবয়স্ক হয়, তখন তারাও যেন অনুমতি চায় যেমনিভাবে তাদের অগ্রজরা অনুমতি চাইত। এভাবে আল্লাহ তোমাদের জন্য তাঁর আয়াতসমূহ বর্ণনা করেন। আর আল্লাহ মহাজ্ঞানী, প্রজ্ঞাময়।",
    "আর বৃদ্ধা নারীরা, যারা বিয়ের প্রত্যাশা করে না, তাদের জন্য কোন দোষ নেই, যদি তারা তাদের সৌন্দর্য প্রদর্শন না করে তাদের কিছু পোশাক খুলে রাখে এবং এ থেকে বিরত থাকাই তাদের জন্য উত্তম। আর আল্লাহ সর্বশ্রোতা, মহাজ্ঞানী।",
    "অন্ধের জন্য কোন দোষ নেই, পঙ্গুর জন্য কোন দোষ নেই, রোগাক্রান্তের জন্য কোন দোষ নেই এবং তোমাদের নিজদের জন্যও কোন দোষ নেই যে তোমরা খাবে তোমাদের নিজদের ঘরে, অথবা তোমাদের পিতাদের ঘরে, অথবা তোমাদের মায়েদের ঘরে, অথবা তোমাদের ভাইদের ঘরে, অথবা তোমাদের বোনদের ঘরে, অথবা তোমাদের চাচাদের ঘরে, অথবা তোমাদের ফুফুদের ঘরে, অথবা তোমাদের মামাদের ঘরে, অথবা তোমাদের খালাদের ঘরে, অথবা সেসব ঘরে যার চাবি তোমাদের অধিকারে রয়েছে, অথবা তোমাদের বন্ধুদের ঘরে। তোমরা একত্রে খাও অথবা আলাদা আলাদা খাও তাতে কোনও দোষ নেই। তবে তোমরা যখন কোন ঘরে প্রবেশ করবে তখন তোমরা নিজদের উপর সালাম করবে, আল্লাহর পক্ষ থেকে বরকতপূর্ণ ও পবিত্র অভিবাদনস্বরূপ। এভাবে আল্লাহ তোমাদের উদ্দেশ্যে তাঁর আয়াতসমূহ বর্ণনা করেন যাতে তোমরা বুঝতে পার।",
    "মুমিন শুধু তারাই যারা আল্লাহ ও তাঁর রাসূলের ওপর ঈমান আনে এবং তাঁর সাথে কোন সমষ্টিগত কাজে থাকলে অনুমতি না নিয়ে চলে যায় না। নিশ্চয় তোমার কাছে যারা অনুমতি চায় তারাই কেবল আল্লাহ ও তাঁর রাসূলের উপর ঈমান আনে; সুতরাং কোন প্রয়োজনে তারা তোমার কাছে বাইরে যাওয়ার অনুমতি চাইলে তাদের মধ্যে তোমার যাকে ইচ্ছা তুমি অনুমতি দেবে এবং তাদের জন্য আল্লাহর কাছে ক্ষমা প্রার্থনা কর। নিশ্চয় আল্লাহ পরম ক্ষমাশীল ও পরম দয়ালু।",
    "তোমরা পরস্পরকে যেভাবে ডাকো রাসূলকে সেভাবে ডেকো না; তোমাদের মধ্যে যারা চুপিসারে সরে পড়ে আল্লাহ অবশ্যই তাদেরকে জানেন। অতএব যারা তাঁর নির্দেশের বিরুদ্ধাচরণ করে তারা যেন তাদের ওপর বিপর্যয় নেমে আসা অথবা যন্ত্রণাদায়ক আযাব পৌঁছার ভয় করে।",
    "সাবধান, আসমানসমূহ ও যমীনে যা কিছু আছে তা আল্লাহরই; তোমরা যে অবস্থায় আছ তা তিনি অবশ্যই জানেন এবং যেদিন তাদেরকে তাঁর কাছে ফিরিয়ে নেয়া হবে সেদিন তারা যা করত তিনি তাদেরকে তা জানিয়ে দেবেন। আল্লাহ সব কিছু সম্পর্কে সম্যক জ্ঞাত।"
  ]
}