{
  "surahName": "An-Naml",
  "surahNameArabic": "النمل",
  "surahNameArabicLong": "سورة النمل",
  "surahNameTranslation": "The Ant",
  "revelationPlace": "Mecca",
  "totalAyah": 93,
  "surahNo": 27,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/27.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/027.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/27.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/027.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/27.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/027.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/27.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/027.mp3"
    }
  },
  "english": [
    "Ṭâ-Sĩn. These are the verses of the Quran; the clear Book.",
    "˹It is˺ a guide and good news for the believers:",
    "˹those˺ who establish prayer, pay alms-tax, and have sure faith in the Hereafter.",
    "As for those who do not believe in the Hereafter, We have certainly made their ˹evil˺ deeds appealing to them, so they wander blindly.",
    "It is they who will suffer a dreadful torment, and in the Hereafter they will ˹truly˺ be the greatest losers.",
    "And indeed, you ˹O Prophet˺ are receiving the Quran from the One ˹Who is˺ All-Wise, All-Knowing.",
    "˹Remember˺ when Moses said to his family, “I have spotted a fire. I will either bring you some directions from there, or a burning torch so you may warm yourselves.”",
    "But when he came to it, he was called ˹by Allah˺, “Blessed is the one at the fire, and whoever is around it! Glory be to Allah, the Lord of all worlds.",
    "O  Moses! It is truly I. I am Allah—the Almighty, All-Wise.",
    "Now, throw down your staff!” But when he saw it slithering like a snake, he ran away without looking back. ˹Allah reassured him,˺ “O Moses! Do not be afraid! Messengers should have no fear in My presence.",
    "˹Fear is˺ only for those who do wrong. But if they later mend ˹their˺ evil ˹ways˺ with good, then I am certainly All-Forgiving, Most Merciful.",
    "Now put your hand through ˹the opening of˺ your collar, it will come out ˹shining˺ white, unblemished. ˹These are two˺ of nine signs for Pharaoh and his people. They have truly been a rebellious people.”",
    "But when Our enlightening signs came to them, they said, “This is pure magic.”",
    "And, although their hearts were convinced the signs were true, they still denied them wrongfully and arrogantly. See then what was the end of the corruptors!",
    "Indeed, We granted knowledge to David and Solomon. And they said ˹in acknowledgment˺, “All praise is for Allah Who has privileged us over many of His faithful servants.”",
    "And David was succeeded by Solomon, who said, “O people! We have been taught the language of birds, and been given everything ˹we need˺. This is indeed a great privilege.”",
    "Solomon’s forces of jinn, humans, and birds were rallied for him, perfectly organized.",
    "And when they came across a valley of ants, an ant warned, “O ants! Go quickly into your homes so Solomon and his armies do not crush you, unknowingly.”",
    "So Solomon smiled in amusement at her words, and prayed, “My Lord! Inspire me to ˹always˺ be thankful for Your favours which You have blessed me and my parents with, and to do good deeds that please you. Admit me, by Your mercy, into ˹the company of˺ Your righteous servants.”",
    "˹One day˺ he inspected the birds, and wondered, “Why is it that I cannot see the hoopoe? Or could he be absent?",
    "I will surely subject him to a severe punishment, or ˹even˺ slaughter him, unless he brings me a compelling excuse.”",
    "It was not long before the bird came and said, “I have found out something you do not know. I have just come to you from Sheba with sure news.",
    "Indeed, I found a woman ruling over them, who has been given everything ˹she needs˺, and who has a magnificent throne.",
    "I found her and her people prostrating to the sun instead of Allah. For Satan has made their deeds appealing to them—hindering them from the ˹Right˺ Way and leaving them unguided—",
    "so they do not prostrate to Allah, Who brings forth what is hidden in the heavens and the earth, and knows what you ˹all˺ conceal and what you reveal.",
    "˹He is˺ Allah! There is no god ˹worthy of worship˺ except Him, the Lord of the Mighty Throne.”",
    "Solomon said, “We will see whether you are telling the truth or lying.",
    "Go with this letter of mine and deliver it to them, then stand aside and see how they will respond.”",
    "The Queen ˹later˺ announced, “O chiefs! Indeed, a noble letter has been delivered to me.",
    "It is from Solomon, and it reads: ‘In the Name of Allah—the Most Compassionate, Most Merciful.",
    "Do not be arrogant with me, but come to me, fully submitting ˹to Allah˺.’”",
    "She said, “O chiefs! Advise me in this matter of mine, for I would never make any decision without you.”",
    "They responded, “We are a people of strength and great ˹military˺ might, but the decision is yours, so decide what you will command.”",
    "She reasoned, “Indeed, when kings invade a land, they ruin it and debase its nobles. They really do so!",
    "But I will certainly send him a gift, and see what ˹response˺ my envoys will return with.”",
    "When the chief-envoy came to him, Solomon said, “Do you offer me wealth? What Allah has granted me is far greater than what He has granted you. No! It is you who rejoice in ˹receiving˺ gifts.",
    "Go back to them, for we will certainly mobilize against them forces which they can never resist, and we will drive them out from there in disgrace, fully humbled.”",
    "Solomon asked, “O chiefs! Which of you can bring me her throne before they come to me in ˹full˺ submission?”",
    "One mighty jinn responded, “I can bring it to you before you rise from this council of yours. And I am quite strong and trustworthy for this ˹task˺.”",
    "But the one who had knowledge of the Scripture said, “I can bring it to you in the blink of an eye.” So when Solomon saw it placed before him, he exclaimed, “This is by the grace of my Lord to test me whether I am grateful or ungrateful. And whoever is grateful, it is only for their own good. But whoever is ungrateful, surely my Lord is Self-Sufficient, Most Generous.”",
    "˹Then˺ Solomon said, “Disguise her throne for her so we may see whether she will recognize ˹it˺ or she will not be able to.”",
    "So when she arrived, it was said ˹to her˺, “Is your throne like this?” She replied, “It looks to be the same. We have ˹already˺ received knowledge ˹of Solomon’s prophethood˺ before this ˹miracle˺, and have submitted ˹to Allah˺.”",
    "But she had been hindered by what she used to worship instead of Allah, for she was indeed from a disbelieving people.",
    "Then she was told, “Enter the palace.” But when she saw the hall, she thought it was a body of water, so she bared her legs. Solomon said. “It is just a palace paved with crystal.” ˹At last˺ she declared, “My Lord! I have certainly wronged my soul. Now I ˹fully˺ submit myself along with Solomon to Allah, the Lord of all worlds.”",
    "And We certainly sent to the people of Thamûd their brother Ṣâliḥ, proclaiming, “Worship Allah,” but they suddenly split into two opposing groups.",
    "He urged ˹the disbelieving group˺, “O my people! Why do you ˹seek to˺ hasten the torment rather than grace? If only you sought Allah’s forgiveness so you may be shown mercy!”",
    "They replied, “You and your followers are a bad omen for us.” He responded, “Your omens are destined by Allah. In fact, you are ˹only˺ a people being tested.”",
    "And there were in the city nine ˹elite˺ men who spread corruption in the land, never doing what is right.",
    "They vowed, “Let us swear by Allah that we will take him and his family down by night. Then we will certainly say to his ˹closest˺ heirs, ‘We did not witness the murder of his family. We are definitely telling the truth.’”",
    "And ˹so˺ they made a plan, but We too made a plan, while they were unaware.",
    "See then what the consequences of their plan were: We ˹utterly˺ destroyed them and their people all together.",
    "So their homes are there, ˹but completely˺ ruined because of their wrongdoing. Surely in this is a lesson for people of knowledge.",
    "And We delivered those who were faithful and were mindful ˹of Allah˺.",
    "And ˹remember˺ Lot, when he rebuked ˹the men of˺ his people, “Do you commit that shameful deed while you can see ˹one another˺?",
    "Do you really lust after men instead of women? In fact, you are ˹only˺ a people acting ignorantly.”",
    "But his people’s only response was to say, “Expel Lot’s followers from your land! They are a people who wish to remain chaste!”",
    "So We delivered him and his family, except his wife. We had destined her to be one of the doomed.",
    "And We poured upon them a rain ˹of brimstone˺. How evil was the rain of those who had been warned!",
    "Say, ˹O Prophet,˺ “Praise be to Allah, and peace be upon the servants He has chosen.” ˹Ask the disbelievers,˺ “Which is better: Allah or whatever ˹gods˺ they associate ˹with Him˺?”",
    "Or ˹ask them,˺ “Who created the heavens and the earth, and sends down rain for you from the sky, by which We cause delightful gardens to grow? You could never cause their trees to grow. Was it another god besides Allah?” Absolutely not! But they are a people who set up equals ˹to Allah˺!",
    "Or ˹ask them,˺ “Who made the earth a place of settlement, caused rivers to flow through it, placed firm mountains upon it, and set a barrier between ˹fresh and salt˺ bodies of water? Was it another god besides Allah?” Absolutely not! But most of them do not know.",
    "Or ˹ask them,˺ “Who responds to the distressed when they cry to Him, relieving ˹their˺ affliction, and ˹Who˺ makes you successors in the earth? Is it another god besides Allah? Yet you are hardly mindful!”",
    "Or ˹ask them,˺ “Who guides you in the darkness of the land and sea, and sends the winds ushering in His mercy? Is it another god besides Allah? Exalted is Allah above what they associate ˹with Him˺!",
    "Or ˹ask them,˺ “Who originates the creation then resurrects it, and gives you provisions from the heavens and the earth? Is it another god besides Allah?” Say, ˹O Prophet,˺ “Show ˹me˺ your proof, if what you say is true.”",
    "Say, ˹O Prophet,˺ “None in the heavens and the earth has knowledge of the unseen except Allah. Nor do they know when they will be resurrected.",
    "No! Their knowledge of the Hereafter amounts to ignorance. In fact, they are in doubt about it. In truth, they are ˹totally˺ blind to it.",
    "The disbelievers ask, “When we and our fathers are reduced to dust, will we really be brought forth ˹alive˺?",
    "We have already been promised this, as well as our forefathers earlier. This is nothing but ancient fables!”",
    "Say, ˹O Prophet,˺ “Travel throughout the land and see the fate of the wicked.”",
    "Do not grieve for them, nor be distressed by their schemes.",
    "They ask ˹the believers˺, “When will this threat come to pass, if what you say is true?”",
    "Say, ˹O Prophet,˺ “Perhaps some of what you seek to hasten is close at hand.”",
    "Surely your Lord is ever Bountiful to humanity, but most of them are ungrateful.",
    "And surely your Lord knows what their hearts conceal and what they reveal.",
    "For there is nothing hidden in the heavens or the earth without being ˹written˺ in a perfect Record.",
    "Indeed, this Quran clarifies for the Children of Israel most of what they differ over.",
    "And it is truly a guide and mercy for the believers.",
    "Your Lord will certainly judge between them by His justice, for He is the Almighty, All-Knowing.",
    "So put your trust in Allah, for you are surely upon the ˹Path of˺ clear truth.",
    "You certainly cannot make the dead hear ˹the truth˺. Nor can you make the deaf hear the call when they turn their backs and walk away.",
    "Nor can you lead the blind out of their misguidance. You can make none hear ˹the truth˺ except those who believe in Our revelations, ˹fully˺ submitting ˹to Allah˺.",
    "And when the decree ˹of the Hour˺ comes to pass against them, We will bring forth for them a beast from the earth, telling them that the people had no sure faith in Our revelations.",
    "˹Watch for˺ the Day We will gather from every faith-community a group of those who denied Our revelations, and they will be driven in ranks.",
    "When they ˹finally˺ come before their Lord, He will ask ˹them˺, “Did you deny My revelations without ˹even˺ comprehending them? Or what ˹exactly˺ did you do?”",
    "And the decree ˹of torment˺ will be justified against them for their wrongdoing, leaving them speechless.",
    "Do they not see that We made the night for them to rest in and the day bright? Surely in this are signs for those who believe.",
    "And ˹beware of˺ the Day the Trumpet will be blown, and all those in the heavens and all those on the earth will be horrified ˹to the point of death˺, except those Allah wills ˹to spare˺. And all will come before Him, fully humbled.",
    "Now you see the mountains, thinking they are firmly fixed, but they are travelling ˹just˺ like clouds. ˹That is˺ the design of Allah, Who has perfected everything. Surely He is All-Aware of what you do.",
    "Whoever comes with a good deed will be rewarded with what is better, and they will be secure from the horror on that Day.",
    "And whoever comes with an evil deed will be hurled face-first into the Fire. Are you rewarded except for what you used to do?",
    "Say, ˹O Prophet,˺ “I have only been commanded to worship the Lord of this city ˹of Mecca˺, Who has made it sacred, and to Him belongs everything. And I am commanded to be one of those who ˹fully˺ submit ˹to Him˺",
    "and to recite the Quran.” Then whoever chooses to be guided, it is only for their own good. But whoever chooses to stray, say, ˹O Prophet,˺ “I am only a warner.”",
    "And say, “All praise is for Allah! He will show you His signs, and you will recognize them. And your Lord is never unaware of what you do.”"
  ],
  "arabic1": [
    "طٰسٓ ۫ تِلْكَ اٰیٰتُ الْقُرْاٰنِ وَكِتَابٍ مُّبِیْنٍ",
    "هُدًی وَّبُشْرٰی لِلْمُؤْمِنِیْنَ",
    "الَّذِیْنَ یُقِیْمُوْنَ الصَّلٰوةَ وَیُؤْتُوْنَ الزَّكٰوةَ وَهُمْ بِالْاٰخِرَةِ هُمْ یُوْقِنُوْنَ",
    "اِنَّ الَّذِیْنَ لَا یُؤْمِنُوْنَ بِالْاٰخِرَةِ زَیَّنَّا لَهُمْ اَعْمَالَهُمْ فَهُمْ یَعْمَهُوْنَ",
    "اُولٰٓىِٕكَ الَّذِیْنَ لَهُمْ سُوْٓءُ الْعَذَابِ وَهُمْ فِی الْاٰخِرَةِ هُمُ الْاَخْسَرُوْنَ",
    "وَاِنَّكَ لَتُلَقَّی الْقُرْاٰنَ مِنْ لَّدُنْ حَكِیْمٍ عَلِیْمٍ",
    "اِذْ قَالَ مُوْسٰی لِاَهْلِهٖۤ اِنِّیْۤ اٰنَسْتُ نَارًا سَاٰتِیْكُمْ مِّنْهَا بِخَبَرٍ اَوْ اٰتِیْكُمْ بِشِهَابٍ قَبَسٍ لَّعَلَّكُمْ تَصْطَلُوْنَ",
    "فَلَمَّا جَآءَهَا نُوْدِیَ اَنْ بُوْرِكَ مَنْ فِی النَّارِ وَمَنْ حَوْلَهَا وَسُبْحٰنَ اللّٰهِ رَبِّ الْعٰلَمِیْنَ",
    "یٰمُوْسٰۤی اِنَّهٗۤ اَنَا اللّٰهُ الْعَزِیْزُ الْحَكِیْمُ",
    "وَاَلْقِ عَصَاكَ فَلَمَّا رَاٰهَا تَهْتَزُّ كَاَنَّهَا جَآنٌّ وَّلّٰی مُدْبِرًا وَّلَمْ یُعَقِّبْ یٰمُوْسٰی لَا تَخَفْ ۫ اِنِّیْ لَا یَخَافُ لَدَیَّ الْمُرْسَلُوْنَ ۗۖ",
    "اِلَّا مَنْ ظَلَمَ ثُمَّ بَدَّلَ حُسْنًا بَعْدَ سُوْٓءٍ فَاِنِّیْ غَفُوْرٌ رَّحِیْمٌ",
    "وَاَدْخِلْ یَدَكَ فِیْ جَیْبِكَ تَخْرُجْ بَیْضَآءَ مِنْ غَیْرِ سُوْٓءٍ ۫ فِیْ تِسْعِ اٰیٰتٍ اِلٰی فِرْعَوْنَ وَقَوْمِهٖ اِنَّهُمْ كَانُوْا قَوْمًا فٰسِقِیْنَ",
    "فَلَمَّا جَآءَتْهُمْ اٰیٰتُنَا مُبْصِرَةً قَالُوْا هٰذَا سِحْرٌ مُّبِیْنٌ",
    "وَجَحَدُوْا بِهَا وَاسْتَیْقَنَتْهَاۤ اَنْفُسُهُمْ ظُلْمًا وَّعُلُوًّا فَانْظُرْ كَیْفَ كَانَ عَاقِبَةُ الْمُفْسِدِیْنَ",
    "وَلَقَدْ اٰتَیْنَا دَاوٗدَ وَسُلَیْمٰنَ عِلْمًا وَقَالَا الْحَمْدُ لِلّٰهِ الَّذِیْ فَضَّلَنَا عَلٰی كَثِیْرٍ مِّنْ عِبَادِهِ الْمُؤْمِنِیْنَ",
    "وَوَرِثَ سُلَیْمٰنُ دَاوٗدَ وَقَالَ یٰۤاَیُّهَا النَّاسُ عُلِّمْنَا مَنْطِقَ الطَّیْرِ وَاُوْتِیْنَا مِنْ كُلِّ شَیْءٍ اِنَّ هٰذَا لَهُوَ الْفَضْلُ الْمُبِیْنُ",
    "وَحُشِرَ لِسُلَیْمٰنَ جُنُوْدُهٗ مِنَ الْجِنِّ وَالْاِنْسِ وَالطَّیْرِ فَهُمْ یُوْزَعُوْنَ",
    "حَتّٰۤی اِذَاۤ اَتَوْا عَلٰی وَادِ النَّمْلِ قَالَتْ نَمْلَةٌ یّٰۤاَیُّهَا النَّمْلُ ادْخُلُوْا مَسٰكِنَكُمْ لَا یَحْطِمَنَّكُمْ سُلَیْمٰنُ وَجُنُوْدُهٗ وَهُمْ لَا یَشْعُرُوْنَ",
    "فَتَبَسَّمَ ضَاحِكًا مِّنْ قَوْلِهَا وَقَالَ رَبِّ اَوْزِعْنِیْۤ اَنْ اَشْكُرَ نِعْمَتَكَ الَّتِیْۤ اَنْعَمْتَ عَلَیَّ وَعَلٰی وَالِدَیَّ وَاَنْ اَعْمَلَ صَالِحًا تَرْضٰىهُ وَاَدْخِلْنِیْ بِرَحْمَتِكَ فِیْ عِبَادِكَ الصّٰلِحِیْنَ",
    "وَتَفَقَّدَ الطَّیْرَ فَقَالَ مَا لِیَ لَاۤ اَرَی الْهُدْهُدَ ۖ اَمْ كَانَ مِنَ الْغَآىِٕبِیْنَ",
    "لَاُعَذِّبَنَّهٗ عَذَابًا شَدِیْدًا اَوْ لَاَاذْبَحَنَّهٗۤ اَوْ لَیَاْتِیَنِّیْ بِسُلْطٰنٍ مُّبِیْنٍ",
    "فَمَكَثَ غَیْرَ بَعِیْدٍ فَقَالَ اَحَطْتُّ بِمَا لَمْ تُحِطْ بِهٖ وَجِئْتُكَ مِنْ سَبَاٍ بِنَبَاٍ یَّقِیْنٍ",
    "اِنِّیْ وَجَدْتُّ امْرَاَةً تَمْلِكُهُمْ وَاُوْتِیَتْ مِنْ كُلِّ شَیْءٍ وَّلَهَا عَرْشٌ عَظِیْمٌ",
    "وَجَدْتُّهَا وَقَوْمَهَا یَسْجُدُوْنَ لِلشَّمْسِ مِنْ دُوْنِ اللّٰهِ وَزَیَّنَ لَهُمُ الشَّیْطٰنُ اَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِیْلِ فَهُمْ لَا یَهْتَدُوْنَ",
    "اَلَّا یَسْجُدُوْا لِلّٰهِ الَّذِیْ یُخْرِجُ الْخَبْءَ فِی السَّمٰوٰتِ وَالْاَرْضِ وَیَعْلَمُ مَا تُخْفُوْنَ وَمَا تُعْلِنُوْنَ",
    "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ رَبُّ الْعَرْشِ الْعَظِیْمِ",
    "قَالَ سَنَنْظُرُ اَصَدَقْتَ اَمْ كُنْتَ مِنَ الْكٰذِبِیْنَ",
    "اِذْهَبْ بِّكِتٰبِیْ هٰذَا فَاَلْقِهْ اِلَیْهِمْ ثُمَّ تَوَلَّ عَنْهُمْ فَانْظُرْ مَاذَا یَرْجِعُوْنَ",
    "قَالَتْ یٰۤاَیُّهَا الْمَلَؤُا اِنِّیْۤ اُلْقِیَ اِلَیَّ كِتٰبٌ كَرِیْمٌ",
    "اِنَّهٗ مِنْ سُلَیْمٰنَ وَاِنَّهٗ بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "اَلَّا تَعْلُوْا عَلَیَّ وَاْتُوْنِیْ مُسْلِمِیْنَ",
    "قَالَتْ یٰۤاَیُّهَا الْمَلَؤُا اَفْتُوْنِیْ فِیْۤ اَمْرِیْ مَا كُنْتُ قَاطِعَةً اَمْرًا حَتّٰی تَشْهَدُوْنِ",
    "قَالُوْا نَحْنُ اُولُوْا قُوَّةٍ وَّاُولُوْا بَاْسٍ شَدِیْدٍ وَّالْاَمْرُ اِلَیْكِ فَانْظُرِیْ مَاذَا تَاْمُرِیْنَ",
    "قَالَتْ اِنَّ الْمُلُوْكَ اِذَا دَخَلُوْا قَرْیَةً اَفْسَدُوْهَا وَجَعَلُوْۤا اَعِزَّةَ اَهْلِهَاۤ اَذِلَّةً وَكَذٰلِكَ یَفْعَلُوْنَ",
    "وَاِنِّیْ مُرْسِلَةٌ اِلَیْهِمْ بِهَدِیَّةٍ فَنٰظِرَةٌ بِمَ یَرْجِعُ الْمُرْسَلُوْنَ",
    "فَلَمَّا جَآءَ سُلَیْمٰنَ قَالَ اَتُمِدُّوْنَنِ بِمَالٍ فَمَاۤ اٰتٰىنِ اللّٰهُ خَیْرٌ مِّمَّاۤ اٰتٰىكُمْ بَلْ اَنْتُمْ بِهَدِیَّتِكُمْ تَفْرَحُوْنَ",
    "اِرْجِعْ اِلَیْهِمْ فَلَنَاْتِیَنَّهُمْ بِجُنُوْدٍ لَّا قِبَلَ لَهُمْ بِهَا وَلَنُخْرِجَنَّهُمْ مِّنْهَاۤ اَذِلَّةً وَّهُمْ صٰغِرُوْنَ",
    "قَالَ یٰۤاَیُّهَا الْمَلَؤُا اَیُّكُمْ یَاْتِیْنِیْ بِعَرْشِهَا قَبْلَ اَنْ یَّاْتُوْنِیْ مُسْلِمِیْنَ",
    "قَالَ عِفْرِیْتٌ مِّنَ الْجِنِّ اَنَا اٰتِیْكَ بِهٖ قَبْلَ اَنْ تَقُوْمَ مِنْ مَّقَامِكَ وَاِنِّیْ عَلَیْهِ لَقَوِیٌّ اَمِیْنٌ",
    "قَالَ الَّذِیْ عِنْدَهٗ عِلْمٌ مِّنَ الْكِتٰبِ اَنَا اٰتِیْكَ بِهٖ قَبْلَ اَنْ یَّرْتَدَّ اِلَیْكَ طَرْفُكَ فَلَمَّا رَاٰهُ مُسْتَقِرًّا عِنْدَهٗ قَالَ هٰذَا مِنْ فَضْلِ رَبِّیْ ۫ لِیَبْلُوَنِیْۤ ءَاَشْكُرُ اَمْ اَكْفُرُ وَمَنْ شَكَرَ فَاِنَّمَا یَشْكُرُ لِنَفْسِهٖ وَمَنْ كَفَرَ فَاِنَّ رَبِّیْ غَنِیٌّ كَرِیْمٌ",
    "قَالَ نَكِّرُوْا لَهَا عَرْشَهَا نَنْظُرْ اَتَهْتَدِیْۤ اَمْ تَكُوْنُ مِنَ الَّذِیْنَ لَا یَهْتَدُوْنَ",
    "فَلَمَّا جَآءَتْ قِیْلَ اَهٰكَذَا عَرْشُكِ قَالَتْ كَاَنَّهٗ هُوَ وَاُوْتِیْنَا الْعِلْمَ مِنْ قَبْلِهَا وَكُنَّا مُسْلِمِیْنَ",
    "وَصَدَّهَا مَا كَانَتْ تَّعْبُدُ مِنْ دُوْنِ اللّٰهِ اِنَّهَا كَانَتْ مِنْ قَوْمٍ كٰفِرِیْنَ",
    "قِیْلَ لَهَا ادْخُلِی الصَّرْحَ فَلَمَّا رَاَتْهُ حَسِبَتْهُ لُجَّةً وَّكَشَفَتْ عَنْ سَاقَیْهَا قَالَ اِنَّهٗ صَرْحٌ مُّمَرَّدٌ مِّنْ قَوَارِیْرَ قَالَتْ رَبِّ اِنِّیْ ظَلَمْتُ نَفْسِیْ وَاَسْلَمْتُ مَعَ سُلَیْمٰنَ لِلّٰهِ رَبِّ الْعٰلَمِیْنَ",
    "وَلَقَدْ اَرْسَلْنَاۤ اِلٰی ثَمُوْدَ اَخَاهُمْ صٰلِحًا اَنِ اعْبُدُوا اللّٰهَ فَاِذَا هُمْ فَرِیْقٰنِ یَخْتَصِمُوْنَ",
    "قَالَ یٰقَوْمِ لِمَ تَسْتَعْجِلُوْنَ بِالسَّیِّئَةِ قَبْلَ الْحَسَنَةِ لَوْلَا تَسْتَغْفِرُوْنَ اللّٰهَ لَعَلَّكُمْ تُرْحَمُوْنَ",
    "قَالُوا اطَّیَّرْنَا بِكَ وَبِمَنْ مَّعَكَ قَالَ طٰٓىِٕرُكُمْ عِنْدَ اللّٰهِ بَلْ اَنْتُمْ قَوْمٌ تُفْتَنُوْنَ",
    "وَكَانَ فِی الْمَدِیْنَةِ تِسْعَةُ رَهْطٍ یُّفْسِدُوْنَ فِی الْاَرْضِ وَلَا یُصْلِحُوْنَ",
    "قَالُوْا تَقَاسَمُوْا بِاللّٰهِ لَنُبَیِّتَنَّهٗ وَاَهْلَهٗ ثُمَّ لَنَقُوْلَنَّ لِوَلِیِّهٖ مَا شَهِدْنَا مَهْلِكَ اَهْلِهٖ وَاِنَّا لَصٰدِقُوْنَ",
    "وَمَكَرُوْا مَكْرًا وَّمَكَرْنَا مَكْرًا وَّهُمْ لَا یَشْعُرُوْنَ",
    "فَانْظُرْ كَیْفَ كَانَ عَاقِبَةُ مَكْرِهِمْ اَنَّا دَمَّرْنٰهُمْ وَقَوْمَهُمْ اَجْمَعِیْنَ",
    "فَتِلْكَ بُیُوْتُهُمْ خَاوِیَةً بِمَا ظَلَمُوْا اِنَّ فِیْ ذٰلِكَ لَاٰیَةً لِّقَوْمٍ یَّعْلَمُوْنَ",
    "وَاَنْجَیْنَا الَّذِیْنَ اٰمَنُوْا وَكَانُوْا یَتَّقُوْنَ",
    "وَلُوْطًا اِذْ قَالَ لِقَوْمِهٖۤ اَتَاْتُوْنَ الْفَاحِشَةَ وَاَنْتُمْ تُبْصِرُوْنَ",
    "اَىِٕنَّكُمْ لَتَاْتُوْنَ الرِّجَالَ شَهْوَةً مِّنْ دُوْنِ النِّسَآءِ بَلْ اَنْتُمْ قَوْمٌ تَجْهَلُوْنَ",
    "فَمَا كَانَ جَوَابَ قَوْمِهٖۤ اِلَّاۤ اَنْ قَالُوْۤا اَخْرِجُوْۤا اٰلَ لُوْطٍ مِّنْ قَرْیَتِكُمْ اِنَّهُمْ اُنَاسٌ یَّتَطَهَّرُوْنَ",
    "فَاَنْجَیْنٰهُ وَاَهْلَهٗۤ اِلَّا امْرَاَتَهٗ قَدَّرْنٰهَا مِنَ الْغٰبِرِیْنَ",
    "وَاَمْطَرْنَا عَلَیْهِمْ مَّطَرًا فَسَآءَ مَطَرُ الْمُنْذَرِیْنَ",
    "قُلِ الْحَمْدُ لِلّٰهِ وَسَلٰمٌ عَلٰی عِبَادِهِ الَّذِیْنَ اصْطَفٰی ءٰٓاللّٰهُ خَیْرٌ اَمَّا یُشْرِكُوْنَ",
    "اَمَّنْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ وَاَنْزَلَ لَكُمْ مِّنَ السَّمَآءِ مَآءً فَاَنْۢبَتْنَا بِهٖ حَدَآىِٕقَ ذَاتَ بَهْجَةٍ مَا كَانَ لَكُمْ اَنْ تُنْۢبِتُوْا شَجَرَهَا ءَاِلٰهٌ مَّعَ اللّٰهِ بَلْ هُمْ قَوْمٌ یَّعْدِلُوْنَ",
    "اَمَّنْ جَعَلَ الْاَرْضَ قَرَارًا وَّجَعَلَ خِلٰلَهَاۤ اَنْهٰرًا وَّجَعَلَ لَهَا رَوَاسِیَ وَجَعَلَ بَیْنَ الْبَحْرَیْنِ حَاجِزًا ءَاِلٰهٌ مَّعَ اللّٰهِ بَلْ اَكْثَرُهُمْ لَا یَعْلَمُوْنَ",
    "اَمَّنْ یُّجِیْبُ الْمُضْطَرَّ اِذَا دَعَاهُ وَیَكْشِفُ السُّوْٓءَ وَیَجْعَلُكُمْ خُلَفَآءَ الْاَرْضِ ءَاِلٰهٌ مَّعَ اللّٰهِ قَلِیْلًا مَّا تَذَكَّرُوْنَ",
    "اَمَّنْ یَّهْدِیْكُمْ فِیْ ظُلُمٰتِ الْبَرِّ وَالْبَحْرِ وَمَنْ یُّرْسِلُ الرِّیٰحَ بُشْرًاۢ بَیْنَ یَدَیْ رَحْمَتِهٖ ءَاِلٰهٌ مَّعَ اللّٰهِ تَعٰلَی اللّٰهُ عَمَّا یُشْرِكُوْنَ",
    "اَمَّنْ یَّبْدَؤُا الْخَلْقَ ثُمَّ یُعِیْدُهٗ وَمَنْ یَّرْزُقُكُمْ مِّنَ السَّمَآءِ وَالْاَرْضِ ءَاِلٰهٌ مَّعَ اللّٰهِ قُلْ هَاتُوْا بُرْهَانَكُمْ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "قُلْ لَّا یَعْلَمُ مَنْ فِی السَّمٰوٰتِ وَالْاَرْضِ الْغَیْبَ اِلَّا اللّٰهُ وَمَا یَشْعُرُوْنَ اَیَّانَ یُبْعَثُوْنَ",
    "بَلِ ادّٰرَكَ عِلْمُهُمْ فِی الْاٰخِرَةِ ۫ بَلْ هُمْ فِیْ شَكٍّ مِّنْهَا ۫ بَلْ هُمْ مِّنْهَا عَمُوْنَ",
    "وَقَالَ الَّذِیْنَ كَفَرُوْۤا ءَاِذَا كُنَّا تُرٰبًا وَّاٰبَآؤُنَاۤ اَىِٕنَّا لَمُخْرَجُوْنَ",
    "لَقَدْ وُعِدْنَا هٰذَا نَحْنُ وَاٰبَآؤُنَا مِنْ قَبْلُ اِنْ هٰذَاۤ اِلَّاۤ اَسَاطِیْرُ الْاَوَّلِیْنَ",
    "قُلْ سِیْرُوْا فِی الْاَرْضِ فَانْظُرُوْا كَیْفَ كَانَ عَاقِبَةُ الْمُجْرِمِیْنَ",
    "وَلَا تَحْزَنْ عَلَیْهِمْ وَلَا تَكُنْ فِیْ ضَیْقٍ مِّمَّا یَمْكُرُوْنَ",
    "وَیَقُوْلُوْنَ مَتٰی هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "قُلْ عَسٰۤی اَنْ یَّكُوْنَ رَدِفَ لَكُمْ بَعْضُ الَّذِیْ تَسْتَعْجِلُوْنَ",
    "وَاِنَّ رَبَّكَ لَذُوْ فَضْلٍ عَلَی النَّاسِ وَلٰكِنَّ اَكْثَرَهُمْ لَا یَشْكُرُوْنَ",
    "وَاِنَّ رَبَّكَ لَیَعْلَمُ مَا تُكِنُّ صُدُوْرُهُمْ وَمَا یُعْلِنُوْنَ",
    "وَمَا مِنْ غَآىِٕبَةٍ فِی السَّمَآءِ وَالْاَرْضِ اِلَّا فِیْ كِتٰبٍ مُّبِیْنٍ",
    "اِنَّ هٰذَا الْقُرْاٰنَ یَقُصُّ عَلٰی بَنِیْۤ اِسْرَآءِیْلَ اَكْثَرَ الَّذِیْ هُمْ فِیْهِ یَخْتَلِفُوْنَ",
    "وَاِنَّهٗ لَهُدًی وَّرَحْمَةٌ لِّلْمُؤْمِنِیْنَ",
    "اِنَّ رَبَّكَ یَقْضِیْ بَیْنَهُمْ بِحُكْمِهٖ وَهُوَ الْعَزِیْزُ الْعَلِیْمُ",
    "فَتَوَكَّلْ عَلَی اللّٰهِ اِنَّكَ عَلَی الْحَقِّ الْمُبِیْنِ",
    "اِنَّكَ لَا تُسْمِعُ الْمَوْتٰی وَلَا تُسْمِعُ الصُّمَّ الدُّعَآءَ اِذَا وَلَّوْا مُدْبِرِیْنَ",
    "وَمَاۤ اَنْتَ بِهٰدِی الْعُمْیِ عَنْ ضَلٰلَتِهِمْ اِنْ تُسْمِعُ اِلَّا مَنْ یُّؤْمِنُ بِاٰیٰتِنَا فَهُمْ مُّسْلِمُوْنَ",
    "وَاِذَا وَقَعَ الْقَوْلُ عَلَیْهِمْ اَخْرَجْنَا لَهُمْ دَآبَّةً مِّنَ الْاَرْضِ تُكَلِّمُهُمْ اَنَّ النَّاسَ كَانُوْا بِاٰیٰتِنَا لَا یُوْقِنُوْنَ",
    "وَیَوْمَ نَحْشُرُ مِنْ كُلِّ اُمَّةٍ فَوْجًا مِّمَّنْ یُّكَذِّبُ بِاٰیٰتِنَا فَهُمْ یُوْزَعُوْنَ",
    "حَتّٰۤی اِذَا جَآءُوْ قَالَ اَكَذَّبْتُمْ بِاٰیٰتِیْ وَلَمْ تُحِیْطُوْا بِهَا عِلْمًا اَمَّاذَا كُنْتُمْ تَعْمَلُوْنَ",
    "وَوَقَعَ الْقَوْلُ عَلَیْهِمْ بِمَا ظَلَمُوْا فَهُمْ لَا یَنْطِقُوْنَ",
    "اَلَمْ یَرَوْا اَنَّا جَعَلْنَا الَّیْلَ لِیَسْكُنُوْا فِیْهِ وَالنَّهَارَ مُبْصِرًا اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّقَوْمٍ یُّؤْمِنُوْنَ",
    "وَیَوْمَ یُنْفَخُ فِی الصُّوْرِ فَفَزِعَ مَنْ فِی السَّمٰوٰتِ وَمَنْ فِی الْاَرْضِ اِلَّا مَنْ شَآءَ اللّٰهُ وَكُلٌّ اَتَوْهُ دٰخِرِیْنَ",
    "وَتَرَی الْجِبَالَ تَحْسَبُهَا جَامِدَةً وَّهِیَ تَمُرُّ مَرَّ السَّحَابِ صُنْعَ اللّٰهِ الَّذِیْۤ اَتْقَنَ كُلَّ شَیْءٍ اِنَّهٗ خَبِیْرٌ بِمَا تَفْعَلُوْنَ",
    "مَنْ جَآءَ بِالْحَسَنَةِ فَلَهٗ خَیْرٌ مِّنْهَا وَهُمْ مِّنْ فَزَعٍ یَّوْمَىِٕذٍ اٰمِنُوْنَ",
    "وَمَنْ جَآءَ بِالسَّیِّئَةِ فَكُبَّتْ وُجُوْهُهُمْ فِی النَّارِ هَلْ تُجْزَوْنَ اِلَّا مَا كُنْتُمْ تَعْمَلُوْنَ",
    "اِنَّمَاۤ اُمِرْتُ اَنْ اَعْبُدَ رَبَّ هٰذِهِ الْبَلْدَةِ الَّذِیْ حَرَّمَهَا وَلَهٗ كُلُّ شَیْءٍ وَّاُمِرْتُ اَنْ اَكُوْنَ مِنَ الْمُسْلِمِیْنَ",
    "وَاَنْ اَتْلُوَا الْقُرْاٰنَ فَمَنِ اهْتَدٰی فَاِنَّمَا یَهْتَدِیْ لِنَفْسِهٖ وَمَنْ ضَلَّ فَقُلْ اِنَّمَاۤ اَنَا مِنَ الْمُنْذِرِیْنَ",
    "وَقُلِ الْحَمْدُ لِلّٰهِ سَیُرِیْكُمْ اٰیٰتِهٖ فَتَعْرِفُوْنَهَا وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ"
  ],
  "bengali": [
    "ত্ব-সীন; এগুলো আল-কুরআন ও সুস্পষ্ট কিতাবের আয়াত।",
    "মুমিনদের জন্য হিদায়াত ও সুসংবাদ।",
    "যারা সালাত কায়েম করে এবং যাকাত দেয়। আর তারাই আখিরাতের প্রতি নিশ্চিত বিশ্বাস রাখে।",
    "নিশ্চয় যারা আখিরাতে বিশ্বাস করে না আমি তাদের জন্য তাদের আমলসমূহকে সুশোভিত করে দিয়েছি। ফলে তারা বিভ্রান্ত হয়ে ঘুরে বেড়ায়।",
    "এদের জন্যই রয়েছে নিকৃষ্ট আযাব। আর এরাই আখিরাতে সর্বাধিক ক্ষতিগ্রস্ত।",
    "আর নিশ্চয় তুমি প্রজ্ঞাময় মহাজ্ঞানীর পক্ষ থেকে আল-কুরআনপ্রাপ্ত।",
    "স্মরণ কর, যখন মূসা তার পরিবারবর্গকে বলল, নিশ্চয় আমি আগুন দেখেছি। শীঘ্রই আমি সেখান থেকে তোমাদের জন্য কোন খবর নিয়ে আসব অথবা তোমাদের জন্য জ্বলন্ত আঙ্গার নিয়ে আসব। যাতে তোমরা আগুন পোহাতে পার।",
    "তারপর সে যখন সেখানে এসে পৌঁছল, তখন ডেকে বলা হল, ‘বরকতময় যা এ আলোর মধ্যে ও এর চারপাশে আছে। আর সৃষ্টিকুলের রব আল্লাহ মহাপবিত্র, মহিমান্বিত’।",
    "হে মূসা, নিশ্চয় আমিই আল্লাহ, মহাপরাক্রমশালী, মহাপ্রজ্ঞাময়।",
    "আর তুমি তোমার লাঠি নিক্ষেপ কর। তারপর যখন সে ওটাকে সাপের মত ছোটাছুটি করতে দেখল, তখন সে পেছনের দিকে ছুটতে লাগল এবং ফিরে তাকাল না। ‘হে মূসা! তুমি ভয় করো না, নিশ্চয় আমার কাছে রাসূলগণ ভয় পায় না’।",
    "‘তবে যে যুল্‌ম করে। তারপর অসৎকাজের পরিবর্তে সৎকাজ করে, তবে অবশ্যই আমি অধিক ক্ষমাশীল, পরম দয়ালু’।",
    "‘আর তুমি তোমার হাত বগলে প্রবেশ করাও, তা দোষমুক্ত শুভ্র অবস্থায় বের হয়ে আসবে। ফির‘আউন ও তার সম্প্রদায়ের কাছে আনীত নয়টি নিদর্শনের অন্তর্ভুক্ত। নিশ্চয় তারা ছিল ফাসিক সম্প্রদায়’।",
    "তারপর যখন আমার নিদর্শনগুলো দৃশ্যমান হয়ে তাদের কাছে আসল, তখন তারা বলল, এটা তো সুস্পষ্ট যাদু।",
    "আর তারা অন্যায় ও উদ্ধতভাবে নিদর্শনগুলোকে প্রত্যাখ্যান করল। অথচ তাদের অন্তর তা নিশ্চিত বিশ্বাস করেছিল। অতএব দেখ, ফাসাদ সৃষ্টিকারীদের পরিণাম কেমন হয়েছিল।",
    "আর অবশ্যই আমি দাঊদ ও সুলাইমানকে জ্ঞান দান করেছি এবং তারা উভয়ে বলল, ‘সকল প্রশংসা আল্লাহর জন্যই, যিনি তাঁর অনেক মুমিন বান্দাদের উপর আমাদেরকে মর্যাদা দান করেছেন’।",
    "আর সুলাইমান দাঊদের ওয়ারিস হল এবং সে বলল, ‘হে মানুষ, আমাদেরকে পাখির ভাষা শেখানো হয়েছে এবং আমাদেরকে সকল কিছু দেয়া হয়েছে। নিশ্চয় এটা সুস্পষ্ট অনুগ্রহ’।",
    "আর সুলাইমানের জন্য তার সেনাবাহিনী থেকে জিন, মানুষ ও পাখিদের সমবেত করা হল। তারপর এদেরকে বিন্যস্ত করা হল।",
    "অবশেষে যখন তারা পিপড়ার উপত্যকায় পৌঁছল তখন এক পিপড়া বলল, ‘ওহে পিপড়ার দল, তোমরা তোমাদের বাসস্থানে প্রবেশ কর। সুলাইমান ও তার বাহিনী তোমাদেরকে যেন অজ্ঞাতসারে পিষ্ট করে মারতে না পারে’।",
    "তারপর সুলাইমান তার কথায় মুচকি হাসল এবং বলল, ‘হে আমার রব, তুমি আমার প্রতি ও আমার পিতা-মাতার প্রতি যে অনুগ্রহ করেছ তার জন্য আমাকে তোমার শুকরিয়া আদায় করার তাওফীক দাও। আর আমি যাতে এমন সৎকাজ করতে পারি যা তুমি পছন্দ কর। আর তোমার অনুগ্রহে তুমি আমাকে তোমার সৎকর্মপরায়ণ বান্দাদের অন্তর্ভুক্ত কর’।",
    "আর সুলাইমান পাখিদের খোঁজ খবর নিল। তারপর সে বলল, ‘কী ব্যাপার, আমি হুদহুদকে দেখছি না; নাকি সে অনুপস্থিতদের অন্তর্ভুক্ত’?",
    "‘অবশ্যই আমি তাকে কঠিন আযাব দেব অথবা তাকে যবেহ করব। অথবা সে আমার কাছে সুস্পষ্ট প্রমাণ নিয়ে আসবে’।",
    "তারপর অনতিবিলম্বে হুদহুদ এসে বলল, ‘আমি যা অবগত হয়েছি আপনি তা অবগত নন, আমি সাবা থেকে আপনার জন্য নিশ্চিত খবর নিয়ে এসেছি’।",
    "‘আমি এক নারীকে দেখতে পেলাম, সে তাদের উপর রাজত্ব করছে। তাকে দেয়া হয়েছে সব কিছু। আর তার আছে এক বিশাল সিংহাসন’।",
    "‘আমি তাকে ও তার কওমকে দেখতে পেলাম তারা আল্লাহর পরিবর্তে সূর্যকে সিজদা করছে। আর শয়তান তাদের কার্যাবলীকে তাদের জন্য সৌন্দর্যমন্ডিত করে দিয়েছে এবং তাদেরকে সৎপথ থেকে নিবৃত করেছে, ফলে তারা হিদায়াত পায় না’।",
    "যাতে তারা আল্লাহকে সিজদা না করে, যিনি আসমান ও যমীনের লুকায়িত বস্তুকে বের করেন। আর তোমরা যা গোপন কর এবং তোমরা যা প্রকাশ কর তিনি সবই জানেন।",
    "আল্লাহ ছাড়া সত্যিকারের কোন ইলাহ নেই। তিনি মহা আরশের রব।[সাজদাহ]",
    "সুলাইমান বলল, আমরা দেখব, ‘তুমি কি সত্য বলেছ, নাকি তুমি মিথ্যাবাদীদের অন্তর্ভুক্ত’।",
    "‘তুমি আমার এ পত্র নিয়ে যাও। অতঃপর এটা তাদের কাছে নিক্ষেপ কর, তারপর তাদের কাছ থেকে সরে থাক এবং দেখ, তারা কী জবাব দেয়’?",
    "সে (রাণী) বলল, ‘হে পারিষদবর্গ! নিশ্চয় আমাকে এক সম্মানজনক পত্র দেয়া হয়েছে’।",
    "‘নিশ্চয় এটা সুলাইমানের পক্ষ থেকে। আর নিশ্চয় এটা পরম করুণাময় পরম দয়ালু আল্লাহর নামে’।",
    "'যাতে তোমরা আমার প্রতি উদ্ধত না হও এবং অনুগত হয়ে আমার কাছে আস'।",
    "সে (রাণী) বলল, ‘হে পারিষদবর্গ, তোমরা আমার ব্যাপারে আমাকে অভিমত দাও। তোমাদের উপস্থিতি ছাড়া আমি কোন বিষয়ে চূড়ান্ত সিদ্ধান্ত গ্রহণ করি না।",
    "তারা বলল, ‘আমরা শক্তিশালী ও কঠোর যোদ্ধা, আর সিদ্ধান্ত আপনার কাছেই। অতএব চিন্তা করে দেখুন, আপনি কী নির্দেশ দেবেন’।",
    "সে বলল, ‘নিশ্চয় রাজা-বাদশাহরা যখন কোন জনপদে প্রবেশ করে তখন তাকে বিপর্যস্ত করে এবং সেখানকার সম্মানিত অধিবাসীদেরকে অপদস্থ করে। আর তা-ই তারা করবে’।",
    "‘আর নিশ্চয় আমি তাদের কাছে উপঢৌকন পাঠাচ্ছি, তারপর দেখি দূতেরা কী নিয়ে ফিরে আসে’।",
    "অতঃপর দূত যখন সুলাইমানের কাছে আসল, তখন সে বলল, ‘তোমরা কি আমাকে সম্পদ দ্বারা সাহায্য করতে চাচ্ছ? সুতরাং আল্লাহ আমাকে যা দিয়েছেন তা তোমাদেরকে যা দিয়েছেন তা থেকে উত্তম। বরং তোমরা তোমাদের উপঢৌকন নিয়ে খুশি হও’।",
    "‘তোমরা তাদের কাছে ফিরে যাও। তারপর আমি অবশ্যই তাদের কাছে এমন সৈন্যবাহিনী নিয়ে আসব যার মুকাবিলা করার শক্তি তাদের নেই। আর আমি অবশ্যই তাদেরকে সেখান থেকে লাঞ্ছিত অবস্থায় বের করে দেব আর তারা অপমানিত।’",
    "সুলাইমান বলল, ‘হে পারিষদবর্গ, তারা আমার কাছে আত্মসমর্পণ করে আসার পূর্বে তোমাদের মধ্যে কে তার (রাণীর) সিংহাসন আমার কাছে নিয়ে আসতে পারবে’?",
    "এক শক্তিশালী জিন বলল, ‘আপনি আপনার স্থান থেকে উঠার পূর্বেই আমি তা এনে দেব। আমি নিশ্চয়ই এই ব্যাপারে শক্তিমান, বিশ্বস্ত।",
    "যার কাছে কিতাবের এক বিশেষ জ্ঞান ছিল সে বলল, ‘আমি চোখের পলক পড়ার পূর্বেই তা আপনার কাছে নিয়ে আসব’। অতঃপর যখন সুলাইমান তা তার সামনে স্থির দেখতে পেল, তখন বলল, ‘এটি আমার রবের অনুগ্রহ, যাতে তিনি আমাকে পরীক্ষা করেন যে, আমি কি কৃতজ্ঞতা প্রকাশ করি না কি অকৃতজ্ঞতা প্রকাশ করি। আর যে কৃতজ্ঞতা প্রকাশ করে সে তো তার নিজের কল্যাণেই তা করে, আর যে কেউ অকৃতজ্ঞ হবে, তবে নিশ্চয় আমার রব অভাবমুক্ত, অধিক দাতা’।",
    "সুলাইমান বলল, ‘তোমরা তার জন্য তার সিংহাসনের আকার-আকৃতি পরিবর্তন করে দাও। দেখব সে সঠিক দিশা পায় নাকি তাদের অন্তর্ভুক্ত হয়ে পড়ে, যারা সঠিক দিশা পায় না’।",
    "অতঃপর যখন সে আসল, তখন তাকে বলা হল; ‘এরূপই কি তোমার সিংহাসন’? সে বলল, ‘এটি যেন সেটিই’। আর বলল, ‘আমাদেরকে তার পূর্বেই জ্ঞান দান করা হয়েছিল এবং আমরা আত্মসমর্পণ করেছিলাম’।",
    "আর আল্লাহকে বাদ দিয়ে যার পূজা সে করত তা তাকে ঈমান থেকে নিবৃত্ত করেছিল। নিশ্চয় সে ছিল কাফির সম্প্রদায়ের অন্তর্ভুক্ত।",
    "তাকে বলা হল, ‘প্রাসাদটিতে প্রবেশ কর’। অতঃপর যখন সে তা দেখল, সে তাকে এক গভীর জলাশয় ধারণা করল, এবং তার পায়ের গোছাদ্বয় অনাবৃত করল। সুলাইমান বলল, ‘এটি আসলে স্বচ্ছ কাঁচ-নির্মিত প্রাসাদ’। সে বলল, ‘হে আমার রব, নিশ্চয় আমি আমার নিজের প্রতি যুলম করেছি। আমি সুলাইমানের সাথে সৃষ্টিকুলের রব আল্লাহর নিকট আত্মসমর্পণ করলাম’।",
    "আর অবশ্যই আমি সামূদ সম্প্রদায়ের নিকট তাদের ভাই সালিহকে পাঠিয়েছিলাম যে, তোমরা আল্লাহর ইবাদাত কর। অতঃপর তারা দু’দলে বিভক্ত হয়ে বিতর্ক করছিল।",
    "সে বলল, ‘হে আমার কওম, তোমরা কল্যাণের পূর্বে কেন অকল্যাণকে তরান্বিত করতে চাইছ? কেন তোমরা আল্লাহর কাছে ক্ষমা প্রার্থনা করছ না যেন তোমাদেরকে রহমত করা হয়’?",
    "তারা বলল, ‘আমরা তুমি ও তোমার সাথে যারা আছে তাদেরকে অশুভ মনে করছি’। সে বলল, ‘তোমাদের অশুভ আল্লাহর নিকট। বরং তোমরা এমন এক কওম যাদের পরীক্ষা করা হচ্ছে’।",
    "আর সেই শহরে ছিল নয় নেতৃস্থানীয় ব্যক্তি। যারা যমীনে ফাসাদ সৃষ্টি করত এবং সংস্কার-সংশোধনমূলক কিছু করত না।",
    "তারা বলল, ‘তোমরা পরস্পর আল্লাহর কসম কর যে, আমরা রাত্রিকালে তার ও তার পরিবারের উপর অবশ্যই আক্রমণ করব, অতঃপর আমরা তার নিকটাত্মীয়দের বলব, আমরা তার পরিবারবর্গের হত্যাকান্ড প্রত্যক্ষ করিনি। আর নিশ্চয়ই আমরা সত্যবাদী’।",
    "আর তারা এক চক্রান্ত করল এবং আমিও কৌশল অবলম্বন করলাম। অথচ তারা উপলদ্ধিও করতে পারল না।",
    "অতএব দেখ, তাদের চক্রান্তের পরিণাম কিরূপ হয়েছে। আমি তাদের ও তাদের কওমকে একত্রে ধ্বংস করে দিয়েছি।",
    "সুতরাং ঐগুলো তাদের বাড়ীঘর, যা তাদের যুলমের কারণে বিরান হয়ে আছে। নিশ্চয় এর মধ্যে নিদর্শন রয়েছে সে কওমের জন্য যারা জ্ঞান রাখে।",
    "আর আমি মুমিনদের মুক্তি দিলাম এবং তারা ছিল তাকওয়া অবলম্বনকারী।",
    "আর স্মরণ কর লূতের কথা, যখন সে তার কওমকে বলেছিল, ‘তোমরা কেন অশ্লীল কাজ করছ, অথচ তা তোমরা ভালভাবে প্রত্যক্ষ করছ’?",
    "‘তোমরা কি নারীদের বাদ দিয়ে পুরুষদের উপর কামতৃপ্তির জন্য উপগত হবে? বরং তোমরা এমন এক কওম যারা জানে না’।",
    "ফলে তার কওমের জবাব একমাত্র এই ছিল যে, ‘লূতের পরিবারকে তোমাদের জনপদ থেকে বের করে দাও। নিশ্চয় এরা এমন লোক যারা পবিত্র থাকতে চায়’।",
    "অতএব আমি মুক্তি দিলাম তাকে ও তার পরিবারকে, তবে তার স্ত্রীকে ছাড়া। আমি তাকে ধ্বংসপ্রাপ্তদের মধ্যে সাব্যস্ত করে রেখেছিলাম।",
    "আমি তাদের উপর মুষলধারে (পাথরের) বৃষ্টি বর্ষণ করেছিলাম। ভীতি প্রদর্শিতদের জন্য কতইনা নিকৃষ্ট ছিল এই বৃষ্টি!",
    "বল, ‘সকল প্রশংসাই আল্লাহর নিমিত্তে। আর শান্তি তাঁর বান্দাদের প্রতি যাদের তিনি মনোনীত করেছেন। আল্লাহ শ্রেষ্ঠ, না কি যাদের এরা শরীক করে তারা’?",
    "বরং তিনি (শ্রেষ্ঠ), যিনি আসমানসমূহ ও যমীনকে সৃষ্টি করেছেন এবং তোমাদের জন্য তিনি আসমান থেকে পানি বর্ষণ করেন। অতঃপর তা দ্বারা আমি মনোরম উদ্যান সৃষ্টি করি। তার বৃক্ষাদি উৎপন্ন করার ক্ষমতা তোমাদের নেই। আল্লাহর সাথে কি অন্য কোন ইলাহ আছে? বরং তারা এমন এক কওম যারা শিরক করে।",
    "বরং তিনি, যিনি যমীনকে আবাসযোগ্য করেছেন এবং তার মধ্যে প্রবাহিত করেছেন নদী-নালা। আর তাতে স্থাপন করেছেন সুদৃঢ় পর্বতমালা এবং দুই সমুদ্রের মধ্যখানে অন্তরায় সৃষ্টি করেছেন। আল্লাহর সাথে কি অন্য কোন ইলাহ আছে? বরং তাদের অধিকাংশই জানে না।",
    "বরং তিনি, যিনি নিরুপায়ের আহবানে সাড়া দেন এবং বিপদ দূরীভূত করেন এবং তোমাদেরকে যমীনের প্রতিনিধি বানান। আল্লাহর সাথে কি অন্য কোন ইলাহ আছে ? তোমরা কমই উপদেশ গ্রহণ করে থাক।",
    "বরং তিনি, যিনি তোমাদেরকে স্থলে ও সমুদ্রের অন্ধকারে পথ দেখান এবং যিনি স্বীয় রহমতের প্রাক্কালে সুসংবাদবাহী বাতাস প্রেরণ করেন। আল্লাহর সাথে কি অন্য কোন ইলাহ আছে? তারা যা কিছু শরীক করে আল্লাহ তা থেকে ঊর্ধ্বে।",
    "বরং তিনি, যিনি সৃষ্টির সূচনা করেন, তারপর তার পুনরাবৃত্তি করবেন এবং যিনি তোমাদেরকে আসমান ও যমীন থেকে রিযিক দান করেন, আল্লাহর সাথে কি কোন ইলাহ আছে? বল, ‘তোমাদের প্রমাণ নিয়ে এসো যদি তোমরা সত্যবাদী হও।’",
    "বল, ‘আল্লাহ ছাড়া আসমানসমূহে ও যমীনে যারা আছে তারা গায়েব জানে না। আর কখন তাদেরকে পুনরুত্থিত করা হবে তা তারা অনুভব করতে পারে না’।",
    "বরং আখিরাত সম্পর্কে তাদের জ্ঞান নিঃশেষ হয়েছে। বরং সে বিষয়ে তারা সন্দেহে আছে; বরং এ ব্যাপারে তারা অন্ধ।",
    "আর কাফিররা বলে, ‘আমরা ও আমাদের পিতৃপুরুষরা মাটি হয়ে যাব তখনো কি আমাদেরকে উত্থিত করা হবে’?",
    "ইতোপূর্বে আমাদেরকে ও আমাদের পূর্বপুরুষদেরকে এ বিষয়ে ওয়াদা দেয়া হয়েছিল, ‘এটি প্রাচীন লোকদের উপকথা ছাড়া কিছুই নয়’।",
    "বল, ‘তোমরা যমীনে ভ্রমণ কর, তারপর দেখ, কিরূপ হয়েছিল অপরাধীদের পরিণতি।’",
    "আর তাদের জন্য দুঃখ করো না এবং তারা যে ষড়যন্ত্র করে তাতে মনক্ষুণ্ণ হয়ো না।",
    "আর তারা বলে, ‘তোমরা সত্যবাদী হলে (বল) এই ওয়াদা কখন আসবে’?",
    "বল, ‘আশা করা যায়, তোমরা যে বিষয়ে তাড়াহুড়া করছ তার কিছু অচিরেই হবে’।",
    "আর নিশ্চয় তোমার রব মানুষের প্রতি অনুগ্রহশীল; কিন্তু তাদের বেশীর ভাগই শুকরিয়া আদায় করে না।",
    "আর নিশ্চয় তোমার রব, অবশ্যই জানেন তাদের অন্তর যা গোপন করে এবং যা তারা প্রকাশ করে।",
    "আর আসমান ও যমীনে এমন কোন গোপন বিষয় নেই যা সুস্পষ্ট কিতাবে লিপিবদ্ধ নেই।",
    "নিশ্চয় এ কুরআন তাদের কাছে বর্ণনা করছে, বনী ইসরাঈল যেসব বিষয়ে বিতর্ক করে তার অধিকাংশই।",
    "আর নিশ্চয় এটি মুমিনদের জন্য হিদায়াত ও রহমত।",
    "নিশ্চয় তোমার রব নিজের বিচার-প্রজ্ঞা দ্বারা তাদের মধ্যে ফয়সালা করে দেবেন; আর তিনি মহাপরাক্রমশালী, সর্বজ্ঞ।",
    "অতএব আল্লাহর উপর তাওয়াক্কুল কর; কারণ তুমি সুস্পষ্ট সত্যের ওপর অধিষ্ঠিত আছ।",
    "নিশ্চয় তুমি মৃতকে শোনাতে পারবে না, আর তুমি বধিরকে আহবান শোনাতে পারবে না, যখন তারা পিঠ দেখিয়ে চলে যায়।",
    "আর তুমি অন্ধদেরকে তাদের ভ্রষ্টতা থেকে হিদায়াতকারী নও; তুমি কেবল তাদেরকে শোনাতে পারবে যারা আমার আয়াতসমূহে ঈমান আনে, অতঃপর তারাই আত্মসমর্পণকারী।",
    "আর যখন তাদের উপর ‘বাণী’ (আযাব) বাস্তবায়িত হবে তখন আমি যমীনের জন্তু (দাব্বাতুল আরদ)* বের করব, যে তাদের সাথে কথা বলবে। কারণ মানুষ আমার আয়াতসমূহে সুদৃঢ় বিশ্বাস রাখত না। \n* কিয়ামতের অন্যতম নিদর্শন হল ‘দাববাতুল আরদ’ বের হওয়া। ইমাম আহমদ (র.) বর্ণনা করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, দশটি নিদর্শন না দেখা পর্যন্ত কিয়ামত হবে না তন্মধ্যে অন্যতম হল, দাববাতুল আরদ বের হওয়া। ইবন কাছীর বলেন, শেষ যামানায় যখন মানুষ সৎকাজের আদেশ দেবে না, অসৎ কাজ হতে নিষেধ করবে না, সত্য দীন পরিবর্তন করবে এবং চারদিকে ফিতনা-ফাসাদ ছড়িয়ে পড়বে তখন ‘দাব্বাতুল আরদ’ বের হবে।",
    "আর স্মরণ কর সেদিনের কথা, যেদিন প্রত্যেক জাতির মধ্য থেকে যারা আমার আয়াতসমূহকে অস্বীকার করত তাদেরকে আমি দলে দলে সমবেত করব। অতঃপর তাদেরকে হাঁকিয়ে নিয়ে যাওয়া হবে।",
    "অবশেষে যখন তারা আসবে, তখন আল্লাহ বলবেন, ‘তোমরা কি আমার আয়াতসমূহকে অস্বীকার করেছিলে, অথচ সে বিষয়ে তোমাদের কোন জ্ঞানই ছিল না? নাকি তোমরা আরো কী করেছিলে?’",
    "আর তাদের উপর বাণী (আযাব) বাস্তবায়িত হবে। কারণ তারা যুলম করেছিল। ফলে তারা কথা বলতে পারবে না।",
    "তারা কি দেখে না যে, আমি রাতকে সৃষ্টি করেছি, যেন তারা তাতে বিশ্রাম নিতে পারে এবং দিনকে করেছি আলোকিত? নিশ্চয় এতে নিদর্শনাবলী রয়েছে সেই কওমের জন্য যারা ঈমান এনেছে।",
    "আর যেদিন শিঙ্গায় ফুঁক দেয়া হবে, সেদিন আসমানসমূহ ও যমীনে যারা আছে সবাই ভীত হবে; তবে আল্লাহ যাদেরকে চাইবেন তারা ছাড়া। আর সবাই তাঁর কাছে হীন অবস্থায় উপস্থিত হবে।",
    "আর তুমি পাহাড়সমূকে দেখছ, সেগুলোকে তুমি স্থির মনে করছ। অথচ তা মেঘমালার ন্যায় চলতে থাকবে। (এটা) আল্লাহর কাজ, যিনি সব কিছু দৃঢ়ভাবে করেছেন। নিশ্চয় তোমরা যা কর, তিনি সে সম্পর্কে বিশেষভাবে অবহিত।",
    "যে ব্যক্তি সৎকাজ নিয়ে আসবে তার জন্য থাকবে তা থেকে উত্তম প্রতিদান এবং সেদিনের ভীতিকর অবস্থা থেকে তারা নিরাপদ থাকবে।",
    "আর যারা মন্দ কাজ নিয়ে আসবে তাদেরকে উপুড় করে জাহান্নামে নিক্ষেপ করা হবে; (তাদেরকে বলা হবে) ‘তোমরা যে আমল করেছ তারই প্রতিদান তোমাদেরকে দেয়া হল’।",
    "‘আমাকে তো নির্দেশ দেয়া হয়েছে এই শহরের রব-এর ইবাদাত করতে যিনি এটিকে সম্মানিত করেছেন এর সব কিছু তাঁরই অধিকারে। আর আমাকে নির্দেশ দেয়া হয়েছে, আমি যেন মুসলিমদের অন্তর্ভুক্ত হই’।",
    "‘আর আমি যেন আল-কুরআন অধ্যয়ন করি, অতঃপর যে হিদায়াত লাভ করল সে নিজের জন্য হিদায়াত লাভ করল; আর যে পথভ্রষ্ট হল তাকে বল, ‘আমি তো সতর্ককারীদের অন্তর্ভুক্ত।’",
    "আর বল, ‘সকল প্রশংসা আল্লাহর; অচিরেই তিনি তোমাদেরকে তাঁর নিদর্শনসমূহ দেখাবেন, তখন তোমরা তা চিনতে পারবে আর তোমরা যা আমল কর সে ব্যাপারে তোমাদের রব বেখবর নন।’"
  ]
}