{
  "surahName": "Qaaf",
  "surahNameArabic": "ق",
  "surahNameArabicLong": "سورة ق",
  "surahNameTranslation": "The letter Qaaf",
  "revelationPlace": "Mecca",
  "totalAyah": 45,
  "surahNo": 50,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/50.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/050.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/50.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/050.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/50.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/050.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/50.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/050.mp3"
    }
  },
  "english": [
    "Qãf. By the glorious Quran!",
    "˹All will be resurrected,˺ yet the deniers are astonished that a warner has come to them from among themselves ˹warning of resurrection˺. So the disbelievers say, “This is an astonishing thing!",
    "˹Will we be returned to life,˺ when we are dead and reduced to dust? Such a return is impossible.”",
    "We certainly know what the earth consumes of them ˹after their death˺, and with us is a well-preserved Record.",
    "In fact, they reject the truth when it has come to them, so they are in a confused state.",
    "Have they not then looked at the sky above them: how We built it and adorned it ˹with stars˺, leaving it flawless?",
    "As for the earth, We spread it out and placed upon it firm mountains, and produced in it every type of pleasant plant—",
    "˹all as˺ an insight and a reminder to every servant who turns ˹to Allah˺.",
    "And We send down blessed rain from the sky, bringing forth gardens and grains for harvest",
    "and towering palm trees ˹loaded˺ with clustered fruit",
    "˹as˺ a provision for ˹Our˺ servants. And with this ˹rain˺ We revive a lifeless land. Similar is the emergence ˹from the graves˺.",
    "Before them, the people of Noah denied ˹the truth,˺ as did the people of the Water-pit, Thamûd",
    "’Ȃd, Pharaoh, the kinfolk of Lot",
    "the residents of the Forest, and the people of Tubba’. Each rejected ˹their˺ messenger, so My warning was fulfilled.",
    "Were We incapable of creating ˹them˺ the first time? In fact, they are in doubt about ˹their˺ re-creation.",
    "Indeed, ˹it is˺ We ˹Who˺ created humankind and ˹fully˺ know what their souls whisper to them, and We are closer to them than ˹their˺ jugular vein.",
    "As the two recording-angels—˹one˺ sitting to the right, and ˹the other to˺ the left—note ˹everything˺",
    "not a word does a person utter without having a ˹vigilant˺ observer ready ˹to write it down˺.",
    "˹Ultimately,˺ with the throes of death will come the truth. This is what you were trying to escape!",
    "And the Trumpet will be blown. This is the Day ˹you were˺ warned of.",
    "Each soul will come forth with an angel to drive it and another to testify.",
    "˹It will be said to the denier,˺ “You were totally heedless of this. Now We have lifted this veil of yours, so Today your sight is sharp!”",
    "And one’s accompanying-angel will say, “Here is the record ready with me.”",
    "˹It will be said to both angels,˺ “Throw into Hell every stubborn disbeliever",
    "withholder of good, transgressor, and doubter",
    "who set up another god with Allah. So cast them into the severe punishment.”",
    "One’s ˹devilish˺ associate will say, “Our Lord! I did not make them transgress. Rather, they were far astray ˹on their own˺.”",
    "Allah will respond, “Do not dispute in My presence, since I had already given you a warning.",
    "My Word cannot be changed, nor am I unjust to ˹My˺ creation.”",
    "˹Beware of˺ the Day We will ask Hell, “Are you full ˹yet˺?” And it will respond, “Are there any more?”",
    "And Paradise will be brought near to the righteous, not far off.",
    "˹And it will be said to them,˺ “This is what you were promised, for whoever ˹constantly˺ turned ˹to Allah˺ and kept up ˹His commandments˺—",
    "who were in awe of the Most Compassionate without seeing ˹Him˺, and have come with a heart turning ˹only to Him˺.",
    "Enter it in peace. This is the Day of eternal life!”",
    "There they will have whatever they desire, and with Us is ˹even˺ more.",
    "˹Imagine˺ how many peoples We destroyed before them, who were far mightier than them. Then ˹when the torment came,˺ they ˹desperately˺ sought refuge in the land. ˹But˺ was there any escape?",
    "Surely in this is a reminder for whoever has a ˹mindful˺ heart and lends an attentive ear.",
    "Indeed, We created the heavens and the earth and everything in between in six Days, and We were not ˹even˺ touched with fatigue.",
    "So be patient ˹O Prophet˺ with what they say. And glorify the praises of your Lord before sunrise and before sunset.",
    "And glorify Him during part of the night and after the prayers.",
    "And listen! On the Day the caller will call out from a near place",
    "the Day all will hear the ˹mighty˺ Blast in ˹all˺ truth, that will be the Day of emergence ˹from the graves˺.",
    "It is certainly We Who give life and cause death. And to Us is the final return.",
    "˹Beware of˺ the Day the earth will split open, letting them rush forth. That will be an easy gathering for Us.",
    "We know best what they say. And you ˹O Prophet˺ are not ˹there˺ to compel them ˹to believe˺. So remind with the Quran ˹only˺ those who fear My warning."
  ],
  "arabic1": [
    "قٓ ۫ وَالْقُرْاٰنِ الْمَجِیْدِ",
    "بَلْ عَجِبُوْۤا اَنْ جَآءَهُمْ مُّنْذِرٌ مِّنْهُمْ فَقَالَ الْكٰفِرُوْنَ هٰذَا شَیْءٌ عَجِیْبٌ",
    "ءَاِذَا مِتْنَا وَكُنَّا تُرَابًا ذٰلِكَ رَجْعٌ بَعِیْدٌ",
    "قَدْ عَلِمْنَا مَا تَنْقُصُ الْاَرْضُ مِنْهُمْ وَعِنْدَنَا كِتٰبٌ حَفِیْظٌ",
    "بَلْ كَذَّبُوْا بِالْحَقِّ لَمَّا جَآءَهُمْ فَهُمْ فِیْۤ اَمْرٍ مَّرِیْجٍ",
    "اَفَلَمْ یَنْظُرُوْۤا اِلَی السَّمَآءِ فَوْقَهُمْ كَیْفَ بَنَیْنٰهَا وَزَیَّنّٰهَا وَمَا لَهَا مِنْ فُرُوْجٍ",
    "وَالْاَرْضَ مَدَدْنٰهَا وَاَلْقَیْنَا فِیْهَا رَوَاسِیَ وَاَنْۢبَتْنَا فِیْهَا مِنْ كُلِّ زَوْجٍ بَهِیْجٍ",
    "تَبْصِرَةً وَّذِكْرٰی لِكُلِّ عَبْدٍ مُّنِیْبٍ",
    "وَنَزَّلْنَا مِنَ السَّمَآءِ مَآءً مُّبٰرَكًا فَاَنْۢبَتْنَا بِهٖ جَنّٰتٍ وَّحَبَّ الْحَصِیْدِ",
    "وَالنَّخْلَ بٰسِقٰتٍ لَّهَا طَلْعٌ نَّضِیْدٌ",
    "رِّزْقًا لِّلْعِبَادِ وَاَحْیَیْنَا بِهٖ بَلْدَةً مَّیْتًا كَذٰلِكَ الْخُرُوْجُ",
    "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ وَّاَصْحٰبُ الرَّسِّ وَثَمُوْدُ",
    "وَعَادٌ وَّفِرْعَوْنُ وَاِخْوَانُ لُوْطٍ",
    "وَّاَصْحٰبُ الْاَیْكَةِ وَقَوْمُ تُبَّعٍ كُلٌّ كَذَّبَ الرُّسُلَ فَحَقَّ وَعِیْدِ",
    "اَفَعَیِیْنَا بِالْخَلْقِ الْاَوَّلِ بَلْ هُمْ فِیْ لَبْسٍ مِّنْ خَلْقٍ جَدِیْدٍ",
    "وَلَقَدْ خَلَقْنَا الْاِنْسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهٖ نَفْسُهٗ وَنَحْنُ اَقْرَبُ اِلَیْهِ مِنْ حَبْلِ الْوَرِیْدِ",
    "اِذْ یَتَلَقَّی الْمُتَلَقِّیٰنِ عَنِ الْیَمِیْنِ وَعَنِ الشِّمَالِ قَعِیْدٌ",
    "مَا یَلْفِظُ مِنْ قَوْلٍ اِلَّا لَدَیْهِ رَقِیْبٌ عَتِیْدٌ",
    "وَجَآءَتْ سَكْرَةُ الْمَوْتِ بِالْحَقِّ ذٰلِكَ مَا كُنْتَ مِنْهُ تَحِیْدُ",
    "وَنُفِخَ فِی الصُّوْرِ ذٰلِكَ یَوْمُ الْوَعِیْدِ",
    "وَجَآءَتْ كُلُّ نَفْسٍ مَّعَهَا سَآىِٕقٌ وَّشَهِیْدٌ",
    "لَقَدْ كُنْتَ فِیْ غَفْلَةٍ مِّنْ هٰذَا فَكَشَفْنَا عَنْكَ غِطَآءَكَ فَبَصَرُكَ الْیَوْمَ حَدِیْدٌ",
    "وَقَالَ قَرِیْنُهٗ هٰذَا مَا لَدَیَّ عَتِیْدٌ",
    "اَلْقِیَا فِیْ جَهَنَّمَ كُلَّ كَفَّارٍ عَنِیْدٍ",
    "مَّنَّاعٍ لِّلْخَیْرِ مُعْتَدٍ مُّرِیْبِ",
    "١لَّذِیْ جَعَلَ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ فَاَلْقِیٰهُ فِی الْعَذَابِ الشَّدِیْدِ",
    "قَالَ قَرِیْنُهٗ رَبَّنَا مَاۤ اَطْغَیْتُهٗ وَلٰكِنْ كَانَ فِیْ ضَلٰلٍۢ بَعِیْدٍ",
    "قَالَ لَا تَخْتَصِمُوْا لَدَیَّ وَقَدْ قَدَّمْتُ اِلَیْكُمْ بِالْوَعِیْدِ",
    "مَا یُبَدَّلُ الْقَوْلُ لَدَیَّ وَمَاۤ اَنَا بِظَلَّامٍ لِّلْعَبِیْدِ",
    "یَوْمَ نَقُوْلُ لِجَهَنَّمَ هَلِ امْتَلَاْتِ وَتَقُوْلُ هَلْ مِنْ مَّزِیْدٍ",
    "وَاُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِیْنَ غَیْرَ بَعِیْدٍ",
    "هٰذَا مَا تُوْعَدُوْنَ لِكُلِّ اَوَّابٍ حَفِیْظٍ",
    "مَنْ خَشِیَ الرَّحْمٰنَ بِالْغَیْبِ وَجَآءَ بِقَلْبٍ مُّنِیْبِ",
    "١دْخُلُوْهَا بِسَلٰمٍ ذٰلِكَ یَوْمُ الْخُلُوْدِ",
    "لَهُمْ مَّا یَشَآءُوْنَ فِیْهَا وَلَدَیْنَا مَزِیْدٌ",
    "وَكَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنْ قَرْنٍ هُمْ اَشَدُّ مِنْهُمْ بَطْشًا فَنَقَّبُوْا فِی الْبِلَادِ هَلْ مِنْ مَّحِیْصٍ",
    "اِنَّ فِیْ ذٰلِكَ لَذِكْرٰی لِمَنْ كَانَ لَهٗ قَلْبٌ اَوْ اَلْقَی السَّمْعَ وَهُوَ شَهِیْدٌ",
    "وَلَقَدْ خَلَقْنَا السَّمٰوٰتِ وَالْاَرْضَ وَمَا بَیْنَهُمَا فِیْ سِتَّةِ اَیَّامٍ ۖ وَّمَا مَسَّنَا مِنْ لُّغُوْبٍ",
    "فَاصْبِرْ عَلٰی مَا یَقُوْلُوْنَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوْعِ الشَّمْسِ وَقَبْلَ الْغُرُوْبِ",
    "وَمِنَ الَّیْلِ فَسَبِّحْهُ وَاَدْبَارَ السُّجُوْدِ",
    "وَاسْتَمِعْ یَوْمَ یُنَادِ الْمُنَادِ مِنْ مَّكَانٍ قَرِیْبٍ",
    "یَّوْمَ یَسْمَعُوْنَ الصَّیْحَةَ بِالْحَقِّ ذٰلِكَ یَوْمُ الْخُرُوْجِ",
    "اِنَّا نَحْنُ نُحْیٖ وَنُمِیْتُ وَاِلَیْنَا الْمَصِیْرُ",
    "یَوْمَ تَشَقَّقُ الْاَرْضُ عَنْهُمْ سِرَاعًا ذٰلِكَ حَشْرٌ عَلَیْنَا یَسِیْرٌ",
    "نَحْنُ اَعْلَمُ بِمَا یَقُوْلُوْنَ وَمَاۤ اَنْتَ عَلَیْهِمْ بِجَبَّارٍ ۫ فَذَكِّرْ بِالْقُرْاٰنِ مَنْ یَّخَافُ وَعِیْدِ"
  ],
  "bengali": [
    "কাফ; মর্যাদাপূর্ণ কুরআনের কসম।",
    "বরং তারা বিস্মিত হয়েছে যে, তাদের মধ্য থেকে একজন সতর্ককারী তাদের কাছে এসেছে। অতঃপর কাফিররা বলল, ‘এতো এক বিস্ময়কর বস্তু’!",
    "‘আমরা যখন মারা যাব এবং মাটিতে পরিণত হব তখনো কি (আমরা পুনরুত্থিত হব)? এ ফিরে যাওয়া সুদূরপরাহত’।",
    "অবশ্যই আমি জানি মাটি তাদের থেকে যতটুকু ক্ষয় করে। আর আমার কাছে আছে অধিক সংরক্ষণকারী কিতাব।",
    "বরং তারা সত্যকে অস্বীকার করেছে, যখনই তাদের কাছে সত্য এসেছে। অতএব তারা সংশয়যুক্ত বিষয়ের মধ্যে রয়েছে।",
    "তারা কি তাদের উপরে আসমানের দিকে তাকায় না, কিভাবে আমি তা বানিয়েছি এবং তা সুশোভিত করেছি? আর তাতে কোন ফাটল নেই।",
    "আর আমি যমীনকে বিস্তৃত করেছি, তাতে পর্বতমালা স্থাপন করেছি এবং তাতে প্রত্যেক প্রকারের সুদৃশ্য উদ্ভিদ উদগত করেছি।",
    "আল্লাহ অভিমুখী প্রতিটি বান্দার জন্য জ্ঞান ও উপদেশ হিসেবে।",
    "আর আমি আসমান থেকে বরকতময় পানি নাযিল করেছি। অতঃপর তা দ্বারা আমি উৎপন্ন করি বাগ-বাগিচা ও কর্তনযোগ্য শস্যদানা।",
    "আর সমুন্নত খেজুরগাছ, যাতে আছে গুচ্ছ গুচ্ছ খেজুর ছড়া,",
    "আমার বান্দাদের জন্য রিয্কস্বরূপ। আর আমি পানি দ্বারা মৃত শহর সঞ্জীবিত করি। এভাবেই উত্থান ঘটবে।",
    "তাদের পূর্বে সত্য প্রত্যাখ্যান করেছিল নূহের সম্প্রদায়, রাস্ এর অধিবাসী ও সামূদ সম্প্রদায়।",
    "‘আদ, ফির‘আউন ও লূত সম্প্রদায়।",
    "আইকার অধিবাসী ও তুব্বা‘ সম্প্রদায়। সকলেই রাসূলদেরকে মিথ্যাবাদী বলেছিল।",
    "আমি কি প্রথমবার সৃষ্টি করেই ক্লান্ত হয়ে পড়েছি? বরং তারা নতুন সৃষ্টির বিষয়ে সন্দেহে নিপতিত।",
    "আর অবশ্যই আমি মানুষকে সৃষ্টি করেছি এবং তার প্রবৃত্তি তাকে যে কুমন্ত্রণা দেয় তাও আমি জানি। আর আমি* তার গলার ধমনী হতেও অধিক কাছে। \n* ইবনে কাসীর বলেন, এখানে نحن বলে আল্লাহর ফেরেশতাদেরকে বুঝানো হয়েছে।",
    "যখন ডানে ও বামে বসা দু’জন লিপিবদ্ধকারী পরস্পর গ্রহণ করবে।",
    "সে যে কথাই উচ্চারণ করে তার কাছে সদা উপস্থিত সংরক্ষণকারী রয়েছে।",
    "আর মৃত্যুর যন্ত্রণা যথাযথই আসবে। যা থেকে তুমি পলায়ন করতে চাইতে।",
    "আর শিংগায় ফুঁক দেয়া হবে। এটাই হল প্রতিশ্রুত দিন।",
    "আর প্রত্যেক ব্যক্তি উপস্থিত হবে, তার সাথে থাকবে একজন চালক ও একজন সাক্ষী।",
    "অবশ্যই তুমি এ দিবস সম্পর্কে উদাসীন ছিলে, অতএব আমি তোমার পর্দা তোমার থেকে উন্মোচন করে দিলাম। ফলে আজ তোমার দৃষ্টি খুব প্রখর।",
    "আর তার সাথী (ফেরেশতা) বলবে, এই তো আমার কাছে (আমল নামা) প্রস্তুত।",
    "তোমরা জাহান্নামে নিক্ষেপ কর প্রত্যেক উদ্ধত কাফিরকে,",
    "কল্যাণকর কাজে প্রবল বাধাদানকারী সীমালঙ্ঘনকারী, সন্দেহ পোষণকারীকে।",
    "যে আল্লাহর সাথে অন্য ইলাহ গ্রহণ করেছিল, তোমরা তাকে কঠিন আযাবে নিক্ষেপ কর।",
    "তার সঙ্গী (শয়তান) বলবে, ‘হে আমাদের ‘রব’, আমি তাকে বিদ্রোহী করে তুলিনি, বরং সে নিজেই ছিল সুদূর পথভ্রষ্টতার মধ্যে’।",
    "আল্লাহ বলবেন, ‘তোমরা আমার কাছে বাক-বিতন্ডা করো না। অবশ্যই আমি পূর্বেই তোমাদেরকে সতর্ক করে দিয়েছিলাম’।",
    "‘আমার কাছে কথা রদবদল হয় না, আর আমি বান্দার প্রতি যুলমকারীও নই’।",
    "সেদিন আমি জাহান্নামকে বলব, ‘তুমি কি পরিপূর্ণ হয়েছ’? আর সে বলবে, ‘আরো বেশি আছে কি’?",
    "আর জান্নাতকে মুত্তাকীদের অদূরে, কাছেই আনা হবে।",
    "এটাই, যার ওয়াদা তোমাদেরকে দেয়া হয়েছিল। প্রত্যেক আল্লাহ অভিমুখী অধিক সংরক্ষণশীলদের জন্য।",
    "যে না দেখেই রহমানকে ভয় করত এবং বিনীত হৃদয়ে উপস্থিত হত।",
    "তোমরা তাতে শান্তির সাথে প্রবেশ কর। এটাই স্থায়িত্বের দিন।",
    "তারা যা চাইবে, সেখানে তাদের জন্য তাই থাকবে এবং আমার কাছে রয়েছে আরও অধিক।",
    "আমি তাদের পূর্বে বহু প্রজন্মকে ধ্বংস করে দিয়েছি যারা পাকড়াও করার ক্ষেত্রে এদের তুলনায় ছিল প্রবলতর, তারা দেশ-বিদেশ চষে বেড়াত। তাদের কি কোন পলায়নস্থল ছিল?",
    "নিশ্চয় এতে উপদেশ রয়েছে তার জন্য, যার রয়েছে অন্তর অথবা যে নিবিষ্টচিত্তে শ্রবণ করে।",
    "আর অবশ্যই আমি আসমানসমূহ ও যমীন এবং এতদোভয়ের মধ্যস্থিত সবকিছু ছয় দিনে সৃষ্টি করেছি। আর আমাকে কোনরূপ ক্লান্তি স্পর্শ করেনি।",
    "অতএব এরা যা বলে, তাতে তুমি ধৈর্যধারণ কর এবং সূর্য উদয়ের পূর্বে ও অস্তমিত হওয়ার পূর্বে তুমি তোমার রবের প্রশংসাসহ তাসবীহ পাঠ কর।",
    "এবং রাতের একাংশেও তুমি তাঁর তাসবীহ পাঠ কর এবং সালাতের পশ্চাতেও।",
    "মনোনিবেশ কর, যেদিন একজন ঘোষক নিকটবর্তী কোন স্থান থেকে ডাকতে থাকবে।",
    "সেদিন তারা সত্যিসত্যিই মহাচিৎকার শুনবে। সেটিই উত্থিত হবার দিন।",
    "আমিই জীবন দেই এবং আমিই মৃত্যু ঘটাই, আর আমার দিকেই চূড়ান্ত প্রত্যাবর্তন।",
    "সেদিন তাদের থেকে যমীন বিদীর্ণ হবে এবং লোকেরা দিগ্বিদিক্ ছুটাছুটি করতে থাকবে। এটি এমন এক সমাবেশ যা আমার পক্ষে অতীব সহজ।",
    "এরা যা বলে আমি তা সবচেয়ে ভাল জানি। আর তুমি তাদের উপর কোন জোর- জবরদস্তিকারী নও। সুতরাং যে আমার ধমককে ভয় করে তাকে কুরআনের সাহায্যে উপদেশ দাও।"
  ]
}