{
  "surahName": "Ghafir",
  "surahNameArabic": "غافر",
  "surahNameArabicLong": "سورة غافر",
  "surahNameTranslation": "The Forgiver",
  "revelationPlace": "Mecca",
  "totalAyah": 85,
  "surahNo": 40,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/40.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/040.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/40.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/040.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/40.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/040.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/40.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/040.mp3"
    }
  },
  "english": [
    "Ḥâ-Mĩm.",
    "The revelation of this Book is from Allah—the Almighty, All-Knowing",
    "the Forgiver of sin and Accepter of repentance, the Severe in punishment, and Infinite in bounty. There is no god ˹worthy of worship˺ except Him. To Him ˹alone˺  is the final return.",
    "None disputes the signs of Allah except the disbelievers, so do not be deceived by their prosperity throughout the land.",
    "Before them, the people of Noah denied ˹the truth˺, as did ˹other˺ enemy forces afterwards. Every community plotted against its prophet to seize him, and argued in falsehood, ˹hoping˺ to discredit the truth with it. So I seized them. And how ˹horrible˺ was My punishment!",
    "And so your Lord’s decree has been proven true against the disbelievers—that they will be the inmates of the Fire.",
    "Those ˹angels˺ who carry the Throne and those around it glorify the praises of their Lord, have faith in Him, and seek forgiveness for the believers, ˹praying:˺ “Our Lord! You encompass everything in ˹Your˺ mercy and knowledge. So forgive those who repent and follow Your Way, and protect them from the torment of the Hellfire.",
    "Our Lord! Admit them into the Gardens of Eternity which You have promised them, along with the righteous among their parents, spouses, and descendants. You ˹alone˺ are truly the Almighty, All-Wise.",
    "And protect them from ˹the consequences of their˺ evil deeds. For whoever You protect from the evil of their deeds on that Day will have been shown Your mercy. That is ˹truly˺ the ultimate triumph.”",
    "Indeed, it will be announced to the disbelievers, “Allah’s contempt for you—as you disbelieved when invited to belief—was far worse than your contempt for one another ˹Today˺.”",
    "They will plead, “Our Lord! You made us lifeless twice, and gave us life twice. Now we confess our sins. So is there any way out?”",
    "˹They will be told,˺ “˹No!˺ This is because when Allah alone was invoked, you ˹staunchly˺ disbelieved. But when others were associated with Him ˹in worship˺, you ˹readily˺ believed. So ˹Today˺ judgment belongs to Allah ˹alone˺—the Most High, All-Great.”",
    "He is the One Who shows you His signs and sends down ˹rain as˺ a provision for you from the sky. ˹But˺ none will be mindful except those who turn ˹to Him˺.",
    "So call upon Allah with sincere devotion, even to the dismay of the disbelievers.",
    "˹He is˺ Highly Exalted in rank, Lord of the Throne. He sends down the revelation by His command to whoever He wills of His servants to warn ˹all˺ of the Day of Meeting—",
    "the Day all will appear ˹before Allah˺. Nothing about them will be hidden from Him. ˹He will ask,˺ “Who does all authority belong to this Day? To Allah—the One, the Supreme!",
    "Today every soul will be rewarded for what it has done. No injustice Today! Surely Allah is swift in reckoning.”",
    "Warn them ˹O Prophet˺ of the approaching Day when the hearts will jump into the throats, suppressing distress. The wrongdoers will have neither a close friend nor intercessor to be heard.",
    "Allah ˹even˺ knows the sly glances of the eyes and whatever the hearts conceal.",
    "And Allah judges with the truth, while those ˹idols˺ they invoke besides Him cannot judge at all. Indeed, Allah ˹alone˺ is the All-Hearing, All-Seeing.",
    "Have they not travelled throughout the land to see what was the end of those ˹destroyed˺ before them? They were far superior in might and ˹richer in˺ monuments throughout the land. But Allah seized them for their sins, and they had no protector from Allah.",
    "That was because their messengers used to come to them with clear proofs, but they persisted in disbelief. So Allah seized them. Surely He is All-Powerful, severe in punishment.",
    "Indeed, We sent Moses with Our signs and compelling proof",
    "to Pharaoh, Hamân, and Korah. But they responded: “Magician! Total liar!”",
    "Then, when he came to them with the truth from Us, they said, “Kill the sons of those who believe with him and keep their women.” But the plotting of the disbelievers was only in vain.",
    "And Pharaoh said, “Let me kill Moses, and let him call upon his Lord! I truly fear that he may change your traditions or cause mischief in the land.”",
    "Moses replied, “I seek refuge in my Lord and your Lord from every arrogant person who does not believe in the Day of Reckoning.”",
    "A believing man from Pharaoh’s people, who was hiding his faith, argued, “Will you kill a man ˹only˺ for saying: ‘My Lord is Allah,’ while he has in fact come to you with clear proofs from your Lord? If he is a liar, it will be to his own loss. But if he is truthful, then you will be afflicted with some of what he is threatening you with. Surely Allah does not guide whoever is a transgressor, a total liar.",
    "O  my people! Authority belongs to you today, reigning supreme in the land. But who would help us against the torment of Allah, if it were to befall us?” Pharaoh assured ˹his people˺, “I am telling you only what I believe, and I am leading you only to the way of guidance.”",
    "And the man who believed cautioned, “O my people! I truly fear for you the doom of ˹earlier˺ enemy forces—",
    "like the fate of the people of Noah, ’Ȃd, Thamûd, and those after them. For Allah would never will to wrong ˹His˺ servants.",
    "O  my people! I truly fear for you the Day all will be crying out ˹to each other˺—",
    "the Day you will ˹try in vain to˺ turn your backs and run away, with no one to protect you from Allah. And whoever Allah leaves to stray will be left with no guide.",
    "Joseph already came to you earlier with clear proofs, yet you never ceased to doubt what he came to you with. When he died you said, ‘Allah will never send a messenger after him.’ This is how Allah leaves every transgressor and doubter to stray—",
    "those who dispute Allah’s signs with no proof given to them. How despicable is that for Allah and the believers! This is how Allah seals the heart of every arrogant tyrant.”",
    "Pharaoh ordered, “O Hamân! Build me a high tower so I may reach the pathways",
    "leading up to the heavens and look for the God of Moses, although I am sure he is a liar.” And so Pharaoh’s evil deeds were made so appealing to him that he was hindered from the ˹Right˺ Way. But the plotting of Pharaoh was only in vain.",
    "And the man who believed urged, “O my people! Follow me, ˹and˺ I will lead you to the Way of Guidance.",
    "O  my people! This worldly life is only ˹a fleeting˺ enjoyment, whereas the Hereafter is truly the home of settlement.",
    "Whoever does an evil deed will only be paid back with its equivalent. And whoever does good, whether male or female, and is a believer, they will enter Paradise, where they will be provided for without limit.",
    "O  my people! How is it that I invite you to salvation, while you invite me to the Fire!",
    "You invite me to disbelieve in Allah and associate with Him what I have no knowledge of, while I invite you to the Almighty, Most Forgiving.",
    "There is no doubt that whatever ˹idols˺ you invite me to ˹worship˺ are not worthy to be invoked either in this world or the Hereafter. ˹Undoubtedly,˺ our return is to Allah, and the transgressors will be the inmates of the Fire.",
    "You will remember what I say to you, and I entrust my affairs to Allah. Surely Allah is All-Seeing of all ˹His˺ servants.”",
    "So Allah protected him from the evil of their schemes. And Pharaoh’s people were overwhelmed by an evil punishment:",
    "they are exposed to the Fire ˹in their graves˺ morning and evening. And on the Day the Hour will be established ˹it will be said˺, “Admit Pharaoh’s people into the harshest punishment ˹of Hell˺.”",
    "˹Consider the Day˺ when they will dispute in the Fire, and the lowly ˹followers˺ will appeal to the arrogant ˹leaders˺, “We were your ˹dedicated˺ followers, will you then shield us from a portion of the Fire?”",
    "The arrogant will say, “We are all in it! ˹For˺ Allah has already passed judgment over ˹His˺ servants.”",
    "And those in the Fire will cry out to the keepers of Hell, “Pray to your Lord to lighten the torment for us ˹even˺ for one day!”",
    "The keepers will reply, “Did your messengers not ˹constantly˺ come to you with clear proofs?” They will say, “Yes ˹they did˺.” The keepers will say, “Then pray! Though the prayer of the disbelievers is only in vain.”",
    "We certainly help Our messengers and the believers, ˹both˺ in this worldly life and on the Day the witnesses will stand forth ˹for testimony˺—",
    "the Day the wrongdoers’ excuses will be of no benefit to them. They will be condemned, and will have the worst outcome.",
    "And indeed, We gave Moses ˹true˺ guidance, and made the Children of Israel inherit the Scripture—",
    "a guide and a reminder to people of reason.",
    "So be patient ˹O Prophet˺, ˹for˺ Allah’s promise is certainly true. Seek forgiveness for your shortcomings. And glorify the praises of your Lord morning and evening.",
    "Surely those who dispute Allah’s signs—with no proof given to them—have nothing in their hearts but greed for dominance, which they will never attain. So seek refuge in Allah. Indeed, He alone is the All-Hearing, All-Seeing.",
    "The creation of the heavens and the earth is certainly greater than the re-creation of humankind, but most people do not know.",
    "Those blind ˹to the truth˺ and those who can see are not equal, nor are those who believe and do good ˹equal˺ to those who do evil. Yet you are hardly mindful.",
    "The Hour is certainly coming, there is no doubt about it. But most people do not believe.",
    "Your Lord has proclaimed, “Call upon Me, I will respond to you. Surely those who are too proud to worship Me will enter Hell, fully humbled.”",
    "It is Allah Who has made the night for you to rest in and the day bright. Surely Allah is ever Bountiful to humanity, but most people are ungrateful.",
    "That is Allah, your Lord, the Creator of all things. There is no god ˹worthy of worship˺ except Him. How can you then be deluded ˹from the truth˺?",
    "This is how those who used to reject Allah’s signs were ˹also˺ deluded.",
    "It is Allah Who made the earth a place of settlement for you and the sky a canopy. He shaped you ˹in the womb˺, perfecting your form. And He has provided you with what is good and lawful. That is Allah—your Lord. So Blessed is Allah, Lord of all worlds.",
    "He is the Ever-Living. There is no god ˹worthy of worship˺ except Him. So call upon Him with sincere devotion, ˹saying,˺ “All praise is for Allah—Lord of all worlds.”",
    "Say, ˹O Prophet,˺ “I have been forbidden to worship those ˹idols˺ you worship besides Allah, since clear proofs have come to me from my Lord. And I have been commanded to ˹fully˺ submit to the Lord of all worlds.”",
    "He is the One Who created you from dust, then from a sperm-drop, then ˹developed you into˺ a clinging clot ˹of blood˺, then He brings you forth as infants, so that you may reach your prime, and become old—though some of you ˹may˺ die sooner—reaching an appointed time, so perhaps you may understand ˹Allah’s power˺.",
    "He is the One Who gives life and causes death. When He decrees a matter, He simply tells it, “Be!” And it is!",
    "Have you not seen how those who dispute Allah’s signs are turned away?",
    "˹They are˺ the ones who reject this Book and all ˹scriptures˺ We sent Our messengers with. So they will know ˹the consequences˺",
    "when shackles will be around their necks and chains ˹on their legs˺. They will be dragged",
    "through boiling water, then burned in the Fire ˹as fuel˺.",
    "Then they will be asked, “Where are those ˹idols˺ you used to associate",
    "with Allah?” They will cry, “They have ˹all˺ failed us. In fact, we did not invoke anything ˹real˺ before.” This is how Allah leaves the disbelievers to stray.",
    "˹They will be told,˺ “This ˹punishment˺ is for being prideful on earth unjustly and for acting arrogantly.",
    "Enter the gates of Hell, to stay there forever. What an evil home for the arrogant!”",
    "So be patient ˹O Prophet˺. Surely Allah’s promise is true. Whether We show you some of what We threaten them with, or cause you to die ˹before that˺, to Us they will ˹all˺ be returned.",
    "We already sent messengers before you. We have told you the stories of some of them, while others We have not. It was not for any messenger to bring a sign without Allah’s permission. But when Allah’s decree comes, judgment will be passed with fairness, and the people of falsehood will then be in ˹total˺ loss.",
    "It is Allah Who made cattle for you so that you may ride some and eat others.",
    "Also, you find in them ˹other˺ benefits. And by means of them you may reach destinations you desire. And you are carried upon ˹some of˺ them and upon ships.",
    "And He shows you His signs. Now which of Allah’s signs will you deny?",
    "Have they not travelled throughout the land to see what was the end of those who were ˹destroyed˺ before them? They were far superior in might and ˹richer in˺ monuments throughout the land, but their ˹worldly˺ gains were of no benefit to them.",
    "When their messengers came to them with clear proofs, they were prideful in whatever ˹worldly˺ knowledge they had, and were ˹ultimately˺ overwhelmed by what they used to ridicule.",
    "When they saw Our punishment, they cried, “˹Now˺ we believe in Allah alone and reject what we had been associating with Him!”",
    "But their faith was of no benefit to them when they saw Our torment. This has ˹always˺ been Allah’s way ˹of dealing˺ with His ˹wicked˺ servants. Then and there the disbelievers were in ˹total˺ loss."
  ],
  "arabic1": [
    "حٰمٓ",
    "تَنْزِیْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِیْزِ الْعَلِیْمِ",
    "غَافِرِ الذَّنْۢبِ وَقَابِلِ التَّوْبِ شَدِیْدِ الْعِقَابِ ذِی الطَّوْلِ لَاۤ اِلٰهَ اِلَّا هُوَ اِلَیْهِ الْمَصِیْرُ",
    "مَا یُجَادِلُ فِیْۤ اٰیٰتِ اللّٰهِ اِلَّا الَّذِیْنَ كَفَرُوْا فَلَا یَغْرُرْكَ تَقَلُّبُهُمْ فِی الْبِلَادِ",
    "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ وَّالْاَحْزَابُ مِنْ بَعْدِهِمْ وَهَمَّتْ كُلُّ اُمَّةٍ بِرَسُوْلِهِمْ لِیَاْخُذُوْهُ وَجٰدَلُوْا بِالْبَاطِلِ لِیُدْحِضُوْا بِهِ الْحَقَّ فَاَخَذْتُهُمْ ۫ فَكَیْفَ كَانَ عِقَابِ",
    "وَكَذٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَی الَّذِیْنَ كَفَرُوْۤا اَنَّهُمْ اَصْحٰبُ النَّارِ",
    "اَلَّذِیْنَ یَحْمِلُوْنَ الْعَرْشَ وَمَنْ حَوْلَهٗ یُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْ وَیُؤْمِنُوْنَ بِهٖ وَیَسْتَغْفِرُوْنَ لِلَّذِیْنَ اٰمَنُوْا رَبَّنَا وَسِعْتَ كُلَّ شَیْءٍ رَّحْمَةً وَّعِلْمًا فَاغْفِرْ لِلَّذِیْنَ تَابُوْا وَاتَّبَعُوْا سَبِیْلَكَ وَقِهِمْ عَذَابَ الْجَحِیْمِ",
    "رَبَّنَا وَاَدْخِلْهُمْ جَنّٰتِ عَدْنِ ١لَّتِیْ وَعَدْتَّهُمْ وَمَنْ صَلَحَ مِنْ اٰبَآىِٕهِمْ وَاَزْوَاجِهِمْ وَذُرِّیّٰتِهِمْ اِنَّكَ اَنْتَ الْعَزِیْزُ الْحَكِیْمُ",
    "وَقِهِمُ السَّیِّاٰتِ وَمَنْ تَقِ السَّیِّاٰتِ یَوْمَىِٕذٍ فَقَدْ رَحِمْتَهٗ وَذٰلِكَ هُوَ الْفَوْزُ الْعَظِیْمُ",
    "اِنَّ الَّذِیْنَ كَفَرُوْا یُنَادَوْنَ لَمَقْتُ اللّٰهِ اَكْبَرُ مِنْ مَّقْتِكُمْ اَنْفُسَكُمْ اِذْ تُدْعَوْنَ اِلَی الْاِیْمَانِ فَتَكْفُرُوْنَ",
    "قَالُوْا رَبَّنَاۤ اَمَتَّنَا اثْنَتَیْنِ وَاَحْیَیْتَنَا اثْنَتَیْنِ فَاعْتَرَفْنَا بِذُنُوْبِنَا فَهَلْ اِلٰی خُرُوْجٍ مِّنْ سَبِیْلٍ",
    "ذٰلِكُمْ بِاَنَّهٗۤ اِذَا دُعِیَ اللّٰهُ وَحْدَهٗ كَفَرْتُمْ وَاِنْ یُّشْرَكْ بِهٖ تُؤْمِنُوْا فَالْحُكْمُ لِلّٰهِ الْعَلِیِّ الْكَبِیْرِ",
    "هُوَ الَّذِیْ یُرِیْكُمْ اٰیٰتِهٖ وَیُنَزِّلُ لَكُمْ مِّنَ السَّمَآءِ رِزْقًا وَمَا یَتَذَكَّرُ اِلَّا مَنْ یُّنِیْبُ",
    "فَادْعُوا اللّٰهَ مُخْلِصِیْنَ لَهُ الدِّیْنَ وَلَوْ كَرِهَ الْكٰفِرُوْنَ",
    "رَفِیْعُ الدَّرَجٰتِ ذُو الْعَرْشِ یُلْقِی الرُّوْحَ مِنْ اَمْرِهٖ عَلٰی مَنْ یَّشَآءُ مِنْ عِبَادِهٖ لِیُنْذِرَ یَوْمَ التَّلَاقِ",
    "یَوْمَ هُمْ بَارِزُوْنَ لَا یَخْفٰی عَلَی اللّٰهِ مِنْهُمْ شَیْءٌ لِمَنِ الْمُلْكُ الْیَوْمَ لِلّٰهِ الْوَاحِدِ الْقَهَّارِ",
    "اَلْیَوْمَ تُجْزٰی كُلُّ نَفْسٍ بِمَا كَسَبَتْ لَا ظُلْمَ الْیَوْمَ اِنَّ اللّٰهَ سَرِیْعُ الْحِسَابِ",
    "وَاَنْذِرْهُمْ یَوْمَ الْاٰزِفَةِ اِذِ الْقُلُوْبُ لَدَی الْحَنَاجِرِ كٰظِمِیْنَ مَا لِلظّٰلِمِیْنَ مِنْ حَمِیْمٍ وَّلَا شَفِیْعٍ یُّطَاعُ",
    "یَعْلَمُ خَآىِٕنَةَ الْاَعْیُنِ وَمَا تُخْفِی الصُّدُوْرُ",
    "وَاللّٰهُ یَقْضِیْ بِالْحَقِّ وَالَّذِیْنَ یَدْعُوْنَ مِنْ دُوْنِهٖ لَا یَقْضُوْنَ بِشَیْءٍ اِنَّ اللّٰهَ هُوَ السَّمِیْعُ الْبَصِیْرُ",
    "اَوَلَمْ یَسِیْرُوْا فِی الْاَرْضِ فَیَنْظُرُوْا كَیْفَ كَانَ عَاقِبَةُ الَّذِیْنَ كَانُوْا مِنْ قَبْلِهِمْ كَانُوْا هُمْ اَشَدَّ مِنْهُمْ قُوَّةً وَّاٰثَارًا فِی الْاَرْضِ فَاَخَذَهُمُ اللّٰهُ بِذُنُوْبِهِمْ وَمَا كَانَ لَهُمْ مِّنَ اللّٰهِ مِنْ وَّاقٍ",
    "ذٰلِكَ بِاَنَّهُمْ كَانَتْ تَّاْتِیْهِمْ رُسُلُهُمْ بِالْبَیِّنٰتِ فَكَفَرُوْا فَاَخَذَهُمُ اللّٰهُ اِنَّهٗ قَوِیٌّ شَدِیْدُ الْعِقَابِ",
    "وَلَقَدْ اَرْسَلْنَا مُوْسٰی بِاٰیٰتِنَا وَسُلْطٰنٍ مُّبِیْنٍ",
    "اِلٰی فِرْعَوْنَ وَهَامٰنَ وَقَارُوْنَ فَقَالُوْا سٰحِرٌ كَذَّابٌ",
    "فَلَمَّا جَآءَهُمْ بِالْحَقِّ مِنْ عِنْدِنَا قَالُوا اقْتُلُوْۤا اَبْنَآءَ الَّذِیْنَ اٰمَنُوْا مَعَهٗ وَاسْتَحْیُوْا نِسَآءَهُمْ وَمَا كَیْدُ الْكٰفِرِیْنَ اِلَّا فِیْ ضَلٰلٍ",
    "وَقَالَ فِرْعَوْنُ ذَرُوْنِیْۤ اَقْتُلْ مُوْسٰی وَلْیَدْعُ رَبَّهٗ اِنِّیْۤ اَخَافُ اَنْ یُّبَدِّلَ دِیْنَكُمْ اَوْ اَنْ یُّظْهِرَ فِی الْاَرْضِ الْفَسَادَ",
    "وَقَالَ مُوْسٰۤی اِنِّیْ عُذْتُ بِرَبِّیْ وَرَبِّكُمْ مِّنْ كُلِّ مُتَكَبِّرٍ لَّا یُؤْمِنُ بِیَوْمِ الْحِسَابِ",
    "وَقَالَ رَجُلٌ مُّؤْمِنٌ ۖ مِّنْ اٰلِ فِرْعَوْنَ یَكْتُمُ اِیْمَانَهٗۤ اَتَقْتُلُوْنَ رَجُلًا اَنْ یَّقُوْلَ رَبِّیَ اللّٰهُ وَقَدْ جَآءَكُمْ بِالْبَیِّنٰتِ مِنْ رَّبِّكُمْ وَاِنْ یَّكُ كَاذِبًا فَعَلَیْهِ كَذِبُهٗ وَاِنْ یَّكُ صَادِقًا یُّصِبْكُمْ بَعْضُ الَّذِیْ یَعِدُكُمْ اِنَّ اللّٰهَ لَا یَهْدِیْ مَنْ هُوَ مُسْرِفٌ كَذَّابٌ",
    "یٰقَوْمِ لَكُمُ الْمُلْكُ الْیَوْمَ ظٰهِرِیْنَ فِی الْاَرْضِ فَمَنْ یَّنْصُرُنَا مِنْ بَاْسِ اللّٰهِ اِنْ جَآءَنَا قَالَ فِرْعَوْنُ مَاۤ اُرِیْكُمْ اِلَّا مَاۤ اَرٰی وَمَاۤ اَهْدِیْكُمْ اِلَّا سَبِیْلَ الرَّشَادِ",
    "وَقَالَ الَّذِیْۤ اٰمَنَ یٰقَوْمِ اِنِّیْۤ اَخَافُ عَلَیْكُمْ مِّثْلَ یَوْمِ الْاَحْزَابِ",
    "مِثْلَ دَاْبِ قَوْمِ نُوْحٍ وَّعَادٍ وَّثَمُوْدَ وَالَّذِیْنَ مِنْ بَعْدِهِمْ وَمَا اللّٰهُ یُرِیْدُ ظُلْمًا لِّلْعِبَادِ",
    "وَیٰقَوْمِ اِنِّیْۤ اَخَافُ عَلَیْكُمْ یَوْمَ التَّنَادِ",
    "یَوْمَ تُوَلُّوْنَ مُدْبِرِیْنَ مَا لَكُمْ مِّنَ اللّٰهِ مِنْ عَاصِمٍ وَمَنْ یُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ هَادٍ",
    "وَلَقَدْ جَآءَكُمْ یُوْسُفُ مِنْ قَبْلُ بِالْبَیِّنٰتِ فَمَا زِلْتُمْ فِیْ شَكٍّ مِّمَّا جَآءَكُمْ بِهٖ حَتّٰۤی اِذَا هَلَكَ قُلْتُمْ لَنْ یَّبْعَثَ اللّٰهُ مِنْ بَعْدِهٖ رَسُوْلًا كَذٰلِكَ یُضِلُّ اللّٰهُ مَنْ هُوَ مُسْرِفٌ مُّرْتَابُ ۖ",
    "١لَّذِیْنَ یُجَادِلُوْنَ فِیْۤ اٰیٰتِ اللّٰهِ بِغَیْرِ سُلْطٰنٍ اَتٰىهُمْ كَبُرَ مَقْتًا عِنْدَ اللّٰهِ وَعِنْدَ الَّذِیْنَ اٰمَنُوْا كَذٰلِكَ یَطْبَعُ اللّٰهُ عَلٰی كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ",
    "وَقَالَ فِرْعَوْنُ یٰهَامٰنُ ابْنِ لِیْ صَرْحًا لَّعَلِّیْۤ اَبْلُغُ الْاَسْبَابَ",
    "اَسْبَابَ السَّمٰوٰتِ فَاَطَّلِعَ اِلٰۤی اِلٰهِ مُوْسٰی وَاِنِّیْ لَاَظُنُّهٗ كَاذِبًا وَكَذٰلِكَ زُیِّنَ لِفِرْعَوْنَ سُوْٓءُ عَمَلِهٖ وَصُدَّ عَنِ السَّبِیْلِ وَمَا كَیْدُ فِرْعَوْنَ اِلَّا فِیْ تَبَابٍ",
    "وَقَالَ الَّذِیْۤ اٰمَنَ یٰقَوْمِ اتَّبِعُوْنِ اَهْدِكُمْ سَبِیْلَ الرَّشَادِ",
    "یٰقَوْمِ اِنَّمَا هٰذِهِ الْحَیٰوةُ الدُّنْیَا مَتَاعٌ وَّاِنَّ الْاٰخِرَةَ هِیَ دَارُ الْقَرَارِ",
    "مَنْ عَمِلَ سَیِّئَةً فَلَا یُجْزٰۤی اِلَّا مِثْلَهَا وَمَنْ عَمِلَ صَالِحًا مِّنْ ذَكَرٍ اَوْ اُ وَهُوَ مُؤْمِنٌ فَاُولٰٓىِٕكَ یَدْخُلُوْنَ الْجَنَّةَ یُرْزَقُوْنَ فِیْهَا بِغَیْرِ حِسَابٍ",
    "وَیٰقَوْمِ مَا لِیْۤ اَدْعُوْكُمْ اِلَی النَّجٰوةِ وَتَدْعُوْنَنِیْۤ اِلَی النَّارِ",
    "تَدْعُوْنَنِیْ لِاَكْفُرَ بِاللّٰهِ وَاُشْرِكَ بِهٖ مَا لَیْسَ لِیْ بِهٖ عِلْمٌ وَّاَنَا اَدْعُوْكُمْ اِلَی الْعَزِیْزِ الْغَفَّارِ",
    "لَا جَرَمَ اَنَّمَا تَدْعُوْنَنِیْۤ اِلَیْهِ لَیْسَ لَهٗ دَعْوَةٌ فِی الدُّنْیَا وَلَا فِی الْاٰخِرَةِ وَاَنَّ مَرَدَّنَاۤ اِلَی اللّٰهِ وَاَنَّ الْمُسْرِفِیْنَ هُمْ اَصْحٰبُ النَّارِ",
    "فَسَتَذْكُرُوْنَ مَاۤ اَقُوْلُ لَكُمْ وَاُفَوِّضُ اَمْرِیْۤ اِلَی اللّٰهِ اِنَّ اللّٰهَ بَصِیْرٌ بِالْعِبَادِ",
    "فَوَقٰىهُ اللّٰهُ سَیِّاٰتِ مَا مَكَرُوْا وَحَاقَ بِاٰلِ فِرْعَوْنَ سُوْٓءُ الْعَذَابِ",
    "اَلنَّارُ یُعْرَضُوْنَ عَلَیْهَا غُدُوًّا وَّعَشِیًّا وَیَوْمَ تَقُوْمُ السَّاعَةُ ۫ اَدْخِلُوْۤا اٰلَ فِرْعَوْنَ اَشَدَّ الْعَذَابِ",
    "وَاِذْ یَتَحَآجُّوْنَ فِی النَّارِ فَیَقُوْلُ الضُّعَفٰٓؤُا لِلَّذِیْنَ اسْتَكْبَرُوْۤا اِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ اَنْتُمْ مُّغْنُوْنَ عَنَّا نَصِیْبًا مِّنَ النَّارِ",
    "قَالَ الَّذِیْنَ اسْتَكْبَرُوْۤا اِنَّا كُلٌّ فِیْهَاۤ اِنَّ اللّٰهَ قَدْ حَكَمَ بَیْنَ الْعِبَادِ",
    "وَقَالَ الَّذِیْنَ فِی النَّارِ لِخَزَنَةِ جَهَنَّمَ ادْعُوْا رَبَّكُمْ یُخَفِّفْ عَنَّا یَوْمًا مِّنَ الْعَذَابِ",
    "قَالُوْۤا اَوَلَمْ تَكُ تَاْتِیْكُمْ رُسُلُكُمْ بِالْبَیِّنٰتِ قَالُوْا بَلٰی قَالُوْا فَادْعُوْا وَمَا دُعٰٓؤُا الْكٰفِرِیْنَ اِلَّا فِیْ ضَلٰلٍ",
    "اِنَّا لَنَنْصُرُ رُسُلَنَا وَالَّذِیْنَ اٰمَنُوْا فِی الْحَیٰوةِ الدُّنْیَا وَیَوْمَ یَقُوْمُ الْاَشْهَادُ",
    "یَوْمَ لَا یَنْفَعُ الظّٰلِمِیْنَ مَعْذِرَتُهُمْ وَلَهُمُ اللَّعْنَةُ وَلَهُمْ سُوْٓءُ الدَّارِ",
    "وَلَقَدْ اٰتَیْنَا مُوْسَی الْهُدٰی وَاَوْرَثْنَا بَنِیْۤ اِسْرَآءِیْلَ الْكِتٰبَ",
    "هُدًی وَّذِكْرٰی لِاُولِی الْاَلْبَابِ",
    "فَاصْبِرْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ وَّاسْتَغْفِرْ لِذَنْۢبِكَ وَسَبِّحْ بِحَمْدِ رَبِّكَ بِالْعَشِیِّ وَالْاِبْكَارِ",
    "اِنَّ الَّذِیْنَ یُجَادِلُوْنَ فِیْۤ اٰیٰتِ اللّٰهِ بِغَیْرِ سُلْطٰنٍ اَتٰىهُمْ اِنْ فِیْ صُدُوْرِهِمْ اِلَّا كِبْرٌ مَّا هُمْ بِبَالِغِیْهِ فَاسْتَعِذْ بِاللّٰهِ اِنَّهٗ هُوَ السَّمِیْعُ الْبَصِیْرُ",
    "لَخَلْقُ السَّمٰوٰتِ وَالْاَرْضِ اَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَعْلَمُوْنَ",
    "وَمَا یَسْتَوِی الْاَعْمٰی وَالْبَصِیْرُ وَالَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَلَا الْمُسِیْٓءُ قَلِیْلًا مَّا تَتَذَكَّرُوْنَ",
    "اِنَّ السَّاعَةَ لَاٰتِیَةٌ لَّا رَیْبَ فِیْهَا وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یُؤْمِنُوْنَ",
    "وَقَالَ رَبُّكُمُ ادْعُوْنِیْۤ اَسْتَجِبْ لَكُمْ اِنَّ الَّذِیْنَ یَسْتَكْبِرُوْنَ عَنْ عِبَادَتِیْ سَیَدْخُلُوْنَ جَهَنَّمَ دٰخِرِیْنَ",
    "اَللّٰهُ الَّذِیْ جَعَلَ لَكُمُ الَّیْلَ لِتَسْكُنُوْا فِیْهِ وَالنَّهَارَ مُبْصِرًا اِنَّ اللّٰهَ لَذُوْ فَضْلٍ عَلَی النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَشْكُرُوْنَ",
    "ذٰلِكُمُ اللّٰهُ رَبُّكُمْ خَالِقُ كُلِّ شَیْءٍ لَاۤ اِلٰهَ اِلَّا هُوَ فَاَنّٰی تُؤْفَكُوْنَ",
    "كَذٰلِكَ یُؤْفَكُ الَّذِیْنَ كَانُوْا بِاٰیٰتِ اللّٰهِ یَجْحَدُوْنَ",
    "اَللّٰهُ الَّذِیْ جَعَلَ لَكُمُ الْاَرْضَ قَرَارًا وَّالسَّمَآءَ بِنَآءً وَّصَوَّرَكُمْ فَاَحْسَنَ صُوَرَكُمْ وَرَزَقَكُمْ مِّنَ الطَّیِّبٰتِ ذٰلِكُمُ اللّٰهُ رَبُّكُمْ فَتَبٰرَكَ اللّٰهُ رَبُّ الْعٰلَمِیْنَ",
    "هُوَ الْحَیُّ لَاۤ اِلٰهَ اِلَّا هُوَ فَادْعُوْهُ مُخْلِصِیْنَ لَهُ الدِّیْنَ اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِیْنَ",
    "قُلْ اِنِّیْ نُهِیْتُ اَنْ اَعْبُدَ الَّذِیْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ لَمَّا جَآءَنِیَ الْبَیِّنٰتُ مِنْ رَّبِّیْ وَاُمِرْتُ اَنْ اُسْلِمَ لِرَبِّ الْعٰلَمِیْنَ",
    "هُوَ الَّذِیْ خَلَقَكُمْ مِّنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ یُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوْۤا اَشُدَّكُمْ ثُمَّ لِتَكُوْنُوْا شُیُوْخًا وَمِنْكُمْ مَّنْ یُّتَوَفّٰی مِنْ قَبْلُ وَلِتَبْلُغُوْۤا اَجَلًا مُّسَمًّی وَّلَعَلَّكُمْ تَعْقِلُوْنَ",
    "هُوَ الَّذِیْ یُحْیٖ وَیُمِیْتُ فَاِذَا قَضٰۤی اَمْرًا فَاِنَّمَا یَقُوْلُ لَهٗ كُنْ فَیَكُوْنُ",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ یُجَادِلُوْنَ فِیْۤ اٰیٰتِ اللّٰهِ اَنّٰی یُصْرَفُوْنَ",
    "الَّذِیْنَ كَذَّبُوْا بِالْكِتٰبِ وَبِمَاۤ اَرْسَلْنَا بِهٖ رُسُلَنَا ۫ فَسَوْفَ یَعْلَمُوْنَ",
    "اِذِ الْاَغْلٰلُ فِیْۤ اَعْنَاقِهِمْ وَالسَّلٰسِلُ یُسْحَبُوْنَ",
    "فِی الْحَمِیْمِ ثُمَّ فِی النَّارِ یُسْجَرُوْنَ",
    "ثُمَّ قِیْلَ لَهُمْ اَیْنَ مَا كُنْتُمْ تُشْرِكُوْنَ",
    "مِنْ دُوْنِ اللّٰهِ قَالُوْا ضَلُّوْا عَنَّا بَلْ لَّمْ نَكُنْ نَّدْعُوْا مِنْ قَبْلُ شَیْـًٔا كَذٰلِكَ یُضِلُّ اللّٰهُ الْكٰفِرِیْنَ",
    "ذٰلِكُمْ بِمَا كُنْتُمْ تَفْرَحُوْنَ فِی الْاَرْضِ بِغَیْرِ الْحَقِّ وَبِمَا كُنْتُمْ تَمْرَحُوْنَ",
    "اُدْخُلُوْۤا اَبْوَابَ جَهَنَّمَ خٰلِدِیْنَ فِیْهَا فَبِئْسَ مَثْوَی الْمُتَكَبِّرِیْنَ",
    "فَاصْبِرْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ فَاِمَّا نُرِیَنَّكَ بَعْضَ الَّذِیْ نَعِدُهُمْ اَوْ نَتَوَفَّیَنَّكَ فَاِلَیْنَا یُرْجَعُوْنَ",
    "وَلَقَدْ اَرْسَلْنَا رُسُلًا مِّنْ قَبْلِكَ مِنْهُمْ مَّنْ قَصَصْنَا عَلَیْكَ وَمِنْهُمْ مَّنْ لَّمْ نَقْصُصْ عَلَیْكَ وَمَا كَانَ لِرَسُوْلٍ اَنْ یَّاْتِیَ بِاٰیَةٍ اِلَّا بِاِذْنِ اللّٰهِ فَاِذَا جَآءَ اَمْرُ اللّٰهِ قُضِیَ بِالْحَقِّ وَخَسِرَ هُنَالِكَ الْمُبْطِلُوْنَ",
    "اَللّٰهُ الَّذِیْ جَعَلَ لَكُمُ الْاَنْعَامَ لِتَرْكَبُوْا مِنْهَا وَمِنْهَا تَاْكُلُوْنَ",
    "وَلَكُمْ فِیْهَا مَنَافِعُ وَلِتَبْلُغُوْا عَلَیْهَا حَاجَةً فِیْ صُدُوْرِكُمْ وَعَلَیْهَا وَعَلَی الْفُلْكِ تُحْمَلُوْنَ",
    "وَیُرِیْكُمْ اٰیٰتِهٖ ۖ فَاَیَّ اٰیٰتِ اللّٰهِ تُنْكِرُوْنَ",
    "اَفَلَمْ یَسِیْرُوْا فِی الْاَرْضِ فَیَنْظُرُوْا كَیْفَ كَانَ عَاقِبَةُ الَّذِیْنَ مِنْ قَبْلِهِمْ كَانُوْۤا اَكْثَرَ مِنْهُمْ وَاَشَدَّ قُوَّةً وَّاٰثَارًا فِی الْاَرْضِ فَمَاۤ اَغْنٰی عَنْهُمْ مَّا كَانُوْا یَكْسِبُوْنَ",
    "فَلَمَّا جَآءَتْهُمْ رُسُلُهُمْ بِالْبَیِّنٰتِ فَرِحُوْا بِمَا عِنْدَهُمْ مِّنَ الْعِلْمِ وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ یَسْتَهْزِءُوْنَ",
    "فَلَمَّا رَاَوْا بَاْسَنَا قَالُوْۤا اٰمَنَّا بِاللّٰهِ وَحْدَهٗ وَكَفَرْنَا بِمَا كُنَّا بِهٖ مُشْرِكِیْنَ",
    "فَلَمْ یَكُ یَنْفَعُهُمْ اِیْمَانُهُمْ لَمَّا رَاَوْا بَاْسَنَا سُنَّتَ اللّٰهِ الَّتِیْ قَدْ خَلَتْ فِیْ عِبَادِهٖ وَخَسِرَ هُنَالِكَ الْكٰفِرُوْنَ"
  ],
  "bengali": [
    "হা-মীম।",
    "মহাপরাক্রমশালী সর্বজ্ঞানী আল্লাহর পক্ষ থেকে এই কিতাব নাযিলকৃত।",
    "তিনি পাপ ক্ষমাকারী, তাওবা কবূলকারী, কঠোর আযাবদাতা, অনুগ্রহ বর্ষণকারী। তিনি ছাড়া কোন (সত্য) ইলাহ নেই। তাঁর দিকেই প্রত্যাবর্তন।",
    "কাফিররাই কেবল আল্লাহর আয়াতসমূহ নিয়ে বিতর্কে লিপ্ত হয়। সুতরাং দেশে দেশে তাদের অবাধ বিচরণ যেন তোমাকে ধোঁকায় না ফেলে।",
    "এদের পূর্বে নূহের কওম এবং তাদের পরে অনেক দলও অস্বীকার করেছিল। প্রত্যেক উম্মতই স্ব স্ব রাসূলকে পাকড়াও করার সংকল্প করেছিল এবং সত্যকে বিদূরীত করার উদ্দেশ্যে তারা অসার বিতর্কে লিপ্ত হয়েছিল। ফলে আমি তাদেরকে পাকড়াও করলাম। সুতরাং কেমন ছিল আমার আযাব!",
    "আর এভাবে কাফিরদের ক্ষেত্রে তোমার রবের বাণী সত্যে পরিণত হল যে, নিশ্চয় এরা জাহান্নামী।",
    "যারা আরশকে ধারণ করে এবং যারা এর চারপাশে রয়েছে, তারা তাদের রবের প্রশংসাসহ তাসবীহ পাঠ করে এবং তাঁর প্রতি ঈমান রাখে। আর মুমিনদের জন্য ক্ষমা চেয়ে বলে যে, ‘হে আমাদের রব, আপনি রহমত ও জ্ঞান দ্বারা সব কিছুকে পরিব্যপ্ত করে রয়েছেন। অতএব যারা তাওবা করে এবং আপনার পথ অনুসরণ করে আপনি তাদেরকে ক্ষমা করে দিন। আর জাহান্নামের আযাব থেকে আপনি তাদেরকে রক্ষা করুন’।",
    "‘হে আমাদের রব, আর আপনি তাদেরকে স্থায়ী জান্নাতে প্রবেশ করান, যার ওয়াদা আপনি তাদেরকে দিয়েছেন। আর তাদের পিতা-মাতা, পতি-পত্নি ও সন্তান-সন্ততিদের মধ্যে যারা সৎকর্ম সম্পাদন করেছে তাদেরকেও। নিশ্চয় আপনি মহাপরাক্রমশালী, মহাপ্রজ্ঞাময়।’",
    "‘আর আপনি তাদের অপরাধের আযাব হতে রক্ষা করুন এবং সেদিন আপনি যাকে অপরাধের আযাব থেকে রক্ষা করবেন, অবশ্যই তাকে অনুগ্রহ করবেন। আর এটিই মহাসাফল্য।’",
    "নিশ্চয় যারা কুফরী করেছে তাদেরকে উচ্চকণ্ঠে বলা হবে; ‘তোমাদের নিজদের প্রতি তোমাদের (আজকের) এ অসন্তোষ অপেক্ষা অবশ্যই আল্লাহর অসন্তোষ অধিকতর ছিল, যখন তোমাদেরকে ঈমানের প্রতি আহবান করা হয়েছিল তারপর তোমরা তা অস্বীকার করেছিলে’।",
    "তারা বলবে, ‘হে আমাদের রব, আপনি আমাদেরকে দু’বার মৃত্যু দিয়েছেন এবং দু’বার জীবন দিয়েছেন। অতঃপর আমরা আমাদের অপরাধ স্বীকার করছি। অতএব (জাহান্নাম থেকে) বের হবার কোন পথ আছে কি’?",
    "[তাদেরকে বলা হবে] ‘এটা তো এজন্য যে, যখন আল্লাহকে এককভাবে ডাকা হত তখন তোমরা তাঁকে অস্বীকার করতে আর যখন তাঁর সাথে শরীক করা হত তখন তোমরা বিশ্বাস করতে। সুতরাং যাবতীয় কর্তৃত্ব সমুচ্চ, মহান আল্লাহর’।",
    "তিনিই তোমাদেরকে তাঁর নিদর্শনাবলী দেখান এবং আকাশ থেকে তোমাদের জন্য রিযক পাঠান। আর যে আল্লাহ অভিমুখী সেই কেবল উপদেশ গ্রহণ করে থাকে।",
    "সুতরাং তোমরা আল্লাহকে ডাক, তাঁর উদ্দেশ্যে দীনকে একনিষ্ঠভাবে নিবেদিত করে। যদিও কাফিররা অপছন্দ করে।",
    "আল্লাহ সুউচ্চ মর্যাদার অধিকারী, আরশের অধিপতি, তাঁর বান্দাদের মধ্য থেকে যার প্রতি ইচ্ছা আপন নির্দেশে তিনি ওহী পাঠান, যেন সে মহামিলন সম্পর্কে সতর্ক করেন।",
    "যে দিন লোকেরা প্রকাশ হয়ে পড়বে। সে দিন আল্লাহর নিকট তাদের কিছুই গোপন থাকবে না। ‘আজ রাজত্ব কার’? প্রবল প্রতাপশালী এক আল্লাহর।",
    "আজ প্রত্যেক ব্যক্তিকে তার অর্জন অনুসারে প্রতিদান দেয়া হবে। আজ কোন যুল্ম নেই। নিশ্চয় আল্লাহ দ্রুত হিসাবগ্রহণকারী।",
    "আর তুমি তাদের আসন্ন দিন সম্পর্কে সতর্ক করে দাও। যখন তাদের প্রাণ কণ্ঠাগত হবে দুঃখ, কষ্ট সংবরণ অবস্থায়। যালিমদের জন্য নেই কোন অকৃত্রিম বন্ধু, নেই এমন কোন সুপারিশকারী যাকে গ্রাহ্য করা হবে।",
    "চক্ষুসমূহের খেয়ানত এবং অন্তরসমূহ যা গোপন রাখে তিনি তা জানেন।",
    "আর আল্লাহ সঠিকভাবে ফয়সালা করেন এবং তাঁকে বাদ দিয়ে তারা যাদের ডাকে তারা কোন কিছুর ফয়সালা করতে পারবে না। নিশ্চয় আল্লাহ, তিনিই সর্বশ্রোতা, সর্বদ্রষ্টা।",
    "এরা কি যমীনে বিচরণ করে না? তাহলে দেখত, তাদের পূর্বে যারা ছিল তাদের পরিণতি কেমন হয়েছিল? তারা এদের তুলনায় যমীনে শক্তিমত্তা ও প্রভাব বিস্তারে প্রবলতর ছিল। অতঃপর আল্লাহ তাদের পাকড়াও করলেন তাদের পাপাচারের কারণে। আর তাদের জন্য ছিল না আল্লাহর পক্ষ থেকে কোন রক্ষাকারী।",
    "এটি এ কারণে যে, তাদের কাছে তাদের রাসূলগণ সুস্পষ্ট প্রমাণাদি নিয়ে আসত, কিন্তু তারা তাদেরকে প্রত্যাখ্যান করত। ফলে আল্লাহ তাদেরকে পাকড়াও করলেন। নিশ্চয় তিনি শক্তিমান, আযাবদানে কঠোর।",
    "আর অবশ্যই আমি মূসাকে আমার নিদর্শনাবলী ও স্পষ্ট প্রমাণসহ প্রেরণ করেছিলাম।",
    "ফির‘আউন, হামান ও কারূনের প্রতি। অতঃপর তারা বলল, ‘সে এক যাদুকর, চরম মিথ্যাবাদী’।",
    "অতঃপর যখন মূসা আমার কাছ থেকে সত্য নিয়ে তাদের কাছে উপস্থিত হয়েছিল, তখন তারা বলল, ‘যারা তার সাথে ঈমান এনেছে তোমরা তাদের ছেলে-সন্তানদেরকে হত্যা কর এবং তাদের মেয়ে-সন্তানদেরকে জীবিত রাখ’। আর কাফিরদের ষড়যন্ত্র কেবল ব্যর্থই হবে।",
    "আর ফির‘আউন বলল, ‘আমাকে ছেড়ে দাও, আমি মূসাকে হত্যা করি এবং সে তার রবকে ডাকুক; নিশ্চয় আমি আশঙ্কা করি, সে তোমাদের দীন পাল্টে দেবে অথবা সে যমীনে বিপর্যয় ছড়িয়ে দেবে।",
    "মূসা বলল, ‘আমি আমার রব ও তোমাদের রবের কাছে আশ্রয় প্রার্থনা করছি প্রত্যেক অহঙ্কারী থেকে, যে বিচার দিনের প্রতি ঈমান রাখে না’।",
    "‘আর ফির‘আউন বংশের এক মুমিন ব্যক্তি যে তার ঈমান গোপন রাখছিল সে বলল, ‘তোমরা কি একটি লোককে কেবল এ কারণে হত্যা করবে যে সে বলে, ‘আমার রব আল্লাহ’ অথচ সে তোমাদের রবের পক্ষ থেকে সুস্পষ্ট প্রমাণ নিয়ে তোমাদের কাছে এসেছে? সে যদি মিথ্যাবাদী হয় তবে তার উপরই বর্তাবে তার মিথ্যা; আর সে যদি সত্যবাদী হয় তবে যে বিষয়ে সে তোমাদেরকে ওয়াদা দিচ্ছে তার কিছু তোমাদের উপর আপতিত হবে। নিশ্চয় আল্লাহ তাকে হিদায়াত দেন না, যে সীমালংঘনকারী, মিথ্যাবাদী’।",
    "‘হে আমার কওম, আজ তোমাদের রাজত্ব; যমীনে তোমরাই কর্তৃত্বশীল; কিন্তু আল্লাহর আযাব আসলে কে আমাদেরকে সাহায্য করবে’? ফির‘আউন বলল, ‘যা আমি সঠিক মনে করি তা-ই আমি তোমাদেরকে দেখাই আর আমি তোমাদেরকে কেবল সঠিক পথই দেখাই’।",
    "আর যে ব্যক্তি ঈমান এনেছিল সে আরো বলল, ‘হে আমার সম্প্রদায়, নিশ্চয় আমি তোমাদের ব্যাপারে পূর্ববর্তী দলসমূহের দিনের অনুরূপ আশঙ্কা করি’;",
    "‘যেমন ঘটেছিল নূহ, ‘আদ ও ছামূদ-এর কওম এবং তাদের পরবর্তীদের। আর আল্লাহ বান্দাদের উপর কোন যুলম করতে চান না।’",
    "‘আর হে আমার কওম, আমি তোমাদের জন্য পারস্পরিক ভয়ার্ত আহবান দিনের আশঙ্কা করি’।",
    "‘যেদিন তোমরা পিছনে পালাতে চাইবে আল্লাহর থেকে তোমাদেরকে রক্ষা করার জন্য কেউ থাকবে না; আর আল্লাহ যাকে বিভ্রান্ত করেন তার জন্য কোন হিদায়াতকারী নেই’।",
    "আর অবশ্যই পূর্বে তোমাদের কাছে সুস্পষ্ট প্রমাণাদিসহ ইউসুফ এসেছিল, সে যা নিয়ে তোমাদের কাছে এসেছিল তা নিয়ে তোমরা সন্দেহে স্থির ছিলে; এমনকি যখন সে মারা গেল তখন তোমরা বললে, ‘আল্লাহ তার পরে কখনো কোন রাসূল পাঠাবেন না’। যে সীমালংঘনকারী, সংশয়বাদী, আল্লাহ তাকে এভাবেই পথভ্রষ্ট করেন।",
    "যারা নিজদের কাছে আগত কোন দলীল-প্রমাণ ছাড়া আল্লাহর নিদর্শনাবলী সম্পর্কে বিতর্কে লিপ্ত হয়। তাদের এ কাজ আল্লাহ ও মুমিনদের দৃষ্টিতে অতিশয় ঘৃণার্হ। এভাবেই আল্লাহ প্রত্যেক অহঙ্কারী স্বৈরাচারীর অন্তরে সীল মেরে দেন।",
    "ফির‘আউন আরও বলল, ‘হে হামান, আমার জন্য একটি উঁচু ইমারত বানাও যাতে আমি অবলম্বন পাই’।",
    "‘আসমানে আরোহরণের অবলম্বন, যাতে আমি মূসার ইলাহকে দেখতে পাই, আর আমি কেবল তাকে মিথ্যাবাদী মনে করি’। আর এভাবে ফির‘আউনের কাছে তার মন্দ কাজ শোভিত করে দেয়া হয়েছিল এবং তাকে বাধা দেয়া হয়েছিল সৎপথ থেকে। আর ফির‘আউনের ষড়যন্ত্র কেবল ব্যর্থই হয়েছিল।",
    "আর যে ব্যক্তি ঈমান এনেছিল, সে বলল, ‘হে আমার কওম, তোমরা আমার আনুগত্য কর; আমি তোমাদেরকে সঠিক পথ দেখাব’।",
    "‘হে আমার কওম, এ দুনিয়ার জীবন কেবল ক্ষণকালের ভোগ; আর নিশ্চয় আখিরাতই হল স্থায়ী আবাস’।",
    "‘কেউ পাপ কাজ করলে তাকে শুধু পাপের সমান প্রতিদান দেয়া হবে আর যে পুরুষ অথবা নারী মুমিন হয়ে সৎকাজ করবে, তবে তারা জান্নাতে প্রবেশ করবে, সেখানে তাদেরকে অগণিত রিয্ক দেয়া হবে।’",
    "‘আর হে আমার কওম, আমার কী হল যে, আমি তোমাদেরকে মুক্তির দিকে ডাকছি আর তোমরা আমাকে ডাকছ আগুনের দিকে!’",
    "‘তোমরা আমাকে ডাকছ আমি যেন আল্লাহর সাথে কুফরী করি, তাঁর সাথে শরীক করি যে ব্যাপারে আমার কোন জ্ঞান নেই; আর আমি তোমাদেরকে ডাকছি মহাপরাক্রমশালী ও পরম ক্ষমাশীলের দিকে।’",
    "‘এ ব্যাপারে কোন সন্দেহ নেই যে, যার দিকে তোমরা আমাকে ডাকছ, সে দুনিয়া বা আখিরাতে কারো ডাকের যোগ্য নয়। আর আমাদের প্রত্যাবর্তন হবে আল্লাহর দিকে এবং নিশ্চয় সীমালংঘনকারীরা হবে আগুনের সাথী’।",
    "‘আমি তোমাদেরকে যা বলছি, অচিরেই তোমরা তা স্মরণ করবে। আর আমার বিষয়টি আমি আল্লাহর নিকট সমর্পণ করছি; নিশ্চয় আল্লাহ তাঁর বান্দাদের ব্যাপারে সর্বদ্রষ্টা।’",
    "অতঃপর তাদের ষড়যন্ত্রের অশুভ পরিণাম থেকে আল্লাহ তাকে রক্ষা করলেন আর ফির‘আউনের অনুসারীদেরকে ঘিরে ফেলল কঠিন আযাব।",
    "আগুন, তাদেরকে সকাল-সন্ধ্যায় তার সামনে উপস্থিত করা হয়, আর যেদিন কিয়ামত সংঘটিত হবে (সেদিন ঘোষণা করা হবে), ‘ফির‘আউনের অনুসারীদেরকে কঠোরতম আযাবে প্রবেশ করাও।’",
    "আর জাহান্নামে তারা যখন বানানুবাদে লিপ্ত হবে তখন দুর্বলরা, যারা অহঙ্কার করেছিল, তাদেরকে বলবে, ‘আমরা তো তোমাদের অনুসারী ছিলাম, অতএব তোমরা কি আমাদের থেকে আগুনের কিয়দংশ বহন করবে’?",
    "অহঙ্কারীরা বলবে, ‘আমরা সবাই এতে আছি; নিশ্চয় আল্লাহ বান্দাদের মধ্যে ফয়সালা করে ফেলেছেন।’",
    "আর যারা আগুনে থাকবে তারা আগুনের দারোয়ানদেরকে বলবে, ‘তোমাদের রবকে একটু ডাকো না! তিনি যেন একটি দিন আমাদের আযাব লাঘব করে দেন।’",
    "তারা বলবে, ‘তোমাদের কাছে কি সুস্পষ্ট প্রমাণাদিসহ তোমাদের রাসূলগণ আসেনি’? জাহান্নামীরা বলবে, ‘হ্যাঁ অবশ্যই’। দারোয়ানরা বলবে, ‘তবে তোমরাই দো‘আ কর। আর কাফিরদের দো‘আ কেবল নিষ্ফলই হয়’।",
    "নিশ্চয় আমি আমার রাসূলদেরকে ও মুমিনদেরকে দুনিয়ার জীবনে এবং যেদিন সাক্ষীগণ দন্ডায়মান হবে সেদিন সাহায্য করব।",
    "যেদিন যালিমদের কোন ওযর-আপত্তি তাদের উপকার করবে না। আর তাদের জন্য রয়েছে লা‘নত এবং তাদের জন্য রয়েছে নিকৃষ্ট নিবাস।",
    "আর অবশ্যই আমি মূসাকে হিদায়াত দান করেছিলাম এবং বনী ইসরাঈলকে কিতাবের উত্তরাধিকারী করেছিলাম,",
    "যা জ্ঞান-বুদ্ধিসম্পন্নদের জন্য হিদায়াত ও উপদেশ।",
    "কাজেই তুমি ধৈর্য ধারণ কর, নিশ্চয় আল্লাহর ওয়াদা সত্য। আর তুমি তোমার ত্রুটির জন্য ক্ষমা প্রার্থনা কর এবং সকাল- সন্ধ্যায় তোমার রবের প্রশংসাসহ তাসবীহ পাঠ কর।",
    "নিশ্চয় যারা তাদের নিকট আসা কোন দলীল- প্রমাণ ছাড়াই আল্লাহর নিদর্শনাবলী সম্পর্কে বিতর্ক করে, তাদের অন্তরসমূহে আছে কেবল অহঙ্কার, তারা কিছুতেই সেখানে (সাফল্যের মনযিলে) পৌঁছবে না। কাজেই তুমি আল্লাহর কাছে আশ্রয় চাও, নিশ্চয় তিনি সর্বশ্রোতা, সর্বদ্রষ্টা।",
    "অবশ্যই আসমানসমূহ ও যমীন সৃষ্টি করা মানুষ সৃষ্টি করার চেয়ে বড় বিষয়; কিন্তু অধিকাংশ মানুষই তা জানে না।",
    "আর সমান হয় না অন্ধ ও দৃষ্টিশক্তিসম্পন্ন ব্যক্তি এবং যারা ঈমান আনে ও সৎকর্ম করে, আর যারা অপরাধী। তোমরা খুব সামান্যই উপদেশ গ্রহণ করে থাক।",
    "নিশ্চয় কিয়ামত আসবেই, এতে কোন সন্দেহ নেই। কিন্তু অধিকাংশ লোক ঈমান আনে না।",
    "আর তোমাদের রব বলেছেন, ‘তোমরা আমাকে ডাক, আমি তোমাদের জন্য সাড়া দেব। নিশ্চয় যারা অহঙ্কার বশতঃ আমার ইবাদাত থেকে বিমুখ থাকে, তারা অচিরেই লাঞ্ছিত অবস্থায় জাহান্নামে প্রবেশ করবে।’",
    "আল্লাহ, যিনি তোমাদের জন্য রাত বানিয়েছেন যাতে তোমরা তাতে বিশ্রাম করতে পার এবং দিনকে করেছেন আলোকোজ্জ্বল। নিশ্চয় আল্লাহ মানুষের প্রতি বড়ই অনুগ্রহশীল; কিন্তু অধিকাংশ মানুষ কৃতজ্ঞতা প্রকাশ করে না।",
    "তিনি আল্লাহ, তোমাদের রব; সব কিছুর সৃষ্টিকর্তা, তিনি ছাড়া কোন (সত্য) ইলাহ নেই। সুতরাং তোমাদেরকে কোথায় ফিরিয়ে নেয়া হচ্ছে?",
    "যারা আল্লাহর নিদর্শনাবলীকে অস্বীকার করে, তাদেরকে এভাবেই ফিরিয়ে নেয়া হয়।",
    "আল্লাহ, যিনি তোমাদের জন্য যমীনকে স্থিতিশীল করেছেন এবং আসমানকে করেছেন ছাদ। আর তিনি তোমাদেরকে আকৃতি দিয়েছেন, অতঃপর তোমাদের আকৃতিকে সুন্দর করেছেন এবং তিনি পবিত্র বস্তু থেকে তোমাদেরকে রিয্ক দান করেছেন। তিনিই আল্লাহ, তোমাদের রব। সুতরাং সৃষ্টিকুলের রব আল্লাহ কত বরকতময়;",
    "তিনি চিরঞ্জীব, তিনি ছাড়া কোন (সত্য) ইলাহ নেই। সুতরাং তোমরা দীনকে তাঁর জন্য একনিষ্ঠ করে তাঁকে ডাক। সকল প্রশংসা আল্লাহর যিনি সৃষ্টিকুলের রব।",
    "বল, ‘যেহেতু আমার রবের পক্ষ থেকে আমার কাছে সুস্পষ্ট প্রমাণাদি এসেছে, তাই তোমরা আল্লাহ ছাড়া যাদেরকে আহবান কর, নিশ্চয় তাদের ইবাদাত করতে আমাকে নিষেধ করা হয়েছে। আর সৃষ্টিকুলের রবের নিকট আত্মসমর্পণ করতে আমি আদিষ্ট হয়েছি’।",
    "তিনিই তোমাদেরকে মাটি থেকে সৃষ্টি করেছেন। তারপর শুক্রবিন্দু থেকে, তারপর ‘আলাকা’* থেকে। অতঃপর তিনি তোমাদেরকে শিশুরূপে বের করে আনেন। তারপর যেন তোমরা তোমাদের যৌবনে পদার্পণ কর, অতঃপর যেন তোমরা বৃদ্ধ হয়ে যাও। আর তোমাদের কেউ কেউ এর পূর্বেই মারা যায়। আর যাতে তোমরা নির্ধারিত সময়ে পৌঁছে যাও। আর যাতে তোমরা অনুধাবন কর। \n* ‘আলাকা’ সম্পর্কে দ্র. সূরা মু’মিনূন ২৩ এর ১৪ নং আয়াতের টীকা।",
    "তিনিই জীবন দান করেন এবং মৃত্যু দেন। আর তিনি যখন কোন কিছু করার সিদ্ধান্ত নেন, তখন তিনি এজন্য বলেন ‘হও’, ফলে তা হয়ে যায়।",
    "তুমি কি তাদের প্রতি লক্ষ্য করনি যারা আল্লাহর নিদর্শনাবলী সম্পর্কে বাকবিতন্ডা করে? তাদেরকে কোথায় ফিরানো হচ্ছে?",
    "যারা কিতাব এবং আমার রাসূলগণকে যা দিয়ে আমি প্রেরণ করেছি তা অস্বীকার করে, অতএব তারা শীঘ্রই জানতে পারবে।",
    "যখন তাদের গলদেশে বেড়ী ও শিকল থাকবে, তাদেরকে টেনে নিয়ে যাওয়া হবে-",
    "ফুটন্ত পানিতে, অতঃপর তাদেরকে আগুনে পোড়ানো হবে।",
    "তারপর তাদেরকে বলা হবে, ‘কোথায় তারা, যাদেরকে তোমরা শরীক করতে-",
    "আল্লাহ ছাড়া’? তারা বলবে, ‘তারা তো আমাদের কাছ থেকে উধাও হয়ে গেছে’, বরং এর পূর্বে আমরা কোন কিছুকে আহবান করিনি’। এভাবেই আল্লাহ কাফিরদেরকে পথভ্রষ্ট করেন।",
    "এটা এ জন্য যে, তোমরা যমীনে অযথা উল্লাস করতে এবং এজন্য যে, তোমরা অহঙ্কার করতে।",
    "তোমরা জাহান্নামের দরজাসমূহ দিয়ে প্রবেশ কর চিরকাল তাতে অবস্থানের জন্য। অতএব অহঙ্কারীদের বাসস্থান কতইনা নিকৃষ্ট!",
    "অতএব তুমি ধৈর্যধারণ কর। নিশ্চয় আল্লাহর ওয়াদা সত্য। আর আমি তাদেরকে যে ওয়াদা দেই, তার কিছু অংশ যদি তোমাকে দেখাই অথবা তোমাকে মৃত্যু দেই, তাহলেও তারা আমার কাছে প্রত্যাবর্তিত হবে।",
    "আর অবশ্যই আমি তোমার পূর্বে অনেক রাসূল পাঠিয়েছি। তাদের মধ্যে কারো কারো কাহিনী আমি তোমার কাছে বর্ণনা করেছি আর কারো কারো কাহিনী তোমার কাছে বর্ণনা করিনি। আর আল্লাহর অনুমতি ছাড়া কোন নিদর্শন নিয়ে আসা কোন রাসূলের উচিৎ নয়। তারপর যখন আল্লাহর নির্দেশ আসবে, তখন ন্যায়সঙ্গতভাবে ফয়সালা করা হবে। আর তখনই বাতিলপন্থীরা ক্ষতিগ্রস্ত হবে।",
    "আল্লাহই তোমাদের জন্য গবাদি পশু সৃষ্টি করেছেন, যাতে তোমরা এদের কতকের উপর আরোহণ করতে পার আর কতক তোমরা খেতে পার।",
    "আর এতে তোমাদের জন্য রয়েছে অনেক উপকার এবং যাতে তোমরা নিজদের অন্তরে যে প্রয়োজন অনুভব কর, ওগুলো দ্বারা তা পূর্ণ করতে পার। ওগুলোর উপর আর নৌযানের উপর তোমাদেরকে বহন করা হয়।",
    "আর তিনি তোমাদেরকে তাঁর নিদর্শনাবলী দেখান। অতএব তোমরা আল্লাহর কোন্ কোন্ নিদর্শনকে অস্বীকার করবে?",
    "তারা কি যমীনে ভ্রমণ করেনি, তা হলে তারা দেখত, তাদের পূর্ববর্তীদের পরিণাম কেমন হয়েছিল? তারা যমীনে ছিল তাদের চেয়ে সংখ্যায় অধিক, আর শক্তিতে ও কীর্তিতে তাদের চেয়ে অধিক প্রবল। অতঃপর তারা যা অর্জন করত তা তাদের কোন কাজে আসেনি।",
    "তারপর তাদের কাছে যখন তাদের রাসূলগণ স্পষ্ট প্রমাণাদিসহ আসল তখন তারা তাদের নিজদের কাছে যে বিদ্যা ছিল তাতেই উৎফুল্ল হয়ে উঠল। আর যা নিয়ে তাঁরা ঠাট্টা-বিদ্রূপ করত তা-ই তাদেরকে পরিবেষ্টন করল।",
    "তারপর তারা যখন আমার আযাব দেখল তখন বলল, ‘আমরা এক আল্লাহর প্রতি ঈমান আনলাম, আর যাদেরকে আমরা তার সাথে শরীক করতাম তাদেরকে প্রত্যাখ্যান করলাম’।",
    "সুতরাং তারা যখন আমার আযাব দেখল তখন তাদের ঈমান তাদের কোন উপকার করল না। এটা আল্লাহর বিধান, তাঁর বান্দাদের মধ্যে চলে আসছে। আর তখনই কাফিররা ক্ষতিগ্রস্ত হয়েছে।"
  ]
}