{
  "surahName": "At-Tur",
  "surahNameArabic": "الطور",
  "surahNameArabicLong": "سورة الطور",
  "surahNameTranslation": "The Mount",
  "revelationPlace": "Mecca",
  "totalAyah": 49,
  "surahNo": 52,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/52.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/052.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/52.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/052.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/52.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/052.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/52.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/052.mp3"
    }
  },
  "english": [
    "By Mount Ṭûr!",
    "And by the Book written",
    "on open pages ˹for all to read˺!",
    "And by the ˹Sacred˺ House frequently visited!",
    "And by the canopy raised ˹high˺!",
    "And by the seas set on fire!",
    "Indeed, the punishment of your Lord will come to pass—",
    "none will avert it—",
    "on the Day the heavens will be shaken violently",
    "and the mountains will be blown away entirely.",
    "Then woe on that Day to the deniers—",
    "those who amuse themselves with falsehood!",
    "˹It is˺ the Day they will be fiercely shoved into the Fire of Hell.",
    "˹They will be told,˺ “This is the Fire which you used to deny.",
    "Is this magic, or do you not see?",
    "Burn in it! It is the same whether you endure ˹it˺ patiently or not. You are only rewarded for what you used to do.”",
    "Indeed, the righteous will be in Gardens and bliss",
    "enjoying whatever their Lord will have granted them. And their Lord will have protected them from the torment of the Hellfire.",
    "˹They will be told,˺ “Eat and drink happily for what you used to do.”",
    "They will be reclining on thrones, ˹neatly˺ lined up ˹facing each other˺. And We will pair them to maidens with gorgeous eyes.",
    "As for those who believe and whose descendants follow them in faith, We will elevate their descendants to their rank, never discounting anything ˹of the reward˺ of their deeds. Every person will reap only what they sowed.",
    "And We will ˹continually˺ provide them with whatever fruit or meat they desire.",
    "They will pass around to each other a drink ˹of pure wine,˺ which leads to no idle talk or sinfulness.",
    "And they will be waited on by their youthful servants like spotless pearls.",
    "They will turn to one another inquisitively.",
    "They will say, “Before ˹this reward˺ we used to be in awe ˹of Allah˺ in the midst of our people.",
    "So Allah has graced us and protected us from the torment of ˹Hell’s˺ scorching heat.",
    "Indeed, we used to call upon Him ˹alone˺ before. He is truly the Most Kind, Most Merciful.”",
    "So ˹continue to˺ remind ˹all, O  Prophet˺. For you, by the grace of your Lord, are not a fortune-teller or a madman.",
    "Or do they say, “˹He is˺ a poet, for whom we ˹eagerly˺ await an ill-fate!”?",
    "Say, “Keep waiting! I too am waiting with you.”",
    "Or do their ˹intelligent˺ minds prompt them to this ˹paradox˺? Or are they ˹just˺ a transgressing people?",
    "Or do they say, “He made this ˹Quran˺ up!”? In fact, they have no faith.",
    "Let them then produce something like it, if what they say is true!",
    "Or were they created by nothing, or are they ˹their own˺ creators?",
    "Or did they create the heavens and the earth? In fact, they have no firm belief ˹in Allah˺.",
    "Or do they possess the treasuries of your Lord, or are they in control ˹of everything˺?",
    "Or do they have a stairway, by which they eavesdrop ˹on the heavens˺? Then let those who do so bring a compelling proof.",
    "Or does He have daughters ˹as you claim˺, while you ˹prefer to˺ have sons?",
    "Or are you ˹O Prophet˺ asking them for a reward ˹for the message˺ so that they are overburdened by debt?",
    "Or do they have access to ˹the Record in˺ the unseen, so they copy it ˹for all to see˺?",
    "Or do they intend to scheme ˹against the Prophet˺? Then it is the disbelievers who will fall victim to ˹their˺ schemes.",
    "Or do they have a god other than Allah? Glorified is Allah far above what they associate ˹with Him˺!",
    "If they were to see a ˹deadly˺ piece of the sky fall down ˹upon them˺, still they would say, “˹This is just˺ a pile of clouds.”",
    "So leave them until they face their Day in which they will be struck dead—",
    "the Day their scheming will be of no benefit to them whatsoever, nor will they be helped.",
    "Also, the wrongdoers will certainly have another torment before that ˹Day˺, but most of them do not know.",
    "So be patient with your Lord’s decree, for you are truly under Our ˹watchful˺ Eyes. And glorify the praises of your Lord when you rise.",
    "And glorify Him during part of the night and at the fading of the stars."
  ],
  "arabic1": [
    "وَالطُّوْرِ",
    "وَكِتٰبٍ مَّسْطُوْرٍ",
    "فِیْ رَقٍّ مَّنْشُوْرٍ",
    "وَّالْبَیْتِ الْمَعْمُوْرِ",
    "وَالسَّقْفِ الْمَرْفُوْعِ",
    "وَالْبَحْرِ الْمَسْجُوْرِ",
    "اِنَّ عَذَابَ رَبِّكَ لَوَاقِعٌ",
    "مَّا لَهٗ مِنْ دَافِعٍ",
    "یَّوْمَ تَمُوْرُ السَّمَآءُ مَوْرًا",
    "وَّتَسِیْرُ الْجِبَالُ سَیْرًا",
    "فَوَیْلٌ یَّوْمَىِٕذٍ لِّلْمُكَذِّبِیْنَ",
    "الَّذِیْنَ هُمْ فِیْ خَوْضٍ یَّلْعَبُوْنَ",
    "یَوْمَ یُدَعُّوْنَ اِلٰی نَارِ جَهَنَّمَ دَعًّا",
    "هٰذِهِ النَّارُ الَّتِیْ كُنْتُمْ بِهَا تُكَذِّبُوْنَ",
    "اَفَسِحْرٌ هٰذَاۤ اَمْ اَنْتُمْ لَا تُبْصِرُوْنَ",
    "اِصْلَوْهَا فَاصْبِرُوْۤا اَوْ لَا تَصْبِرُوْا سَوَآءٌ عَلَیْكُمْ اِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُوْنَ",
    "اِنَّ الْمُتَّقِیْنَ فِیْ جَنّٰتٍ وَّنَعِیْمٍ",
    "فٰكِهِیْنَ بِمَاۤ اٰتٰىهُمْ رَبُّهُمْ وَوَقٰىهُمْ رَبُّهُمْ عَذَابَ الْجَحِیْمِ",
    "كُلُوْا وَاشْرَبُوْا هَنِیْٓـًٔا بِمَا كُنْتُمْ تَعْمَلُوْنَ",
    "مُتَّكِـِٕیْنَ عَلٰی سُرُرٍ مَّصْفُوْفَةٍ وَزَوَّجْنٰهُمْ بِحُوْرٍ عِیْنٍ",
    "وَالَّذِیْنَ اٰمَنُوْا وَاتَّبَعَتْهُمْ ذُرِّیَّتُهُمْ بِاِیْمَانٍ اَلْحَقْنَا بِهِمْ ذُرِّیَّتَهُمْ وَمَاۤ اَلَتْنٰهُمْ مِّنْ عَمَلِهِمْ مِّنْ شَیْءٍ كُلُّ امْرِىۢ بِمَا كَسَبَ رَهِیْنٌ",
    "وَاَمْدَدْنٰهُمْ بِفَاكِهَةٍ وَّلَحْمٍ مِّمَّا یَشْتَهُوْنَ",
    "یَتَنَازَعُوْنَ فِیْهَا كَاْسًا لَّا لَغْوٌ فِیْهَا وَلَا تَاْثِیْمٌ",
    "وَیَطُوْفُ عَلَیْهِمْ غِلْمَانٌ لَّهُمْ كَاَنَّهُمْ لُؤْلُؤٌ مَّكْنُوْنٌ",
    "وَاَقْبَلَ بَعْضُهُمْ عَلٰی بَعْضٍ یَّتَسَآءَلُوْنَ",
    "قَالُوْۤا اِنَّا كُنَّا قَبْلُ فِیْۤ اَهْلِنَا مُشْفِقِیْنَ",
    "فَمَنَّ اللّٰهُ عَلَیْنَا وَوَقٰىنَا عَذَابَ السَّمُوْمِ",
    "اِنَّا كُنَّا مِنْ قَبْلُ نَدْعُوْهُ اِنَّهٗ هُوَ الْبَرُّ الرَّحِیْمُ",
    "فَذَكِّرْ فَمَاۤ اَنْتَ بِنِعْمَتِ رَبِّكَ بِكَاهِنٍ وَّلَا مَجْنُوْنٍ",
    "اَمْ یَقُوْلُوْنَ شَاعِرٌ نَّتَرَبَّصُ بِهٖ رَیْبَ الْمَنُوْنِ",
    "قُلْ تَرَبَّصُوْا فَاِنِّیْ مَعَكُمْ مِّنَ الْمُتَرَبِّصِیْنَ",
    "اَمْ تَاْمُرُهُمْ اَحْلَامُهُمْ بِهٰذَاۤ اَمْ هُمْ قَوْمٌ طَاغُوْنَ",
    "اَمْ یَقُوْلُوْنَ تَقَوَّلَهٗ بَلْ لَّا یُؤْمِنُوْنَ",
    "فَلْیَاْتُوْا بِحَدِیْثٍ مِّثْلِهٖۤ اِنْ كَانُوْا صٰدِقِیْنَ",
    "اَمْ خُلِقُوْا مِنْ غَیْرِ شَیْءٍ اَمْ هُمُ الْخٰلِقُوْنَ",
    "اَمْ خَلَقُوا السَّمٰوٰتِ وَالْاَرْضَ بَلْ لَّا یُوْقِنُوْنَ",
    "اَمْ عِنْدَهُمْ خَزَآىِٕنُ رَبِّكَ اَمْ هُمُ الْمُصَیْطِرُوْنَ",
    "اَمْ لَهُمْ سُلَّمٌ یَّسْتَمِعُوْنَ فِیْهِ فَلْیَاْتِ مُسْتَمِعُهُمْ بِسُلْطٰنٍ مُّبِیْنٍ",
    "اَمْ لَهُ الْبَنٰتُ وَلَكُمُ الْبَنُوْنَ",
    "اَمْ تَسْـَٔلُهُمْ اَجْرًا فَهُمْ مِّنْ مَّغْرَمٍ مُّثْقَلُوْنَ",
    "اَمْ عِنْدَهُمُ الْغَیْبُ فَهُمْ یَكْتُبُوْنَ",
    "اَمْ یُرِیْدُوْنَ كَیْدًا فَالَّذِیْنَ كَفَرُوْا هُمُ الْمَكِیْدُوْنَ",
    "اَمْ لَهُمْ اِلٰهٌ غَیْرُ اللّٰهِ سُبْحٰنَ اللّٰهِ عَمَّا یُشْرِكُوْنَ",
    "وَاِنْ یَّرَوْا كِسْفًا مِّنَ السَّمَآءِ سَاقِطًا یَّقُوْلُوْا سَحَابٌ مَّرْكُوْمٌ",
    "فَذَرْهُمْ حَتّٰی یُلٰقُوْا یَوْمَهُمُ الَّذِیْ فِیْهِ یُصْعَقُوْنَ",
    "یَوْمَ لَا یُغْنِیْ عَنْهُمْ كَیْدُهُمْ شَیْـًٔا وَّلَا هُمْ یُنْصَرُوْنَ",
    "وَاِنَّ لِلَّذِیْنَ ظَلَمُوْا عَذَابًا دُوْنَ ذٰلِكَ وَلٰكِنَّ اَكْثَرَهُمْ لَا یَعْلَمُوْنَ",
    "وَاصْبِرْ لِحُكْمِ رَبِّكَ فَاِنَّكَ بِاَعْیُنِنَا وَسَبِّحْ بِحَمْدِ رَبِّكَ حِیْنَ تَقُوْمُ",
    "وَمِنَ الَّیْلِ فَسَبِّحْهُ وَاِدْبَارَ النُّجُوْمِ"
  ],
  "bengali": [
    "কসম তূর পর্বতের,",
    "আর কসম কিতাবের যা লিপিবদ্ধ আছে।",
    "উন্মুক্ত পাতায়।",
    "কসম আবাদ গৃহের,* \n* আবাদ গৃহ বলতে সপ্তাকাশের বায়তুল মা‘মূরকে বুঝানো হয়েছে। অগণিত ফেরেশতা নিরবচ্ছিন্ন ইবাদাতে যা আবাদ রেখেছে।",
    "আর সমুন্নত আকাশের;",
    "কসম তরঙ্গ-বিক্ষুব্ধ সাগরের,* \n* অন্য তাফসীর মতে-আগুনের সাগর যা দুনিয়াতে হতে পারে, অথবা কিয়ামতে।",
    "নিশ্চয় তোমার রবের আযাব অবশ্যম্ভাবী।",
    "যার কোন প্রতিরোধকারী নেই।",
    "যেদিন তীব্রভাবে আকাশ প্রকম্পিত হবে,",
    "আর পর্বতমালা দ্রুত পরিভ্রমণ করবে,",
    "অতএব মিথ্যারোপকারীদের জন্য সেদিনের ধ্বংস,",
    "যারা খেল-তামাশায় মত্ত থাকে।",
    "সেদিন তাদেরকে জাহান্নামের আগুনের দিকে হাঁকিয়ে নিয়ে যাওয়া হবে।",
    "‘এটি সেই জাহান্নাম যা তোমরা অস্বীকার করতে।’",
    "‘এটি কি যাদু, নাকি তোমরা দেখতে পাচ্ছ না!’",
    "তোমরা আগুনে প্রবেশ কর*, তারপর তোমরা ধৈর্যধারণ কর বা না কর, উভয়ই তোমাদের জন্য সমান; তোমাদেরকে তো কেবল তোমাদের আমলের প্রতিফল দেয়া হচ্ছে। \n* অন্য তাফসীর মতে- ‘‘তোমরা এর উত্তাপ ভোগ কর’’।",
    "নিশ্চয় মুত্তাকীরা (থাকবে) জান্নাতে ও প্রাচুর্যে।",
    "তাদের রব তাদেরকে যা দিয়েছেন তা উপভোগ করবে, আর তাদের রব তাদেরকে বাঁচাবেন জ্বলন্ত আগুনের আযাব থেকে।",
    "তোমরা তৃপ্তি সহকারে খাও ও পান কর, তোমরা যে আমল করতে তার বিনিময়ে।",
    "সারিবদ্ধ পালঙ্কে তারা হেলান দিয়ে বসবে; আর আমি তাদেরকে মিলায়ে দেব ডাগরচোখা হূর-এর সাথে।",
    "আর যারা ঈমান আনে এবং তাদের সন্তান-সন্ততি ঈমানের সাথে তাদের অনুসরণ করে, আমরা তাদের সাথে তাদের সন্তানদের মিলন ঘটাব এবং তাদের কর্মের কোন অংশই কমাব না। প্রত্যেক ব্যক্তি তার কামাইয়ের ব্যাপারে দায়ী থাকবে।",
    "আর আমি তাদেরকে অতিরিক্ত দেব ফলমূল ও গোশত যা তারা কামনা করবে।",
    "তারা পরস্পরের মধ্যে পানপাত্র বিনিময় করবে; সেখানে থাকবে না কোন বেহুদা কথাবার্তা এবং কোন পাপকাজ।",
    "আর তাদের সেবায় চারপাশে ঘুরবে বালকদল; তারা যেন সুরক্ষিত মুক্তা।",
    "আর তারা একে অপরের মুখোমুখি হয়ে জিজ্ঞাসাবাদ করবে,",
    "তারা বলবে, ‘পূর্বে আমরা আমাদের পরিবারের মধ্যে শঙ্কিত ছিলাম।’",
    "‘অতঃপর আল্লাহ আমাদের প্রতি দয়া করেছেন এবং আগুনের আযাব থেকে আমাদেরকে রক্ষা করেছেন।’",
    "নিশ্চয় পূর্বে আমরা তাঁকে ডাকতাম; নিশ্চয় তিনি ইহসানকারী, পরম দয়ালু।",
    "অতএব, তুমি উপদেশ দিতে থাক; কারণ তোমার রবের অনুগ্রহে তুমি গণক নও এবং উন্মাদও নও।",
    "তারা কি বলছে, ‘সে (মুহাম্মাদ) একজন কবি? আমরা তার মৃত্যুর প্রতীক্ষা করছি।’",
    "বল, ‘তোমরা অপেক্ষায় থাক! আমিও তোমাদের সাথে প্রতীক্ষাকারীদের অন্তর্ভুক্ত রইলাম।’",
    "তাদের বিবেক কি তাদেরকে এ আদেশ দেয়, না তারা সীমালংঘনকারী কওম?",
    "তারা কি বলে, ‘সে এটা বানিয়ে বলছে?’ বরং তারা ঈমান আনে না।",
    "অতএব, তারা যদি সত্যবাদী হয় তবে তার অনুরূপ বাণী নিয়ে আসুক।",
    "তারা কি স্রষ্টা ছাড়া সৃষ্টি হয়েছে, না তারাই স্রষ্টা?",
    "তারা কি আসমান ও যমীন সৃষ্টি করেছে? বরং তারা দৃঢ় বিশ্বাস করে না।",
    "তোমার রবের গুপ্তভান্ডার কি তাদের কাছে আছে, না তারা সব কিছু নিয়ন্ত্রণকারী?",
    "নাকি তাদের আছে সিঁড়ি, যাতে চড়ে তারা (ঊর্ধ্বলোকের কথা) শুনতে পায়; তাদের শ্রোতা স্পষ্ট প্রমাণ নিয়ে আসুক না?",
    "তবে কি কন্যাসন্তান তাঁর; আর পুত্রসন্তান তোমাদের?",
    "তবে কি তুমি তাদের কাছে প্রতিদান চাও যে, তারা তা ভারী জরিমানা মনে করে?",
    "নাকি তাদের কাছে আছে গায়েবের জ্ঞান, যা তারা লিখছে?",
    "নাকি তারা ষড়যন্ত্র করতে চায়? অতএব যারা কুফরী করে তারাই হবে ষড়যন্ত্রের শিকার।",
    "নাকি তাদের জন্য আল্লাহ ছাড়া অন্য ইলাহ আছে? তারা যে শিরক করে তা থেকে আল্লাহ পবিত্র।",
    "আর কোন আকাশখন্ড ভেঙ্গে পড়তে দেখলে তারা বলবে, ‘এটি তো এক পুঞ্জীভূত মেঘ’!",
    "অতএব, তাদেরকে ছেড়ে দাও সেদিন পর্যন্ত যেদিন তারা ধ্বংস হবে।",
    "যেদিন তাদের পক্ষ থেকে কৃত তাদের ষড়যন্ত্র কোন কাজে আসবে না এবং তারা সাহায্যপ্রাপ্তও হবে না।",
    "আর নিশ্চয় যারা যুলম করবে তাদের জন্য থাকবে এছাড়া আরো আযাব; কিন্তু তাদের বেশীরভাগই জানে না।",
    "আর তোমাদের রবের সিদ্ধান্তের জন্য ধৈর্যধারণ কর; কারণ তুমি আমার চোখের সামনেই আছ, তুমি যখন জেগে ওঠ তখন তোমার রবের সপ্রশংস তাসবীহ পাঠ কর।",
    "আর রাতের কিছু অংশে এবং নক্ষত্রের অস্ত যাবার পর তার তাসবীহ পাঠ কর।"
  ]
}