{
  "surahName": "Ash-Shu'araa",
  "surahNameArabic": "الشعراء",
  "surahNameArabicLong": "سورة الشعراء",
  "surahNameTranslation": "The Poets",
  "revelationPlace": "Mecca",
  "totalAyah": 227,
  "surahNo": 26,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/26.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/026.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/26.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/026.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/26.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/026.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/26.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/026.mp3"
    }
  },
  "english": [
    "Ṭâ-Sĩn-Mĩm.",
    "These are the verses of the clear Book.",
    "Perhaps you ˹O Prophet˺ will grieve yourself to death over their disbelief.",
    "If We willed, We could send down upon them a ˹compelling˺ sign from the heavens, leaving their necks bent in ˹utter˺ submission to it.",
    "Whatever new reminder comes to them from the Most Compassionate, they always turn away from it.",
    "They have certainly denied ˹the truth˺, so they will soon face the consequences of their ridicule.",
    "Have they failed to look at the earth, ˹to see˺ how many types of fine plants We have caused to grow in it?",
    "Surely in this is a sign. Yet most of them would not believe.",
    "And your Lord is certainly the Almighty, Most Merciful.",
    "˹Remember˺ when your Lord called out to Moses, “Go to the wrongdoing people—",
    "the people of Pharaoh. Will they not fear ˹Allah˺?”",
    "He replied, “My Lord! I fear that they will reject me.",
    "And ˹so˺ my heart will be broken and my tongue will be tied. So send Aaron along ˹as a messenger˺.",
    "Also, they have a charge against me, so I fear they may kill me.”",
    "Allah responded, “Certainly not! So go, both of you, with Our signs. We will be with you, listening.",
    "Go to Pharaoh and say, ‘We are messengers from the Lord of all worlds",
    "˹commanded to say:˺ ‘Let the Children of Israel go with us.’’”",
    "Pharaoh protested, “Did we not raise you among us as a child, and you stayed several years of your life in our care?",
    "Then you did what you did, being ˹utterly˺ ungrateful!”",
    "Moses replied, “I did it then, lacking guidance.",
    "So I fled from you when I feared you. Then my Lord granted me wisdom and made me one of the messengers.",
    "How can that be a ‘favour,’ of which you remind me, when ˹it was only because˺ you ˹have˺ enslaved the Children of Israel?”",
    "Pharaoh asked, “And what is ‘the Lord of all worlds’?”",
    "Moses replied, “˹He is˺ the Lord of the heavens and the earth and everything in between, if only you had sure faith.”",
    "Pharaoh said to those around him, “Did you hear ˹what he said˺?”",
    "Moses added, “˹He is˺ your Lord and the Lord of your forefathers.”",
    "Pharaoh said ˹mockingly˺, “Your messenger, who has been sent to you, must be insane.”",
    "Moses responded: “˹He is˺ the Lord of the east and west, and everything in between, if only you had any sense.”",
    "Pharaoh threatened, “If you take any other god besides me, I will certainly have you imprisoned.”",
    "Moses responded, “Even if I bring you a clear proof?”",
    "Pharaoh demanded, “Bring it then, if what you say is true.”",
    "So he threw down his staff and—behold!—it became a real snake.",
    "Then he drew his hand ˹out of his collar˺ and it was ˹shining˺ white for all to see.",
    "Pharaoh said to the chiefs around him, “He is indeed a skilled magician",
    "who seeks to drive you from your land by his magic. So what do you propose?”",
    "They replied, “Let him and his brother wait and dispatch mobilizers to all cities",
    "to bring you every skilled magician.”",
    "So the magicians were assembled at the set time on the appointed day.",
    "And the people were asked, “Will you join the gathering",
    "so that we may follow the magicians if they prevail?”",
    "When the magicians came, they asked Pharaoh, “Shall we have a ˹suitable˺ reward if we prevail?”",
    "He replied, “Yes, and you will then certainly be among those closest to me.”",
    "Moses said to them, “Cast whatever you wish to cast.”",
    "So they cast down their ropes and staffs, saying, “By Pharaoh’s might, it is we who will surely prevail.”",
    "Then Moses threw down his staff, and—behold!—it devoured the objects of their illusion!",
    "So the magicians fell down, prostrating.",
    "They declared, “We ˹now˺ believe in the Lord of all worlds—",
    "the Lord of Moses and Aaron.”",
    "Pharaoh threatened, “How dare you believe in him before I give you permission? He must be your master who taught you magic, but soon you will see. I will certainly cut off your hands and feet on opposite sides, then crucify you all.”",
    "They responded, “˹That would be˺ no harm! Surely to our Lord we will ˹all˺ return.",
    "We really hope that our Lord will forgive our sins, as we are the first to believe.”",
    "And We inspired Moses, ˹saying,˺ “Leave with My servants at night, for you will surely be pursued.”",
    "Then Pharaoh sent mobilizers to all cities",
    "˹and said,˺ “These ˹outcasts˺ are just a handful of people",
    "who have really enraged us",
    "but we are all on the alert.”",
    "So We lured the tyrants out of ˹their˺ gardens, springs",
    "treasures, and splendid residences.",
    "So it was. And We awarded it ˹all˺ to the Children of Israel.",
    "And so they pursued them at sunrise.",
    "When the two groups came face to face, the companions of Moses cried out, “We are overtaken for sure.”",
    "Moses reassured ˹them˺, “Absolutely not! My Lord is certainly with me—He will guide me.”",
    "So We inspired Moses: “Strike the sea with your staff,” and the sea was split, each part was like a huge mountain.",
    "We drew the pursuers to that place",
    "and delivered Moses and those with him all together.",
    "Then We drowned the others.",
    "Surely in this is a sign. Yet most of them would not believe.",
    "And your Lord is certainly the Almighty, Most Merciful.",
    "Relate to them ˹O Prophet˺ the story of Abraham",
    "when he questioned his father and his people, “What is that you worship ˹besides Allah˺?”",
    "They replied, “We worship idols, to which we are fully devoted.”",
    "Abraham asked, “Can they hear you when you call upon them?",
    "Or can they benefit or harm you?”",
    "They replied, “No! But we found our forefathers doing the same.”",
    "Abraham responded, “Have you ˹really˺ considered what you have been worshipping—",
    "you and your ancestors?",
    "They are ˹all˺ enemies to me, except the Lord of all worlds.",
    "˹He is˺ the One Who created me, and He ˹alone˺ guides me.",
    "˹He is˺ the One Who provides me with food and drink.",
    "And He ˹alone˺ heals me when I am sick.",
    "And He ˹is the One Who˺ will cause me to die, and then bring me back to life.",
    "And He is ˹the One˺ Who, I hope, will forgive my flaws on Judgment Day.”",
    "“My Lord! Grant me wisdom, and join me with the righteous.",
    "Bless me with honourable mention among later generations.",
    "Make me one of those awarded the Garden of Bliss.",
    "Forgive my father, for he is certainly one of the misguided.",
    "And do not disgrace me on the Day all will be resurrected—",
    "the Day when neither wealth nor children will be of any benefit.",
    "Only those who come before Allah with a pure heart ˹will be saved˺.”",
    "˹On that Day˺ Paradise will be brought near to the God-fearing",
    "and the Hellfire will be displayed to the deviant.",
    "And it will be said to them, “Where are those you used to worship",
    "besides Allah? Can they help you or even help themselves?”",
    "Then the idols will be hurled headlong into Hell, along with the deviant",
    "and the soldiers of Iblîs, all together.",
    "There the deviant will cry while disputing with their idols",
    "“By Allah! We were clearly mistaken",
    "when we made you equal to the Lord of all worlds.",
    "And none led us astray other than the wicked.",
    "Now we have none to intercede for us",
    "nor a close friend.",
    "If only we could have a second chance, then we would be believers.”",
    "Surely in this is a sign. Yet most of them would not believe.",
    "And your Lord is certainly the Almighty, Most Merciful.",
    "The people of Noah rejected the messengers",
    "when their brother Noah said to them, “Will you not fear ˹Allah˺?",
    "I am truly a trustworthy messenger to you.",
    "So fear Allah, and obey me.",
    "I do not ask you for any reward for this ˹message˺. My reward is only from the Lord of all worlds.",
    "So fear Allah, and obey me.”",
    "They argued, “How can we believe in you, when you are followed ˹only˺ by the lowest of the low?”",
    "He responded, “And what knowledge do I have of what they do?",
    "Their judgment is with my Lord, if you had any sense!",
    "I am not going to expel the believers.",
    "I am only sent with a clear warning.”",
    "They threatened, “If you do not desist, O  Noah, you will surely be stoned ˹to death˺.”",
    "Noah prayed, “My Lord! My people have truly rejected me.",
    "So judge between me and them decisively, and save me and the believers with me.”",
    "So We saved him and those with him in the fully loaded Ark.",
    "Then afterwards We drowned the rest.",
    "Surely in this is a sign. Yet most of them would not believe.",
    "And your Lord is certainly the Almighty, Most Merciful.",
    "The people of ’Âd rejected the messengers",
    "when their brother Hûd said to them, “Will you not fear ˹Allah˺?",
    "I am truly a trustworthy messenger to you.",
    "So fear Allah, and obey me.",
    "I do not ask you for any reward for this ˹message˺. My reward is only from the Lord of all worlds.",
    "˹Why˺ do you build a landmark on every high place in vanity",
    "and construct castles, as if you are going to live forever",
    "and act so viciously when you attack ˹others˺?",
    "So fear Allah, and obey me.",
    "Fear the One Who has provided you with ˹the good˺ things you know:",
    "He provided you with cattle, and children",
    "and gardens, and springs.",
    "I truly fear for you the torment of a tremendous day.”",
    "They responded, “It is all the same to us whether you warn ˹us˺ or not.",
    "This is simply the tradition of our predecessors.",
    "And we will never be punished.”",
    "So they rejected him, and ˹so˺ We destroyed them. Surely in this is a sign. Yet most of them would not believe.",
    "And your Lord is certainly the Almighty, Most Merciful.",
    "The people of Thamûd rejected the messengers",
    "when their brother Ṣâliḥ said to them, “Will you not fear ˹Allah˺?",
    "I am truly a trustworthy messenger to you.",
    "So fear Allah, and obey me.",
    "I do not ask you for any reward for this ˹message˺. My reward is only from the Lord of all worlds.",
    "Do you think you will be ˹forever˺ left secure in what you have here:",
    "amid gardens and springs",
    "and ˹various˺ crops, and palm trees ˹loaded˺ with tender fruit;",
    "to carve homes in the mountains with great skill?",
    "So fear Allah, and obey me.",
    "And do not follow the command of the transgressors",
    "who spread corruption throughout the land, never setting things right.”",
    "They replied, “You are simply bewitched!",
    "You are only a human being like us, so bring forth a sign if what you say is true.”",
    "Ṣâliḥ said, “Here is a camel. She will have her turn to drink as you have yours, each on an appointed day.",
    "And do not ever touch her with harm, or you will be overtaken by the torment of a tremendous day.”",
    "But they killed her, becoming regretful.",
    "So the punishment overtook them. Surely in this is a sign. Yet most of them would not believe.",
    "And your Lord is certainly the Almighty, Most Merciful.",
    "The people of Lot rejected the messengers",
    "when their brother Lot said to them, “Will you not fear ˹Allah˺?",
    "I am truly a trustworthy messenger to you.",
    "So fear Allah, and obey me.",
    "I do not ask you for any reward for this ˹message˺. My reward is only from the Lord of all worlds.",
    "Why do you ˹men˺ lust after fellow men",
    "leaving the wives that your Lord has created for you? In fact, you are a transgressing people.”",
    "They threatened, “If you do not desist, O  Lot, you will surely be expelled.”",
    "Lot responded, “I am truly one of those who despise your ˹shameful˺ practice.",
    "My Lord! Save me and my family from ˹the consequences of˺ what they do.”",
    "So We saved him and all of his family",
    "except an old woman, who was one of the doomed.",
    "Then We utterly destroyed the rest",
    "pouring upon them a rain ˹of brimstone˺. How evil was the rain of those who had been warned!",
    "Surely in this is a sign. Yet most of them would not believe.",
    "And your Lord is certainly the Almighty, Most Merciful.",
    "The residents of the Forest rejected the messengers",
    "when Shu’aib said to them, “Will you not fear ˹Allah˺?",
    "I am truly a trustworthy messenger to you.",
    "So fear Allah, and obey me.",
    "I do not ask you for any reward for this ˹message˺. My reward is only from the Lord of all worlds.",
    "Give full measure, and cause no loss ˹to others˺.",
    "Weigh with an even balance",
    "and do not defraud people of their property. Nor go about spreading corruption in the land.",
    "And fear the One Who created you and ˹all˺ earlier peoples.”",
    "They replied, “You are simply bewitched!",
    "Also, you are only a human being like us, and we think you are indeed a liar.",
    "So cause ˹deadly˺ pieces of the sky to fall upon us, if what you say is true.”",
    "Shu’aib responded, “My Lord knows best whatever you do.”",
    "So they rejected him, and ˹so˺ were overtaken by the torment of the day of the ˹deadly˺ cloud. That was really a torment of a tremendous day.",
    "Surely in this is a sign. Yet most of them would not believe.",
    "And your Lord is certainly the Almighty, Most Merciful.",
    "This is certainly a revelation from the Lord of all worlds",
    "which the trustworthy spirit ˹Gabriel˺ brought down",
    "into your heart ˹O Prophet˺—so that you may be one of the warners—",
    "in a clear Arabic tongue.",
    "And it has indeed been ˹foretold˺ in the Scriptures of those before.",
    "Was it not sufficient proof for the deniers that it has been recognized by the knowledgeable among the Children of Israel?",
    "Had We revealed it to a non-Arab",
    "who would then recite it to the deniers ˹in fluent Arabic˺, still they would not have believed in it!",
    "This is how We allow denial ˹to steep˺ into the hearts of the wicked.",
    "They will not believe in it until they see the painful punishment",
    "which will take them by surprise when they least expect ˹it˺.",
    "Then they will cry, “Can we be allowed more time?”",
    "Do they ˹really˺ seek to hasten Our torment?",
    "Imagine ˹O Prophet˺ if We allowed them enjoyment for years",
    "then there came to them what they had been threatened with:",
    "would that enjoyment be of any benefit to them ˹at all˺?",
    "We have never destroyed a society without warners",
    "to remind ˹them˺, for We would never wrong ˹anyone˺.",
    "It was not the devils who brought this ˹Quran˺ down:",
    "it is not for them ˹to do so˺, nor can they",
    "for they are strictly barred from ˹even˺ overhearing ˹it˺.",
    "So do not ever call upon any other god besides Allah, or you will be one of the punished.",
    "And warn ˹all, starting with˺ your closest relatives",
    "and be gracious to the believers who follow you.",
    "But if they disobey you, say, “I am certainly free of what you do.”",
    "Put your trust in the Almighty, Most Merciful",
    "Who sees you when you rise ˹for prayer at night˺",
    "as well as your movements ˹in prayer˺ along with ˹fellow˺ worshippers.",
    "He ˹alone˺ is indeed the All-Hearing, All-Knowing.",
    "Shall I inform you of whom the devils ˹actually˺ descend upon?",
    "They descend upon every sinful liar",
    "who gives an ˹attentive˺ ear ˹to half-truths˺, mostly passing on sheer lies.",
    "As for poets, they are followed ˹merely˺ by deviants.",
    "Do you not see how they rant in every field",
    "only saying what they never do?",
    "Except those who believe, do good, remember Allah often, and ˹poetically˺ avenge ˹the believers˺ after being wrongfully slandered. The wrongdoers will come to know what ˹evil˺ end they will meet."
  ],
  "arabic1": [
    "طٰسٓمّٓ",
    "تِلْكَ اٰیٰتُ الْكِتٰبِ الْمُبِیْنِ",
    "لَعَلَّكَ بَاخِعٌ نَّفْسَكَ اَلَّا یَكُوْنُوْا مُؤْمِنِیْنَ",
    "اِنْ نَّشَاْ نُنَزِّلْ عَلَیْهِمْ مِّنَ السَّمَآءِ اٰیَةً فَظَلَّتْ اَعْنَاقُهُمْ لَهَا خٰضِعِیْنَ",
    "وَمَا یَاْتِیْهِمْ مِّنْ ذِكْرٍ مِّنَ الرَّحْمٰنِ مُحْدَثٍ اِلَّا كَانُوْا عَنْهُ مُعْرِضِیْنَ",
    "فَقَدْ كَذَّبُوْا فَسَیَاْتِیْهِمْ اَنْۢبٰٓؤُا مَا كَانُوْا بِهٖ یَسْتَهْزِءُوْنَ",
    "اَوَلَمْ یَرَوْا اِلَی الْاَرْضِ كَمْ اَنْۢبَتْنَا فِیْهَا مِنْ كُلِّ زَوْجٍ كَرِیْمٍ",
    "اِنَّ فِیْ ذٰلِكَ لَاٰیَةً وَمَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِیْنَ",
    "وَاِنَّ رَبَّكَ لَهُوَ الْعَزِیْزُ الرَّحِیْمُ",
    "وَاِذْ نَادٰی رَبُّكَ مُوْسٰۤی اَنِ ائْتِ الْقَوْمَ الظّٰلِمِیْنَ",
    "قَوْمَ فِرْعَوْنَ اَلَا یَتَّقُوْنَ",
    "قَالَ رَبِّ اِنِّیْۤ اَخَافُ اَنْ یُّكَذِّبُوْنِ",
    "وَیَضِیْقُ صَدْرِیْ وَلَا یَنْطَلِقُ لِسَانِیْ فَاَرْسِلْ اِلٰی هٰرُوْنَ",
    "وَلَهُمْ عَلَیَّ ذَنْۢبٌ فَاَخَافُ اَنْ یَّقْتُلُوْنِ ۖ",
    "قَالَ كَلَّا فَاذْهَبَا بِاٰیٰتِنَاۤ اِنَّا مَعَكُمْ مُّسْتَمِعُوْنَ",
    "فَاْتِیَا فِرْعَوْنَ فَقُوْلَاۤ اِنَّا رَسُوْلُ رَبِّ الْعٰلَمِیْنَ",
    "اَنْ اَرْسِلْ مَعَنَا بَنِیْۤ اِسْرَآءِیْلَ",
    "قَالَ اَلَمْ نُرَبِّكَ فِیْنَا وَلِیْدًا وَّلَبِثْتَ فِیْنَا مِنْ عُمُرِكَ سِنِیْنَ",
    "وَفَعَلْتَ فَعْلَتَكَ الَّتِیْ فَعَلْتَ وَاَنْتَ مِنَ الْكٰفِرِیْنَ",
    "قَالَ فَعَلْتُهَاۤ اِذًا وَّاَنَا مِنَ الضَّآلِّیْنَ",
    "فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِیْ رَبِّیْ حُكْمًا وَّجَعَلَنِیْ مِنَ الْمُرْسَلِیْنَ",
    "وَتِلْكَ نِعْمَةٌ تَمُنُّهَا عَلَیَّ اَنْ عَبَّدْتَّ بَنِیْۤ اِسْرَآءِیْلَ",
    "قَالَ فِرْعَوْنُ وَمَا رَبُّ الْعٰلَمِیْنَ",
    "قَالَ رَبُّ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَیْنَهُمَا اِنْ كُنْتُمْ مُّوْقِنِیْنَ",
    "قَالَ لِمَنْ حَوْلَهٗۤ اَلَا تَسْتَمِعُوْنَ",
    "قَالَ رَبُّكُمْ وَرَبُّ اٰبَآىِٕكُمُ الْاَوَّلِیْنَ",
    "قَالَ اِنَّ رَسُوْلَكُمُ الَّذِیْۤ اُرْسِلَ اِلَیْكُمْ لَمَجْنُوْنٌ",
    "قَالَ رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ وَمَا بَیْنَهُمَا اِنْ كُنْتُمْ تَعْقِلُوْنَ",
    "قَالَ لَىِٕنِ اتَّخَذْتَ اِلٰهًا غَیْرِیْ لَاَجْعَلَنَّكَ مِنَ الْمَسْجُوْنِیْنَ",
    "قَالَ اَوَلَوْ جِئْتُكَ بِشَیْءٍ مُّبِیْنٍ",
    "قَالَ فَاْتِ بِهٖۤ اِنْ كُنْتَ مِنَ الصّٰدِقِیْنَ",
    "فَاَلْقٰی عَصَاهُ فَاِذَا هِیَ ثُعْبَانٌ مُّبِیْنٌ ۖ",
    "وَّنَزَعَ یَدَهٗ فَاِذَا هِیَ بَیْضَآءُ لِلنّٰظِرِیْنَ",
    "قَالَ لِلْمَلَاِ حَوْلَهٗۤ اِنَّ هٰذَا لَسٰحِرٌ عَلِیْمٌ",
    "یُّرِیْدُ اَنْ یُّخْرِجَكُمْ مِّنْ اَرْضِكُمْ بِسِحْرِهٖ ۖ فَمَاذَا تَاْمُرُوْنَ",
    "قَالُوْۤا اَرْجِهْ وَاَخَاهُ وَابْعَثْ فِی الْمَدَآىِٕنِ حٰشِرِیْنَ",
    "یَاْتُوْكَ بِكُلِّ سَحَّارٍ عَلِیْمٍ",
    "فَجُمِعَ السَّحَرَةُ لِمِیْقَاتِ یَوْمٍ مَّعْلُوْمٍ",
    "وَّقِیْلَ لِلنَّاسِ هَلْ اَنْتُمْ مُّجْتَمِعُوْنَ",
    "لَعَلَّنَا نَتَّبِعُ السَّحَرَةَ اِنْ كَانُوْا هُمُ الْغٰلِبِیْنَ",
    "فَلَمَّا جَآءَ السَّحَرَةُ قَالُوْا لِفِرْعَوْنَ اَىِٕنَّ لَنَا لَاَجْرًا اِنْ كُنَّا نَحْنُ الْغٰلِبِیْنَ",
    "قَالَ نَعَمْ وَاِنَّكُمْ اِذًا لَّمِنَ الْمُقَرَّبِیْنَ",
    "قَالَ لَهُمْ مُّوْسٰۤی اَلْقُوْا مَاۤ اَنْتُمْ مُّلْقُوْنَ",
    "فَاَلْقَوْا حِبَالَهُمْ وَعِصِیَّهُمْ وَقَالُوْا بِعِزَّةِ فِرْعَوْنَ اِنَّا لَنَحْنُ الْغٰلِبُوْنَ",
    "فَاَلْقٰی مُوْسٰی عَصَاهُ فَاِذَا هِیَ تَلْقَفُ مَا یَاْفِكُوْنَ ۖ",
    "فَاُلْقِیَ السَّحَرَةُ سٰجِدِیْنَ",
    "قَالُوْۤا اٰمَنَّا بِرَبِّ الْعٰلَمِیْنَ",
    "رَبِّ مُوْسٰی وَهٰرُوْنَ",
    "قَالَ اٰمَنْتُمْ لَهٗ قَبْلَ اَنْ اٰذَنَ لَكُمْ اِنَّهٗ لَكَبِیْرُكُمُ الَّذِیْ عَلَّمَكُمُ السِّحْرَ فَلَسَوْفَ تَعْلَمُوْنَ لَاُقَطِّعَنَّ اَیْدِیَكُمْ وَاَرْجُلَكُمْ مِّنْ خِلَافٍ وَّلَاُوصَلِّبَنَّكُمْ اَجْمَعِیْنَ",
    "قَالُوْا لَا ضَیْرَ اِنَّاۤ اِلٰی رَبِّنَا مُنْقَلِبُوْنَ",
    "اِنَّا نَطْمَعُ اَنْ یَّغْفِرَ لَنَا رَبُّنَا خَطٰیٰنَاۤ اَنْ كُنَّاۤ اَوَّلَ الْمُؤْمِنِیْنَ",
    "وَاَوْحَیْنَاۤ اِلٰی مُوْسٰۤی اَنْ اَسْرِ بِعِبَادِیْۤ اِنَّكُمْ مُّتَّبَعُوْنَ",
    "فَاَرْسَلَ فِرْعَوْنُ فِی الْمَدَآىِٕنِ حٰشِرِیْنَ",
    "اِنَّ هٰۤؤُلَآءِ لَشِرْذِمَةٌ قَلِیْلُوْنَ",
    "وَاِنَّهُمْ لَنَا لَغَآىِٕظُوْنَ",
    "وَاِنَّا لَجَمِیْعٌ حٰذِرُوْنَ",
    "فَاَخْرَجْنٰهُمْ مِّنْ جَنّٰتٍ وَّعُیُوْنٍ",
    "وَّكُنُوْزٍ وَّمَقَامٍ كَرِیْمٍ",
    "كَذٰلِكَ وَاَوْرَثْنٰهَا بَنِیْۤ اِسْرَآءِیْلَ",
    "فَاَتْبَعُوْهُمْ مُّشْرِقِیْنَ",
    "فَلَمَّا تَرَآءَ الْجَمْعٰنِ قَالَ اَصْحٰبُ مُوْسٰۤی اِنَّا لَمُدْرَكُوْنَ",
    "قَالَ كَلَّا اِنَّ مَعِیَ رَبِّیْ سَیَهْدِیْنِ",
    "فَاَوْحَیْنَاۤ اِلٰی مُوْسٰۤی اَنِ اضْرِبْ بِّعَصَاكَ الْبَحْرَ فَانْفَلَقَ فَكَانَ كُلُّ فِرْقٍ كَالطَّوْدِ الْعَظِیْمِ",
    "وَاَزْلَفْنَا ثَمَّ الْاٰخَرِیْنَ",
    "وَاَنْجَیْنَا مُوْسٰی وَمَنْ مَّعَهٗۤ اَجْمَعِیْنَ",
    "ثُمَّ اَغْرَقْنَا الْاٰخَرِیْنَ",
    "اِنَّ فِیْ ذٰلِكَ لَاٰیَةً وَمَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِیْنَ",
    "وَاِنَّ رَبَّكَ لَهُوَ الْعَزِیْزُ الرَّحِیْمُ",
    "وَاتْلُ عَلَیْهِمْ نَبَاَ اِبْرٰهِیْمَ",
    "اِذْ قَالَ لِاَبِیْهِ وَقَوْمِهٖ مَا تَعْبُدُوْنَ",
    "قَالُوْا نَعْبُدُ اَصْنَامًا فَنَظَلُّ لَهَا عٰكِفِیْنَ",
    "قَالَ هَلْ یَسْمَعُوْنَكُمْ اِذْ تَدْعُوْنَ",
    "اَوْ یَنْفَعُوْنَكُمْ اَوْ یَضُرُّوْنَ",
    "قَالُوْا بَلْ وَجَدْنَاۤ اٰبَآءَنَا كَذٰلِكَ یَفْعَلُوْنَ",
    "قَالَ اَفَرَءَیْتُمْ مَّا كُنْتُمْ تَعْبُدُوْنَ",
    "اَنْتُمْ وَاٰبَآؤُكُمُ الْاَقْدَمُوْنَ",
    "فَاِنَّهُمْ عَدُوٌّ لِّیْۤ اِلَّا رَبَّ الْعٰلَمِیْنَ",
    "الَّذِیْ خَلَقَنِیْ فَهُوَ یَهْدِیْنِ",
    "وَالَّذِیْ هُوَ یُطْعِمُنِیْ وَیَسْقِیْنِ",
    "وَاِذَا مَرِضْتُ فَهُوَ یَشْفِیْنِ",
    "وَالَّذِیْ یُمِیْتُنِیْ ثُمَّ یُحْیِیْنِ",
    "وَالَّذِیْۤ اَطْمَعُ اَنْ یَّغْفِرَ لِیْ خَطِیْٓـَٔتِیْ یَوْمَ الدِّیْنِ",
    "رَبِّ هَبْ لِیْ حُكْمًا وَّاَلْحِقْنِیْ بِالصّٰلِحِیْنَ",
    "وَاجْعَلْ لِّیْ لِسَانَ صِدْقٍ فِی الْاٰخِرِیْنَ",
    "وَاجْعَلْنِیْ مِنْ وَّرَثَةِ جَنَّةِ النَّعِیْمِ",
    "وَاغْفِرْ لِاَبِیْۤ اِنَّهٗ كَانَ مِنَ الضَّآلِّیْنَ",
    "وَلَا تُخْزِنِیْ یَوْمَ یُبْعَثُوْنَ",
    "یَوْمَ لَا یَنْفَعُ مَالٌ وَّلَا بَنُوْنَ",
    "اِلَّا مَنْ اَتَی اللّٰهَ بِقَلْبٍ سَلِیْمٍ",
    "وَاُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِیْنَ",
    "وَبُرِّزَتِ الْجَحِیْمُ لِلْغٰوِیْنَ",
    "وَقِیْلَ لَهُمْ اَیْنَ مَا كُنْتُمْ تَعْبُدُوْنَ",
    "مِنْ دُوْنِ اللّٰهِ هَلْ یَنْصُرُوْنَكُمْ اَوْ یَنْتَصِرُوْنَ",
    "فَكُبْكِبُوْا فِیْهَا هُمْ وَالْغَاوٗنَ",
    "وَجُنُوْدُ اِبْلِیْسَ اَجْمَعُوْنَ",
    "قَالُوْا وَهُمْ فِیْهَا یَخْتَصِمُوْنَ",
    "تَاللّٰهِ اِنْ كُنَّا لَفِیْ ضَلٰلٍ مُّبِیْنٍ",
    "اِذْ نُسَوِّیْكُمْ بِرَبِّ الْعٰلَمِیْنَ",
    "وَمَاۤ اَضَلَّنَاۤ اِلَّا الْمُجْرِمُوْنَ",
    "فَمَا لَنَا مِنْ شَافِعِیْنَ",
    "وَلَا صَدِیْقٍ حَمِیْمٍ",
    "فَلَوْ اَنَّ لَنَا كَرَّةً فَنَكُوْنَ مِنَ الْمُؤْمِنِیْنَ",
    "اِنَّ فِیْ ذٰلِكَ لَاٰیَةً وَمَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِیْنَ",
    "وَاِنَّ رَبَّكَ لَهُوَ الْعَزِیْزُ الرَّحِیْمُ",
    "كَذَّبَتْ قَوْمُ نُوْحِ ١لْمُرْسَلِیْنَ ۖ",
    "اِذْ قَالَ لَهُمْ اَخُوْهُمْ نُوْحٌ اَلَا تَتَّقُوْنَ",
    "اِنِّیْ لَكُمْ رَسُوْلٌ اَمِیْنٌ",
    "فَاتَّقُوا اللّٰهَ وَاَطِیْعُوْنِ",
    "وَمَاۤ اَسْـَٔلُكُمْ عَلَیْهِ مِنْ اَجْرٍ اِنْ اَجْرِیَ اِلَّا عَلٰی رَبِّ الْعٰلَمِیْنَ",
    "فَاتَّقُوا اللّٰهَ وَاَطِیْعُوْنِ",
    "قَالُوْۤا اَنُؤْمِنُ لَكَ وَاتَّبَعَكَ الْاَرْذَلُوْنَ",
    "قَالَ وَمَا عِلْمِیْ بِمَا كَانُوْا یَعْمَلُوْنَ",
    "اِنْ حِسَابُهُمْ اِلَّا عَلٰی رَبِّیْ لَوْ تَشْعُرُوْنَ",
    "وَمَاۤ اَنَا بِطَارِدِ الْمُؤْمِنِیْنَ",
    "اِنْ اَنَا اِلَّا نَذِیْرٌ مُّبِیْنٌ",
    "قَالُوْا لَىِٕنْ لَّمْ تَنْتَهِ یٰنُوْحُ لَتَكُوْنَنَّ مِنَ الْمَرْجُوْمِیْنَ",
    "قَالَ رَبِّ اِنَّ قَوْمِیْ كَذَّبُوْنِ ۖ",
    "فَافْتَحْ بَیْنِیْ وَبَیْنَهُمْ فَتْحًا وَّنَجِّنِیْ وَمَنْ مَّعِیَ مِنَ الْمُؤْمِنِیْنَ",
    "فَاَنْجَیْنٰهُ وَمَنْ مَّعَهٗ فِی الْفُلْكِ الْمَشْحُوْنِ",
    "ثُمَّ اَغْرَقْنَا بَعْدُ الْبٰقِیْنَ",
    "اِنَّ فِیْ ذٰلِكَ لَاٰیَةً وَمَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِیْنَ",
    "وَاِنَّ رَبَّكَ لَهُوَ الْعَزِیْزُ الرَّحِیْمُ",
    "كَذَّبَتْ عَادُ ١لْمُرْسَلِیْنَ ۖ",
    "اِذْ قَالَ لَهُمْ اَخُوْهُمْ هُوْدٌ اَلَا تَتَّقُوْنَ",
    "اِنِّیْ لَكُمْ رَسُوْلٌ اَمِیْنٌ",
    "فَاتَّقُوا اللّٰهَ وَاَطِیْعُوْنِ",
    "وَمَاۤ اَسْـَٔلُكُمْ عَلَیْهِ مِنْ اَجْرٍ اِنْ اَجْرِیَ اِلَّا عَلٰی رَبِّ الْعٰلَمِیْنَ",
    "اَتَبْنُوْنَ بِكُلِّ رِیْعٍ اٰیَةً تَعْبَثُوْنَ",
    "وَتَتَّخِذُوْنَ مَصَانِعَ لَعَلَّكُمْ تَخْلُدُوْنَ",
    "وَاِذَا بَطَشْتُمْ بَطَشْتُمْ جَبَّارِیْنَ",
    "فَاتَّقُوا اللّٰهَ وَاَطِیْعُوْنِ",
    "وَاتَّقُوا الَّذِیْۤ اَمَدَّكُمْ بِمَا تَعْلَمُوْنَ",
    "اَمَدَّكُمْ بِاَنْعَامٍ وَّبَنِیْنَ",
    "وَجَنّٰتٍ وَّعُیُوْنٍ",
    "اِنِّیْۤ اَخَافُ عَلَیْكُمْ عَذَابَ یَوْمٍ عَظِیْمٍ",
    "قَالُوْا سَوَآءٌ عَلَیْنَاۤ اَوَعَظْتَ اَمْ لَمْ تَكُنْ مِّنَ الْوٰعِظِیْنَ",
    "اِنْ هٰذَاۤ اِلَّا خُلُقُ الْاَوَّلِیْنَ",
    "وَمَا نَحْنُ بِمُعَذَّبِیْنَ",
    "فَكَذَّبُوْهُ فَاَهْلَكْنٰهُمْ اِنَّ فِیْ ذٰلِكَ لَاٰیَةً وَمَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِیْنَ",
    "وَاِنَّ رَبَّكَ لَهُوَ الْعَزِیْزُ الرَّحِیْمُ",
    "كَذَّبَتْ ثَمُوْدُ الْمُرْسَلِیْنَ ۖ",
    "اِذْ قَالَ لَهُمْ اَخُوْهُمْ صٰلِحٌ اَلَا تَتَّقُوْنَ",
    "اِنِّیْ لَكُمْ رَسُوْلٌ اَمِیْنٌ",
    "فَاتَّقُوا اللّٰهَ وَاَطِیْعُوْنِ",
    "وَمَاۤ اَسْـَٔلُكُمْ عَلَیْهِ مِنْ اَجْرٍ اِنْ اَجْرِیَ اِلَّا عَلٰی رَبِّ الْعٰلَمِیْنَ",
    "اَتُتْرَكُوْنَ فِیْ مَا هٰهُنَاۤ اٰمِنِیْنَ",
    "فِیْ جَنّٰتٍ وَّعُیُوْنٍ",
    "وَّزُرُوْعٍ وَّنَخْلٍ طَلْعُهَا هَضِیْمٌ",
    "وَتَنْحِتُوْنَ مِنَ الْجِبَالِ بُیُوْتًا فٰرِهِیْنَ",
    "فَاتَّقُوا اللّٰهَ وَاَطِیْعُوْنِ",
    "وَلَا تُطِیْعُوْۤا اَمْرَ الْمُسْرِفِیْنَ",
    "الَّذِیْنَ یُفْسِدُوْنَ فِی الْاَرْضِ وَلَا یُصْلِحُوْنَ",
    "قَالُوْۤا اِنَّمَاۤ اَنْتَ مِنَ الْمُسَحَّرِیْنَ",
    "مَاۤ اَنْتَ اِلَّا بَشَرٌ مِّثْلُنَا فَاْتِ بِاٰیَةٍ اِنْ كُنْتَ مِنَ الصّٰدِقِیْنَ",
    "قَالَ هٰذِهٖ نَاقَةٌ لَّهَا شِرْبٌ وَّلَكُمْ شِرْبُ یَوْمٍ مَّعْلُوْمٍ",
    "وَلَا تَمَسُّوْهَا بِسُوْٓءٍ فَیَاْخُذَكُمْ عَذَابُ یَوْمٍ عَظِیْمٍ",
    "فَعَقَرُوْهَا فَاَصْبَحُوْا نٰدِمِیْنَ",
    "فَاَخَذَهُمُ الْعَذَابُ اِنَّ فِیْ ذٰلِكَ لَاٰیَةً وَمَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِیْنَ",
    "وَاِنَّ رَبَّكَ لَهُوَ الْعَزِیْزُ الرَّحِیْمُ",
    "كَذَّبَتْ قَوْمُ لُوْطِ ١لْمُرْسَلِیْنَ ۖ",
    "اِذْ قَالَ لَهُمْ اَخُوْهُمْ لُوْطٌ اَلَا تَتَّقُوْنَ",
    "اِنِّیْ لَكُمْ رَسُوْلٌ اَمِیْنٌ",
    "فَاتَّقُوا اللّٰهَ وَاَطِیْعُوْنِ",
    "وَمَاۤ اَسْـَٔلُكُمْ عَلَیْهِ مِنْ اَجْرٍ اِنْ اَجْرِیَ اِلَّا عَلٰی رَبِّ الْعٰلَمِیْنَ",
    "اَتَاْتُوْنَ الذُّكْرَانَ مِنَ الْعٰلَمِیْنَ",
    "وَتَذَرُوْنَ مَا خَلَقَ لَكُمْ رَبُّكُمْ مِّنْ اَزْوَاجِكُمْ بَلْ اَنْتُمْ قَوْمٌ عٰدُوْنَ",
    "قَالُوْا لَىِٕنْ لَّمْ تَنْتَهِ یٰلُوْطُ لَتَكُوْنَنَّ مِنَ الْمُخْرَجِیْنَ",
    "قَالَ اِنِّیْ لِعَمَلِكُمْ مِّنَ الْقَالِیْنَ",
    "رَبِّ نَجِّنِیْ وَاَهْلِیْ مِمَّا یَعْمَلُوْنَ",
    "فَنَجَّیْنٰهُ وَاَهْلَهٗۤ اَجْمَعِیْنَ",
    "اِلَّا عَجُوْزًا فِی الْغٰبِرِیْنَ",
    "ثُمَّ دَمَّرْنَا الْاٰخَرِیْنَ",
    "وَاَمْطَرْنَا عَلَیْهِمْ مَّطَرًا فَسَآءَ مَطَرُ الْمُنْذَرِیْنَ",
    "اِنَّ فِیْ ذٰلِكَ لَاٰیَةً وَمَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِیْنَ",
    "وَاِنَّ رَبَّكَ لَهُوَ الْعَزِیْزُ الرَّحِیْمُ",
    "كَذَّبَ اَصْحٰبُ لْـَٔیْكَةِ الْمُرْسَلِیْنَ ۖ",
    "اِذْ قَالَ لَهُمْ شُعَیْبٌ اَلَا تَتَّقُوْنَ",
    "اِنِّیْ لَكُمْ رَسُوْلٌ اَمِیْنٌ",
    "فَاتَّقُوا اللّٰهَ وَاَطِیْعُوْنِ",
    "وَمَاۤ اَسْـَٔلُكُمْ عَلَیْهِ مِنْ اَجْرٍ اِنْ اَجْرِیَ اِلَّا عَلٰی رَبِّ الْعٰلَمِیْنَ",
    "اَوْفُوا الْكَیْلَ وَلَا تَكُوْنُوْا مِنَ الْمُخْسِرِیْنَ",
    "وَزِنُوْا بِالْقِسْطَاسِ الْمُسْتَقِیْمِ",
    "وَلَا تَبْخَسُوا النَّاسَ اَشْیَآءَهُمْ وَلَا تَعْثَوْا فِی الْاَرْضِ مُفْسِدِیْنَ",
    "وَاتَّقُوا الَّذِیْ خَلَقَكُمْ وَالْجِبِلَّةَ الْاَوَّلِیْنَ",
    "قَالُوْۤا اِنَّمَاۤ اَنْتَ مِنَ الْمُسَحَّرِیْنَ",
    "وَمَاۤ اَنْتَ اِلَّا بَشَرٌ مِّثْلُنَا وَاِنْ نَّظُنُّكَ لَمِنَ الْكٰذِبِیْنَ",
    "فَاَسْقِطْ عَلَیْنَا كِسَفًا مِّنَ السَّمَآءِ اِنْ كُنْتَ مِنَ الصّٰدِقِیْنَ",
    "قَالَ رَبِّیْۤ اَعْلَمُ بِمَا تَعْمَلُوْنَ",
    "فَكَذَّبُوْهُ فَاَخَذَهُمْ عَذَابُ یَوْمِ الظُّلَّةِ اِنَّهٗ كَانَ عَذَابَ یَوْمٍ عَظِیْمٍ",
    "اِنَّ فِیْ ذٰلِكَ لَاٰیَةً وَمَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِیْنَ",
    "وَاِنَّ رَبَّكَ لَهُوَ الْعَزِیْزُ الرَّحِیْمُ",
    "وَاِنَّهٗ لَتَنْزِیْلُ رَبِّ الْعٰلَمِیْنَ",
    "نَزَلَ بِهِ الرُّوْحُ الْاَمِیْنُ",
    "عَلٰی قَلْبِكَ لِتَكُوْنَ مِنَ الْمُنْذِرِیْنَ",
    "بِلِسَانٍ عَرَبِیٍّ مُّبِیْنٍ",
    "وَاِنَّهٗ لَفِیْ زُبُرِ الْاَوَّلِیْنَ",
    "اَوَلَمْ یَكُنْ لَّهُمْ اٰیَةً اَنْ یَّعْلَمَهٗ عُلَمٰٓؤُا بَنِیْۤ اِسْرَآءِیْلَ",
    "وَلَوْ نَزَّلْنٰهُ عَلٰی بَعْضِ الْاَعْجَمِیْنَ",
    "فَقَرَاَهٗ عَلَیْهِمْ مَّا كَانُوْا بِهٖ مُؤْمِنِیْنَ",
    "كَذٰلِكَ سَلَكْنٰهُ فِیْ قُلُوْبِ الْمُجْرِمِیْنَ",
    "لَا یُؤْمِنُوْنَ بِهٖ حَتّٰی یَرَوُا الْعَذَابَ الْاَلِیْمَ",
    "فَیَاْتِیَهُمْ بَغْتَةً وَّهُمْ لَا یَشْعُرُوْنَ",
    "فَیَقُوْلُوْا هَلْ نَحْنُ مُنْظَرُوْنَ",
    "اَفَبِعَذَابِنَا یَسْتَعْجِلُوْنَ",
    "اَفَرَءَیْتَ اِنْ مَّتَّعْنٰهُمْ سِنِیْنَ",
    "ثُمَّ جَآءَهُمْ مَّا كَانُوْا یُوْعَدُوْنَ",
    "مَاۤ اَغْنٰی عَنْهُمْ مَّا كَانُوْا یُمَتَّعُوْنَ",
    "وَمَاۤ اَهْلَكْنَا مِنْ قَرْیَةٍ اِلَّا لَهَا مُنْذِرُوْنَ",
    "ذِكْرٰی ۫ وَمَا كُنَّا ظٰلِمِیْنَ",
    "وَمَا تَنَزَّلَتْ بِهِ الشَّیٰطِیْنُ",
    "وَمَا یَنْۢبَغِیْ لَهُمْ وَمَا یَسْتَطِیْعُوْنَ",
    "اِنَّهُمْ عَنِ السَّمْعِ لَمَعْزُوْلُوْنَ",
    "فَلَا تَدْعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ فَتَكُوْنَ مِنَ الْمُعَذَّبِیْنَ",
    "وَاَنْذِرْ عَشِیْرَتَكَ الْاَقْرَبِیْنَ",
    "وَاخْفِضْ جَنَاحَكَ لِمَنِ اتَّبَعَكَ مِنَ الْمُؤْمِنِیْنَ",
    "فَاِنْ عَصَوْكَ فَقُلْ اِنِّیْ بَرِیْٓءٌ مِّمَّا تَعْمَلُوْنَ",
    "وَتَوَكَّلْ عَلَی الْعَزِیْزِ الرَّحِیْمِ",
    "الَّذِیْ یَرٰىكَ حِیْنَ تَقُوْمُ",
    "وَتَقَلُّبَكَ فِی السّٰجِدِیْنَ",
    "اِنَّهٗ هُوَ السَّمِیْعُ الْعَلِیْمُ",
    "هَلْ اُنَبِّئُكُمْ عَلٰی مَنْ تَنَزَّلُ الشَّیٰطِیْنُ",
    "تَنَزَّلُ عَلٰی كُلِّ اَفَّاكٍ اَثِیْمٍ",
    "یُّلْقُوْنَ السَّمْعَ وَاَكْثَرُهُمْ كٰذِبُوْنَ",
    "وَالشُّعَرَآءُ یَتَّبِعُهُمُ الْغَاوٗنَ",
    "اَلَمْ تَرَ اَنَّهُمْ فِیْ كُلِّ وَادٍ یَّهِیْمُوْنَ",
    "وَاَنَّهُمْ یَقُوْلُوْنَ مَا لَا یَفْعَلُوْنَ",
    "اِلَّا الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَذَكَرُوا اللّٰهَ كَثِیْرًا وَّانْتَصَرُوْا مِنْ بَعْدِ مَا ظُلِمُوْا وَسَیَعْلَمُ الَّذِیْنَ ظَلَمُوْۤا اَیَّ مُنْقَلَبٍ یَّنْقَلِبُوْنَ"
  ],
  "bengali": [
    "ত্ব-সীন-মীম।",
    "এগুলো সুস্পষ্ট কিতাবের আয়াত।",
    "তারা মুমিন হবে না বলে হয়ত তুমি আত্মবিনাশী হয়ে পড়বে।",
    "আমি ইচ্ছা করলে আসমান থেকে তাদের উপর এমন নিদর্শন অবতীর্ণ করতাম ফলে তার প্রতি তাদের ঘাড়গুলো নত হয়ে যেত।",
    "আর যখনই তাদের কাছে পরম করুণাময়ের পক্ষ থেকে কোন নতুন উপদেশ আসে তখনই তারা তা থেকে বিমুখ হয়।",
    "অতএব অবশ্যই তারা অস্বীকার করেছে। কাজেই তারা যা নিয়ে ঠাট্টা-বিদ্রূপ করত, তার সংবাদ অচিরেই তাদের কাছে এসে পড়বে।",
    "তারা কি যমীনের প্রতি লক্ষ করেনি? আমি তাতে প্রত্যেক প্রকারের বহু উৎকৃষ্ট উদ্ভিদ উদগত করেছি।",
    "নিশ্চয় এতে আছে নিদর্শন, আর তাদের অধিকাংশই মুমিন নয়।",
    "আর নিশ্চয় তোমার রব, তিনি তো মহা পরাক্রমশালী, পরম দয়ালু।",
    "আর স্মরণ কর, যখন তোমার রব মূসাকে ডেকে বললেন, ‘তুমি যালিম সম্প্রদায়ের কাছে যাও’।",
    "‘ফির‘আউনের সম্প্রদায়ের কাছে। তারা কি ভয় করবে না’?",
    "মূসা বলল, ‘হে আমার রব, আমি অবশ্যই আশঙ্কা করছি যে, তারা আমাকে অস্বীকার করবে’।",
    "‘আর আমার বক্ষ সঙ্কুচিত হয়ে যাচ্ছে। আমার জিহবা চলছে না। সুতরাং আপনি হারুনের প্রতি ওহী পাঠান’।",
    "‘আর আমার বিরুদ্ধে তাদের কাছে একটি অপরাধের অভিযোগ রয়েছে। ফলে আমি আশঙ্কা করছি যে, তারা আমাকে হত্যা করে ফেলবে’।",
    "আল্লাহ বললেন, ‘কখনো নয়। তোমরা উভয়ে আমার নিদর্শনাদিসহ যাও। অবশ্যই আমি আছি তোমাদের সাথে শ্রবণকারী’।",
    "‘সুতরাং তোমরা উভয়ে ফির‘আউনের কাছে গিয়ে বল, নিশ্চয় আমরা বিশ্বজগতের রবের রাসূল’।",
    "‘যাতে তুমি বনী ইসরাঈলকে আমাদের সাথে পাঠাও’।",
    "ফির‘আউন বলল, ‘আমরা কি তোমাকে শৈশবে আমাদের মাঝে লালন পালন করিনি? আর তুমি তোমার জীবনের অনেক বছর আমাদের মধ্যে অবস্থান করেছ’।",
    "‘আর তুমি তোমার কর্ম যা করার তা করেছ এবং তুমি অকৃতজ্ঞদের অন্তর্ভুক্ত’।",
    "মূসা বলল, ‘আমি এটি তখন করেছিলাম, যখন আমি ছিলাম বিভ্রান্ত’।",
    "‘অতঃপর যখন আমি তোমাদেরকে ভয় করলাম, তখন আমি তোমাদের থেকে পালিয়ে গেলাম। তারপর আমার রব আমাকে প্রজ্ঞা দান করলেন এবং আমাকে রাসূলদের অন্তর্ভুক্ত করলেন’।",
    "‘আর এই তো সে অনুগ্রহ যার খোঁটা তুমি আমাকে দিচ্ছ যে, তুমি বনী ইসরাঈলকে দাস বানিয়ে রেখেছ’।",
    "ফির‘আউন বলল, ‘সৃষ্টিকুলের রব কে?’",
    "মূসা বলল, ‘আসমানসমূহ ও যমীন এবং এতদোভয়ের মধ্যবর্তী সবকিছুর রব, যদি তোমরা নিশ্চিত বিশ্বাসী হয়ে থাক।’",
    "ফির‘আউন তার আশেপাশে যারা ছিল তাদেরকে বলল, ‘তোমরা কি মনোযোগসহ শুনছ না’?",
    "মূসা বলল, ‘তিনি তোমাদের রব এবং তোমাদের পিতৃপুরুষদেরও রব’।",
    "ফির‘আউন বলল, ‘তোমাদের কাছে প্রেরিত তোমাদের এই রাসূল নিশ্চয়ই পাগল’।",
    "মূসা বলল, ‘তিনি পূর্ব ও পশ্চিম এবং এতদোভয়ের মধ্যবর্তী সবকিছুর রব, যদি তোমরা বুঝে থাক’।",
    "ফির‘আউন বলল, ‘যদি তুমি আমাকে ছাড়া কাউকে ইলাহরূপে গ্রহণ কর, তাহলে অবশ্যই আমি তোমাকে কয়েদীদের অন্তর্ভুক্ত করব’।",
    "মূসা বলল, ‘যদি আমি তোমার কাছে স্পষ্ট কোন বিষয় নিয়ে আসি, তবুও’?",
    "ফির‘আউন বলল, ‘তুমি সত্যবাদী হয়ে থাকলে তা নিয়ে এসো’।",
    "অতঃপর সে তার লাঠি ফেলে দিল, ফলে তৎক্ষণাৎ তা একটি স্পষ্ট অজগর হয়ে গেল।",
    "আর সে তার হাত বের করল, ফলে তা তৎক্ষণাৎ দর্শকদের সামনে উজ্জ্বল-সাদা হয়ে দেখা দিল।",
    "ফির‘আউন তার আশপাশের পারিষদদের উদ্দেশ্যে বলল, ‘এ তো এক বিজ্ঞ যাদুকর।’",
    "‘সে তোমাদেরকে তার যাদুর মাধ্যমে তোমাদের দেশ থেকে বের করতে চায়। অতএব, তোমরা আমাকে কী পরামর্শ দাও?’",
    "তারা বলল, ‘তাকে ও তার ভাইকে কিছু সময়ের জন্য অবকাশ দাও, আর সংগ্রহকারীদেরকে নগরে-নগরে পাঠিয়ে দাও।’",
    "‘তারা তোমার নিকট প্রত্যেক বিজ্ঞ যাদুকরকে নিয়ে আসুক’।",
    "অতঃপর এক নির্ধারিত দিনের নির্দিষ্ট সময়ে যাদুকরদের একত্র করা হল।",
    "আর লোকদের বলা হল, ‘তোমরা কি সমবেত হবে?’",
    "‘যাতে আমরা যাদুকরদের অনুসরণ করতে পারি, যদি তারা বিজয়ী হয়’।",
    "অতঃপর যখন যাদুকররা আসল,তারা ফির‘আউনকে বলল,‘যদি আমরাই বিজয়ী হই, তবে আমাদের জন্য কি সত্যিই পুরস্কার আছে?’",
    "সে বলল, ‘হ্যাঁ এবং নিশ্চয় তোমরা তখন আমার ঘনিষ্টজনদের অন্তর্ভুক্ত হবে’।",
    "মূসা তাদের বলল, ‘তোমরা যা নিক্ষেপ করার তা নিক্ষেপ কর’।",
    "অতঃপর তারা তাদের রশি ও লাঠি নিক্ষেপ করল এবং বলল, ‘ফির‘আউনের মর্যাদার কসম! অবশ্যই আমরা বিজয়ী হব।’",
    "তারপর মূসা তার লাঠি ফেলল, ফলে তৎক্ষণাৎ তা তাদের মিথ্যা প্রদর্শনীগুলো গ্রাস করে ফেলল।",
    "ফলে যাদুকররা সিজদাবনত হয়ে পড়ল।",
    "তারা বলল, ‘আমরা ঈমান আনলাম সকল সৃষ্টির রবের প্রতি’।",
    "‘মূসা ও হারুনের রব’।",
    "ফির‘আউন বলল, ‘আমি তোমাদেরকে অনুমতি দেয়ার পূর্বেই তোমরা তার প্রতি ঈমান আনলে? নিশ্চয় সে তোমাদের গুরু যে তোমাদের যাদু শিক্ষা দিয়েছে। অতএব অচিরেই তোমরা জানতে পারবে। আমি অবশ্যই তোমাদের হাতসমূহ ও তোমাদের পাসমূহ বিপরীত দিক থেকে কেটে ফেলব এবং অবশ্যই তোমাদের সকলকে শূলিবিদ্ধ করব’।",
    "তারা বলল, ‘কোন ক্ষতি নেই তাতে। অবশ্যই আমরা তো আমাদের রবের দিকেই ফিরে যাব।’",
    "‘আমরা আশা করি যে, আমাদের রব আমাদের অপরাধসমূহ ক্ষমা করে দেবেন, কারণ আমরা মুমিনদের মধ্যে প্রথম।’",
    "আর আমি মূসার প্রতি এ মর্মে ওহী পাঠিয়েছিলাম যে, ‘আমার বান্দাদের নিয়ে রাত্রিকালে যাত্রা শুরু কর, নিশ্চয়ই তোমাদের পিছু নেয়া হবে।’",
    "অতঃপর ফির‘আউন নগরে- নগরে একত্রকারীদেরকে পাঠাল।",
    "‘নিশ্চয়ই এরা তো ক্ষুদ্র একটি দল।’",
    "‘আর এরা অবশ্যই আমাদের ক্রোধের উদ্রেক ঘটিয়েছে।’",
    "‘আর আমরা সবাই তো যথেষ্ট সতর্ক।’",
    "তারপর আমি তাদেরকে উদ্যানমালা ও ঝর্ণাধারাসমূহ থেকে বের করে আনলাম।",
    "আর ধনভান্ডার ও মর্যাদাপূর্ণ অবস্থান থেকে।",
    "এরূপই এবং আমি বনী ইসরাঈলকে এসবের ওয়ারিস বানিয়েছিলাম।",
    "তারপর তারা সূর্যোদয়ের প্রাক্কালে তাদের পিছু নিল।",
    "অতঃপর যখন উভয় দল পরস্পরকে দেখল, তখন মূসার সাথীরা বলল, অবশ্যই ‘আমরা ধরা পড়ে গেলাম!’",
    "মূসা বলল, ‘কক্ষনো নয়; আমার সাথে আমার রব রয়েছেন। নিশ্চয় অচিরেই তিনি আমাকে পথনির্দেশ দেবেন’।",
    "অতঃপর আমি মূসার প্রতি ওহী পাঠালাম, ‘তোমার লাঠি দ্বারা সমুদ্রে আঘাত কর।’ ফলে তা বিভক্ত হয়ে গেল। তারপর প্রত্যেক ভাগ বিশাল পাহাড়সদৃশ হয়ে গেল।",
    "আর আমি অপর দলটিকে সেই জায়গায় নিকটবর্তী করলাম,",
    "আর আমি মূসা ও তার সাথে যারা ছিল সকলকে উদ্ধার করলাম,",
    "তারপর অপর দলটিকে ডুবিয়ে দিলাম।",
    "নিশ্চয় এর মধ্যে রয়েছে নিদর্শন। আর তাদের অধিকাংশই মুমিন নয়।",
    "আর নিশ্চয় তোমার রব তো মহাপরাক্রমশালী, পরম দয়ালু।",
    "আর তুমি তাদের নিকট ইবরাহীমের ঘটনা বর্ণনা কর,",
    "যখন সে তার পিতা ও তার কওমকে বলেছিল, ‘তোমরা কিসের ইবাদাত কর?’",
    "তারা বলল, ‘আমরা মূর্তির পূজা করি। অতঃপর এগুলোর পূজায় আমরা নিষ্ঠার সাথে রত থাকি’।",
    "সে বলল, ‘যখন তোমরা ডাক তখন তারা কি তোমাদের সে ডাক শুনতে পায়?’",
    "‘অথবা তারা কি তোমাদের উপকার কিংবা ক্ষতি করতে পারে’?",
    "তারা বলল, ‘বরং আমরা আমাদের পিতৃপুরুষদের পেয়েছি, তারা এরূপই করত’।",
    "ইবরাহীম বলল, ‘তোমরা কি তাদের সম্পর্কে ভেবে দেখেছ, তোমরা যাদের পূজা কর’।",
    "‘তোমরা এবং তোমাদের অতীত পিতৃপুরুষেরা?’",
    "‘সকল সৃষ্টির রব ছাড়া অবশ্যই তারা আমার শত্রু’।",
    "‘যিনি আমাকে সৃষ্টি করেছেন। অতঃপর তিনিই আমাকে হিদায়াত দিয়েছেন।’",
    "‘আর যিনি আমাকে খাওয়ান এবং পান করান’।",
    "‘আর যখন আমি অসুস্থ হই, তখন যিনি আমাকে আরোগ্য করেন’।",
    "‘আর যিনি আমার মৃত্যু ঘটাবেন তারপর আমাকে জীবিত করবেন’।",
    "‘আর যিনি আশা করি, বিচার দিবসে আমার ত্রুটি-বিচ্যুতি ক্ষমা করে দেবেন’।",
    "‘হে আমার রব, আমাকে প্রজ্ঞা দান করুন এবং আমাকে সৎকর্মশীলদের সাথে শামিল করে দিন’।",
    "‘এবং পরবর্তীদের মধ্যে আমার সুনাম-সুখ্যাতি অব্যাহত রাখুন’,",
    "‘আর আপনি আমাকে সুখময় জান্নাতের ওয়ারিসদের অন্তর্ভুক্ত করুন’।",
    "‘আর আমার পিতাকে ক্ষমা করুন; নিশ্চয় সে পথভ্রষ্টদের অন্তর্ভুক্ত ছিল’।",
    "‘আর যেদিন পুনরুত্থিত করা হবে সেদিন আমাকে লাঞ্ছিত করবেন না’।",
    "‘যেদিন ধন-সম্পদ ও সন্তান-সন্ততি কোন উপকারে আসবে না’।",
    "‘তবে যে আল্লাহর কাছে আসবে সুস্থ অন্তরে’।",
    "আর মুত্তাকীদের জন্য জান্নাত নিকটবর্তী করা হবে,",
    "এবং পথভ্রষ্টকারীদের জন্য জাহান্নাম উন্মোচিত করা হবে।",
    "আর তাদেরকে বলা হবে, ‘তারা কোথায় যাদের তোমরা ইবাদাত করতে’?",
    "আল্লাহ ছাড়া? তারা কি তোমাদেরকে সাহায্য করছে, না নিজেদের সাহায্য করতে পারছে?",
    "অতঃপর তাদেরকে এবং পথভ্রষ্টকারীদেরকে উপুড় করে জাহান্নামে নিক্ষেপ করা হবে,",
    "আর ইবলীসের সকল সৈন্যবাহিনীকে।",
    "সেখানে পরস্পর ঝগড়া করতে গিয়ে তারা বলবে,",
    "আল্লাহর কসম! আমরা তো সুস্পষ্ট পথভ্রষ্টতায় নিমজ্জিত ছিলাম',",
    "‘যখন আমরা তোমাদেরকে সকল সৃষ্টির রবের সমকক্ষ বানাতাম’।",
    "‘আর অপরাধীরাই শুধু আমাদেরকে পথভ্রষ্ট করেছিল’;",
    "‘অতএব, আমাদের কোন সুপারিশকারী নেই’।",
    "‘এবং কোন অন্তরঙ্গ বন্ধুও নেই’।",
    "‘হায়, আমাদের যদি আরেকটি সুযোগ হত, তবে আমরা মুমিনদের অর্ন্তভুক্ত হতাম’।",
    "নিশ্চয় এতে রয়েছে নিদর্শন, আর তাদের অধিকাংশ মুমিন নয়।",
    "আর নিশ্চয় তোমার রব, তিনি তো মহাপরাক্রমশালী, পরম দয়ালু।",
    "নূহ-এর কওম রাসূলদেরকে অস্বীকার করেছিল।",
    "যখন তাদের ভাই নূহ তাদেরকে বলেছিল, ‘তোমরা কি তাকওয়া অবলম্বন করবে না’?",
    "‘নিশ্চয় আমি তোমাদের জন্য একজন বিশ্বস্ত রাসূল’।",
    "‘সুতরাং তোমরা আল্লাহর তাকওয়া অবলম্বন কর এবং আমার আনুগত্য কর’।",
    "‘আর এর উপর আমি তোমাদের কাছে কোন পারিশ্রমিক চাই না; আমার প্রতিদান শুধু সৃষ্টিকুলের রবের নিকট’।",
    "‘সুতরাং তোমরা আল্লাহর তাকওয়া অবলম্বন কর এবং আমার আনুগত্য কর’।",
    "‘তারা বলল, ‘আমরা কি তোমার প্রতি বিশ্বাস স্থাপন করব, অথচ নিম্নশ্রেণীর লোকেরা তোমাকে অনুসরণ করছে’?",
    "নূহ বলল, ‘তারা কি করে তা জানা আমার কী প্রয়োজন’?",
    "‘তাদের হিসাব গ্রহণ তো কেবল আমার রবের দায়িত্বে, যদি তোমরা জানতে’।",
    "‘আর আমি তো মুমিনদেরকে তাড়িয়ে দেয়ার নই’।",
    "‘আমি তো কেবল সুস্পষ্ট সতর্ককারী’।",
    "তারা বলল, ‘হে নূহ, তুমি যদি বিরত না হও তবে অবশ্যই তুমি প্রস্তরাঘাতে নিহতদের অন্তর্ভুক্ত হবে’।",
    "নূহ বলল, ‘হে আমার রব, আমার কওম আমাকে অস্বীকার করেছে’;",
    "‘সুতরাং আপনি আমার ও তাদের মধ্যে ফয়সালা করে দিন আর আমাকে ও আমার সাথে যেসব মুমিন, আছে তাদেরকে রক্ষা করুন’।",
    "অতঃপর আমি তাকে এবং তার সাথে যারা বোঝাই নৌকায় ছিল তাদেরকে নাজাত দিলাম।",
    "তারপর বাকীদের ডুবিয়ে দিলাম।",
    "নিশ্চয় এতে রয়েছে নিদর্শন, আর তাদের বেশীর ভাগ মুমিন ছিল না।",
    "আর নিশ্চয় তোমার রব, তিনি তো মহাপরাক্রমশালী, পরম দয়ালু।",
    "‘আদ জাতি রাসূলগণকে অস্বীকার করেছিল,",
    "যখন তাদের ভাই হূদ তাদেরকে বলেছিল, ‘তোমরা কি তাকওয়া অবলম্বন করবে না’?",
    "‘নিশ্চয় আমি তোমাদের জন্য একজন বিশ্বস্ত রাসূল’।",
    "‘সুতরাং আল্লাহর তাকওয়া অবলম্বন কর এবং আমার আনুগত্য কর’।",
    "‘আর এর উপর আমি তোমাদের কাছে কোন পারিশ্রমিক চাই না; আমার প্রতিদান কেবল সৃষ্টিকুলের রবের নিকট’।",
    "‘তোমরা কি প্রতিটি উঁচু স্থানে বেহুদা স্তম্ভ নির্মাণ করছ’?",
    "‘আর তোমরা সুদৃঢ় প্রাসাদ নির্মাণ করছ, যেন তোমরা স্থায়ী হবে’।",
    "‘আর তোমরা যখন কাউকে পাকড়াও কর, পাকড়াও কর স্বেচ্ছাচারী হয়ে’।",
    "‘সুতরাং আল্লাহকে ভয় কর এবং আমাকে অনুসরণ কর’।",
    "'আর তাঁকে ভয় কর যিনি তোমাদেরকে সাহায্য করেছেন এমন কিছু দিয়ে, যা তোমরা জান'।",
    "‘তিনি তোমাদেরকে সাহায্য করেছেন চতুষ্পদ জন্তু ও সন্তান-সন্ততি দ্বারা’,",
    "‘আর উদ্যান ও ঝর্ণা দ্বারা’।",
    "‘নিশ্চয় আমি তোমাদের উপর এক মহাদিবসের আযাবের ভয় করছি’।",
    "তারা বলল, ‘তুমি আমাদের উপদেশ দাও অথবা না দাও, উভয়ই আমাদের জন্য সমান’।",
    "‘এটি তো পূর্ববর্তীদেরই চরিত্র,।",
    "‘আর আমরা আযাবপ্রাপ্তদের অন্তর্ভুক্ত হব না’।",
    "অতঃপর তারা তাকে অস্বীকার করল, ফলে তাদেরকে আমি ধ্বংস করে দিলাম; নিশ্চয় এতে নিদর্শন রয়েছে। আর তাদের অধিকাংশ মুমিন ছিল না।",
    "আর নিশ্চয় তোমার রব তিনি মহাপরাক্রমশালী, পরম দয়ালু।",
    "সামূদ জাতি রাসুলদেরকে অস্বীকার করেছিল,",
    "যখন তাদের ভাই সালিহ তাদেরকে বলেছিল, ‘তোমরা কি তাকওয়া অবলম্বন করবে না’?",
    "‘নিশ্চয় আমি তোমাদের জন্য এক বিশ্বস্ত রাসূল’;",
    "‘সুতরাং তোমরা আল্লাহর তাকওয়া অবলম্বন কর এবং আমার আনুগত্য কর’।",
    "‘আর এর উপর আমি তোমাদের কাছে কোন পারিশ্রমিক চাই না; আমার প্রতিদান কেবল সৃষ্টিকুলের রবের নিকট’।",
    "‘তোমাদেরকে কি এখানে যা আছে তাতে নিরাপদে ছেড়ে দেয়া হবে’?",
    "‘উদ্যান ও ঝর্ণায়’,",
    "‘আর ক্ষেত-খামার ও কোমল শীষবিশিষ্ট খেজুর বাগানে’?",
    "‘আর তোমরা নৈপুণ্যের সাথে পাহাড় কেটে বাড়ী নির্মাণ করছ’।",
    "‘সুতরাং আল্লাহর তাকওয়া অবলম্বন কর এবং আমার আনুগত্য কর’।",
    "‘এবং সীমালংঘনকারীদের নির্দেশের আনুগত্য করো না’-",
    "‘যারা পৃথিবীতে ফাসাদ সৃষ্টি করে এবং শান্তি স্থাপন করে না’।",
    "তারা বলল, ‘তুমিতো যাদুগ্রস্তদের একজন।",
    "‘তুমি তো কেবল আমাদের মত মানুষ, সুতরাং তুমি যদি সত্যবাদী হও তবে কোন নিদর্শন নিয়ে এসো’।",
    "সালিহ বলল, ‘এটি একটি উষ্ট্রী; তার জন্য পানি পানের পালা একদিন আর তোমাদের পানি পানের পালা আরেক নির্দিষ্ট দিনে’।",
    "‘আর তোমরা তাকে কোন অনিষ্ট কিছু করো না; যদি কর তবে এক মহাদিবসের আযাব তোমাদেরকে পেয়ে বসবে’।",
    "অতঃপর তারা সেটি জবেহ করল; ফলে তারা অনুতপ্ত হল।",
    "অতএব আযাব তাদেরকে পাকড়াও করল, নিশ্চয়ই এতে নিদর্শন রয়েছে, আর তাদের অধিকাংশ মুমিন ছিল না।",
    "আর নিশ্চয় তোমার রব, তিনি তো মহাপরাক্রমশালী, পরম দয়ালু্।",
    "লূতের সম্প্রদায় রাসূলদেরকে অস্বীকার করেছিল।",
    "যখন তাদেরকে তাদের ভাই লূত বলেছিল, ‘তোমরা কি তাকওয়া অবলম্বন করবে না’?",
    "‘নিশ্চয় আমি তোমাদের জন্য এক বিশ্বস্ত রাসূল’।",
    "‘সুতরাং তোমরা আল্লাহর তাকওয়া অবলম্বন কর এবং আমার আনুগত্য কর’।",
    "‘আর আমি এর উপর তোমাদের নিকট কোন প্রতিদান চাই না। আমার প্রতিদান কেবল সৃষ্টিকুলের রবের নিকট’।",
    "‘সৃষ্টিকুলের মধ্যে তোমরা কি কেবল পুরুষদের সাথে উপগত হও’?",
    "‘আর তোমাদের রব তোমাদের জন্য যে স্ত্রীদের সৃষ্টি করেছেন তাদেরকে তোমরা ত্যাগ কর, বরং তোমরা এক সীমালংঘনকারী সম্প্রদায়’।",
    "তারা বলল, ‘হে লূত, তুমি যদি বিরত না হও, তাহলে তুমি অবশ্যই বহিস্কৃতদের অন্তর্ভুক্ত হবে’।",
    "লূত বলল, ‘নিশ্চয় আমি তোমাদের কাজকে ঘৃণা করি’।",
    "‘হে আমার রব, তারা যা করছে, তা থেকে আমাকে ও আমার পরিবার-পরিজনকে তুমি রক্ষা কর’।",
    "অতঃপর আমি তাকে ও তার পরিবার-পরিজন সবাইকে রক্ষা করলাম।",
    "পেছনে অবস্থানকারিণী এক বৃদ্ধা ছাড়া।",
    "তারপর অন্যদেরকে আমি ধ্বংস করে দিলাম।",
    "আর আমি তাদের উপর শিলাবৃষ্টি বর্ষণ করলাম। সুতরাং সেই বৃষ্টি ভয় প্রদর্শিতদের জন্য কতইনা মন্দ ছিল!",
    "নিশ্চয় এতে এক নিদর্শন রয়েছে। আর তাদের অধিকাংশই মুমিন ছিল না।",
    "আর নিশ্চয় তোমার রব, তিনি তো মহাপরাক্রমশালী, পরম দয়ালু।",
    "আইকার অধিবাসীরা রাসূলদেরকে অস্বীকার করেছিল।",
    "যখন শু‘আইব তাদেরকে বলল, ‘তোমরা কি তাকওয়া অবলম্বন করবে না’?",
    "‘নিশ্চয় আমি তোমাদের জন্য এক বিশ্বস্ত রাসূল’।",
    "‘সুতরাং তোমরা আল্লাহর তাকওয়া অবলম্বন কর এবং আমার আনুগত্য কর’।",
    "‘আর আমি এর উপর তোমাদের নিকট কোন প্রতিদান চাই না। আমার প্রতিদান কেবল সৃষ্টিকুলের রবের নিকট’।",
    "‘মাপ পূর্ণ করে দাও এবং যারা মাপে ঘাটতি করে, তোমরা তাদের অন্তর্ভুক্ত হয়ো না’।",
    "‘আর সঠিক দাঁড়ি পাল্লায় ওজন কর’।",
    "'আর লোকদেরকে তাদের প্রাপ্যবস্তু কম দিও না এবং যমীনে ফাসাদ সৃষ্টি করো না'।",
    "‘যিনি তোমাদেরকে ও পূর্ববর্তী প্রজন্মসমূহকে সৃষ্টি করেছেন, তাঁর তাকওয়া অবলম্বন কর’।",
    "তারা বলল, ‘তুমি তো কেবল যাদুগ্রস্তদের অন্তর্ভুক্ত’।",
    "‘তুমি কেবল আমাদের মত একজন মানুষ। আর আমরা তোমাকে অবশ্যই মিথ্যাবাদীদের অন্তর্ভুক্ত বলে মনে করি’।",
    "‘অতএব, তুমি যদি সত্যবাদী হও, তবে আসমান থেকে এক টুকরো আমাদের উপর ফেলে দাও’।",
    "সে বলল, ‘তোমরা যা কর, সে সম্পর্কে আমার রব অধিক জ্ঞাত’।",
    "অতঃপর তারা তাকে অস্বীকার করল। ফলে তাদেরকে এক মেঘাচ্ছন্ন দিবসের আযাব পাকড়াও করল। অবশ্যই তা ছিল এক মহা দিবসের আযাব।",
    "নিশ্চয় এতে অনেক নিদর্শন রয়েছে। আর তাদের অধিকাংশই মুমিন ছিল না।",
    "আর নিশ্চয় তোমার রব তিনি তো মহাপরাক্রমশালী, পরম দয়ালু।",
    "আর নিশ্চয় এ কুরআন সৃষ্টিকুলের রবেরই নাযিলকৃত।",
    "বিশ্বস্ত আত্মা* এটা নিয়ে অবতরণ করেছে। \n* এখানে 'বিশ্বস্ত আত্মা'দ্বারা জিবরীল (আ:) কে বুঝানো হয়েছে।",
    "তোমার হৃদয়ে, যাতে তুমি সতর্ককারীদের অন্তর্ভুক্ত হও।",
    "সুস্পষ্ট আরবী ভাষায়।",
    "আর অবশ্যই তা রয়েছে পূর্ববর্তী কিতাবসমূহে।",
    "এটা কি তাদের জন্য একটি নিদর্শন নয় যে, বনী ইসরাঈলের পন্ডিতগণ তা জানে?",
    "আর আমি যদি এটাকে কোন অনারবের প্রতি নাযিল করতাম।",
    "অতঃপর সে তা তাদের নিকট পাঠ করত। তবুও তারা এতে মুমিন হত না।",
    "এভাবেই আমি বিষয়টি অপরাধীদের অন্তরে সঞ্চার করেছি।",
    "যতক্ষণ না তারা যন্ত্রণাদায়ক আযাব প্রত্যক্ষ করবে, ততক্ষণ পর্যন্ত তারা এতে ঈমান আনবে না।",
    "সুতরাং তা আকস্মিকভাবে তাদের নিকট এসে পড়বে, অথচ তারা উপলদ্ধি করতে পারবে না।",
    "তখন তারা বলবে, ‘আমাদেরকে কি অবকাশ দেয়া হবে?’",
    "তাহলে কি তারা আমার আযাব ত্বরান্বিত করতে চায়?",
    "তুমি কি লক্ষ্য করেছ, আমি যদি তাদেরকে দীর্ঘকাল ভোগ-বিলাসের সুযোগ দিতাম।",
    "অতঃপর তাদেরকে যে বিষয়ে ওয়াদা করা হয়েছে, তা তাদের নিকট এসে পড়ত,",
    "তখন যা তাদের ভোগ-বিলাসের জন্য দেয়া হয়েছিল, তা তাদের কোনই কাজে আসত না।",
    "আর আমি এমন কোন জনপদকে ধ্বংস করিনি, যাতে কোন সতর্ককারী আসেনি।",
    "এটা উপদেশস্বরূপ; আর আমি যালিমদের অন্তর্ভুক্ত ছিলাম না।",
    "আর শয়তানরা তা নিয়ে অবতরণ করেনি।",
    "আর এটা তাদের জন্য উচিৎ নয় এবং তারা এর ক্ষমতাও রাখে না।",
    "নিশ্চয়ই তাদেরকে এর শ্রবণ থেকে আড়ালে রাখা হয়েছে।",
    "অতএব, তুমি আল্লাহর সাথে অন্য কোন ইলাহকে ডেকো না, তাহলে তুমি আযাবপ্রাপ্তদের অন্তর্ভুক্ত হয়ে যাবে।",
    "আর তুমি তোমার নিকটাত্মীয়দেরকে সতর্ক কর।",
    "আর মুমিনদের মধ্যে যারা তোমার অনুসরণ করে, তাদের প্রতি তুমি তোমার বাহুকে অবনত কর।",
    "তারপর যদি তারা তোমার অবাধ্য হয়, তাহলে বল, ‘তোমরা যা কর, নিশ্চয় আমি তা থেকে সম্পূর্ণ মুক্ত’।",
    "‘আর তুমি মহাপরাক্রমশালী পরম দয়ালুর উপর তাওয়াক্কুল কর,",
    "‘যিনি তোমাকে দেখেন যখন তুমি দন্ডায়মান হও’",
    "‘এবং সিজদাকারীদের মধ্যে তোমার উঠাবসা’।",
    "‘নিশ্চয় তিনি সর্বশ্রোতা, মহাজ্ঞানী’।",
    "‘আমি কি তোমাদেরকে সংবাদ দেব, কার নিকট শয়তানরা অবতীর্ণ হয়’?",
    "তারা অবতীর্ণ হয় প্রত্যেক চরম মিথ্যাবাদী ও পাপীর নিকট।",
    "তারা কান পেতে থাকে এবং তাদের অধিকাংশই মিথ্যাবাদী।",
    "আর বিভ্রান্তরাই কবিদের অনুসরণ করে।",
    "তুমি কি লক্ষ্য করো নি যে, তারা প্রত্যেক উপত্যকায় উদভ্রান্ত হয়ে ঘুরে বেড়ায়?",
    "আর নিশ্চয় তারা এমন কথা বলে, যা তারা করে না।",
    "তবে যারা ঈমান এনেছে এবং সৎকর্ম করেছে, আর আল্লাহকে অনেক স্মরণ করেছে। আর তারা নির্যাতিত হওয়ার পর প্রতিশোধ নেয়। আর যালিমরা শীঘ্রই জানতে পারবে কোন্ প্রত্যাবর্তন স্থলে তারা প্রত্যাবর্তন করবে।"
  ]
}