{
  "surahName": "Al-Anbiyaa",
  "surahNameArabic": "الأنبياء",
  "surahNameArabicLong": "سورة الأنبياء",
  "surahNameTranslation": "The Prophets",
  "revelationPlace": "Mecca",
  "totalAyah": 112,
  "surahNo": 21,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/21.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/021.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/21.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/021.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/21.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/021.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/21.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/021.mp3"
    }
  },
  "english": [
    "˹The time of˺ people’s judgment has drawn near, yet they are heedlessly turning away.",
    "Whatever new reminder comes to them from their Lord, they only listen to it jokingly",
    "with their hearts ˹totally˺ distracted. The evildoers would converse secretly, ˹saying,˺ “Is this ˹one˺ not human like yourselves? Would you fall for ˹this˺ witchcraft, even though you can ˹clearly˺ see?”",
    "The Prophet responded, “My Lord ˹fully˺ knows every word spoken in the heavens and the earth. For He is the All-Hearing, All-Knowing.”",
    "Yet they say, “This ˹Quran˺ is a set of confused dreams! No, he has fabricated it! No, he must be a poet! So let him bring us a ˹tangible˺ sign like those ˹prophets˺ sent before.”",
    "Not a ˹single˺ society We destroyed before them ever believed ˹after receiving the signs˺. Will these ˹pagans˺ then believe?",
    "We did not send ˹messengers˺ before you ˹O Prophet˺ except mere men inspired by Us. If you ˹polytheists˺ do not know ˹this already˺, then ask those who have knowledge ˹of the Scriptures˺.",
    "We did not give those messengers ˹supernatural˺ bodies that did not need food, nor were they immortal.",
    "Then We fulfilled Our promise to them, saving them along with whoever We willed and destroying the transgressors.",
    "We have surely revealed to you a Book, in which there is glory for you. Will you not then understand?",
    "˹Imagine˺ how many societies of wrongdoers We have destroyed, raising up other people after them!",
    "When the wrongdoers sensed ˹the arrival of˺ Our torment, they started to run away from their cities.",
    "˹They were told,˺ “Do not run away! Return to your luxuries and your homes, so you may be questioned ˹about your fate˺.”",
    "They cried, “Woe to us! We have surely been wrongdoers.”",
    "They kept repeating their cry until We mowed them down, ˹leaving them˺ lifeless.",
    "We did not create the heavens and the earth and everything in between for sport.",
    "Had We intended to take ˹some˺ amusement, We could have found it in Our presence, if that had been Our Will.",
    "In fact, We hurl the truth against falsehood, leaving it crushed, and it quickly vanishes. And woe be to you for what you claim!",
    "To Him belong all those in the heavens and the earth. And those nearest to Him are not too proud to worship Him, nor do they tire.",
    "They glorify ˹Him˺ day and night, never wavering.",
    "Or have they taken gods from the earth, who can raise the dead?",
    "Had there been other gods besides Allah in the heavens or the earth, both ˹realms˺ would have surely been corrupted. So Glorified is Allah, Lord of the Throne, far above what they claim.",
    "He cannot be questioned about what He does, but they will ˹all˺ be questioned.",
    "Or have they taken other gods besides Him? Say, ˹O Prophet,˺ “Show ˹me˺ your proof. Here is ˹the Quran,˺ the Reminder for those with me; along with ˹earlier Scriptures,˺ the Reminder for those before me.” But most of them do not know the truth, so they turn away.",
    "We never sent a messenger before you ˹O Prophet˺ without revealing to him: “There is no god ˹worthy of worship˺ except Me, so worship Me ˹alone˺.”",
    "And they say, “The Most Compassionate has offspring!” Glory be to Him! In fact, those ˹angels˺ are only ˹His˺ honoured servants",
    "who do not speak until He has spoken, ˹only˺ acting at His command.",
    "He ˹fully˺ knows what is ahead of them and what is behind them. They do not intercede except for whom He approves, and they tremble in awe of Him.",
    "Whoever of them were to say, “I am a god besides Him,” they would be rewarded with Hell by Us. This is how We reward the wrongdoers.",
    "Do the disbelievers not realize that the heavens and earth were ˹once˺ one mass then We split them apart? And We created from water every living thing. Will they not then believe?",
    "And We have placed firm mountains upon the earth so it does not shake with them, and made in it broad pathways so they may find their way.",
    "And We have made the sky a well-protected canopy, still they turn away from its signs.",
    "And He is the One Who created the day and the night, the sun and the moon—each travelling in an orbit.",
    "We have not granted immortality to any human before you ˹O Prophet˺: so if you die, will they live forever?",
    "Every soul will taste death. And We test you ˹O humanity˺ with good and evil as a trial, then to Us you will ˹all˺ be returned.",
    "When the disbelievers see you ˹O Prophet˺, they only make fun of you, ˹saying,˺ “Is this the one who speaks ˹ill˺ of your gods?” while they disbelieve at the mention of the Most Compassionate.",
    "Humankind is made of haste. I will soon show you My signs, so do not ask Me to hasten them.",
    "They ask ˹the believers˺, “When will this threat come to pass if what you say is true?”",
    "If only the disbelievers knew that a time will come when they will not be able to keep the Fire off their faces or backs, nor will they be helped.",
    "In fact, the Hour will take them by surprise, leaving them stunned. So they will not be able to avert it, nor will it be delayed from them.",
    "˹Other˺ messengers had already been ridiculed before you ˹O Prophet˺, but those who mocked them were overtaken by what they used to ridicule.",
    "Ask ˹them, O  Prophet,˺ “Who can defend you by day or by night against the Most Compassionate?” Still they turn away from the remembrance of their Lord.",
    "Or do they have gods—other than Us—that can protect them? They cannot ˹even˺ protect themselves, nor will they be aided against Us.",
    "In fact, We have allowed enjoyment for these ˹Meccans˺ and their forefathers for such a long time ˹that they took it for granted˺. Do they not see that We gradually reduce ˹their˺ land from its borders? Is it they who will then prevail?",
    "Say, ˹O Prophet,˺ “I warn you only by revelation.” But the deaf cannot hear the call when they are warned!",
    "If they were touched by even a breath of your Lord’s torment, they would certainly cry, “Woe to us! We have really been wrongdoers.”",
    "We will set up the scales of justice on the Day of Judgment, so no soul will be wronged in the least. And ˹even˺ if a deed is the weight of a mustard seed, We will bring it forth. And sufficient are We as a ˹vigilant˺ Reckoner.",
    "Indeed, We granted Moses and Aaron the standard ˹to distinguish between right and wrong˺—a light and a reminder for the righteous",
    "who are in awe of their Lord without seeing Him, and are fearful of the Hour.",
    "And this ˹Quran˺ is a blessed reminder which We have revealed. Will you ˹pagans˺ then deny it?",
    "And indeed, We had granted Abraham sound judgment early on, for We knew him well ˹to be worthy of it˺.",
    "˹Remember˺ when he questioned his father and his people, “What are these statues to which you are so devoted?”",
    "They replied, “We found our forefathers worshipping them.”",
    "He responded, “Indeed, you and your forefathers have been clearly astray.”",
    "They asked, “Have you come to us with the truth, or is this a joke?”",
    "He replied, “In fact, your Lord is the Lord of the heavens and the earth, Who created them ˹both˺. And to that I bear witness.”",
    "˹Then he said to himself,˺ “By Allah! I will surely plot against your idols after you have turned your backs and gone away.”",
    "So he smashed them into pieces, except the biggest of them, so they might turn to it ˹for answers˺.",
    "They protested, “Who dared do this to our gods? It must be an evildoer!”",
    "Some said, “We heard a young man, called Abraham, speaking ˹ill˺ of them.”",
    "They demanded, “Bring him before the eyes of the people, so that they may witness ˹his trial˺.”",
    "They asked, “Was it you who did this to our gods, O  Abraham?”",
    "He replied ˹sarcastically˺, “No, this one—the biggest of them—did it! So ask them, if they can talk!”",
    "So they came back to their senses, saying ˹to one another˺, “You yourselves are truly the wrongdoers!”",
    "Then they ˹quickly˺ regressed to their ˹original˺ mind-set, ˹arguing,˺ “You already know that those ˹idols˺ cannot talk.”",
    "He rebuked ˹them˺, “Do you then worship—instead of Allah—what can neither benefit nor harm you in any way?",
    "Shame on you and whatever you worship instead of Allah! Do you not have any sense?”",
    "They concluded, “Burn him up to avenge your gods, if you must act.”",
    "We ordered, “O fire! Be cool and safe for Abraham!”",
    "They had sought to harm him, but We made them the worst losers.",
    "Then We delivered him, along with Lot, to the land We had showered with blessings for all people.",
    "And We blessed him with Isaac ˹as a son˺ and Jacob ˹as a grandson˺, as an additional favour—making all of them righteous.",
    "We ˹also˺ made them leaders, guiding by Our command, and inspired them to do good deeds, establish prayer, and pay alms-tax. And they were devoted to Our worship.",
    "And to Lot We gave wisdom and knowledge, and delivered him from the society engrossed in shameful practices. They were certainly an evil, rebellious people.",
    "And We admitted him into Our mercy, ˹for˺ he was truly one of the righteous.",
    "And ˹remember˺ when Noah had cried out to Us earlier, so We responded to him and delivered him and his family from the great distress.",
    "And We made him prevail over those who had rejected Our signs. They were truly an evil people, so We drowned them all.",
    "And ˹remember˺ when David and Solomon passed judgment regarding the crops ruined ˹at night˺ by someone’s sheep, and We were witness to their judgments.",
    "We guided ˹young˺ Solomon to a fairer settlement, and granted each of them wisdom and knowledge. We subjected the mountains as well as the birds to hymn ˹Our praises˺ along with David. It is We Who did ˹it all˺.",
    "We taught him the art of making body armour to protect you in battle. Will you then be grateful?",
    "And to Solomon We subjected the raging winds, blowing by his command to the land We had showered with blessings. It is We Who know everything.",
    "And ˹We subjected˺ some jinn that dived for him, and performed other duties. It is We Who kept them in check.",
    "And ˹remember˺ when Job cried out to his Lord, “I have been touched with adversity, and You are the Most Merciful of the merciful.”",
    "So We answered his prayer and removed his adversity, and gave him back his family, twice as many, as a mercy from Us and a lesson for the ˹devoted˺ worshippers.",
    "And ˹remember˺ Ishmael, Enoch, and Ⱬul-Kifl. They were all steadfast.",
    "We admitted them into Our mercy, for they were truly of the righteous.",
    "And ˹remember˺ when the Man of the Whale stormed off ˹from his city˺ in a rage, thinking We would not restrain him. Then in the ˹veils of˺ darkness he cried out, “There is no god ˹worthy of worship˺ except You. Glory be to You! I have certainly done wrong.”",
    "So We answered his prayer and rescued him from anguish. And so do We save the ˹true˺ believers.",
    "And ˹remember˺ when Zachariah cried out to his Lord, “My Lord! Do not leave me childless, though You are the Best of Successors.”",
    "So We answered his prayer, granted him John, and made his wife fertile. Indeed, they used to race in doing good, and call upon Us with hope and fear, totally humbling themselves before Us.",
    "And ˹remember˺ the one who guarded her chastity, so We breathed into her through Our angel, ˹Gabriel,˺ making her and her son a sign for all peoples.",
    "˹O prophets!˺ Indeed, this religion of yours is ˹only˺ one, and I am your Lord, so worship Me ˹alone˺.",
    "Yet the people have divided it into sects. But to Us they will all return.",
    "So whoever does good and is a believer will never be denied ˹the reward for˺ their striving, for We are recording it all.",
    "It is impossible for a society which We have destroyed to ever rise again",
    "until ˹after˺ Gog and Magog have broken loose ˹from the barrier˺, swarming down from every hill",
    "ushering in the True Promise. Then—behold!—the disbelievers will stare ˹in horror, crying,˺ “Oh, woe to us! We have truly been heedless of this. In fact, we have been wrongdoers.”",
    "Certainly you ˹disbelievers˺ and whatever you worship instead of Allah will be the fuel of Hell. You are ˹all˺ bound to enter it.",
    "Had those idols been ˹true˺ gods, they would not have entered it. And they will be there forever.",
    "In it they will groan, and will not be able to hear.",
    "Surely those for whom We have destined the finest reward will be kept far away from Hell",
    "not even hearing the slightest hissing from it. And they will delight forever in what their souls desire.",
    "The Supreme Horror ˹of that Day˺ will not disturb them, and the angels will greet them, ˹saying,˺ “This is your Day, which you have been promised.”",
    "On that Day We will roll up the heavens like a scroll of writings. Just as We produced the first creation, ˹so˺ shall We reproduce it. That is a promise binding on Us. We truly uphold ˹Our promises˺!",
    "Surely, following the ˹heavenly˺ Record, We decreed in the Scriptures: “My righteous servants shall inherit the land.”",
    "Surely this ˹Quran˺ is sufficient ˹as a reminder˺ for those devoted to worship.",
    "We have sent you ˹O Prophet˺ only as a mercy for the whole world.",
    "Say, “What has been revealed to me is this: ‘Your God is only One God.’ Will you then submit?”",
    "If they turn away, then say, “I have warned you all equally. I do not know if what you are threatened with is near or far.",
    "Allah surely knows what you say openly and whatever you hide.",
    "I do not know if this ˹delay˺ is possibly a test for you and an enjoyment for a while.”",
    "˹In the end,˺ the Prophet said, “My Lord! Judge ˹between us˺ in truth. And our Lord is the Most Compassionate, Whose help is sought against what you claim.”"
  ],
  "arabic1": [
    "اِقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِیْ غَفْلَةٍ مُّعْرِضُوْنَ",
    "مَا یَاْتِیْهِمْ مِّنْ ذِكْرٍ مِّنْ رَّبِّهِمْ مُّحْدَثٍ اِلَّا اسْتَمَعُوْهُ وَهُمْ یَلْعَبُوْنَ",
    "لَاهِیَةً قُلُوْبُهُمْ وَاَسَرُّوا النَّجْوَی ۖ الَّذِیْنَ ظَلَمُوْا ۖ هَلْ هٰذَاۤ اِلَّا بَشَرٌ مِّثْلُكُمْ اَفَتَاْتُوْنَ السِّحْرَ وَاَنْتُمْ تُبْصِرُوْنَ",
    "قٰلَ رَبِّیْ یَعْلَمُ الْقَوْلَ فِی السَّمَآءِ وَالْاَرْضِ وَهُوَ السَّمِیْعُ الْعَلِیْمُ",
    "بَلْ قَالُوْۤا اَضْغَاثُ اَحْلَامٍ بَلِ افْتَرٰىهُ بَلْ هُوَ شَاعِرٌ فَلْیَاْتِنَا بِاٰیَةٍ كَمَاۤ اُرْسِلَ الْاَوَّلُوْنَ",
    "مَاۤ اٰمَنَتْ قَبْلَهُمْ مِّنْ قَرْیَةٍ اَهْلَكْنٰهَا اَفَهُمْ یُؤْمِنُوْنَ",
    "وَمَاۤ اَرْسَلْنَا قَبْلَكَ اِلَّا رِجَالًا نُّوْحِیْۤ اِلَیْهِمْ فَسْـَٔلُوْۤا اَهْلَ الذِّكْرِ اِنْ كُنْتُمْ لَا تَعْلَمُوْنَ",
    "وَمَا جَعَلْنٰهُمْ جَسَدًا لَّا یَاْكُلُوْنَ الطَّعَامَ وَمَا كَانُوْا خٰلِدِیْنَ",
    "ثُمَّ صَدَقْنٰهُمُ الْوَعْدَ فَاَنْجَیْنٰهُمْ وَمَنْ نَّشَآءُ وَاَهْلَكْنَا الْمُسْرِفِیْنَ",
    "لَقَدْ اَنْزَلْنَاۤ اِلَیْكُمْ كِتٰبًا فِیْهِ ذِكْرُكُمْ اَفَلَا تَعْقِلُوْنَ",
    "وَكَمْ قَصَمْنَا مِنْ قَرْیَةٍ كَانَتْ ظَالِمَةً وَّاَنْشَاْنَا بَعْدَهَا قَوْمًا اٰخَرِیْنَ",
    "فَلَمَّاۤ اَحَسُّوْا بَاْسَنَاۤ اِذَا هُمْ مِّنْهَا یَرْكُضُوْنَ",
    "لَا تَرْكُضُوْا وَارْجِعُوْۤا اِلٰی مَاۤ اُتْرِفْتُمْ فِیْهِ وَمَسٰكِنِكُمْ لَعَلَّكُمْ تُسْـَٔلُوْنَ",
    "قَالُوْا یٰوَیْلَنَاۤ اِنَّا كُنَّا ظٰلِمِیْنَ",
    "فَمَا زَالَتْ تِّلْكَ دَعْوٰىهُمْ حَتّٰی جَعَلْنٰهُمْ حَصِیْدًا خٰمِدِیْنَ",
    "وَمَا خَلَقْنَا السَّمَآءَ وَالْاَرْضَ وَمَا بَیْنَهُمَا لٰعِبِیْنَ",
    "لَوْ اَرَدْنَاۤ اَنْ نَّتَّخِذَ لَهْوًا لَّاتَّخَذْنٰهُ مِنْ لَّدُنَّاۤ ۖ اِنْ كُنَّا فٰعِلِیْنَ",
    "بَلْ نَقْذِفُ بِالْحَقِّ عَلَی الْبَاطِلِ فَیَدْمَغُهٗ فَاِذَا هُوَ زَاهِقٌ وَلَكُمُ الْوَیْلُ مِمَّا تَصِفُوْنَ",
    "وَلَهٗ مَنْ فِی السَّمٰوٰتِ وَالْاَرْضِ وَمَنْ عِنْدَهٗ لَا یَسْتَكْبِرُوْنَ عَنْ عِبَادَتِهٖ وَلَا یَسْتَحْسِرُوْنَ",
    "یُسَبِّحُوْنَ الَّیْلَ وَالنَّهَارَ لَا یَفْتُرُوْنَ",
    "اَمِ اتَّخَذُوْۤا اٰلِهَةً مِّنَ الْاَرْضِ هُمْ یُنْشِرُوْنَ",
    "لَوْ كَانَ فِیْهِمَاۤ اٰلِهَةٌ اِلَّا اللّٰهُ لَفَسَدَتَا فَسُبْحٰنَ اللّٰهِ رَبِّ الْعَرْشِ عَمَّا یَصِفُوْنَ",
    "لَا یُسْـَٔلُ عَمَّا یَفْعَلُ وَهُمْ یُسْـَٔلُوْنَ",
    "اَمِ اتَّخَذُوْا مِنْ دُوْنِهٖۤ اٰلِهَةً قُلْ هَاتُوْا بُرْهَانَكُمْ هٰذَا ذِكْرُ مَنْ مَّعِیَ وَذِكْرُ مَنْ قَبْلِیْ بَلْ اَكْثَرُهُمْ لَا یَعْلَمُوْنَ الْحَقَّ فَهُمْ مُّعْرِضُوْنَ",
    "وَمَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِیْۤ اِلَیْهِ اَنَّهٗ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدُوْنِ",
    "وَقَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا سُبْحٰنَهٗ بَلْ عِبَادٌ مُّكْرَمُوْنَ",
    "لَا یَسْبِقُوْنَهٗ بِالْقَوْلِ وَهُمْ بِاَمْرِهٖ یَعْمَلُوْنَ",
    "یَعْلَمُ مَا بَیْنَ اَیْدِیْهِمْ وَمَا خَلْفَهُمْ وَلَا یَشْفَعُوْنَ اِلَّا لِمَنِ ارْتَضٰی وَهُمْ مِّنْ خَشْیَتِهٖ مُشْفِقُوْنَ",
    "وَمَنْ یَّقُلْ مِنْهُمْ اِنِّیْۤ اِلٰهٌ مِّنْ دُوْنِهٖ فَذٰلِكَ نَجْزِیْهِ جَهَنَّمَ كَذٰلِكَ نَجْزِی الظّٰلِمِیْنَ",
    "اَوَلَمْ یَرَ الَّذِیْنَ كَفَرُوْۤا اَنَّ السَّمٰوٰتِ وَالْاَرْضَ كَانَتَا رَتْقًا فَفَتَقْنٰهُمَا وَجَعَلْنَا مِنَ الْمَآءِ كُلَّ شَیْءٍ حَیٍّ اَفَلَا یُؤْمِنُوْنَ",
    "وَجَعَلْنَا فِی الْاَرْضِ رَوَاسِیَ اَنْ تَمِیْدَ بِهِمْ وَجَعَلْنَا فِیْهَا فِجَاجًا سُبُلًا لَّعَلَّهُمْ یَهْتَدُوْنَ",
    "وَجَعَلْنَا السَّمَآءَ سَقْفًا مَّحْفُوْظًا وَّهُمْ عَنْ اٰیٰتِهَا مُعْرِضُوْنَ",
    "وَهُوَ الَّذِیْ خَلَقَ الَّیْلَ وَالنَّهَارَ وَالشَّمْسَ وَالْقَمَرَ كُلٌّ فِیْ فَلَكٍ یَّسْبَحُوْنَ",
    "وَمَا جَعَلْنَا لِبَشَرٍ مِّنْ قَبْلِكَ الْخُلْدَ اَفَاۡىِٕنْ مِّتَّ فَهُمُ الْخٰلِدُوْنَ",
    "كُلُّ نَفْسٍ ذَآىِٕقَةُ الْمَوْتِ وَنَبْلُوْكُمْ بِالشَّرِّ وَالْخَیْرِ فِتْنَةً وَاِلَیْنَا تُرْجَعُوْنَ",
    "وَاِذَا رَاٰكَ الَّذِیْنَ كَفَرُوْۤا اِنْ یَّتَّخِذُوْنَكَ اِلَّا هُزُوًا اَهٰذَا الَّذِیْ یَذْكُرُ اٰلِهَتَكُمْ وَهُمْ بِذِكْرِ الرَّحْمٰنِ هُمْ كٰفِرُوْنَ",
    "خُلِقَ الْاِنْسَانُ مِنْ عَجَلٍ سَاُورِیْكُمْ اٰیٰتِیْ فَلَا تَسْتَعْجِلُوْنِ",
    "وَیَقُوْلُوْنَ مَتٰی هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "لَوْ یَعْلَمُ الَّذِیْنَ كَفَرُوْا حِیْنَ لَا یَكُفُّوْنَ عَنْ وُّجُوْهِهِمُ النَّارَ وَلَا عَنْ ظُهُوْرِهِمْ وَلَا هُمْ یُنْصَرُوْنَ",
    "بَلْ تَاْتِیْهِمْ بَغْتَةً فَتَبْهَتُهُمْ فَلَا یَسْتَطِیْعُوْنَ رَدَّهَا وَلَا هُمْ یُنْظَرُوْنَ",
    "وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّنْ قَبْلِكَ فَحَاقَ بِالَّذِیْنَ سَخِرُوْا مِنْهُمْ مَّا كَانُوْا بِهٖ یَسْتَهْزِءُوْنَ",
    "قُلْ مَنْ یَّكْلَؤُكُمْ بِالَّیْلِ وَالنَّهَارِ مِنَ الرَّحْمٰنِ بَلْ هُمْ عَنْ ذِكْرِ رَبِّهِمْ مُّعْرِضُوْنَ",
    "اَمْ لَهُمْ اٰلِهَةٌ تَمْنَعُهُمْ مِّنْ دُوْنِنَا لَا یَسْتَطِیْعُوْنَ نَصْرَ اَنْفُسِهِمْ وَلَا هُمْ مِّنَّا یُصْحَبُوْنَ",
    "بَلْ مَتَّعْنَا هٰۤؤُلَآءِ وَاٰبَآءَهُمْ حَتّٰی طَالَ عَلَیْهِمُ الْعُمُرُ اَفَلَا یَرَوْنَ اَنَّا نَاْتِی الْاَرْضَ نَنْقُصُهَا مِنْ اَطْرَافِهَا اَفَهُمُ الْغٰلِبُوْنَ",
    "قُلْ اِنَّمَاۤ اُنْذِرُكُمْ بِالْوَحْیِ ۖ وَلَا یَسْمَعُ الصُّمُّ الدُّعَآءَ اِذَا مَا یُنْذَرُوْنَ",
    "وَلَىِٕنْ مَّسَّتْهُمْ نَفْحَةٌ مِّنْ عَذَابِ رَبِّكَ لَیَقُوْلُنَّ یٰوَیْلَنَاۤ اِنَّا كُنَّا ظٰلِمِیْنَ",
    "وَنَضَعُ الْمَوَازِیْنَ الْقِسْطَ لِیَوْمِ الْقِیٰمَةِ فَلَا تُظْلَمُ نَفْسٌ شَیْـًٔا وَاِنْ كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ اَتَیْنَا بِهَا وَكَفٰی بِنَا حٰسِبِیْنَ",
    "وَلَقَدْ اٰتَیْنَا مُوْسٰی وَهٰرُوْنَ الْفُرْقَانَ وَضِیَآءً وَّذِكْرًا لِّلْمُتَّقِیْنَ",
    "الَّذِیْنَ یَخْشَوْنَ رَبَّهُمْ بِالْغَیْبِ وَهُمْ مِّنَ السَّاعَةِ مُشْفِقُوْنَ",
    "وَهٰذَا ذِكْرٌ مُّبٰرَكٌ اَنْزَلْنٰهُ اَفَاَنْتُمْ لَهٗ مُنْكِرُوْنَ",
    "وَلَقَدْ اٰتَیْنَاۤ اِبْرٰهِیْمَ رُشْدَهٗ مِنْ قَبْلُ وَكُنَّا بِهٖ عٰلِمِیْنَ",
    "اِذْ قَالَ لِاَبِیْهِ وَقَوْمِهٖ مَا هٰذِهِ التَّمَاثِیْلُ الَّتِیْۤ اَنْتُمْ لَهَا عٰكِفُوْنَ",
    "قَالُوْا وَجَدْنَاۤ اٰبَآءَنَا لَهَا عٰبِدِیْنَ",
    "قَالَ لَقَدْ كُنْتُمْ اَنْتُمْ وَاٰبَآؤُكُمْ فِیْ ضَلٰلٍ مُّبِیْنٍ",
    "قَالُوْۤا اَجِئْتَنَا بِالْحَقِّ اَمْ اَنْتَ مِنَ اللّٰعِبِیْنَ",
    "قَالَ بَلْ رَّبُّكُمْ رَبُّ السَّمٰوٰتِ وَالْاَرْضِ الَّذِیْ فَطَرَهُنَّ ۖ وَاَنَا عَلٰی ذٰلِكُمْ مِّنَ الشّٰهِدِیْنَ",
    "وَتَاللّٰهِ لَاَكِیْدَنَّ اَصْنَامَكُمْ بَعْدَ اَنْ تُوَلُّوْا مُدْبِرِیْنَ",
    "فَجَعَلَهُمْ جُذٰذًا اِلَّا كَبِیْرًا لَّهُمْ لَعَلَّهُمْ اِلَیْهِ یَرْجِعُوْنَ",
    "قَالُوْا مَنْ فَعَلَ هٰذَا بِاٰلِهَتِنَاۤ اِنَّهٗ لَمِنَ الظّٰلِمِیْنَ",
    "قَالُوْا سَمِعْنَا فَتًی یَّذْكُرُهُمْ یُقَالُ لَهٗۤ اِبْرٰهِیْمُ",
    "قَالُوْا فَاْتُوْا بِهٖ عَلٰۤی اَعْیُنِ النَّاسِ لَعَلَّهُمْ یَشْهَدُوْنَ",
    "قَالُوْۤا ءَاَنْتَ فَعَلْتَ هٰذَا بِاٰلِهَتِنَا یٰۤاِبْرٰهِیْمُ",
    "قَالَ بَلْ فَعَلَهٗ ۖ كَبِیْرُهُمْ هٰذَا فَسْـَٔلُوْهُمْ اِنْ كَانُوْا یَنْطِقُوْنَ",
    "فَرَجَعُوْۤا اِلٰۤی اَنْفُسِهِمْ فَقَالُوْۤا اِنَّكُمْ اَنْتُمُ الظّٰلِمُوْنَ",
    "ثُمَّ نُكِسُوْا عَلٰی رُءُوْسِهِمْ لَقَدْ عَلِمْتَ مَا هٰۤؤُلَآءِ یَنْطِقُوْنَ",
    "قَالَ اَفَتَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ مَا لَا یَنْفَعُكُمْ شَیْـًٔا وَّلَا یَضُرُّكُمْ",
    "اُفٍّ لَّكُمْ وَلِمَا تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ اَفَلَا تَعْقِلُوْنَ",
    "قَالُوْا حَرِّقُوْهُ وَانْصُرُوْۤا اٰلِهَتَكُمْ اِنْ كُنْتُمْ فٰعِلِیْنَ",
    "قُلْنَا یٰنَارُ كُوْنِیْ بَرْدًا وَّسَلٰمًا عَلٰۤی اِبْرٰهِیْمَ",
    "وَاَرَادُوْا بِهٖ كَیْدًا فَجَعَلْنٰهُمُ الْاَخْسَرِیْنَ",
    "وَنَجَّیْنٰهُ وَلُوْطًا اِلَی الْاَرْضِ الَّتِیْ بٰرَكْنَا فِیْهَا لِلْعٰلَمِیْنَ",
    "وَوَهَبْنَا لَهٗۤ اِسْحٰقَ وَیَعْقُوْبَ نَافِلَةً وَكُلًّا جَعَلْنَا صٰلِحِیْنَ",
    "وَجَعَلْنٰهُمْ اَىِٕمَّةً یَّهْدُوْنَ بِاَمْرِنَا وَاَوْحَیْنَاۤ اِلَیْهِمْ فِعْلَ الْخَیْرٰتِ وَاِقَامَ الصَّلٰوةِ وَاِیْتَآءَ الزَّكٰوةِ وَكَانُوْا لَنَا عٰبِدِیْنَ",
    "وَلُوْطًا اٰتَیْنٰهُ حُكْمًا وَّعِلْمًا وَّنَجَّیْنٰهُ مِنَ الْقَرْیَةِ الَّتِیْ كَانَتْ تَّعْمَلُ الْخَبٰٓىِٕثَ اِنَّهُمْ كَانُوْا قَوْمَ سَوْءٍ فٰسِقِیْنَ",
    "وَاَدْخَلْنٰهُ فِیْ رَحْمَتِنَا اِنَّهٗ مِنَ الصّٰلِحِیْنَ",
    "وَنُوْحًا اِذْ نَادٰی مِنْ قَبْلُ فَاسْتَجَبْنَا لَهٗ فَنَجَّیْنٰهُ وَاَهْلَهٗ مِنَ الْكَرْبِ الْعَظِیْمِ",
    "وَنَصَرْنٰهُ مِنَ الْقَوْمِ الَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا اِنَّهُمْ كَانُوْا قَوْمَ سَوْءٍ فَاَغْرَقْنٰهُمْ اَجْمَعِیْنَ",
    "وَدَاوٗدَ وَسُلَیْمٰنَ اِذْ یَحْكُمٰنِ فِی الْحَرْثِ اِذْ نَفَشَتْ فِیْهِ غَنَمُ الْقَوْمِ وَكُنَّا لِحُكْمِهِمْ شٰهِدِیْنَ",
    "فَفَهَّمْنٰهَا سُلَیْمٰنَ وَكُلًّا اٰتَیْنَا حُكْمًا وَّعِلْمًا وَّسَخَّرْنَا مَعَ دَاوٗدَ الْجِبَالَ یُسَبِّحْنَ وَالطَّیْرَ وَكُنَّا فٰعِلِیْنَ",
    "وَعَلَّمْنٰهُ صَنْعَةَ لَبُوْسٍ لَّكُمْ لِتُحْصِنَكُمْ مِّنْ بَاْسِكُمْ فَهَلْ اَنْتُمْ شٰكِرُوْنَ",
    "وَلِسُلَیْمٰنَ الرِّیْحَ عَاصِفَةً تَجْرِیْ بِاَمْرِهٖۤ اِلَی الْاَرْضِ الَّتِیْ بٰرَكْنَا فِیْهَا وَكُنَّا بِكُلِّ شَیْءٍ عٰلِمِیْنَ",
    "وَمِنَ الشَّیٰطِیْنِ مَنْ یَّغُوْصُوْنَ لَهٗ وَیَعْمَلُوْنَ عَمَلًا دُوْنَ ذٰلِكَ وَكُنَّا لَهُمْ حٰفِظِیْنَ",
    "وَاَیُّوْبَ اِذْ نَادٰی رَبَّهٗۤ اَنِّیْ مَسَّنِیَ الضُّرُّ وَاَنْتَ اَرْحَمُ الرّٰحِمِیْنَ ۖ",
    "فَاسْتَجَبْنَا لَهٗ فَكَشَفْنَا مَا بِهٖ مِنْ ضُرٍّ وَّاٰتَیْنٰهُ اَهْلَهٗ وَمِثْلَهُمْ مَّعَهُمْ رَحْمَةً مِّنْ عِنْدِنَا وَذِكْرٰی لِلْعٰبِدِیْنَ",
    "وَاِسْمٰعِیْلَ وَاِدْرِیْسَ وَذَا الْكِفْلِ كُلٌّ مِّنَ الصّٰبِرِیْنَ",
    "وَاَدْخَلْنٰهُمْ فِیْ رَحْمَتِنَا اِنَّهُمْ مِّنَ الصّٰلِحِیْنَ",
    "وَذَا النُّوْنِ اِذْ ذَّهَبَ مُغَاضِبًا فَظَنَّ اَنْ لَّنْ نَّقْدِرَ عَلَیْهِ فَنَادٰی فِی الظُّلُمٰتِ اَنْ لَّاۤ اِلٰهَ اِلَّاۤ اَنْتَ سُبْحٰنَكَ ۖ اِنِّیْ كُنْتُ مِنَ الظّٰلِمِیْنَ ۖ",
    "فَاسْتَجَبْنَا لَهٗ وَنَجَّیْنٰهُ مِنَ الْغَمِّ وَكَذٰلِكَ نُـجِی الْمُؤْمِنِیْنَ",
    "وَزَكَرِیَّاۤ اِذْ نَادٰی رَبَّهٗ رَبِّ لَا تَذَرْنِیْ فَرْدًا وَّاَنْتَ خَیْرُ الْوٰرِثِیْنَ ۖ",
    "فَاسْتَجَبْنَا لَهٗ وَوَهَبْنَا لَهٗ یَحْیٰی وَاَصْلَحْنَا لَهٗ زَوْجَهٗ اِنَّهُمْ كَانُوْا یُسٰرِعُوْنَ فِی الْخَیْرٰتِ وَیَدْعُوْنَنَا رَغَبًا وَّرَهَبًا وَكَانُوْا لَنَا خٰشِعِیْنَ",
    "وَالَّتِیْۤ اَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِیْهَا مِنْ رُّوْحِنَا وَجَعَلْنٰهَا وَابْنَهَاۤ اٰیَةً لِّلْعٰلَمِیْنَ",
    "اِنَّ هٰذِهٖۤ اُمَّتُكُمْ اُمَّةً وَّاحِدَةً ۖ وَّاَنَا رَبُّكُمْ فَاعْبُدُوْنِ",
    "وَتَقَطَّعُوْۤا اَمْرَهُمْ بَیْنَهُمْ كُلٌّ اِلَیْنَا رٰجِعُوْنَ",
    "فَمَنْ یَّعْمَلْ مِنَ الصّٰلِحٰتِ وَهُوَ مُؤْمِنٌ فَلَا كُفْرَانَ لِسَعْیِهٖ وَاِنَّا لَهٗ كٰتِبُوْنَ",
    "وَحَرٰمٌ عَلٰی قَرْیَةٍ اَهْلَكْنٰهَاۤ اَنَّهُمْ لَا یَرْجِعُوْنَ",
    "حَتّٰۤی اِذَا فُتِحَتْ یَاْجُوْجُ وَمَاْجُوْجُ وَهُمْ مِّنْ كُلِّ حَدَبٍ یَّنْسِلُوْنَ",
    "وَاقْتَرَبَ الْوَعْدُ الْحَقُّ فَاِذَا هِیَ شَاخِصَةٌ اَبْصَارُ الَّذِیْنَ كَفَرُوْا یٰوَیْلَنَا قَدْ كُنَّا فِیْ غَفْلَةٍ مِّنْ هٰذَا بَلْ كُنَّا ظٰلِمِیْنَ",
    "اِنَّكُمْ وَمَا تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ حَصَبُ جَهَنَّمَ اَنْتُمْ لَهَا وٰرِدُوْنَ",
    "لَوْ كَانَ هٰۤؤُلَآءِ اٰلِهَةً مَّا وَرَدُوْهَا وَكُلٌّ فِیْهَا خٰلِدُوْنَ",
    "لَهُمْ فِیْهَا زَفِیْرٌ وَّهُمْ فِیْهَا لَا یَسْمَعُوْنَ",
    "اِنَّ الَّذِیْنَ سَبَقَتْ لَهُمْ مِّنَّا الْحُسْنٰۤی اُولٰٓىِٕكَ عَنْهَا مُبْعَدُوْنَ",
    "لَا یَسْمَعُوْنَ حَسِیْسَهَا وَهُمْ فِیْ مَا اشْتَهَتْ اَنْفُسُهُمْ خٰلِدُوْنَ",
    "لَا یَحْزُنُهُمُ الْفَزَعُ الْاَكْبَرُ وَتَتَلَقّٰىهُمُ الْمَلٰٓىِٕكَةُ هٰذَا یَوْمُكُمُ الَّذِیْ كُنْتُمْ تُوْعَدُوْنَ",
    "یَوْمَ نَطْوِی السَّمَآءَ كَطَیِّ السِّجِلِّ لِلْكُتُبِ كَمَا بَدَاْنَاۤ اَوَّلَ خَلْقٍ نُّعِیْدُهٗ وَعْدًا عَلَیْنَا اِنَّا كُنَّا فٰعِلِیْنَ",
    "وَلَقَدْ كَتَبْنَا فِی الزَّبُوْرِ مِنْ بَعْدِ الذِّكْرِ اَنَّ الْاَرْضَ یَرِثُهَا عِبَادِیَ الصّٰلِحُوْنَ",
    "اِنَّ فِیْ هٰذَا لَبَلٰغًا لِّقَوْمٍ عٰبِدِیْنَ",
    "وَمَاۤ اَرْسَلْنٰكَ اِلَّا رَحْمَةً لِّلْعٰلَمِیْنَ",
    "قُلْ اِنَّمَا یُوْحٰۤی اِلَیَّ اَنَّمَاۤ اِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ فَهَلْ اَنْتُمْ مُّسْلِمُوْنَ",
    "فَاِنْ تَوَلَّوْا فَقُلْ اٰذَنْتُكُمْ عَلٰی سَوَآءٍ وَاِنْ اَدْرِیْۤ اَقَرِیْبٌ اَمْ بَعِیْدٌ مَّا تُوْعَدُوْنَ",
    "اِنَّهٗ یَعْلَمُ الْجَهْرَ مِنَ الْقَوْلِ وَیَعْلَمُ مَا تَكْتُمُوْنَ",
    "وَاِنْ اَدْرِیْ لَعَلَّهٗ فِتْنَةٌ لَّكُمْ وَمَتَاعٌ اِلٰی حِیْنٍ",
    "قٰلَ رَبِّ احْكُمْ بِالْحَقِّ وَرَبُّنَا الرَّحْمٰنُ الْمُسْتَعَانُ عَلٰی مَا تَصِفُوْنَ"
  ],
  "bengali": [
    "মানুষের হিসাব-নিকাশের সময় আসন্ন, অথচ তারা উদাসীনতায় মুখ ফিরিয়ে রয়েছে।",
    "যখনই তাদের রবের পক্ষ থেকে তাদের নিকট কোন নতুন উপদেশ আসে তখন তারা তা কৌতুকভরে শ্রবণ করে।",
    "তাদের অন্তর থাকে অমনোযোগী এবং যালিমরা গোপনে পরামর্শ করে, ‘এ তো তোমাদের মতই একজন মানুষ। এরপরও কি তোমরা দেখে শুনে যাদুর কবলে পড়বে’?",
    "সে (রাসূল) বলল, ‘আমার রব আসমান ও যমীনের সমস্ত কথাই জানেন এবং তিনিই সর্বশ্রোতা, সর্বজ্ঞ’।",
    "বরং তারা বলে, ‘এগুলো অলীক কল্পনা, হয় সে এটি মন থেকে বানিয়েছে নয়তো সে একজন কবি। অতএব সে আমাদের কাছে এমন নিদর্শন নিয়ে আসুক যেরূপ নিদর্শনসহ প্রেরিত হয়েছিল পূর্ববর্তীগণ’।",
    "তাদের পূর্বে যে জনপদ ঈমান আনেনি তাদেরকে আমি ধ্বংস করেছি । তবে কি এরা ঈমান আনবে?",
    "আর তোমার পূর্বে আমি পুরুষই পাঠিয়েছিলাম, যাদের প্রতি আমি ওহী পাঠাতাম। সুতরাং তোমরা জ্ঞানীদেরকে জিজ্ঞাসা কর যদি তোমরা না জান।",
    "আর আমি তাদেরকে এমন দেহবিশিষ্ট করিনি যে, তারা খাদ্য গ্রহণ করত না, আর তারা স্থায়ীও ছিল না।",
    "অতঃপর আমি তাদের প্রতি কৃত ওয়াদা পূর্ণ করলাম। আর আমি তাদেরকে ও যাদেরকে ইচ্ছা করি রক্ষা করলাম এবং সীমালঙ্ঘনকারীদেরকে ধ্বংস করে দিলাম।",
    "নিশ্চয় আমি তোমাদের প্রতি এক কিতাব নাযিল করেছি, যাতে তোমাদের জন্য উপদেশ* রয়েছে, তবুও কি তোমরা বুঝবে না? \n* এ আয়াতে যিকর শব্দটি দু’টি অর্থে ব্যবহৃত হতে পারেঃ একটি উপদেশ আর অপরটি সম্মান ও মর্যাদা। অর্থাৎ যে এ কুরআন শিক্ষা করে এবং তদনুযায়ী জীবন পরিচালনা করে সেই মর্যাদা ও সম্মানের অধিকারী হবে।",
    "আমি কত জনবসতিকে ধ্বংস করেছি যারা ছিল যালিম এবং তাদের পর অন্য জাতি সৃষ্টি করেছি।",
    "অতঃপর তারা যখন আমার আযাব দেখল তখনই তারা জনপদ ছেড়ে পালাতে লাগল।",
    "(তাদেরকে বলা হল) ‘পলায়ন করো না, বরং তোমাদের ভোগ-বিলাসিতায় এবং ঘরবাড়িতে ফিরে যাও, যেন তোমাদেরকে জিজ্ঞাসা করা হয়’।",
    "তারা বলল, ‘হায় আমাদের দুর্ভোগ! আমরা তো অবশ্যই যালিম ছিলাম।’",
    "অতঃপর তাদের এই বিলাপ চলতে থাকে আমি তাদেরকে কেটে ফেলা শস্য ও নিভে যাওয়া আগুন সদৃশ না করা পর্যন্ত।",
    "আসমান-যমীন ও তাদের মাঝখানে যা কিছু আছে তার কোন কিছুই আমি খেলাচ্ছলে সৃষ্টি করিনি।",
    "আমি যদি খেলার উপকরণ গ্রহণ করতে চাইতাম, তবে আমার কাছে যা আছে তা দিয়েই করতাম। কিন্তু আমি তা করিনি।",
    "বরং আমি মিথ্যার উপর সত্য নিক্ষেপ করি; ফলে তা মিথ্যাকে চূর্ণ-বিচূর্ণ করে দেয় এবং নিমিষেই তা বিলুপ্ত হয়। আর তোমাদের জন্য রয়েছে দুর্ভোগ তোমরা যা বলছ তার জন্য ।",
    "আর আসমান-যমীনে যারা আছে তারা সবাই তাঁর; আর তাঁর কাছে যারা আছে তারা অহঙ্কারবশতঃ তাঁর ইবাদাত হতে বিমুখ হয় না এবং ক্লান্তিও বোধ করে না।",
    "তারা দিন-রাত তাঁর তাসবীহ পাঠ করে, তারা শিথিলতা দেখায় না।",
    "তারা যেসব মাটির দেবতা গ্রহণ করেছে, সেগুলি কি মৃতকে জীবিত করতে সক্ষম?",
    "যদি আসমান ও যমীনে আল্লাহ ছাড়া বহু ইলাহ থাকত তবে উভয়ই ধ্বংস হয়ে যেত, সুতরাং তারা যা বলে, আরশের রব আল্লাহ তা থেকে পবিত্র।",
    "তিনি যা করেন সে ব্যাপারে তাকে প্রশ্ন করা যাবে না; বরং তাদেরকেই প্রশ্ন করা হবে।",
    "তারা কি তাঁকে ছাড়া অনেক ইলাহ গ্রহণ করেছে? বল, ‘তোমাদের প্রমাণ নিয়ে আস। আমার সাথে যারা আছে এটি তাদের জন্য উপদেশ এবং আমার পূর্বে যারা ছিল তাদের জন্যও এটাই ছিল উপদেশ।’ কিন্তু তাদের বেশীরভাগই প্রকৃত সত্যকে জানে না; তাই তারা মুখ ফিরিয়ে নেয়।",
    "আর তোমার পূর্বে এমন কোন রাসূল আমি পাঠাইনি যার প্রতি আমি এই ওহী নাযিল করিনি যে, ‘আমি ছাড়া কোন (সত্য) ইলাহ নেই; সুতরাং তোমরা আমার ইবাদাত কর।’",
    "আর তারা বলে, ‘পরম করুণাময় সন্তান গ্রহণ করেছেন।’ তিনি পবিত্র। বরং তারা* সম্মানিত বান্দা। \n* বনূ খুযা‘আ দাবী করত, ফেরেশতারা আল্লাহর কন্যা। এ ভুল ধারণা দূর করতে আল্লাহ বলেন, ফেরেশতারা আল্লাহর সন্তান নয়; বরং তারা সম্মানিত বান্দা। আল-কাশ্শাফ",
    "তারা তাঁর আগ বাড়িয়ে কোন কথা বলে না, তাঁর নির্দেশেই তো তারা কাজ করে।",
    "তাদের সামনে ও পেছনে যা কিছু আছে সবই তিনি জানেন। আর তারা শুধু তাদের জন্যই সুপারিশ করে যাদের প্রতি তিনি সন্তুষ্ট। তারা তাঁর ভয়ে ভীত।* \n* ফেরেশতারা আল্লাহর ভয়ে সর্বদা ভীত থাকে।",
    "আর তাদের মধ্যে যে-ই বলবে, ‘তিনি ছাড়া আমি ইলাহ’, তাকেই আমি প্রতিদান হিসেবে জাহান্নাম দেব; এভাবেই আমি যালিমদের আযাব দিয়ে থাকি।",
    "যারা কুফরী করে তারা কি ভেবে দেখে না যে, আসমানসমূহ ও যমীন ওতপ্রোতভাবে মিশে ছিল*, অতঃপর আমি উভয়কে পৃথক করে দিলাম, আর আমি সকল প্রাণবান জিনিসকে পানি থেকে সৃষ্টি করলাম। তবুও কি তারা ঈমান আনবে না? \n* আধুনিক জ্যোতির্বিজ্ঞানীদের মতে আদিতে আকাশ, সূর্য, নক্ষত্র ও পৃথিবী ইত্যাদি পৃথক সত্তায় ছিল না; বরং সবকিছুই ওতপ্রোতভাবে মিশে ছিল। তখন মহাবিশ্ব ছিল অসংখ্য গ্যাসীয় কণার সমষ্টি। পরবর্তীকালে মহাবিস্ফোরণের মাধ্যমে নক্ষত্র, সূর্য, পৃথিবী ও গ্রহসমূহ সৃষ্টি হয়। এটিই বিগ ব্যাং বা মহাবিস্ফোরণ থিওরী।",
    "আর আমি যমীনে সৃষ্টি করেছি সুদৃঢ় পর্বত, যেন তা পর্বতসমূহ নিয়ে একদিকে হেলে না পড়ে*, আর আমি তাতে তৈরী করেছি প্রশস্ত রাস্তা, যেন তারা চলতে পারে। \n* আধুনিক ভূ-তত্ত্ববিদগণ বলেন, পৃথিবীর অভ্যন্তরস্থ উত্তপ্ত গলিত পদার্থের তাপ ছড়ানোর কারণে পৃথিবীর পৃষ্ঠদেশ সঙ্কুচিত হয়ে তাতে ভাঁজ সৃষ্টি হয় এবং তার উপরের অংশই হল পর্বত। পর্বতমালা পৃথিবী-পৃষ্ঠের ভারসাম্য রক্ষা করে।",
    "আর আমি আসমানকে করেছি সুরক্ষিত ছাদ; কিন্তু তারা তার নিদর্শনাবলী হতে মুখ ফিরিয়ে নেয়।",
    "আর তিনিই রাত ও দিন এবং সূর্য ও চাঁদ সৃষ্টি করেছেন; সবাই নিজ নিজ কক্ষপথে বিচরণ করে।",
    "আর তোমার পূর্বে কোন মানুষকে আমি স্থায়ী জীবন দান করিনি; সুতরাং তোমার মৃত্যু হলে তারা কি অনন্ত জীবনসম্পন্ন হয়ে থাকবে ?",
    "প্রতিটি প্রাণ মৃত্যুর স্বাদ গ্রহণ করবে; আর ভাল ও মন্দ দ্বারা আমি তোমাদেরকে পরীক্ষা করে থাকি এবং আমার কাছেই তোমাদেরকে ফিরে আসতে হবে।",
    "আর যারা কুফরী করে তারা যখন তোমাকে দেখে তখন তোমাকে কেবল উপহাসের পাত্র হিসেবে গ্রহণ করে। তারা বলে, ‘এ কি সেই ব্যক্তি, যে তোমাদের দেবতাদের সমালোচনা করে?’ অথচ তারাই ‘রহমান’-এর আলোচনার বিরোধিতা করে। \n* রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাফিরদের দেবতাদের অস্বীকার করতেন বলে তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সমালোচনা করত। আবার তাঁরাই একমাত্র ইলাহ আল্লাহর গুণবাচক নাম ‘রহমান’ শব্দটি শুনতেই চাইতো না। এটি চূড়ান্ত পর্যায়ের অজ্ঞতা ও স্ববিরোধিতা। আল-কুরতুবী।",
    "মানুষকে সৃষ্টি করা হয়েছে তাড়াহুড়ার প্রবণতা দিয়ে। অচিরেই আমি তোমাদেরকে দেখাব আমার নিদর্শনাবলী। সুতরাং তোমরা তাড়াহুড়া করো না।",
    "আর তারা বলে, ‘তোমরা যদি সত্যবাদী হও তবে বল, এ ওয়াদা কখন পূর্ণ হবে?’",
    "হায়, কাফিররা যদি সে সময়ের কথা জানত, যখন তারা তাদের সামনে ও পেছন থেকে আগুন ফিরাতে পারবে না। আর তাদেরকে সাহায্যও করা হবে না;",
    "বরং অকস্মাৎ তাদের উপর তা এসে পড়বে। অতঃপর তাদেরকে হতবাক করে দেবে। ফলে তারা তা ফিরাতে সক্ষম হবে না এবং তাদেরকে অবকাশও দেয়া হবে না।",
    "আর তোমার পূর্বেও অনেক রাসূলকে ঠাট্টা-বিদ্রূপ করা হয়েছিল; পরিণামে তারা যা নিয়ে ঠাট্টা করত তাই বিদ্রূপকারীদেরকে ঘিরে ফেলেছিল।* \n* রাসূলগণ আযাব আসার ভয় দেখালে কাফিররা ঠাট্টা-বিদ্রূপ করত। পরিশেষে তাদের ঠাট্টার বস্ত্ত অর্থাৎ আযাব এসে তাদেরকে ঘিরে ফেলত এবং সে আযাবই তাদেরকে গ্রাস করত।",
    "বল, ‘রাতে এবং দিনে পরম করুণাময় থেকে কে তোমাদেরকে রক্ষা করবে?’ তবুও তারা তাদের রবের স্মরণ হতে মুখ ফিরিয়ে নেয়।",
    "আমি ছাড়া তাদের কি এমন কোন দেব-দেবী আছে যারা তাদেরকে রক্ষা করতে পারে? তারা তো নিজদেরকেই সাহায্য করতে সক্ষম নয় এবং আমার বিরুদ্ধে তারা কোন সঙ্গীও পাবে না।* \n* يصحبون এর অর্থ-তারা সঙ্গী পাবে না। ইবন আববাস (রাঃ) বলেন, এখানে এর অর্থ হল يجارون অর্থাৎ আল্লাহর শাস্তি হতে মুক্তি পেতে তাদেরকে সাহায্য করবে এমন কাউকে তারা পাবে না।",
    "বরং আমিই তাদেরকে ও তাদের পূর্বপুরুষদেরকে উপভোগ করতে দিয়েছিলাম; উপরন্তু তাদের হায়াতও দীর্ঘ হয়েছিল। তারা কি দেখে না যে, আমি চতুর্দিক থেকে তাঁদের দেশকে সঙ্কুচিত করে দিচ্ছি? তবুও কি তারা জয়ী হবে?",
    "বল, ‘আমি তো কেবল ওহী দ্বারাই তোমাদেরকে সতর্ক করি’। কিন্তু যারা বধির তাদেরকে যখন সতর্ক করা হয়, তখন তারা সে আহবান শোনে না।",
    "আর তোমার রবের আযাবের সামান্য কিছুও যদি তাদেরকে স্পর্শ করে, তবে তারা অবশ্যই বলে উঠবে-‘হায়, দুর্ভোগ আমাদের! আমরাতো অবশ্যই যালিম ছিলাম’।",
    "আর কিয়ামতের দিন আমি ন্যায়বিচারের মানদন্ড স্থাপন করব। সুতরাং কারো প্রতি কোন অবিচার করা হবে না। কারো কর্ম যদি সরিষার দানা পরিমাণও হয়, আমি তা হাযির করব। আর হিসাব গ্রহণকারীরূপে আমিই যথেষ্ট।",
    "আর আমি তো মূসা ও হারূনকে সত্য-মিথ্যার পার্থক্যকারী দিয়েছিলাম এবং মুত্তাকীদের জন্য দিয়েছিলাম জ্যোতি ও উপদেশ।",
    "যারা না দেখেও তাদের রবকে ভয় করে এবং কিয়ামত সম্পর্কে থাকে ভীত-সন্ত্রস্ত।",
    "আর এটা বরকতময় উপদেশ, যা আমি নাযিল করেছি। তবুও কি তোমরা তা অস্বীকার করবে?",
    "আর আমি তো ইতঃপূর্বে ইবরাহীমকে সঠিক পথের জ্ঞান দিয়েছিলাম এবং আমি তার সম্পর্কে ছিলাম সম্যক অবগত।",
    "যখন সে তার পিতা ও তার কওমকে বলল, ‘এ মূর্তিগুলো কী, যেগুলোর পূজায় তোমরা রত রয়েছ’?",
    "তারা বলল, ‘আমরা আমাদের পূর্বপুরুষদেরকে এদের পূজা করতে দেখেছি’।",
    "সে বলল, ‘তোমরা নিজেরা এবং তোমাদের পূর্বপুরুষরা সবাই রয়েছ স্পষ্ট বিভ্রান্তিতে’।",
    "তারা বলল, ‘তুমি কি আমাদের নিকট সত্য নিয়ে এসেছ, নাকি তুমি খেল-তামাশা করছ’?",
    "সে বলল, ‘না, বরং তোমাদের রব তো আসমানসমূহ ও যমীনের রব; যিনি এ সবকিছু সৃষ্টি করেছেন। আর এ বিষয়ে আমি অন্যতম সাক্ষী’।",
    "‘আর আল্লাহর কসম, তোমরা চলে যাওয়ার পর আমি তোমাদের মূর্তিগুলোর ব্যাপারে অবশ্যই কৌশল অবলম্বন করব’।",
    "অতঃপর সে মূর্তিগুলোকে চূর্ণ-বিচূর্ণ করে দিল তাদের বড়টি ছাড়া, যাতে তারা তাঁর দিকে ফিরে আসে।",
    "তারা বলল, ‘আমাদের দেবদেবীগুলোর সাথে কে এমনটি করল? নিশ্চয় সে যালিম’।",
    "তাদের কেউ কেউ বলল, ‘আমরা শুনেছি এক যুবক এই মূর্তিগুলোর সমালোচনা করে। তাকে বলা হয় ইবরাহীম’।",
    "তারা বলল, ‘তাহলে তাকে লোকজনের সামনে নিয়ে এসো, যাতে তারা দেখতে পারে’।",
    "তারা বলল, ‘হে ইবরাহীম, তুমিই কি আমাদের দেবদেবীগুলোর সাথে এরূপ করেছ’?",
    "সে বলল, ‘বরং তাদের এ বড়টিই একাজ করেছে। তাই এদেরকেই জিজ্ঞাসা কর, যদি এরা কথা বলতে পারে’।",
    "তখন তারা নিজদের দিকে ফিরে গেল* এবং একে অন্যকে বলতে লাগল, ‘তোমরাই তো যালিম’। \n* এ বাক্যের অর্থ ‘তারা মনে মনে চিন্তা করল তারা বিবেক বুদ্ধি খাটাল’ ও হতে পারে।",
    "অতঃপর তাদের মাথা অবনত হয়ে গেল এবং বলল, ‘তুমি তো জানই যে, এরা কথা বলতে পারে না’।",
    "সে (ইবরাহীম) বলল, ‘তাহলে কি তোমরা আল্লাহর পরিবর্তে এমন কিছুর ইবাদাত কর, যা তোমাদের কোন উপকার করতে পারে না এবং কোন ক্ষতিও করতে পারে না’?",
    "‘ধিক তোমাদেরকে এবং আল্লাহর পরিবর্তে তোমরা যাদের ইবাদাত কর তাদেরকে! ‘তবুও কি তোমরা বুঝবে না’?",
    "তারা বলল, ‘তাকে আগুনে পুড়িয়ে দাও এবং তোমাদের দেবদেবীদেরকে সাহায্য কর, যদি তোমরা কিছু করতে চাও’।",
    "আমি বললাম, ‘হে আগুন, তুমি শীতল ও নিরাপদ হয়ে যাও ইবরাহীমের জন্য’ ।",
    "আর তারা তার বিরুদ্ধে চক্রান্ত করেছিল, কিন্তু আমি তাদেরকে সবচেয়ে বেশী ক্ষতিগ্রস্ত করে দিলাম।",
    "আর আমি তাকে ও লূতকে উদ্ধার করে সে দেশে নিয়ে গেলাম, যেখানে আমি বিশ্ববাসীর জন্য বরকত রেখেছি।",
    "আর আমি তাকে দান করেছিলাম ইসহাক ও ইয়াকূবকে অতিরিক্ত হিসেবে; আর তাদের প্রত্যেককেই আমি সৎকর্মশীল করেছিলাম।",
    "আর তাদেরকে আমি নেতা বানিয়েছিলাম, তারা আমার নির্দেশ অনুসারে মানুষকে সঠিক পথ দেখাত। আমি তাদের প্রতি সৎকাজ করার, সালাত কায়েম করার এবং যাকাত প্রদান করার জন্য ওহী প্রেরণ করেছিলাম। আর তারা আমারই ইবাদাত করত।",
    "আর লূতকে আমি প্রজ্ঞা ও জ্ঞান দান করেছিলাম। আমি তাকে এমন এক জনপদ থেকে উদ্ধার করেছিলাম, যার অধিবাসীরা অশ্লীল কাজে লিপ্ত ছিল। তারা ছিল এক মন্দ ও পাপাচারী কওম।",
    "আর আমি তাকে আমার রহমতের মধ্যে শামিল করে নিয়েছিলাম। সে ছিল সৎকর্মশীলদের অন্তর্ভুক্ত।",
    "আর স্মরণ কর নূহের কথা, ইতঃপূর্বে যখন সে আমাকে ডেকেছিল, তখন আমি তার ডাকে সাড়া দিয়েছিলাম। অতঃপর তাকে ও তার পরিবারবর্গকে আমি মহাবিপদ থেকে উদ্ধার করেছিলাম।",
    "আর আমি তাকে সেই সম্প্রদায়ের বিরুদ্ধে সাহায্য করেছিলাম, যারা আমার আয়াতসমূহকে অস্বীকার করেছিল। তারা ছিল এক মন্দ কওম। তাই আমি তাদের সকলকেই পানিতে ডুবিয়ে মেরেছিলাম।",
    "আর স্মরণ কর দাঊদ ও সুলায়মানের কথা, যখন তারা শস্যক্ষেত সম্পর্কে বিচার করছিল। যাতে রাতের বেলায় কোন কওমের মেষ ঢুকে পড়েছিল। আর আমি তাদের বিচার কাজ দেখছিলাম।",
    "অতঃপর আমি এ বিষয়ের ফয়সালা সুলায়মানকে বুঝিয়ে দিয়েছিলাম। আর আমি তাদের প্রত্যেককেই দিয়েছিলাম প্রজ্ঞা ও জ্ঞান। আর আমি পর্বতমালা ও পাখীদেরকে দাঊদের অধীন করে দিয়েছিলাম, তারা দাঊদের সাথে আমার তাসবীহ পাঠ করত। আর এসবকিছু আমিই করছিলাম।",
    "আর আমিই তাকে তোমাদের জন্য বর্ম বানানো শিক্ষা দিয়েছিলাম। যাতে তা যুদ্ধে তোমাদেরকে রক্ষা করতে পারে। সুতরাং তোমরা কি কৃতজ্ঞ হবে?",
    "আর আমি সুলায়মানের জন্য অনুগত করে দিয়েছিলাম প্রবল হাওয়াকে, যা তার নির্দেশে প্রবাহিত হত সেই দেশের দিকে, যেখানে আমি বরকত রেখেছি। আর আমি প্রত্যেক বিষয় সম্পর্কেই অবগত ছিলাম।",
    "আর শয়তানদের মধ্যে কতক তার জন্য ডুবুরীর কাজ করত, এছাড়া অন্যান্য কাজও করত। আর আমিই তাদের জন্য হিফাযতকারী ছিলাম।",
    "আর স্মরণ কর আইউবের কথা, যখন সে তার রবকে আহবান করে বলেছিল, ‘আমি দুঃখ-কষ্টে পতিত হয়েছি। আর আপনি তো সর্বশ্রেষ্ঠ দয়ালু’।",
    "তখন আমি তার ডাকে সাড়া দিলাম। আর তার যত দুঃখ-কষ্ট ছিল তা দূর করে দিলাম এবং তার পরিবার-পরিজন তাকে দিয়ে দিলাম। আর তাদের সাথে তাদের মত আরো দিলাম আমার পক্ষ থেকে রহমত এবং ইবাদাতকারীদের জন্য উপদেশস্বরূপ।",
    "আর স্মরণ কর ইসমাঈল, ইদরীস ও যুল্ কিফল এর কথা, তাদের প্রত্যেকেই ধৈর্যশীল ছিল।",
    "আর তাদেরকে আমি আমার রহমতে শামিল করেছিলাম। তারা ছিল সৎকর্মপরায়ণ।",
    "আর স্মরণ কর যুন-নূন এর কথা, যখন সে রাগান্বিত অবস্থায় চলে গিয়েছিল এবং মনে করেছিল যে, আমি তার উপর ক্ষমতা প্রয়োগ করব না। তারপর সে অন্ধকার থেকে ডেকে বলেছিল, ‘আপনি ছাড়া কোন (সত্য) ইলাহ নেই’। আপনি পবিত্র মহান। নিশ্চয় আমি ছিলাম যালিম’ ।",
    "অতঃপর আমি তার ডাকে সাড়া দিয়েছিলাম এবং দুশ্চিন্তা থেকে তাকে উদ্ধার করেছিলাম। আর এভাবেই আমি মুমিনদেরকে উদ্ধার করে থাকি।",
    "আর স্মরণ কর যাকারিয়্যার কথা, যখন সে তার রবকে আহবান করে বলেছিল, ‘হে আমার রব! আমাকে একা রেখো না, তুমি তো শ্রেষ্ঠ মালিকানার অধিকারী’।",
    "অতঃপর আমি তার আহবানে সাড়া দিয়েছিলাম এবং তাকে দান করেছিলাম ইয়াহইয়া। আর তার জন্য তার স্ত্রীকে উপযোগী করেছিলাম। তারা সৎকাজে প্রতিযোগিতা করত। আর আমাকে আশা ও ভীতি সহকারে ডাকত। আর তারা ছিল আমার নিকট বিনয়ী।",
    "আর স্মরণ কর সে নারীর কথা, যে নিজ সতীত্ব রক্ষা করেছিল। অতঃপর আমি তার মধ্যে আমার ‘রূহ’ ফুঁকে দিয়েছিলাম এবং তাকে ও তার পুত্রকে বিশ্ববাসীর জন্য করেছিলাম এক নিদর্শন ।",
    "নিশ্চয় তোমাদের এ জাতি তো একই জাতি। আর আমিই তোমাদের রব। অতএব তোমরা আমার ইবাদাত কর।",
    "কিন্তু তারা নিজদের কার্যকলাপে পরস্পরের মধ্যে বিভেদ সৃষ্টি করেছে। সকলেই আমার নিকট প্রত্যাবর্তন করবে।",
    "সুতরাং যে মুমিন অবস্থায় সৎকাজ করে তার প্রচেষ্টাকে অস্বীকার করা হবে না। আর আমি তো তা লিখে রাখি।",
    "আর আমি যে জনপদকে ধ্বংস করেছি তার সম্পর্কে নিষেধাজ্ঞা রয়েছে যে, তার অধিবাসীবৃন্দ আর ফিরে আসবে না।",
    "অবশেষে যখন ইয়া’জূজ ও মা’জূজকে মুক্তি দেয়া হবে, আর তারা প্রতিটি উঁচু ভূমি হতে ছুটে আসবে।",
    "আর সত্য ওয়াদার সময় নিকটে আসলে হঠাৎ কাফিরদের চক্ষু স্থির হয়ে যাবে। তারা বলবে, ‘হায়, আমাদের দুর্ভোগ! আমরা তো এ বিষয়ে উদাসীন ছিলাম বরং আমরা ছিলাম যালিম’ ।",
    "নিশ্চয় তোমরা এবং আল্লাহ ছাড়া তোমরা যাদের পূজা কর, সেগুলো তো জাহান্নামের জ্বালানী। তোমরা সেখানে প্রবেশ করবে।",
    "যদি তারা ইলাহ হত তবে তারা জাহান্নামে প্রবেশ করত না। আর তারা সবাই তাতে স্থায়ী হয়ে থাকবে।",
    "সেখানে থাকবে তাদের আর্তনাদ, আর সেখানে তারা শুনতে পাবে না।",
    "আমার পক্ষ থেকে যাদের জন্য পূর্বেই কল্যাণ নির্ধারিত রয়েছে তাদেরকে তা থেকে দূরে রাখা হবে।",
    "তারা জাহান্নামের ক্ষীণতম শব্দও শুনতে পাবে না। সেখানে তারা তাদের মনঃপুত বস্তুর মধ্যে চিরকাল থাকবে।",
    "মহাভীতি তাদেরকে পেরেশান করবে না। আর ফেরেশতারা তাদেরকে অভ্যর্থনা জানিয়ে বলবে, ‘এটাই তোমাদের সেই দিন, যার ওয়াদা তোমাদেরকে দেয়া হয়েছিল’।",
    "সে দিন আমি আসমানসমূহকে গুটিয়ে নেব, যেভাবে গুটিয়ে রাখা হয় লিখিত দলীল-পত্রাদি। যেভাবে আমি প্রথম সৃষ্টির সূচনা করেছিলাম সেভাবেই পুনরায় সৃষ্টি করব। ওয়াদা পালন করা আমার কর্তব্য। আমি তা পালন করবই।",
    "আর উপদেশ দেয়ার পর আমি কিতাবে লিখে দিয়েছি যে, ‘আমার যোগ্যতর বান্দাগণই পৃথিবীর উত্তরাধিকারী হবে’।",
    "নিশ্চয় এতে ইবাদাতকারী সম্প্রদায়ের জন্য উপদেশ বাণী রয়েছে।",
    "আর আমি তো তোমাকে বিশ্ববাসীর জন্য রহমত হিসেবেই প্রেরণ করেছি।",
    "বল, ‘আমার প্রতি ওহী প্রেরণ করা হয় যে, তোমাদের ইলাহ একক ইলাহ। সুতরাং তোমরা কি আত্মসমর্পণকারী হবে’?",
    "তবে তারা মুখ ফিরিয়ে নিলে তুমি বলে দিও, ‘আমি যথাযথভাবে তোমাদেরকে জানিয়ে দিয়েছি। আর আমি জানি না তোমাদেরকে যে বিষয়ের ওয়াদা দেয়া হয়েছে তা কি নিকটবর্তী না দূরবর্তী’।",
    "তিনি প্রকাশ্য কথা সম্পর্কেও জানেন এবং তোমরা যা গোপন কর তাও জানেন।",
    "আর আমি জানি না হয়তো তা তোমাদের জন্য এক পরীক্ষা কিছু কালের জন্য উপভোগের সুযোগ।",
    "রাসূল বলেছিল, ‘হে আমার রব, আপনি ন্যায়সঙ্গতভাবে ফয়সালা করে দিন’। আর আমাদের রব তো পরম করুণাময়। তোমরা যা বলছ সে বিষয়ে তিনিই একমাত্র সহায়স্থল।"
  ]
}