{
  "surahName": "Al-Kahf",
  "surahNameArabic": "الكهف",
  "surahNameArabicLong": "سورة الكهف",
  "surahNameTranslation": "The Cave",
  "revelationPlace": "Mecca",
  "totalAyah": 110,
  "surahNo": 18,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/18.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/018.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/18.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/018.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/18.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/018.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/18.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/018.mp3"
    }
  },
  "english": [
    "All praise is for Allah Who has revealed the Book to His servant, allowing no crookedness in it",
    "˹making it˺ perfectly upright, to warn ˹the disbelievers˺ of a severe torment from Him; to give good news to the believers—who do good—that they will have a fine reward",
    "in which they will remain forever;",
    "and to warn those who claim, “Allah has offspring.”",
    "They have no knowledge of this, nor did their forefathers. What a terrible claim that comes out of their mouths! They say nothing but lies.",
    "Now, perhaps you ˹O Prophet˺ will grieve yourself to death over their denial, if they ˹continue to˺ disbelieve in this message.",
    "We have indeed made whatever is on earth as an adornment for it, in order to test which of them is best in deeds.",
    "And We will certainly reduce whatever is on it to barren ground.",
    "Have you ˹O Prophet˺ thought that the people of the cave and the plaque were ˹the only˺ wonders of Our signs?",
    "˹Remember˺ when those youths took refuge in the cave, and said, “Our Lord! Grant us mercy from Yourself and guide us rightly through our ordeal.”",
    "So We caused them to fall into a dead sleep in the cave for many years",
    "then We raised them so We may show which of the two groups would make a better estimation of the length of their stay.",
    "We relate to you ˹O Prophet˺ their story in truth. They were youths who truly believed in their Lord, and We increased them in guidance.",
    "And We strengthened their hearts when they stood up and declared, “Our Lord is the Lord of the heavens and the earth. We will never call upon any god besides Him, or we would truly be uttering an outrageous lie.”",
    "˹Then they said to one another,˺ “These people of ours have taken gods besides Him. Why do they not produce a clear proof of them? Who then does more wrong than those who fabricate lies against Allah?",
    "Since you have distanced yourselves from them and what they worship besides Allah, take refuge in the cave. Your Lord will extend His mercy to you and accommodate you in your ordeal.”",
    "And you would have seen the sun, as it rose, inclining away from their cave to the right, and as it set, declining away from them to the left, while they lay in its open space. That is one of the signs of Allah. Whoever Allah guides is truly guided. But whoever He leaves to stray, you will never find for them a guiding mentor.",
    "And you would have thought they were awake, though they were asleep. We turned them over, to the right and left, while their dog stretched his forelegs at the entrance. Had you looked at them, you would have certainly fled away from them, filled with horror.",
    "And so We awakened them so that they might question one another. One of them exclaimed, “How long have you remained ˹asleep˺?” Some replied, “Perhaps a day, or part of a day.” They said ˹to one another˺, “Your Lord knows best how long you have remained. So send one of you with these silver coins of yours to the city, and let him find which food is the purest, and then bring you provisions from it. Let him be ˹exceptionally˺ cautious, and do not let him give you away.",
    "For, indeed, if they find out about you, they will stone you ˹to death˺, or force you back into their faith, and then you will never succeed.”",
    "That is how We caused them to be discovered so that their people might know that Allah’s promise ˹of resurrection˺ is true and that there is no doubt about the Hour. When the people disputed with each other about the case of the youth ˹after their death˺, some proposed, “Build a structure around them. Their Lord knows best about them.” Those who prevailed in the matter said, “We will surely build a place of worship over them.”",
    "Some will say, “They were three, their dog was the fourth,” while others will say, “They were five, their dog was the sixth,” ˹only˺ guessing blindly. And others will say, “They were seven and their dog was the eighth.” Say, ˹O Prophet,˺ “My Lord knows best their ˹exact˺ number. Only a few people know as well.” So do not argue about them except with sure knowledge, nor consult any of those ˹who debate˺ about them.",
    "And never say of anything, “I will definitely do this tomorrow,”",
    "without adding, “if Allah so wills!” But if you forget, then remember your Lord, and say, “I trust my Lord will guide me to what is more right than this.”",
    "They had remained in their cave for three hundred years, adding nine.",
    "Say, ˹O Prophet,˺ “Allah knows best how long they stayed. With Him ˹alone˺ is ˹the knowledge of˺ the unseen of the heavens and the earth. How perfectly He hears and sees! They have no guardian besides Him, and He shares His command with none.”",
    "Recite what has been revealed to you from the Book of your Lord. None can change His Words, nor can you find any refuge besides Him.",
    "And patiently stick with those who call upon their Lord morning and evening, seeking His pleasure. Do not let your eyes look beyond them, desiring the luxuries of this worldly life. And do not obey those whose hearts We have made heedless of Our remembrance, who follow ˹only˺ their desires and whose state is ˹total˺ loss.",
    "And say, ˹O Prophet,˺ “˹This is˺ the truth from your Lord. Whoever wills let them believe, and whoever wills let them disbelieve.” Surely We have prepared for the wrongdoers a Fire whose walls will ˹completely˺ surround them. When they cry for aid, they will be aided with water like molten metal, which will burn ˹their˺ faces. What a horrible drink! And what a terrible place to rest!",
    "As for those who believe and do good, We certainly never deny the reward of those who are best in deeds.",
    "It is they who will have the Gardens of Eternity, with rivers flowing under their feet. There they will be adorned with bracelets of gold, and wear green garments of fine silk and rich brocade, reclining there on ˹canopied˺ couches. What a marvellous reward! And what a fabulous place to rest!",
    "Give them ˹O Prophet˺ an example of two men. To ˹the disbelieving˺ one We gave two gardens of grapevines, which We surrounded with palm trees and placed ˹various˺ crops in between.",
    "Each garden yielded ˹all˺ its produce, never falling short. And We caused a river to flow between them.",
    "And he had other resources ˹as well˺. So he boasted to a ˹poor˺ companion of his, while conversing with him, “I am greater than you in wealth and superior in manpower.”",
    "And he entered his property, while wronging his soul, saying, “I do not think this will ever perish",
    "nor do I think the Hour will ˹ever˺ come. And if in fact I am returned to my Lord, I will definitely get a far better outcome than ˹all˺ this.”",
    "His ˹believing˺ companion replied, while conversing with him, “Do you disbelieve in the One Who created you from dust, then ˹developed you˺ from a sperm-drop, then formed you into a man?",
    "But as for me: He is Allah, my Lord, and I will never associate anyone with my Lord ˹in worship˺.",
    "If only you had said, upon entering your property, ‘This is what Allah has willed! There is no power except with Allah!’ Even though you see me inferior to you in wealth and offspring",
    "perhaps my Lord will grant me ˹something˺ better than your garden, and send down upon your garden a thunderbolt from the sky, turning it into a barren waste.",
    "Or its water may sink ˹into the earth˺, and then you will never be able to seek it out.”",
    "And so all his produce was ˹totally˺ ruined, so he started to wring his hands for all he had spent on it, while it had collapsed on its trellises. He cried, “Alas! I wish I had never associated anyone with my Lord ˹in worship˺!”",
    "And he had no manpower to help him against Allah, nor could he ˹even˺ help himself.",
    "At this time, support comes ˹only˺ from Allah—the True ˹Lord˺. He is best in reward and best in outcome.",
    "And give them a parable of this worldly life. ˹It is˺ like the plants of the earth, thriving when sustained by the rain We send down from the sky. Then they ˹soon˺ turn into chaff scattered by the wind. And Allah is fully capable of ˹doing˺ all things.",
    "Wealth and children are the adornment of this worldly life, but the everlasting good deeds are far better with your Lord in reward and in hope.",
    "˹Beware of˺ the Day We will blow the mountains away, and you will see the earth laid bare. And We will gather all ˹humankind˺, leaving none behind.",
    "They will be presented before your Lord in rows, ˹and the deniers will be told,˺ “You have surely returned to Us ˹all alone˺ as We created you the first time, although you ˹always˺ claimed that We would never appoint a time for your return.”",
    "And the record ˹of deeds˺ will be laid ˹open˺, and you will see the wicked in fear of what is ˹written˺ in it. They will cry, “Woe to us! What kind of record is this that does not leave any sin, small or large, unlisted?” They will find whatever they did present ˹before them˺. And your Lord will never wrong anyone.",
    "And ˹remember˺ when We said to the angels, “Prostrate before Adam,” so they all did—but not Iblîs, who was one of the jinn, but he rebelled against the command of his Lord. Would you then take him and his descendants as patrons instead of Me, although they are your enemy? What an evil alternative for the wrongdoers ˹to choose˺!",
    "I never called them to witness the creation of the heavens and the earth or ˹even˺ their own creation, nor would I take the misleaders as helpers.",
    "And ˹beware of˺ the Day He will say, “Call upon those you claimed were My associate-gods.” So they will call them, but will receive no response. And We will make them ˹all˺ share in the same doom.",
    "The wicked will see the Fire and realize that they are bound to fall into it, and will find no way to avoid it.",
    "We have surely set forth in this Quran every ˹kind of˺ lesson for people, but humankind is the most argumentative of all beings.",
    "And nothing prevents people from believing when guidance comes to them and from seeking their Lord’s forgiveness except ˹their demand˺ to meet the same fate of earlier deniers or that the torment would confront them face to face.",
    "We do not send the messengers except as deliverers of good news and warners. But the disbelievers argue in falsehood, ˹hoping˺ to discredit the truth with it, and make a mockery of My revelations and warnings.",
    "And who does more wrong than those who, when reminded of their Lord’s revelations, turn away from them and forget what their own hands have done? We have certainly cast veils over their hearts—leaving them unable to comprehend this ˹Quran˺—and deafness in their ears. And if you ˹O Prophet˺ invite them to ˹true˺ guidance, they will never be ˹rightly˺ guided.",
    "Your Lord is the All-Forgiving, Full of Mercy. If He were to seize them ˹immediately˺ for what they commit, He would have certainly hastened their punishment. But they have an appointed time, from which they will find no refuge.",
    "Those ˹are the˺ societies We destroyed when they persisted in wrong, and We had set a time for their destruction.",
    "And ˹remember˺ when Moses said to his young assistant, “I will never give up until I reach the junction of the two seas, even if I travel for ages.”",
    "But when they ˹finally˺ reached the point where the seas met, they forgot their ˹salted˺ fish, and it made its way into the sea, slipping away ˹wondrously˺.",
    "When they had passed further, he said to his assistant, “Bring us our meal! We have certainly been exhausted by today’s journey.”",
    "He replied, “Do you remember when we rested by the rock? ˹That is when˺ I forgot the fish. None made me forget to mention this except Satan. And the fish made its way into the sea miraculously.”",
    "Moses responded, “That is ˹exactly˺ what we were looking for.” So they returned, retracing their footsteps.",
    "There they found a servant of Ours, to whom We had granted mercy from Us and enlightened with knowledge of Our Own.",
    "Moses said to him, “May I follow you, provided that you teach me some of the right guidance you have been taught?”",
    "He said, “You certainly cannot be patient ˹enough˺ with me.",
    "And how can you be patient with what is beyond your ˹realm of˺ knowledge?”",
    "Moses assured ˹him˺, “You will find me patient, Allah willing, and I will not disobey any of your orders.”",
    "He responded, “Then if you follow me, do not question me about anything until I ˹myself˺ clarify it for you.”",
    "So they set out, but after they had boarded a ship, the man made a hole in it. Moses protested, “Have you done this to drown its people? You have certainly done a terrible thing!”",
    "He replied, “Did I not say that you cannot have patience with me?”",
    "Moses pleaded, “Excuse me for forgetting, and do not be hard on me.”",
    "So they proceeded until they came across a boy, and the man killed him. Moses protested, “Have you killed an innocent soul, who killed no one? You have certainly done a horrible thing.”",
    "He answered, “Did I not tell you that you cannot have patience with me?”",
    "Moses replied, “If I ever question you about anything after this, then do not keep me in your company, for by then I would have given you enough of an excuse.”",
    "So they moved on until they came to the people of a town. They asked them for food, but the people refused to give them hospitality. There they found a wall ready to collapse, so the man set it right. Moses protested, “If you wanted, you could have demanded a fee for this.”",
    "He replied, “This is the parting of our ways. I will explain to you what you could not bear patiently.",
    "“As for the ship, it belonged to some poor people, working at sea. So I intended to damage it, for there was a ˹tyrant˺ king ahead of them who seizes every ˹good˺ ship by force.",
    "“And as for the boy, his parents were ˹true˺ believers, and we feared that he would pressure them into defiance and disbelief.",
    "So we hoped that their Lord would give them another, more virtuous and caring in his place.",
    "“And as for the wall, it belonged to two orphan boys in the city, and under the wall was a treasure that belonged to them, and their father had been a righteous man. So your Lord willed that these children should come of age and retrieve their treasure, as a mercy from your Lord. I did not do it ˹all˺ on my own. This is the explanation of what you could not bear patiently.”",
    "They ask you ˹O Prophet˺ about Ⱬul-Qarnain. Say, “I will relate to you something of his narrative.”",
    "Surely We established him in the land, and gave him the means to all things.",
    "So he travelled a course",
    "until he reached the setting ˹point˺ of the sun, which appeared to him to be setting in a spring of murky water, where he found some people. We said, “O Ⱬul-Qarnain! Either punish them or treat them kindly.”",
    "He responded, “Whoever does wrong will be punished by us, then will be returned to their Lord, Who will punish them with a horrible torment.",
    "As for those who believe and do good, they will have the finest reward, and we will assign them easy commands.”",
    "Then he travelled a ˹different˺ course",
    "until he reached the rising ˹point˺ of the sun. He found it rising on a people for whom We had provided no shelter from it.",
    "So it was. And We truly had full knowledge of him.",
    "Then he travelled a ˹third˺ course",
    "until he reached ˹a pass˺ between two mountains. He found in front of them a people who could hardly understand ˹his˺ language.",
    "They pleaded, “O Ⱬul-Qarnain! Surely Gog and Magog are spreading corruption throughout the land. Should we pay you tribute, provided that you build a wall between us and them?”",
    "He responded, “What my Lord has provided for me is far better. But assist me with resources, and I will build a barrier between you and them.",
    "Bring me blocks of iron!” Then, when he had filled up ˹the gap˺ between the two mountains, he ordered, “Blow!” When the iron became red hot, he said, “Bring me molten copper to pour over it.”",
    "And so the enemies could neither scale nor tunnel through it.",
    "He declared, “This is a mercy from my Lord. But when the promise of my Lord comes to pass, He will level it to the ground. And my Lord’s promise is ever true.”",
    "On that Day, We will let them surge ˹like waves˺ over one another. Later, the Trumpet will be blown, and We will gather all ˹people˺ together.",
    "On that Day We will display Hell clearly for the disbelievers",
    "those who turned a blind eye to My Reminder and could not stand listening ˹to it˺.",
    "Do the disbelievers think they can ˹simply˺ take My servants as lords instead of Me? We have surely prepared Hell as an accommodation for the disbelievers.",
    "Say, ˹O Prophet,˺ “Shall we inform you of who will lose the most deeds?",
    "˹They are˺ those whose efforts are in vain in this worldly life, while they think they are doing good!”",
    "It is they who reject the signs of their Lord and their meeting with Him, rendering their deeds void, so We will not give their deeds any weight on Judgment Day.",
    "That is their reward: Hell, for their disbelief and mockery of My signs and messengers.",
    "Indeed, those who believe and do good will have the Gardens of Paradise as an accommodation",
    "where they will be forever, never desiring anywhere else.",
    "Say, ˹O Prophet,˺ “If the ocean were ink for ˹writing˺ the Words of my Lord, it would certainly run out before the Words of my Lord were finished, even if We refilled it with its equal.”",
    "Say, ˹O Prophet,˺ “I am only a man like you, ˹but˺ it has been revealed to me that your God is only One God. So whoever hopes for the meeting with their Lord, let them do good deeds and associate none in the worship of their Lord.”"
  ],
  "arabic1": [
    "اَلْحَمْدُ لِلّٰهِ الَّذِیْۤ اَنْزَلَ عَلٰی عَبْدِهِ الْكِتٰبَ وَلَمْ یَجْعَلْ لَّهٗ عِوَجًا ٚ",
    "قَیِّمًا لِّیُنْذِرَ بَاْسًا شَدِیْدًا مِّنْ لَّدُنْهُ وَیُبَشِّرَ الْمُؤْمِنِیْنَ الَّذِیْنَ یَعْمَلُوْنَ الصّٰلِحٰتِ اَنَّ لَهُمْ اَجْرًا حَسَنًا",
    "مَّاكِثِیْنَ فِیْهِ اَبَدًا",
    "وَّیُنْذِرَ الَّذِیْنَ قَالُوا اتَّخَذَ اللّٰهُ وَلَدًا ۗ",
    "مَا لَهُمْ بِهٖ مِنْ عِلْمٍ وَّلَا لِاٰبَآىِٕهِمْ كَبُرَتْ كَلِمَةً تَخْرُجُ مِنْ اَفْوَاهِهِمْ اِنْ یَّقُوْلُوْنَ اِلَّا كَذِبًا",
    "فَلَعَلَّكَ بَاخِعٌ نَّفْسَكَ عَلٰۤی اٰثَارِهِمْ اِنْ لَّمْ یُؤْمِنُوْا بِهٰذَا الْحَدِیْثِ اَسَفًا",
    "اِنَّا جَعَلْنَا مَا عَلَی الْاَرْضِ زِیْنَةً لَّهَا لِنَبْلُوَهُمْ اَیُّهُمْ اَحْسَنُ عَمَلًا",
    "وَاِنَّا لَجٰعِلُوْنَ مَا عَلَیْهَا صَعِیْدًا جُرُزًا",
    "اَمْ حَسِبْتَ اَنَّ اَصْحٰبَ الْكَهْفِ وَالرَّقِیْمِ كَانُوْا مِنْ اٰیٰتِنَا عَجَبًا",
    "اِذْ اَوَی الْفِتْیَةُ اِلَی الْكَهْفِ فَقَالُوْا رَبَّنَاۤ اٰتِنَا مِنْ لَّدُنْكَ رَحْمَةً وَّهَیِّئْ لَنَا مِنْ اَمْرِنَا رَشَدًا",
    "فَضَرَبْنَا عَلٰۤی اٰذَانِهِمْ فِی الْكَهْفِ سِنِیْنَ عَدَدًا",
    "ثُمَّ بَعَثْنٰهُمْ لِنَعْلَمَ اَیُّ الْحِزْبَیْنِ اَحْصٰی لِمَا لَبِثُوْۤا اَمَدًا",
    "نَحْنُ نَقُصُّ عَلَیْكَ نَبَاَهُمْ بِالْحَقِّ اِنَّهُمْ فِتْیَةٌ اٰمَنُوْا بِرَبِّهِمْ وَزِدْنٰهُمْ هُدًی ۗۖ",
    "وَّرَبَطْنَا عَلٰی قُلُوْبِهِمْ اِذْ قَامُوْا فَقَالُوْا رَبُّنَا رَبُّ السَّمٰوٰتِ وَالْاَرْضِ لَنْ نَّدْعُوَاۡ مِنْ دُوْنِهٖۤ اِلٰهًا لَّقَدْ قُلْنَاۤ اِذًا شَطَطًا",
    "هٰۤؤُلَآءِ قَوْمُنَا اتَّخَذُوْا مِنْ دُوْنِهٖۤ اٰلِهَةً لَوْلَا یَاْتُوْنَ عَلَیْهِمْ بِسُلْطٰنٍ بَیِّنٍ فَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰی عَلَی اللّٰهِ كَذِبًا",
    "وَاِذِ اعْتَزَلْتُمُوْهُمْ وَمَا یَعْبُدُوْنَ اِلَّا اللّٰهَ فَاْوٗۤا اِلَی الْكَهْفِ یَنْشُرْ لَكُمْ رَبُّكُمْ مِّنْ رَّحْمَتِهٖ وَیُهَیِّئْ لَكُمْ مِّنْ اَمْرِكُمْ مِّرْفَقًا",
    "وَتَرَی الشَّمْسَ اِذَا طَلَعَتْ تَّزٰوَرُ عَنْ كَهْفِهِمْ ذَاتَ الْیَمِیْنِ وَاِذَا غَرَبَتْ تَّقْرِضُهُمْ ذَاتَ الشِّمَالِ وَهُمْ فِیْ فَجْوَةٍ مِّنْهُ ذٰلِكَ مِنْ اٰیٰتِ اللّٰهِ مَنْ یَّهْدِ اللّٰهُ فَهُوَ الْمُهْتَدِ وَمَنْ یُّضْلِلْ فَلَنْ تَجِدَ لَهٗ وَلِیًّا مُّرْشِدًا",
    "وَتَحْسَبُهُمْ اَیْقَاظًا وَّهُمْ رُقُوْدٌ ۖ وَّنُقَلِّبُهُمْ ذَاتَ الْیَمِیْنِ وَذَاتَ الشِّمَالِ ۖ وَكَلْبُهُمْ بَاسِطٌ ذِرَاعَیْهِ بِالْوَصِیْدِ لَوِ اطَّلَعْتَ عَلَیْهِمْ لَوَلَّیْتَ مِنْهُمْ فِرَارًا وَّلَمُلِئْتَ مِنْهُمْ رُعْبًا",
    "وَكَذٰلِكَ بَعَثْنٰهُمْ لِیَتَسَآءَلُوْا بَیْنَهُمْ قَالَ قَآىِٕلٌ مِّنْهُمْ كَمْ لَبِثْتُمْ قَالُوْا لَبِثْنَا یَوْمًا اَوْ بَعْضَ یَوْمٍ قَالُوْا رَبُّكُمْ اَعْلَمُ بِمَا لَبِثْتُمْ فَابْعَثُوْۤا اَحَدَكُمْ بِوَرِقِكُمْ هٰذِهٖۤ اِلَی الْمَدِیْنَةِ فَلْیَنْظُرْ اَیُّهَاۤ اَزْكٰی طَعَامًا فَلْیَاْتِكُمْ بِرِزْقٍ مِّنْهُ وَلَا یُشْعِرَنَّ بِكُمْ اَحَدًا",
    "اِنَّهُمْ اِنْ یَّظْهَرُوْا عَلَیْكُمْ یَرْجُمُوْكُمْ اَوْ یُعِیْدُوْكُمْ فِیْ مِلَّتِهِمْ وَلَنْ تُفْلِحُوْۤا اِذًا اَبَدًا",
    "وَكَذٰلِكَ اَعْثَرْنَا عَلَیْهِمْ لِیَعْلَمُوْۤا اَنَّ وَعْدَ اللّٰهِ حَقٌّ وَّاَنَّ السَّاعَةَ لَا رَیْبَ فِیْهَا اِذْ یَتَنَازَعُوْنَ بَیْنَهُمْ اَمْرَهُمْ فَقَالُوا ابْنُوْا عَلَیْهِمْ بُنْیَانًا رَبُّهُمْ اَعْلَمُ بِهِمْ قَالَ الَّذِیْنَ غَلَبُوْا عَلٰۤی اَمْرِهِمْ لَنَتَّخِذَنَّ عَلَیْهِمْ مَّسْجِدًا",
    "سَیَقُوْلُوْنَ ثَلٰثَةٌ رَّابِعُهُمْ كَلْبُهُمْ وَیَقُوْلُوْنَ خَمْسَةٌ سَادِسُهُمْ كَلْبُهُمْ رَجْمًا بِالْغَیْبِ وَیَقُوْلُوْنَ سَبْعَةٌ وَّثَامِنُهُمْ كَلْبُهُمْ قُلْ رَّبِّیْۤ اَعْلَمُ بِعِدَّتِهِمْ مَّا یَعْلَمُهُمْ اِلَّا قَلِیْلٌ ۫ فَلَا تُمَارِ فِیْهِمْ اِلَّا مِرَآءً ظَاهِرًا وَّلَا تَسْتَفْتِ فِیْهِمْ مِّنْهُمْ اَحَدًا",
    "وَلَا تَقُوْلَنَّ لِشَایْءٍ اِنِّیْ فَاعِلٌ ذٰلِكَ غَدًا",
    "اِلَّاۤ اَنْ یَّشَآءَ اللّٰهُ وَاذْكُرْ رَّبَّكَ اِذَا نَسِیْتَ وَقُلْ عَسٰۤی اَنْ یَّهْدِیَنِ رَبِّیْ لِاَقْرَبَ مِنْ هٰذَا رَشَدًا",
    "وَلَبِثُوْا فِیْ كَهْفِهِمْ ثَلٰثَ مِائَةٍ سِنِیْنَ وَازْدَادُوْا تِسْعًا",
    "قُلِ اللّٰهُ اَعْلَمُ بِمَا لَبِثُوْا لَهٗ غَیْبُ السَّمٰوٰتِ وَالْاَرْضِ اَبْصِرْ بِهٖ وَاَسْمِعْ مَا لَهُمْ مِّنْ دُوْنِهٖ مِنْ وَّلِیٍّ وَّلَا یُشْرِكُ فِیْ حُكْمِهٖۤ اَحَدًا",
    "وَاتْلُ مَاۤ اُوْحِیَ اِلَیْكَ مِنْ كِتَابِ رَبِّكَ لَا مُبَدِّلَ لِكَلِمٰتِهٖ ۫ وَلَنْ تَجِدَ مِنْ دُوْنِهٖ مُلْتَحَدًا",
    "وَاصْبِرْ نَفْسَكَ مَعَ الَّذِیْنَ یَدْعُوْنَ رَبَّهُمْ بِالْغَدٰوةِ وَالْعَشِیِّ یُرِیْدُوْنَ وَجْهَهٗ وَلَا تَعْدُ عَیْنٰكَ عَنْهُمْ تُرِیْدُ زِیْنَةَ الْحَیٰوةِ الدُّنْیَا وَلَا تُطِعْ مَنْ اَغْفَلْنَا قَلْبَهٗ عَنْ ذِكْرِنَا وَاتَّبَعَ هَوٰىهُ وَكَانَ اَمْرُهٗ فُرُطًا",
    "وَقُلِ الْحَقُّ مِنْ رَّبِّكُمْ ۫ فَمَنْ شَآءَ فَلْیُؤْمِنْ وَّمَنْ شَآءَ فَلْیَكْفُرْ اِنَّاۤ اَعْتَدْنَا لِلظّٰلِمِیْنَ نَارًا اَحَاطَ بِهِمْ سُرَادِقُهَا وَاِنْ یَّسْتَغِیْثُوْا یُغَاثُوْا بِمَآءٍ كَالْمُهْلِ یَشْوِی الْوُجُوْهَ بِئْسَ الشَّرَابُ وَسَآءَتْ مُرْتَفَقًا",
    "اِنَّ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ اِنَّا لَا نُضِیْعُ اَجْرَ مَنْ اَحْسَنَ عَمَلًا",
    "اُولٰٓىِٕكَ لَهُمْ جَنّٰتُ عَدْنٍ تَجْرِیْ مِنْ تَحْتِهِمُ الْاَنْهٰرُ یُحَلَّوْنَ فِیْهَا مِنْ اَسَاوِرَ مِنْ ذَهَبٍ وَّیَلْبَسُوْنَ ثِیَابًا خُضْرًا مِّنْ سُنْدُسٍ وَّاِسْتَبْرَقٍ مُّتَّكِـِٕیْنَ فِیْهَا عَلَی الْاَرَآىِٕكِ نِعْمَ الثَّوَابُ وَحَسُنَتْ مُرْتَفَقًا",
    "وَاضْرِبْ لَهُمْ مَّثَلًا رَّجُلَیْنِ جَعَلْنَا لِاَحَدِهِمَا جَنَّتَیْنِ مِنْ اَعْنَابٍ وَّحَفَفْنٰهُمَا بِنَخْلٍ وَّجَعَلْنَا بَیْنَهُمَا زَرْعًا",
    "كِلْتَا الْجَنَّتَیْنِ اٰتَتْ اُكُلَهَا وَلَمْ تَظْلِمْ مِّنْهُ شَیْـًٔا وَّفَجَّرْنَا خِلٰلَهُمَا نَهَرًا",
    "وَّكَانَ لَهٗ ثَمَرٌ فَقَالَ لِصَاحِبِهٖ وَهُوَ یُحَاوِرُهٗۤ اَنَا اَكْثَرُ مِنْكَ مَالًا وَّاَعَزُّ نَفَرًا",
    "وَدَخَلَ جَنَّتَهٗ وَهُوَ ظَالِمٌ لِّنَفْسِهٖ قَالَ مَاۤ اَظُنُّ اَنْ تَبِیْدَ هٰذِهٖۤ اَبَدًا",
    "وَّمَاۤ اَظُنُّ السَّاعَةَ قَآىِٕمَةً وَّلَىِٕنْ رُّدِدْتُّ اِلٰی رَبِّیْ لَاَجِدَنَّ خَیْرًا مِّنْهَا مُنْقَلَبًا",
    "قَالَ لَهٗ صَاحِبُهٗ وَهُوَ یُحَاوِرُهٗۤ اَكَفَرْتَ بِالَّذِیْ خَلَقَكَ مِنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ ثُمَّ سَوّٰىكَ رَجُلًا",
    "لٰكِنَّاۡ هُوَ اللّٰهُ رَبِّیْ وَلَاۤ اُشْرِكُ بِرَبِّیْۤ اَحَدًا",
    "وَلَوْلَاۤ اِذْ دَخَلْتَ جَنَّتَكَ قُلْتَ مَا شَآءَ اللّٰهُ لَا قُوَّةَ اِلَّا بِاللّٰهِ اِنْ تَرَنِ اَنَا اَقَلَّ مِنْكَ مَالًا وَّوَلَدًا",
    "فَعَسٰی رَبِّیْۤ اَنْ یُّؤْتِیَنِ خَیْرًا مِّنْ جَنَّتِكَ وَیُرْسِلَ عَلَیْهَا حُسْبَانًا مِّنَ السَّمَآءِ فَتُصْبِحَ صَعِیْدًا زَلَقًا",
    "اَوْ یُصْبِحَ مَآؤُهَا غَوْرًا فَلَنْ تَسْتَطِیْعَ لَهٗ طَلَبًا",
    "وَاُحِیْطَ بِثَمَرِهٖ فَاَصْبَحَ یُقَلِّبُ كَفَّیْهِ عَلٰی مَاۤ اَنْفَقَ فِیْهَا وَهِیَ خَاوِیَةٌ عَلٰی عُرُوْشِهَا وَیَقُوْلُ یٰلَیْتَنِیْ لَمْ اُشْرِكْ بِرَبِّیْۤ اَحَدًا",
    "وَلَمْ تَكُنْ لَّهٗ فِئَةٌ یَّنْصُرُوْنَهٗ مِنْ دُوْنِ اللّٰهِ وَمَا كَانَ مُنْتَصِرًا",
    "هُنَالِكَ الْوَلَایَةُ لِلّٰهِ الْحَقِّ هُوَ خَیْرٌ ثَوَابًا وَّخَیْرٌ عُقْبًا",
    "وَاضْرِبْ لَهُمْ مَّثَلَ الْحَیٰوةِ الدُّنْیَا كَمَآءٍ اَنْزَلْنٰهُ مِنَ السَّمَآءِ فَاخْتَلَطَ بِهٖ نَبَاتُ الْاَرْضِ فَاَصْبَحَ هَشِیْمًا تَذْرُوْهُ الرِّیٰحُ وَكَانَ اللّٰهُ عَلٰی كُلِّ شَیْءٍ مُّقْتَدِرًا",
    "اَلْمَالُ وَالْبَنُوْنَ زِیْنَةُ الْحَیٰوةِ الدُّنْیَا وَالْبٰقِیٰتُ الصّٰلِحٰتُ خَیْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَّخَیْرٌ اَمَلًا",
    "وَیَوْمَ نُسَیِّرُ الْجِبَالَ وَتَرَی الْاَرْضَ بَارِزَةً وَّحَشَرْنٰهُمْ فَلَمْ نُغَادِرْ مِنْهُمْ اَحَدًا",
    "وَعُرِضُوْا عَلٰی رَبِّكَ صَفًّا لَقَدْ جِئْتُمُوْنَا كَمَا خَلَقْنٰكُمْ اَوَّلَ مَرَّةٍ بَلْ زَعَمْتُمْ اَلَّنْ نَّجْعَلَ لَكُمْ مَّوْعِدًا",
    "وَوُضِعَ الْكِتٰبُ فَتَرَی الْمُجْرِمِیْنَ مُشْفِقِیْنَ مِمَّا فِیْهِ وَیَقُوْلُوْنَ یٰوَیْلَتَنَا مَالِ هٰذَا الْكِتٰبِ لَا یُغَادِرُ صَغِیْرَةً وَّلَا كَبِیْرَةً اِلَّاۤ اَحْصٰىهَا وَوَجَدُوْا مَا عَمِلُوْا حَاضِرًا وَلَا یَظْلِمُ رَبُّكَ اَحَدًا",
    "وَاِذْ قُلْنَا لِلْمَلٰٓىِٕكَةِ اسْجُدُوْا لِاٰدَمَ فَسَجَدُوْۤا اِلَّاۤ اِبْلِیْسَ كَانَ مِنَ الْجِنِّ فَفَسَقَ عَنْ اَمْرِ رَبِّهٖ اَفَتَتَّخِذُوْنَهٗ وَذُرِّیَّتَهٗۤ اَوْلِیَآءَ مِنْ دُوْنِیْ وَهُمْ لَكُمْ عَدُوٌّ بِئْسَ لِلظّٰلِمِیْنَ بَدَلًا",
    "مَاۤ اَشْهَدْتُّهُمْ خَلْقَ السَّمٰوٰتِ وَالْاَرْضِ وَلَا خَلْقَ اَنْفُسِهِمْ وَمَا كُنْتُ مُتَّخِذَ الْمُضِلِّیْنَ عَضُدًا",
    "وَیَوْمَ یَقُوْلُ نَادُوْا شُرَكَآءِیَ الَّذِیْنَ زَعَمْتُمْ فَدَعَوْهُمْ فَلَمْ یَسْتَجِیْبُوْا لَهُمْ وَجَعَلْنَا بَیْنَهُمْ مَّوْبِقًا",
    "وَرَاَ الْمُجْرِمُوْنَ النَّارَ فَظَنُّوْۤا اَنَّهُمْ مُّوَاقِعُوْهَا وَلَمْ یَجِدُوْا عَنْهَا مَصْرِفًا",
    "وَلَقَدْ صَرَّفْنَا فِیْ هٰذَا الْقُرْاٰنِ لِلنَّاسِ مِنْ كُلِّ مَثَلٍ وَكَانَ الْاِنْسَانُ اَكْثَرَ شَیْءٍ جَدَلًا",
    "وَمَا مَنَعَ النَّاسَ اَنْ یُّؤْمِنُوْۤا اِذْ جَآءَهُمُ الْهُدٰی وَیَسْتَغْفِرُوْا رَبَّهُمْ اِلَّاۤ اَنْ تَاْتِیَهُمْ سُنَّةُ الْاَوَّلِیْنَ اَوْ یَاْتِیَهُمُ الْعَذَابُ قُبُلًا",
    "وَمَا نُرْسِلُ الْمُرْسَلِیْنَ اِلَّا مُبَشِّرِیْنَ وَمُنْذِرِیْنَ وَیُجَادِلُ الَّذِیْنَ كَفَرُوْا بِالْبَاطِلِ لِیُدْحِضُوْا بِهِ الْحَقَّ وَاتَّخَذُوْۤا اٰیٰتِیْ وَمَاۤ اُنْذِرُوْا هُزُوًا",
    "وَمَنْ اَظْلَمُ مِمَّنْ ذُكِّرَ بِاٰیٰتِ رَبِّهٖ فَاَعْرَضَ عَنْهَا وَنَسِیَ مَا قَدَّمَتْ یَدٰهُ اِنَّا جَعَلْنَا عَلٰی قُلُوْبِهِمْ اَكِنَّةً اَنْ یَّفْقَهُوْهُ وَفِیْۤ اٰذَانِهِمْ وَقْرًا وَاِنْ تَدْعُهُمْ اِلَی الْهُدٰی فَلَنْ یَّهْتَدُوْۤا اِذًا اَبَدًا",
    "وَرَبُّكَ الْغَفُوْرُ ذُو الرَّحْمَةِ لَوْ یُؤَاخِذُهُمْ بِمَا كَسَبُوْا لَعَجَّلَ لَهُمُ الْعَذَابَ بَلْ لَّهُمْ مَّوْعِدٌ لَّنْ یَّجِدُوْا مِنْ دُوْنِهٖ مَوْىِٕلًا",
    "وَتِلْكَ الْقُرٰۤی اَهْلَكْنٰهُمْ لَمَّا ظَلَمُوْا وَجَعَلْنَا لِمَهْلِكِهِمْ مَّوْعِدًا",
    "وَاِذْ قَالَ مُوْسٰی لِفَتٰىهُ لَاۤ اَبْرَحُ حَتّٰۤی اَبْلُغَ مَجْمَعَ الْبَحْرَیْنِ اَوْ اَمْضِیَ حُقُبًا",
    "فَلَمَّا بَلَغَا مَجْمَعَ بَیْنِهِمَا نَسِیَا حُوْتَهُمَا فَاتَّخَذَ سَبِیْلَهٗ فِی الْبَحْرِ سَرَبًا",
    "فَلَمَّا جَاوَزَا قَالَ لِفَتٰىهُ اٰتِنَا غَدَآءَنَا لَقَدْ لَقِیْنَا مِنْ سَفَرِنَا هٰذَا نَصَبًا",
    "قَالَ اَرَءَیْتَ اِذْ اَوَیْنَاۤ اِلَی الصَّخْرَةِ فَاِنِّیْ نَسِیْتُ الْحُوْتَ وَمَاۤ اَنْسٰىنِیْهُ اِلَّا الشَّیْطٰنُ اَنْ اَذْكُرَهٗ وَاتَّخَذَ سَبِیْلَهٗ فِی الْبَحْرِ ۖ عَجَبًا",
    "قَالَ ذٰلِكَ مَا كُنَّا نَبْغِ ۖ فَارْتَدَّا عَلٰۤی اٰثَارِهِمَا قَصَصًا",
    "فَوَجَدَا عَبْدًا مِّنْ عِبَادِنَاۤ اٰتَیْنٰهُ رَحْمَةً مِّنْ عِنْدِنَا وَعَلَّمْنٰهُ مِنْ لَّدُنَّا عِلْمًا",
    "قَالَ لَهٗ مُوْسٰی هَلْ اَتَّبِعُكَ عَلٰۤی اَنْ تُعَلِّمَنِ مِمَّا عُلِّمْتَ رُشْدًا",
    "قَالَ اِنَّكَ لَنْ تَسْتَطِیْعَ مَعِیَ صَبْرًا",
    "وَكَیْفَ تَصْبِرُ عَلٰی مَا لَمْ تُحِطْ بِهٖ خُبْرًا",
    "قَالَ سَتَجِدُنِیْۤ اِنْ شَآءَ اللّٰهُ صَابِرًا وَّلَاۤ اَعْصِیْ لَكَ اَمْرًا",
    "قَالَ فَاِنِ اتَّبَعْتَنِیْ فَلَا تَسْـَٔلْنِیْ عَنْ شَیْءٍ حَتّٰۤی اُحْدِثَ لَكَ مِنْهُ ذِكْرًا",
    "فَانْطَلَقَا ۫ حَتّٰۤی اِذَا رَكِبَا فِی السَّفِیْنَةِ خَرَقَهَا قَالَ اَخَرَقْتَهَا لِتُغْرِقَ اَهْلَهَا لَقَدْ جِئْتَ شَیْـًٔا اِمْرًا",
    "قَالَ اَلَمْ اَقُلْ اِنَّكَ لَنْ تَسْتَطِیْعَ مَعِیَ صَبْرًا",
    "قَالَ لَا تُؤَاخِذْنِیْ بِمَا نَسِیْتُ وَلَا تُرْهِقْنِیْ مِنْ اَمْرِیْ عُسْرًا",
    "فَانْطَلَقَا ۫ حَتّٰۤی اِذَا لَقِیَا غُلٰمًا فَقَتَلَهٗ قَالَ اَقَتَلْتَ نَفْسًا زَكِیَّةً بِغَیْرِ نَفْسٍ لَقَدْ جِئْتَ شَیْـًٔا نُّكْرًا",
    "قَالَ اَلَمْ اَقُلْ لَّكَ اِنَّكَ لَنْ تَسْتَطِیْعَ مَعِیَ صَبْرًا",
    "قَالَ اِنْ سَاَلْتُكَ عَنْ شَیْ بَعْدَهَا فَلَا تُصٰحِبْنِیْ قَدْ بَلَغْتَ مِنْ لَّدُنِّیْ عُذْرًا",
    "فَانْطَلَقَا ۫ حَتّٰۤی اِذَاۤ اَتَیَاۤ اَهْلَ قَرْیَةِ ١سْتَطْعَمَاۤ اَهْلَهَا فَاَبَوْا اَنْ یُّضَیِّفُوْهُمَا فَوَجَدَا فِیْهَا جِدَارًا یُّرِیْدُ اَنْ یَّنْقَضَّ فَاَقَامَهٗ قَالَ لَوْ شِئْتَ لَتَّخَذْتَ عَلَیْهِ اَجْرًا",
    "قَالَ هٰذَا فِرَاقُ بَیْنِیْ وَبَیْنِكَ سَاُنَبِّئُكَ بِتَاْوِیْلِ مَا لَمْ تَسْتَطِعْ عَّلَیْهِ صَبْرًا",
    "اَمَّا السَّفِیْنَةُ فَكَانَتْ لِمَسٰكِیْنَ یَعْمَلُوْنَ فِی الْبَحْرِ فَاَرَدْتُّ اَنْ اَعِیْبَهَا وَكَانَ وَرَآءَهُمْ مَّلِكٌ یَّاْخُذُ كُلَّ سَفِیْنَةٍ غَصْبًا",
    "وَاَمَّا الْغُلٰمُ فَكَانَ اَبَوٰهُ مُؤْمِنَیْنِ فَخَشِیْنَاۤ اَنْ یُّرْهِقَهُمَا طُغْیَانًا وَّكُفْرًا",
    "فَاَرَدْنَاۤ اَنْ یُّبْدِلَهُمَا رَبُّهُمَا خَیْرًا مِّنْهُ زَكٰوةً وَّاَقْرَبَ رُحْمًا",
    "وَاَمَّا الْجِدَارُ فَكَانَ لِغُلٰمَیْنِ یَتِیْمَیْنِ فِی الْمَدِیْنَةِ وَكَانَ تَحْتَهٗ كَنْزٌ لَّهُمَا وَكَانَ اَبُوْهُمَا صَالِحًا فَاَرَادَ رَبُّكَ اَنْ یَّبْلُغَاۤ اَشُدَّهُمَا وَیَسْتَخْرِجَا كَنْزَهُمَا ۖ رَحْمَةً مِّنْ رَّبِّكَ وَمَا فَعَلْتُهٗ عَنْ اَمْرِیْ ذٰلِكَ تَاْوِیْلُ مَا لَمْ تَسْطِعْ عَّلَیْهِ صَبْرًا",
    "وَیَسْـَٔلُوْنَكَ عَنْ ذِی الْقَرْنَیْنِ قُلْ سَاَتْلُوْا عَلَیْكُمْ مِّنْهُ ذِكْرًا",
    "اِنَّا مَكَّنَّا لَهٗ فِی الْاَرْضِ وَاٰتَیْنٰهُ مِنْ كُلِّ شَیْءٍ سَبَبًا",
    "فَاَتْبَعَ سَبَبًا",
    "حَتّٰۤی اِذَا بَلَغَ مَغْرِبَ الشَّمْسِ وَجَدَهَا تَغْرُبُ فِیْ عَیْنٍ حَمِئَةٍ وَّوَجَدَ عِنْدَهَا قَوْمًا قُلْنَا یٰذَا الْقَرْنَیْنِ اِمَّاۤ اَنْ تُعَذِّبَ وَاِمَّاۤ اَنْ تَتَّخِذَ فِیْهِمْ حُسْنًا",
    "قَالَ اَمَّا مَنْ ظَلَمَ فَسَوْفَ نُعَذِّبُهٗ ثُمَّ یُرَدُّ اِلٰی رَبِّهٖ فَیُعَذِّبُهٗ عَذَابًا نُّكْرًا",
    "وَاَمَّا مَنْ اٰمَنَ وَعَمِلَ صَالِحًا فَلَهٗ جَزَآءَ ١لْحُسْنٰی وَسَنَقُوْلُ لَهٗ مِنْ اَمْرِنَا یُسْرًا",
    "ثُمَّ اَتْبَعَ سَبَبًا",
    "حَتّٰۤی اِذَا بَلَغَ مَطْلِعَ الشَّمْسِ وَجَدَهَا تَطْلُعُ عَلٰی قَوْمٍ لَّمْ نَجْعَلْ لَّهُمْ مِّنْ دُوْنِهَا سِتْرًا",
    "كَذٰلِكَ وَقَدْ اَحَطْنَا بِمَا لَدَیْهِ خُبْرًا",
    "ثُمَّ اَتْبَعَ سَبَبًا",
    "حَتّٰۤی اِذَا بَلَغَ بَیْنَ السَّدَّیْنِ وَجَدَ مِنْ دُوْنِهِمَا قَوْمًا لَّا یَكَادُوْنَ یَفْقَهُوْنَ قَوْلًا",
    "قَالُوْا یٰذَا الْقَرْنَیْنِ اِنَّ یَاْجُوْجَ وَمَاْجُوْجَ مُفْسِدُوْنَ فِی الْاَرْضِ فَهَلْ نَجْعَلُ لَكَ خَرْجًا عَلٰۤی اَنْ تَجْعَلَ بَیْنَنَا وَبَیْنَهُمْ سَدًّا",
    "قَالَ مَا مَكَّنِّیْ فِیْهِ رَبِّیْ خَیْرٌ فَاَعِیْنُوْنِیْ بِقُوَّةٍ اَجْعَلْ بَیْنَكُمْ وَبَیْنَهُمْ رَدْمًا",
    "اٰتُوْنِیْ زُبَرَ الْحَدِیْدِ حَتّٰۤی اِذَا سَاوٰی بَیْنَ الصَّدَفَیْنِ قَالَ انْفُخُوْا حَتّٰۤی اِذَا جَعَلَهٗ نَارًا قَالَ اٰتُوْنِیْۤ اُفْرِغْ عَلَیْهِ قِطْرًا",
    "فَمَا اسْطَاعُوْۤا اَنْ یَّظْهَرُوْهُ وَمَا اسْتَطَاعُوْا لَهٗ نَقْبًا",
    "قَالَ هٰذَا رَحْمَةٌ مِّنْ رَّبِّیْ فَاِذَا جَآءَ وَعْدُ رَبِّیْ جَعَلَهٗ دَكَّآءَ وَكَانَ وَعْدُ رَبِّیْ حَقًّا",
    "وَتَرَكْنَا بَعْضَهُمْ یَوْمَىِٕذٍ یَّمُوْجُ فِیْ بَعْضٍ وَّنُفِخَ فِی الصُّوْرِ فَجَمَعْنٰهُمْ جَمْعًا",
    "وَّعَرَضْنَا جَهَنَّمَ یَوْمَىِٕذٍ لِّلْكٰفِرِیْنَ عَرْضَا",
    "١لَّذِیْنَ كَانَتْ اَعْیُنُهُمْ فِیْ غِطَآءٍ عَنْ ذِكْرِیْ وَكَانُوْا لَا یَسْتَطِیْعُوْنَ سَمْعًا",
    "اَفَحَسِبَ الَّذِیْنَ كَفَرُوْۤا اَنْ یَّتَّخِذُوْا عِبَادِیْ مِنْ دُوْنِیْۤ اَوْلِیَآءَ اِنَّاۤ اَعْتَدْنَا جَهَنَّمَ لِلْكٰفِرِیْنَ نُزُلًا",
    "قُلْ هَلْ نُنَبِّئُكُمْ بِالْاَخْسَرِیْنَ اَعْمَالًا",
    "اَلَّذِیْنَ ضَلَّ سَعْیُهُمْ فِی الْحَیٰوةِ الدُّنْیَا وَهُمْ یَحْسَبُوْنَ اَنَّهُمْ یُحْسِنُوْنَ صُنْعًا",
    "اُولٰٓىِٕكَ الَّذِیْنَ كَفَرُوْا بِاٰیٰتِ رَبِّهِمْ وَلِقَآىِٕهٖ فَحَبِطَتْ اَعْمَالُهُمْ فَلَا نُقِیْمُ لَهُمْ یَوْمَ الْقِیٰمَةِ وَزْنًا",
    "ذٰلِكَ جَزَآؤُهُمْ جَهَنَّمُ بِمَا كَفَرُوْا وَاتَّخَذُوْۤا اٰیٰتِیْ وَرُسُلِیْ هُزُوًا",
    "اِنَّ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ كَانَتْ لَهُمْ جَنّٰتُ الْفِرْدَوْسِ نُزُلًا",
    "خٰلِدِیْنَ فِیْهَا لَا یَبْغُوْنَ عَنْهَا حِوَلًا",
    "قُلْ لَّوْ كَانَ الْبَحْرُ مِدَادًا لِّكَلِمٰتِ رَبِّیْ لَنَفِدَ الْبَحْرُ قَبْلَ اَنْ تَنْفَدَ كَلِمٰتُ رَبِّیْ وَلَوْ جِئْنَا بِمِثْلِهٖ مَدَدًا",
    "قُلْ اِنَّمَاۤ اَنَا بَشَرٌ مِّثْلُكُمْ یُوْحٰۤی اِلَیَّ اَنَّمَاۤ اِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ فَمَنْ كَانَ یَرْجُوْا لِقَآءَ رَبِّهٖ فَلْیَعْمَلْ عَمَلًا صَالِحًا وَّلَا یُشْرِكْ بِعِبَادَةِ رَبِّهٖۤ اَحَدًا"
  ],
  "bengali": [
    "সমস্ত প্রশংসা আল্লাহর, যিনি তাঁর বান্দার উপর কিতাব নাযিল করেছেন এবং তাতে রাখেননি কোন বক্রতা ।",
    "সরলরূপে, যাতে সে তাঁর পক্ষ থেকে কঠিন আযাব সম্পর্কে সতর্ক করে এবং সুসংবাদ দেয়, সেসব মুমিনকে, যারা সৎকর্ম করে, নিশ্চয় তাদের জন্য রয়েছে উত্তম প্রতিদান।",
    "তারা তাতে অনন্তকাল অবস্থান করবে।",
    "আর যেন সতর্ক করে তাদেরকে, যারা বলে, আল্লাহ সন্তান গ্রহণ করেছেন’।",
    "এ ব্যাপারে তাদের কোন জ্ঞান নেই এবং তাদের পিতৃপুরুষদেরও না। বড় মারাত্মক কথা, যা তাদের মুখ থেকে বের হয়। মিথ্যা ছাড়া তারা কিছুই বলে না!",
    "হয়তো তুমি তাদের পেছনে পেছনে ঘুরে দুঃখে নিজকে শেষ করে দেবে, যদি তারা এই কথার প্রতি ঈমান না আনে।",
    "নিশ্চয় যমীনের উপর যা রয়েছে, তা আমি শোভা করেছি তার জন্য, যাতে তাদেরকে পরীক্ষা করি যে, কর্মে তাদের মধ্যে কে উত্তম।",
    "আর নিশ্চয় তার উপর যা রয়েছে তাকে আমি উদ্ভিদহীন শুষ্ক মাটিতে পরিণত করব।",
    "তুমি কি মনে করেছ যে, গুহা ও রাকীমের* অধিবাসীরা ছিল আমার আয়াতসমূহের এক বিস্ময়? \n* রাকীম একটি পাহাড়ের নাম, অথবা যে গ্রাম থেকে তারা বের হয়েছিল সে গ্রামের নাম, অথবা একটি ফলক- যাতে ঐ সব যুবকের নাম লিখা ছিল।",
    "যখন যুবকরা গুহায় আশ্রয় নিল অতঃপর বলল, ‘হে আমাদের রব, আমাদেরকে আপনার পক্ষ থেকে রহমত দিন এবং আমাদের জন্য আমাদের কর্মকান্ড সঠিক করে দিন’।",
    "ফলে আমি গুহায় তাদের কান বন্ধ করে দিলাম অনেক বছরের জন্য।",
    "তারপর আমি তাদেরকে জাগালাম, যাতে আমি জানতে পারি, যতটুকু সময় তারা অবস্থান করেছিল, দু’দলের মধ্যে* কে তা অধিক নির্ণয়কারী। \n* গুহায় অবস্থান কাল নিয়ে দু’টি দল হয়েছিল। একদল বলেছিল, আমরা অবস্থান করেছি এক দিন অথবা এক দিনের কিছু কম সময়; অন্যদল বলেছিল, দীর্ঘ সময়।",
    "আমিই তোমাকে তাদের সংবাদ সঠিকভাবে বর্ণনা করছি। নিশ্চয় তারা কয়েকজন যুবক, যারা তাদের রবের প্রতি ঈমান এনেছিল এবং আমি তাদের হিদায়াত বাড়িয়ে দিয়েছিলাম।",
    "যখন তারা উঠেছিল, আমি তাদের অন্তরকে দৃঢ় করেছিলাম। তখন তারা বলল, ‘আমাদের রব আসমানসমূহ ও যমীনের রব। তিনি ছাড়া কোন ইলাহকে আমরা কখনো ডাকব না। (যদি ডাকি) তাহলে নিশ্চয় আমরা গর্হিত কথা বলব’।",
    "এরা আমাদের কওম, তারা তাঁকে ছাড়া অন্যান্য উপাস্য গ্রহণ করেছে। কেন তারা তাদের ব্যাপারে স্পষ্ট প্রমাণ উপস্থিত করে না? অতএব যে আল্লাহর ব্যাপারে মিথ্যা রটায়, তার চেয়ে বড় যালিম আর কে?",
    "আর যখন তোমরা তাদের থেকে আলাদা হয়েছ এবং আল্লাহ ছাড়া যাদের তারা উপাসনা করে তাদের থেকেও, তখন গুহায় আশ্রয় নাও। তাহলে তোমাদের রব তোমাদের জন্য তার রহমত উন্মুক্ত করে দেবেন এবং তোমাদের জন্য তোমাদের জীবনোপকরণের বিষয়টি সহজ করে দেবেন।",
    "আর তুমি দেখতে পেতে, সূর্য উদিত হলে তাদের গুহার ডানে তা হেলে পড়ছে, আর অস্ত গেলে তাদেরকে বামে রেখে কেটে যাচ্ছে, তখন তারা ছিল তার আঙিনায়। এগুলো আল্লাহর আয়াতসমূহের কিছু। আল্লাহ যাকে হিদায়াত দেন, সে হেদায়াতপ্রাপ্ত। আর যাকে ভ্রষ্ট করেন, তুমি তার জন্য পথনির্দেশকারী কোন অভিভাবক পাবে না।",
    "তুমি তাদেরকে মনে করতে জাগ্রত, অথচ তারা ছিল ঘুমন্ত, আমি তাদেরকে পাশ পরিবর্তন করাচ্ছি ডানে ও বামে এবং তাদের কুকুরটি আঙিনায় তার সামনের দু’পা বাড়িয়ে আছে। যদি তুমি তাদেরকে উঁকি মেরে দেখতে, তবে নিশ্চয় তাদের থেকে পেছনে ফিরে পালিয়ে যেতে এবং অবশ্যই তাদের কারণে ভীষণ ভীত হতে।",
    "আর এমনিভাবে আমি তাদেরকে জাগিয়ে তুলেছিলাম, যাতে তারা পরস্পর জিজ্ঞাসা করে। তাদের একজন বলল, ‘তোমরা কতক্ষণ অবস্থান করলে’? তারা বলল, ‘আমরা একদিন কিংবা একদিনের কিছু অংশ অবস্থান করেছি। তারা বলল, ‘তোমরা কতক্ষণ অবস্থান করেছ, সে ব্যাপারে তোমাদের রবই অধিক জানেন। তাই তোমরা তোমাদের কাউকে তোমাদের এই রৌপ্যমুদ্রাগুলো দিয়ে শহরে পাঠাও। অতঃপর সে যেন দেখে শহরের কোন্ খাবার একেবারে ভেজালমুক্ত, তখন সে যেন তোমাদের জন্য তা থেকে কিছু খাবার নিয়ে আসে। আর সে অবশ্যই সাবধানতা অবলম্বন করবে এবং কাউকে যেন তোমাদের ব্যাপারে না জানায়’।",
    "‘নিশ্চয় তারা যদি তোমাদের ব্যাপারে জেনে যায়, তাহলে তারা তোমাদেরকে পাথর মেরে হত্যা করবে অথবা তোমাদেরকে তাদের ধর্মে ফিরিয়ে নিয়ে যাবে। আর তখন তোমরা কোনভাবেই সফল হবে না’।",
    "আর এমনিভাবে আমি তাদের ব্যাপারে (লোকদেরকে) জানিয়ে দিলাম, যাতে তারা জানতে পারে যে, নিশ্চয় আল্লাহর ওয়াদা সত্য এবং কিয়ামতের ব্যাপারে কোন সন্দেহ নেই। যখন তারা নিজদের মধ্যে তাদের বিষয়টি নিয়ে বিতর্ক করছিল, তখন তারা বলল, ‘তাদের উপর তোমরা একটি ভবন নির্মাণ কর’। তাদের রবই তাদের ব্যাপারে অধিক জ্ঞাত। যারা গুহাবাসীদের উপর প্রাধান্য লাভ করেছিল, তারা বলল, ‘আমরা অবশ্যই তাদের উপর একটি মসজিদ নির্মাণ করব’।",
    "বিতর্ককারীরা বলবে, ‘তারা ছিল তিন জন, চতুর্থ হল তাদের কুকুর’। আর কতক বলবে, ‘তারা ছিল পাঁচজন, ষষ্ঠ হল তাদের কুকুর’। এসবই অজানা বিষয়ে অনুমান করে। আর কেউ কেউ বলবে, ‘তারা ছিল সাত জন; অষ্টম হল তাদের কুকুর’। বল, ‘আমার রবই তাদের সংখ্যা সম্পর্কে অধিক জ্ঞাত’। কম সংখ্যক লোকই তাদেরকে জানে। সুতরাং স্পষ্ট আলোচনা ছাড়া তুমি তাদের ব্যাপারে বিতর্ক করো না। আর তাদের ব্যাপারে লোকদের মধ্যে কারো কাছে জানতে চেয়ো না।",
    "আর কোন কিছুর ব্যাপারে তুমি মোটেই বলবে না যে, ‘নিশ্চয় আমি তা আগামী কাল করব’,",
    "তবে ‘আল্লাহ যদি চান’। আর যখন ভুলে যাও, তখন তুমি তোমার রবের যিকির কর এবং বল, আশা করি, আল্লাহ আমাকে এর চেয়েও নিকটবর্তী সত্য পথের হিদায়াত দেবেন।",
    "আর তারা তাদের গুহায় অবস্থান করেছে তিনশ’ বছর এবং এর সাথে অতিরিক্ত হয়েছিল ‘নয়’।",
    "বল, ‘তারা যে সময়টুকু অবস্থান করেছিল, সে ব্যাপারে আল্লাহই অধিক জানেন’। আসমানসমূহ ও যমীনের গায়েবী বিষয় তাঁরই। এ ব্যাপারে তিনিই উত্তম দ্রষ্টা ও উত্তম শ্রোতা। তিনি ছাড়া তাদের কোন অভিভাবক নেই। তাঁর সিদ্ধান্তে তিনি কাউকে শরীক করেন না।",
    "আর তোমার রবের কিতাব থেকে তোমার নিকট যে ওহী পাঠানো হয়, তুমি তা তিলাওয়াত কর। তাঁর বাণীসমূহের কোন পরিবর্তনকারী নেই এবং তিনি ছাড়া কোন আশ্রয়স্থল তুমি পাবে না।",
    "আর তুমি নিজকে ধৈর্যশীল রাখ তাদের সাথে, যারা সকাল-সন্ধ্যায় তাদের রবকে ডাকে, তাঁর সন্তুষ্টির উদ্দেশে, এবং দুনিয়ার জীবনের সৌন্দর্য কামনা করে তোমার দু’চোখ যেন তাদের থেকে ঘুরে না যায়। আর ওই ব্যক্তির আনুগত্য করো না, যার অন্তরকে আমি আমার যিকির থেকে গাফেল করে দিয়েছি এবং যে তার প্রবৃত্তির অনুসরণ করেছে এবং যার কর্ম বিনষ্ট হয়েছে।",
    "আর বল, ‘সত্য তোমাদের রবের পক্ষ থেকে। সুতরাং যে ইচ্ছা করে সে যেন ঈমান আনে এবং যে ইচ্ছা করে সে যেন কুফরী করে। নিশ্চয় আমি যালিমদের জন্য আগুন প্রস্ত্তত করেছি, যার প্রাচীরগুলো তাদেরকে বেষ্টন করে রেখেছে। যদি তারা পানি চায়, তবে তাদেরকে দেয়া হবে এমন পানি যা গলিত ধাতুর মত, যা চেহারাগুলো ঝলসে দেবে। কী নিকৃষ্ট পানীয়! আর কী মন্দ বিশ্রামস্থল!",
    "নিশ্চয় যারা ঈমান এনেছে এবং সৎকাজ করেছে, নিশ্চয় আমি এমন কারো প্রতিদান নষ্ট করব না, যে সুকর্ম করেছে।",
    "এরাই তারা, যাদের জন্য রয়েছে স্থায়ী জান্নাতসমূহ, যার নিচ দিয়ে প্রবাহিত হয় নদীসমূহ। সেখানে তাদেরকে অলংকৃত করা হবে স্বর্ণের চুড়ি দিয়ে এবং তারা পরিধান করবে মিহি ও পুরু সিল্কের সবুজ পোশাক। তারা সেখানে (থাকবে) আসনে হেলান দিয়ে। কী উত্তম প্রতিদান এবং কী সুন্দর বিশ্রামস্থল !",
    "আর তুমি তাদের জন্য একটি দৃষ্টান্ত পেশ কর: দুই ব্যক্তি, তাদের একজনকে আমি দু’টি আঙ্গুরের বাগান দিয়েছি এবং উভয় বাগানকে ঘিরে দিয়েছি খেজুর গাছ দ্বারা এবং উভয়ের মাঝখানে রেখেছি শস্যক্ষেত।",
    "উভয় বাগান ফল দিয়েছে, তাতে কিছুই ত্রুটি করেনি এবং আমি উভয়ের মাঝ দিয়ে নদী প্রবাহিত করেছি।",
    "আর (এতে) তার ছিল বিপুল ফল-ফলাদি। তাই সে তার সঙ্গীকে কথায় কথায় বলল, ‘সম্পদে আমি তোমার চেয়ে অধিক এবং জনবলেও অনেক শক্তিশালী’।",
    "আর সে তার বাগানে প্রবেশ করল, নিজের প্রতি যুলমরত অবস্থায়। সে বলল, ‘আমি মনে করি না যে, এটি কখনো ধ্বংস হবে’।",
    "‘আর আমি মনে করি না যে, কিয়ামত সংঘটিত হবে। আর আমাকে যদি ফিরিয়ে নেয়া হয় আমার রবের কাছে, তবে নিশ্চয় আমি এর চেয়ে উত্তম প্রত্যাবর্তনস্থল পাব’।",
    "কথায় কথায় তার সঙ্গী বলল, ‘তুমি কি তাকে অস্বীকার করছ, যিনি তোমাকে সৃষ্টি করেছেন মাটি থেকে, অতঃপর ‘বীর্য’ থেকে, তারপর তোমাকে অবয়ব দিয়েছেন পুরুষের’?",
    "‘কিন্তু তিনিই আল্লাহ, আমার রব। আর আমি আমার রবের সাথে কাউকে শরীক করি না’।",
    "‘আর যখন তুমি তোমার বাগানে প্রবেশ করলে, তখন কেন তুমি বললে না, ‘মাশাআল্লাহ’! আল্লাহর তৌফিক ছাড়া কোন শক্তি নেই। তুমি যদি দেখ যে, আমি সম্পদে ও সন্তানে তোমার চেয়ে কম,",
    "তবে আশা করা যায় যে, ‘আমার রব আমাকে তোমার বাগানের চেয়ে উত্তম (কিছু) দান করবেন এবং তার উপর আসমান থেকে বজ্র পাঠাবেন। ফলে তা অনুর্বর উদ্ভিদশূন্য যমীনে পরিণত হবে’।",
    "‘কিংবা তার পানি মাটির গভীরে চলে যাবে, ফলে তা তুমি কোনভাবেই খুঁজে পাবে না’।",
    "আর (বিপর্যয়ে) তার ফল-ফলাদি ঘিরে ফেলা হল। ফলে তাতে সে যা ব্যয় করেছিল, তার জন্য (আক্ষেপে) হাত কচলাতে লাগল এবং সেটি ধ্বংস হয়েছিল তার মাচার উপর। আর সে বলছিল, ‘হায় আক্ষেপ! আমি যদি আমার রবের সাথে কাউকে শরীক না করতাম’!",
    "আর আল্লাহ ছাড়া তার এমন কোন লোকবলও ছিল না যারা তাকে সাহায্য করবে এবং সে সাহায্যপ্রাপ্তও ছিল না।",
    "এখানে অভিভাবকত্ব আল্লাহর, যিনি সত্য। তিনিই প্রতিদানে উত্তম এবং পরিণামে শ্রেষ্ঠ।",
    "আর আপনি তাদের জন্য পেশ করুন দুনিয়ার জীবনের উপমা তা পানির মত, যা আমি আসমান থেকে বর্ষণ করেছি। অতঃপর তার সাথে মিশ্রিত হয় যমীনের উদ্ভিদ। ফলে তা পরিণত হয় এমন শুকনো গুঁড়ায়, বাতাস যাকে উড়িয়ে নেয়। আর আল্লাহ সবকিছুর উপর ক্ষমতাবান।",
    "সম্পদ ও সন্তান-সন্ততি দুনিয়ার জীবনের শোভা। আর স্থায়ী সৎকাজ তোমার রবের নিকট প্রতিদানে উত্তম এবং প্রত্যাশাতেও উত্তম।",
    "স্মরণ কর সেদিনের কথা যেদিন আমি পর্বতকে করব সঞ্চালিত এবং তুমি পৃথিবীকে দেখবে একটি শূন্য প্রান্তর; সেদিন মানুষকে আমি একত্রিত করব এবং তাদের কেহকেও অব্যাহতি দিব না।",
    "আর তাদেরকে তোমার রবের সামনে উপস্থিত করা হবে কাতারবদ্ধ করে। (আল্লাহ বলবেন) ‘তোমরা আমার কাছে এসেছ তেমনভাবে, যেমন আমি তোমাদেরকে প্রথমবার সৃষ্টি করেছিলাম; বরং তোমরা তো ভেবেছিলে আমি তোমাদের জন্য কোন প্রতিশ্রুত মুহূর্ত রাখিনি’।",
    "আর আমলনামা রাখা হবে। তখন তুমি অপরাধীদেরকে দেখতে পাবে ভীত, তাতে যা রয়েছে তার কারণে। আর তারা বলবে, ‘হায় ধ্বংস আমাদের! কী হল এ কিতাবের! তা ছোট-বড় কিছুই ছাড়ে না, শুধু সংরক্ষণ করে’ এবং তারা যা করেছে, তা হাযির পাবে। আর তোমার রব কারো প্রতি যুলম করেন না।",
    "আর যখন আমি ফেরেশতাদের বলেছিলাম, তোমরা আদমকে সিজদা কর। অতঃপর তারা সিজদা করল, ইবলীস ছাড়া। সে ছিল জিনদের একজন। সে তার রবের নির্দেশ অমান্য করল। তোমরা কি তাকে ও তার বংশকে আমার পরিবর্তে অভিভাবক হিসেবে গ্রহণ করবে, অথচ তারা তোমাদের শত্রু? যালিমদের জন্য কী মন্দ বিনিময়!",
    "আমি তাদেরকে আসমানসমূহ ও যমীনের সৃষ্টির সাক্ষী করিনি এবং না তাদের নিজদের সৃষ্টির। আর আমি পথভ্রষ্টকারীদেরকে সহায়তাকারী হিসেবে গ্রহণ করিনি।",
    "আর যেদিন তিনি বলবেন, ‘তোমরা ডাক আমার শরীকদের, যাদেরকে তোমরা (শরীক) মনে করতে’। অতঃপর তারা তাদেরকে ডাকবে, কিন্তু তারা তাদের ডাকে সাড়া দেবে না। আর আমি তাদের মধ্যে রেখে দেব ধ্বংসস্থল।",
    "আর অপরাধীরা আগুন দেখবে, অতঃপর তারা নিশ্চিতরূপে জানতে পারবে যে, নিশ্চয় তারা তাতে নিপতিত হবে এবং তারা তা থেকে বাঁচার কোন পথ খুঁজে পাবে না।",
    "আর আমি এই কুরআনে মানুষের জন্য সকল প্রকার উপমা বিস্তারিত বর্ণনা করেছি। আর মানুষ সবচেয়ে বেশি তর্ককারী।",
    "আর যখন মানুষের নিকট হিদায়াত এসেছে, তখন তাদেরকে ঈমান আনতে কিংবা তাদের রবের কাছে ইস্তিগফার করতে বাধা প্রদান করেছে কেবল এ বিষয়টিই যে, পূর্ববর্তীদের (ব্যাপারে আমার নির্ধারিত) রীতি তাদের উপর পুনরায় নেমে আসবে কিংবা তাদের উপর আযাব সরাসরি এসে উপস্থিত হবে।",
    "আর আমি তো রাসূলদেরকে সুসংবাদদাতা ও সতর্ককারীরূপেই পাঠিয়েছি এবং যারা কুফরী করেছে তারা বাতিল দ্বারা তর্ক করে, যাতে তার মাধ্যমে সত্যকে মিটিয়ে দিতে পারে। আর তারা আমার আয়াতসমূহকে এবং যা দিয়ে তাদেরকে সতর্ক করা হয়েছে, তাকে উপহাস হিসেবে গ্রহণ করে।",
    "আর তার চেয়ে অধিক যালিম আর কে হতে পারে, যাকে তার রবের আয়াতসমূহ স্মরণ করিয়ে দেয়া হয়েছে, অতঃপর সে তা থেকে বিমুখ হয়েছে এবং সে ভুলে গেছে যা তার দু-হাত পেশ করেছে? নিশ্চয় আমি তাদের অন্তরসমূহের উপর পর্দা দিয়ে দিয়েছি, যাতে তারা তা (কুরআন) বুঝতে না পারে। আর তাদের কর্ণসমূহে রয়েছে বধিরতা এবং তুমি তাদেরকে হিদায়াতের প্রতি আহবান করলেও তারা কখনো হিদায়াতপ্রাপ্ত হবে না।",
    "আর তোমার রব ক্ষমাশীল, দয়াময়। তারা যা উপার্জন করেছে, তার কারণে তিনি যদি তাদেরকে পাকড়াও করতেন তবে অবশ্যই তাদের জন্য আযাব ত্বরান্বিত করতেন। বরং তাদের জন্য রয়েছে প্রতিশ্রুত সময়, যা থেকে তারা কোন আশ্রয়স্থল পাবে না।",
    "আর এগুলো সেই জনপদ যেগুলো আমি ধ্বংস করেছি যখন তারা যুলম করেছে এবং আমি তাদের ধ্বংসের জন্য একটি নির্দিষ্ট সময় নির্ধারণ করেছি।",
    "আর স্মরণ কর, যখন মূসা তার সহচর যুবকটিকে বলল, আমি চলতে থাকব যতক্ষণ না দুই সমুদ্রের মিলনস্থলে উপনীত হব কিংবা দীর্ঘ সময় কাটিয়ে দেব।",
    "এরপর যখন তারা তাদের দুই সমুদ্রের মিলনস্থলে উপনীত হল, তখন তারা তাদের মাছের কথা ভুলে গেল। ফলে মাছটি নালার মত করে সমুদ্রে তার পথ করে নিল।",
    "অতঃপর যখন তারা অগ্রসর হল তখন সে তার যুবককে বলল, ‘আমাদের সকালের খাবার নিয়ে আস। আমাদের এই সফরে আমরা অনেক ক্লান্তির মুখোমুখি হয়েছি’।",
    "সে বলল, আপনি কি লক্ষ্য করেছেন যে, যখন আমরা পাথরটিতে বিশ্রাম নিচ্ছিলাম, তখন আমি মাছটি হারিয়ে ফেলি। আর আমাকে তা স্মরণ করতে ভুলিয়েছে কেবল শয়তান এবং আশ্চর্যজনকভাবে তা সমুদ্রে তার পথ করে নিয়েছে’।",
    "সে বলল, ‘ঐ স্থানটিই আমরা খুঁজছি। তাই তারা তাদের পদচি‎হ্ন অনুসরণ করে পেছনে ফিরে গেল’।",
    "অতঃপর তারা আমার বান্দাদের মধ্য থেকে এক বান্দাকে পেল, যাকে আমি আমার পক্ষ থেকে রহমত দান করেছি এবং তাকে আমার পক্ষ থেকে জ্ঞান শিক্ষা দিয়েছি।",
    "মূসা তাঁকে বলল, ‘আমি কি আপনাকে এই শর্তে অনুসরণ করব যে, আপনাকে যে সঠিক জ্ঞান দেয়া হয়েছে, তা আমাকে শিক্ষা দেবেন’?",
    "সে বলল, ‘আপনি কখনো আমার সাথে ধৈর্যধারণ করতে পারবেন না’।",
    "‘আপনি তাতে কীভাবে ধৈর্য ধরবেন, যে সম্পর্কে আপনি জানেন না’?",
    "সে বলল, ‘ইনশাআল্লাহ, আপনি আমাকে ধৈর্যশীল পাবেন এবং কোন বিষয়ে আমি আপনার অবাধ্য হব না’।",
    "সে বলল, ‘তবে আপনি যদি আমাকে অনুসরণ করেন, তাহলে কোন বিষয় সম্পর্কে আমাকে প্রশ্ন করবেন না, যতক্ষণ না আমি সে সম্পর্কে আপনাকে জানাই’।",
    "অতঃপর তারা চলতে থাক। অবশেষে যখন তারা জাহাজে চড়ল, সে তা ফুটো করে দিল। সে বলল, ‘আপনি কি তার আরোহীদের ডুবানোর জন্য তা ফুটো করে দিলেন? আপনি অবশ্যই মন্দ কাজ করলেন’।",
    "সে বলল, ‘আমি কি বলিনি, আপনি আমার সাথে ধৈর্যধারণ করতে পারবেন না?",
    "সে বলল, ‘আমি যা ভুলে গিয়েছি, সে ব্যাপারে আমাকে ধরবেন না এবং আমাকে আমার বিষয়ে কঠোর আচরণ করবেন না।",
    "অতঃপর তারা চলতে লাগল। অবশেষে যখন তারা এক বালকের সাক্ষাৎ পেল, তখন সে তাকে হত্যা করল। সে বলল, ‘আপনি নিষ্পাপ ব্যক্তিকে হত্যা করলেন, যে কাউকে হত্যা করেনি? আপনি তো খুবই মন্দ কাজ করলেন’।",
    "সে বলল, ‘আমি কি আপনাকে বলিনি যে, আপনি আমার সাথে কখনই ধৈর্য ধারণ করতে পারবেন না’?",
    "মূসা বলল, ‘এরপর যদি আমি আপনাকে আর কোন বিষয়ে প্রশ্ন করি, তাহলে আপনি আমাকে আর আপনার সাথে রাখবেন না। আমার পক্ষ থেকে আপনি ওযর পেয়ে গেছেন’।",
    "অতঃপর তারা দু’জন চলতে শুরু করল। অবশেষে যখন তারা একটি জনপদের অধিবাসীদের নিকট পৌঁছল তখন তাদের কাছে কিছু খাবার চাইল; কিন্তু তারা তাদেরকে মেহমানদারী করতে অস্বীকার করল। অতঃপর তারা সেখানে একটি প্রাচীর দেখতে পেল, যা পড়ে যাওয়ার উপক্রম হয়েছিল। সে তখন প্রাচীরটি সোজাভাবে দাঁড় করিয়ে দিল। মূসা বলল, ‘আপনি ইচ্ছা করলে এর জন্য পারিশ্রমিক নিতে পারতেন’।",
    "সে বলল, ‘এখানেই আমার ও আপনার মধ্যে বিচ্ছেদ। যে বিষয়ে আপনি ধৈর্য ধারণ করতে পারেননি আমি এখন আপনাকে তার ব্যাখ্যা দিচ্ছি’।",
    "‘নৌকাটির বিষয় হল, তা ছিল কিছু দরিদ্র লোকের যারা সমুদ্রে কাজ করত। আমি নৌকাটিকে ত্রুটিযুক্ত করতে চেয়েছি কারণ তাদের পেছনে ছিল এক রাজা, যে নৌকাগুলো জোরপূর্বক ছিনিয়ে নিচ্ছিল’।",
    "‘আর বালকটির বিষয় হল, তার পিতা-মাতা ছিল মুমিন। অতঃপর আমি আশংকা* করলাম যে, সে সীমালংঘন ও কুফরী দ্বারা তাদেরকে অতিষ্ঠ করে তুলবে’। \n* তাঁর আশংকা নিছক ধারণা ভিত্তিক ছিল না, বরং আল্লাহর পক্ষ থেকে তিনি নিশ্চিত জানতে পেরেছিলেন।",
    "‘তাই আমি চাইলাম, তাদের রব তাদেরকে তার পরিবর্তে এমন সন্তান দান করবেন, যে হবে তার চেয়ে পবিত্রতায় উত্তম এবং দয়ামায়ায় অধিক ঘনিষ্ঠ।",
    "‘আর প্রাচীরটির বিষয় হল, তা ছিল শহরের দু’জন ইয়াতীম বালকের এবং তার নিচে ছিল তাদের গুপ্তধন। আর তাদের পিতা ছিল সৎকর্মপরায়ণ। তাই আপনার রব চাইলেন যে, তারা দু’জন প্রাপ্তবয়স্ক হয়ে তাদের গুপ্তধন বের করে নেবে। এ সবই আপনার রবের রহমত স্বরূপ। আমি নিজ থেকে তা করিনি। এ হলো সে বিষয়ের ব্যাখ্যা, যে সম্পর্কে আপনি ধৈর্য ধারণ করতে পারেননি।",
    "আর তারা তোমাকে যুলকারনাইন সম্পর্কে জিজ্ঞাসা করছে। বল, ‘আমি এখন তার সম্পর্কে তোমাদের নিকট বর্ণনা দিচ্ছি’।",
    "আমি তাকে যমীনে কর্তৃত্ব দান করেছিলাম এবং সববিষয়ের উপায়- উপকরণ দান করেছিলাম।",
    "অতঃপর সে একটি পথ অবলম্বন করল।",
    "অবশেষে যখন সে সূর্যাস্তের স্থানে পৌঁছল, তখন সে সূর্যকে একটি কর্দমাক্ত পানির ঝর্ণায় ডুবতে দেখতে পেল এবং সে এর কাছে একটি জাতির দেখা পেল। আমি বললাম, ‘হে যুলকারনাইন, তুমি তাদেরকে আযাবও দিতে পার অথবা তাদের ব্যাপারে সদাচরণও করতে পার’।",
    "সে বলল, ‘যে ব্যক্তি যুলম করবে, আমি অচিরেই তাকে শাস্তি দেব। অতঃপর তাকে তার রবের নিকট ফিরিয়ে নেয়া হবে। তখন তিনি তাকে কঠিন আযাব দেবেন’।",
    "‘আর যে ব্যক্তি ঈমান আনবে এবং সৎকাজ করবে, তার জন্য রয়েছে উত্তম পুরস্কার। আর আমি আমার ব্যবহারে তার সাথে নরম কথা বলব’।",
    "তারপর সে আরেক পথ অবলম্বন করল।",
    "অবশেষে সে যখন সূর্যোদয়ের স্থানে এসে পৌঁছল তখন সে দেখতে পেল, তা এমন এক জাতির উপর উদিত হচ্ছে যাদের জন্য আমি সূর্যের বিপরীতে কোন আড়ালের ব্যবস্থা করিনি।",
    "প্রকৃত ঘটনা এটাই। আর তার নিকট যা ছিল, আমি সে সম্পর্কে সম্পূর্ণ অবহিত।",
    "তারপর সে আরেক পথ অবলম্বন করল।",
    "অবশেষে যখন সে দুই পর্বতের মধ্যবর্তী স্থানে পৌঁছল, তখন সেখানে সে এমন এক জাতিকে পেল, যারা তার কথা তেমন একটা বুঝতে পারছিল না।",
    "তারা বলল, ‘হে যুলকারনাইন! নিশ্চয় ইয়া’জূজ ও মা’জূজ যমীনে অশান্তি সৃষ্টি করছে, তাই আমরা কি আপনাকে এ জন্য কিছু খরচ দেব যে, আপনি আমাদের ও তাদের মধ্যে একটা প্রাচীর নির্মাণ করে দেবেন’?",
    "সে বলল, ‘আমার রব আমাকে যে সামর্থ্য দিয়েছেন, সেটাই উত্তম। সুতরাং তোমরা আমাকে শ্রম দিয়ে সাহায্য কর। আমি তোমাদের ও তাদের মাঝখানে একটি সুদৃঢ় প্রাচীর নির্মাণ করে দেব’।",
    "‘তোমরা আমাকে লোহার পাত এনে দাও’। অবশেষে যখন সে দু’পাহাড়ের মধ্যবর্তী জায়গা সমান করে দিল, তখন সে বলল, ‘তোমরা ফুঁক দিতে থাক’। অতঃপর যখন সে তা আগুনে পরিণত করল, তখন বলল, ‘তোমরা আমাকে কিছু তামা দাও, আমি তা এর উপর ঢেলে দেই’।",
    "এরপর তারা (ইয়া’জূজ ও মা’জূজ) প্রাচীরের উপর দিয়ে অতিক্রম করতে পারল না এবং নিচ দিয়েও তা ভেদ করতে পারল না।",
    "সে বলল, ‘এটা আমার রবের অনুগ্রহ। অতঃপর যখন আমার রবের ওয়াদাকৃত সময় আসবে তখন তিনি তা মাটির সাথে মিশিয়ে দেবেন। আর আমার রবের ওয়াদা সত্য’।",
    "আর সেদিন আমি তাদেরকে এমন অবস্থায় ছেড়ে দেব যে, তারা একদল আরেক দলের উপর তরঙ্গমালার মত আছড়ে পড়বে এবং শিঙ্গায় ফুঁক দেয়া হবে। অতঃপর আমি তাদের সকলকে একত্র করব।",
    "এবং আমি সেদিন কাফিরদের জন্য জাহান্নামকে সরাসরি উপস্থিত করব;",
    "আমার স্মরণ থেকে যাদের চোখ ছিল আবরণে ঢাকা এবং যারা শুনতেও ছিল অক্ষম।",
    "যারা কুফরী করছে, তারা কি মনে করেছে যে, তারা আমার পরিবর্তে আমার বান্দাদেরকে অভিভাবকরূপে গ্রহণ করবে? নিশ্চয় আমি জাহান্নামকে কাফিরদের আপ্যায়নের জন্য প্রস্তুত করছি।",
    "বল, ‘আমি কি তোমাদেরকে এমন লোকদের কথা জানাব, যারা আমলের দিক থেকে সবচেয়ে বেশী ক্ষতিগ্রস্ত’?",
    "দুনিয়ার জীবনে যাদের চেষ্টা ব্যর্থ হয়ে গেছে, অথচ তারা মনে করছে যে, তারা ভাল কাজই করছে’!",
    "‘তারাই সেসব লোক, যারা তাদের রবের আয়াতসমূহ এবং তাঁর সাথে সাক্ষাতকে অস্বীকার করেছে। ফলে তাদের সকল আমল নিষ্ফল হয়ে গেছে। সুতরাং আমি তাদের জন্য কিয়ামতের দিন কোন ওজনের ব্যবস্থা রাখব না’।",
    "‘এ জন্যই তাদের প্রতিফল জাহান্নাম। কারণ তারা কুফরী করেছে এবং আমার আয়াতসমূহ ও আমার রাসূলগণকে বিদ্রূপের বিষয় বানিয়েছে’।",
    "নিশ্চয় যারা ঈমান এনেছে এবং সৎকাজ করেছে, তাদের মেহমানদারির জন্য রয়েছে জান্নাতুল ফেরদাউস।",
    "সেখানে তারা স্থায়ী হবে। তারা সেখান থেকে অন্য কোথাও স্থানান্তরিত হতে চাইবে না।",
    "বল, ‘আমার রবের কথা লেখার জন্য সমুদ্র যদি কালি হয়ে যায় তবে সমুদ্র নিঃশেষ হয়ে যাবে আমার রবের কথা শেষ হওয়ার আগেই। যদিও এর সাহায্যার্থে অনুরূপ আরো সমুদ্র নিয়ে আসি’।",
    "বল, ‘আমি তোমাদের মতই একজন মানুষ। আমার নিকট ওহী প্রেরণ করা হয় যে, তোমাদের ইলাহই এক ইলাহ। সুতরাং যে তার রবের সাক্ষাৎ কামনা করে, সে যেন সৎকর্ম করে এবং তার রবের ইবাদাতে কাউকে শরীক না করে’।"
  ]
}