{
  "surahName": "Az-Zukhruf",
  "surahNameArabic": "الزخرف",
  "surahNameArabicLong": "سورة الزخرف",
  "surahNameTranslation": "Ornaments of gold",
  "revelationPlace": "Mecca",
  "totalAyah": 89,
  "surahNo": 43,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/43.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/043.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/43.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/043.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/43.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/043.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/43.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/043.mp3"
    }
  },
  "english": [
    "Ḥâ-Mĩm.",
    "By the clear Book!",
    "Certainly, We have made it a Quran in Arabic so perhaps you will understand.",
    "And indeed, it is—in the Master Record with Us—highly esteemed, rich in wisdom.",
    "Should We then turn the ˹Quranic˺ Reminder away from you ˹simply˺ because you have been a transgressing people?",
    "˹Imagine˺ how many prophets We sent to those ˹destroyed˺ before!",
    "But no prophet ever came to them without being mocked.",
    "So We destroyed those who were far mightier than these ˹Meccans˺. The examples of ˹their˺ predecessors have ˹already˺ been related.",
    "If you ask them ˹O Prophet˺ who created the heavens and the earth, they will certainly say, “The Almighty, All-Knowing did.”",
    "˹He is the One˺ Who has laid out the earth for you, and set in it pathways for you so that you may find your way.",
    "And ˹He is the One˺ Who sends down rain from the sky in perfect measure, with which We give life to a lifeless land. And so will you be brought forth ˹from the grave˺.",
    "And ˹He is the One˺ Who created all ˹things in˺ pairs, and made for you ships and animals to ride",
    "so that you may sit firmly on their backs, and remember your Lord’s blessings once you are settled on them, saying, “Glory be to the One Who has subjected these for us, for we could have never done so ˹on our own˺.",
    "And surely to our Lord we will ˹all˺ return.”",
    "Still the pagans have made some of His creation out to be a part of Him. Indeed, humankind is clearly ungrateful.",
    "Has He taken ˹angels as His˺ daughters from what He created, and favoured you ˹O pagans˺ with sons?",
    "Whenever one of them is given the good news of what they attribute to the Most Compassionate, his face grows gloomy, as he suppresses his rage.",
    "˹Do they attribute to Him˺ those who are brought up in fineries and are not commanding in disputes?",
    "Still they have labelled the angels, who are servants of the Most Compassionate, as female. Did they witness their creation? Their statement will be recorded, and they will be questioned!",
    "And they argue, “Had the Most Compassionate willed, we would have never worshipped them.” They have no knowledge ˹in support˺ of this ˹claim˺. They do nothing but lie.",
    "Or have We given them a Book ˹for proof˺, before this ˹Quran˺, to which they are holding firm?",
    "In fact, they say, “We found our forefathers following a ˹particular˺ way, and we are following in their footsteps.”",
    "Similarly, whenever We sent a warner to a society before you ˹O Prophet˺, its ˹spoiled˺ elite would say, “We found our forefathers following a ˹particular˺ way, and we are walking in their footsteps.”",
    "Each ˹warner˺ asked, “Even if what I brought you is better guidance than what you found your forefathers practicing?” They replied, “We totally reject whatever you have been sent with.”",
    "So We inflicted punishment upon them. See then what was the fate of the deniers!",
    "˹Remember, O  Prophet˺ when Abraham declared to his father and his people, “I am totally free of whatever ˹gods˺ you worship",
    "except the One Who originated me, and He will surely guide me.”",
    "And he left this enduring declaration among his descendants, so they may ˹always˺ turn back ˹to Allah˺.",
    "In fact, I had allowed enjoyment for these ˹Meccans˺ and their forefathers, until the truth came to them along with a messenger making things clear.",
    "˹But˺ when the truth came to them, they said, “This is magic, and we totally reject it.”",
    "And they exclaimed, “If only this Quran was revealed to a great man from ˹one of˺ the two cities!”",
    "Is it they who distribute your Lord’s mercy? We ˹alone˺ have distributed their ˹very˺ livelihood among them in this worldly life and raised some of them in rank above others so that some may employ others in service. ˹But˺ your Lord’s mercy is far better than whatever ˹wealth˺ they amass.",
    "Were it not that people might ˹be tempted to˺ become one community ˹of disbelievers˺, We would have supplied the homes of ˹only˺ those who disbelieve in the Most Compassionate with silver roofs and ˹silver˺ stairways to ascend",
    "as well as ˹silver˺ gates and thrones to recline on",
    "and ornaments ˹of gold˺. Yet all this is no more than a ˹fleeting˺ enjoyment in this worldly life. ˹But˺ the Hereafter with your Lord is ˹only˺ for those mindful ˹of Him˺.",
    "And whoever turns a blind eye to the Reminder of the Most Compassionate, We place at the disposal of each a devilish one as their close associate",
    "who will certainly hinder them from the ˹Right˺ Way while they think they are ˹rightly˺ guided.",
    "But when such a person comes to Us, one will say ˹to their associate˺, “I wish you were as distant from me as the east is from the west! What an evil associate ˹you were˺!”",
    "˹It will be said to both,˺ “Since you all did wrong, sharing in the punishment will be of no benefit to you this Day.”",
    "Can you make the deaf hear, or guide the blind or those clearly astray?",
    "Even if We take you away ˹from this world˺, We will surely inflict punishment upon them.",
    "Or if We show you what We threaten them with, We certainly have full power over them.",
    "So hold firmly to what has been revealed to you ˹O Prophet˺. You are truly on the Straight Path.",
    "Surely this ˹Quran˺ is a glory for you and your people. And you will ˹all˺ be questioned ˹about it˺.",
    "Ask ˹the followers of˺ the messengers that We already sent before you if We ˹ever˺ appointed ˹other˺ gods to be worshipped besides the Most Compassionate.",
    "Indeed, We sent Moses with Our signs to Pharaoh and his chiefs, and he said: “I am a messenger of the Lord of all worlds.”",
    "But as soon as he came to them with Our signs, they laughed at them",
    "although every sign We showed them was greater than the one before. Ultimately, We seized them with torments so that they might return ˹to the Right Path˺.",
    "˹Then˺ they pleaded, “O ˹mighty˺ magician! Pray to your Lord on our behalf, by virtue of the covenant He made with you. We will certainly accept guidance.”",
    "But as soon as We removed the torments from them, they broke their promise.",
    "And Pharaoh called out to his people, boasting, “O my people! Am I not sovereign over Egypt as well as ˹all˺ these streams flowing at my feet? Can you not see?",
    "Am I not better than this nobody who can hardly express himself?",
    "Why then have no golden bracelets ˹of kingship˺ been granted to him or angels come with him as escorts!”",
    "And so he fooled his people, and they obeyed him. They were truly a rebellious people.",
    "So when they enraged Us, We inflicted punishment upon them, drowning them all.",
    "And We made them an example and a lesson for those after them.",
    "When the son of Mary was cited as an example ˹in argument˺, your people ˹O Prophet˺ broke into ˹joyful˺ applause.",
    "They exclaimed, “Which is better: our gods or Jesus?” They cite him only to argue. In fact, they are a people prone to dispute.",
    "He was only a servant We showed favour to, and made as an example for the Children of Israel.",
    "Had We willed, We could have easily replaced you ˹all˺ with angels, succeeding one another on earth.",
    "And his ˹second˺ coming is truly a sign for the Hour. So have no doubt about it, and follow me. This is the Straight Path.",
    "And do not let Satan hinder you, ˹for˺ he is certainly your sworn enemy.",
    "When Jesus came with clear proofs, he declared, “I have come to you with wisdom, and to clarify to you some of what you differ about. So fear Allah, and obey me.",
    "Surely Allah ˹alone˺ is my Lord and your Lord, so worship Him ˹alone˺. This is the Straight Path.”",
    "Yet their ˹various˺ groups have differed among themselves ˹about him˺, so woe to the wrongdoers when they face the torment of a painful Day!",
    "Are they waiting for the Hour to take them by surprise when they least expect ˹it˺?",
    "Close friends will be enemies to one another on that Day, except the righteous",
    "˹who will be told,˺ “O My servants! There is no fear for you Today, nor will you grieve—",
    "˹those˺ who believed in Our signs and ˹fully˺ submitted ˹to Us˺.",
    "Enter Paradise, you and your spouses, rejoicing.”",
    "Golden trays and cups will be passed around to them. There will be whatever the souls desire and the eyes delight in. And you will be there forever.",
    "That is the Paradise which you will be awarded for what you used to do.",
    "There you will have abundant fruit to eat from.",
    "Indeed, the wicked will be in the torment of Hell forever.",
    "It will never be lightened for them, and there they will be overwhelmed with despair.",
    "We did not wrong them, but it was they who were the wrongdoers.",
    "They will cry, “O Mâlik! Let your Lord finish us off.” He will answer, “You are definitely here to stay.”",
    "We certainly brought the truth to you, but most of you were resentful of the truth.",
    "Or have they mastered some ˹evil˺ plan? Then We ˹too˺ are surely planning.",
    "Or do they think that We do not hear their ˹evil˺ thoughts and secret talks? Yes ˹We do˺! And Our messenger-angels are in their presence, recording ˹it all˺.",
    "Say, ˹O Prophet,˺ “If the Most Compassionate ˹really˺ had offspring, I would be the first worshipper.”",
    "Glorified is the Lord of the heavens and the earth, the Lord of the Throne, far above what they claim.",
    "So let them indulge ˹in falsehood˺ and amuse ˹themselves˺ until they face their Day, which they have been warned of.",
    "It is He Who is ˹the only˺ God in the heavens and ˹the only˺ God on the earth. For He is the All-Wise, All-Knowing.",
    "And Blessed is the One to Whom belongs the kingdom of the heavens and the earth and everything in between! With Him ˹alone˺ is the knowledge of the Hour. And to Him you will ˹all˺ be returned.",
    "˹But˺ those ˹objects of worship˺ they invoke besides Him have no power to intercede, except those who testify to the truth knowingly.",
    "If you ask them ˹O Prophet˺ who created them, they will certainly say, “Allah!” How can they then be deluded ˹from the truth˺?",
    "˹Allah is Aware of˺ the Prophet’s cry: “O my Lord! Indeed, these are a people who persist in disbelief.”",
    "So bear with them and respond with peace. They will soon come to know."
  ],
  "arabic1": [
    "حٰمٓ",
    "وَالْكِتٰبِ الْمُبِیْنِ",
    "اِنَّا جَعَلْنٰهُ قُرْءٰنًا عَرَبِیًّا لَّعَلَّكُمْ تَعْقِلُوْنَ",
    "وَاِنَّهٗ فِیْۤ اُمِّ الْكِتٰبِ لَدَیْنَا لَعَلِیٌّ حَكِیْمٌ",
    "اَفَنَضْرِبُ عَنْكُمُ الذِّكْرَ صَفْحًا اَنْ كُنْتُمْ قَوْمًا مُّسْرِفِیْنَ",
    "وَكَمْ اَرْسَلْنَا مِنْ نَّبِیٍّ فِی الْاَوَّلِیْنَ",
    "وَمَا یَاْتِیْهِمْ مِّنْ نَّبِیٍّ اِلَّا كَانُوْا بِهٖ یَسْتَهْزِءُوْنَ",
    "فَاَهْلَكْنَاۤ اَشَدَّ مِنْهُمْ بَطْشًا وَّمَضٰی مَثَلُ الْاَوَّلِیْنَ",
    "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ لَیَقُوْلُنَّ خَلَقَهُنَّ الْعَزِیْزُ الْعَلِیْمُ",
    "الَّذِیْ جَعَلَ لَكُمُ الْاَرْضَ مَهْدًا وَّجَعَلَ لَكُمْ فِیْهَا سُبُلًا لَّعَلَّكُمْ تَهْتَدُوْنَ",
    "وَالَّذِیْ نَزَّلَ مِنَ السَّمَآءِ مَآءً بِقَدَرٍ فَاَنْشَرْنَا بِهٖ بَلْدَةً مَّیْتًا كَذٰلِكَ تُخْرَجُوْنَ",
    "وَالَّذِیْ خَلَقَ الْاَزْوَاجَ كُلَّهَا وَجَعَلَ لَكُمْ مِّنَ الْفُلْكِ وَالْاَنْعَامِ مَا تَرْكَبُوْنَ",
    "لِتَسْتَوٗا عَلٰی ظُهُوْرِهٖ ثُمَّ تَذْكُرُوْا نِعْمَةَ رَبِّكُمْ اِذَا اسْتَوَیْتُمْ عَلَیْهِ وَتَقُوْلُوْا سُبْحٰنَ الَّذِیْ سَخَّرَ لَنَا هٰذَا وَمَا كُنَّا لَهٗ مُقْرِنِیْنَ",
    "وَاِنَّاۤ اِلٰی رَبِّنَا لَمُنْقَلِبُوْنَ",
    "وَجَعَلُوْا لَهٗ مِنْ عِبَادِهٖ جُزْءًا اِنَّ الْاِنْسَانَ لَكَفُوْرٌ مُّبِیْنٌ",
    "اَمِ اتَّخَذَ مِمَّا یَخْلُقُ بَنٰتٍ وَّاَصْفٰىكُمْ بِالْبَنِیْنَ",
    "وَاِذَا بُشِّرَ اَحَدُهُمْ بِمَا ضَرَبَ لِلرَّحْمٰنِ مَثَلًا ظَلَّ وَجْهُهٗ مُسْوَدًّا وَّهُوَ كَظِیْمٌ",
    "اَوَمَنْ یُّنَشَّؤُا فِی الْحِلْیَةِ وَهُوَ فِی الْخِصَامِ غَیْرُ مُبِیْنٍ",
    "وَجَعَلُوا الْمَلٰٓىِٕكَةَ الَّذِیْنَ هُمْ عِبٰدُ الرَّحْمٰنِ اِنَاثًا اَشَهِدُوْا خَلْقَهُمْ سَتُكْتَبُ شَهَادَتُهُمْ وَیُسْـَٔلُوْنَ",
    "وَقَالُوْا لَوْ شَآءَ الرَّحْمٰنُ مَا عَبَدْنٰهُمْ مَا لَهُمْ بِذٰلِكَ مِنْ عِلْمٍ اِنْ هُمْ اِلَّا یَخْرُصُوْنَ",
    "اَمْ اٰتَیْنٰهُمْ كِتٰبًا مِّنْ قَبْلِهٖ فَهُمْ بِهٖ مُسْتَمْسِكُوْنَ",
    "بَلْ قَالُوْۤا اِنَّا وَجَدْنَاۤ اٰبَآءَنَا عَلٰۤی اُمَّةٍ وَّاِنَّا عَلٰۤی اٰثٰرِهِمْ مُّهْتَدُوْنَ",
    "وَكَذٰلِكَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ فِیْ قَرْیَةٍ مِّنْ نَّذِیْرٍ اِلَّا قَالَ مُتْرَفُوْهَاۤ اِنَّا وَجَدْنَاۤ اٰبَآءَنَا عَلٰۤی اُمَّةٍ وَّاِنَّا عَلٰۤی اٰثٰرِهِمْ مُّقْتَدُوْنَ",
    "قٰلَ اَوَلَوْ جِئْتُكُمْ بِاَهْدٰی مِمَّا وَجَدْتُّمْ عَلَیْهِ اٰبَآءَكُمْ قَالُوْۤا اِنَّا بِمَاۤ اُرْسِلْتُمْ بِهٖ كٰفِرُوْنَ",
    "فَانْتَقَمْنَا مِنْهُمْ فَانْظُرْ كَیْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِیْنَ",
    "وَاِذْ قَالَ اِبْرٰهِیْمُ لِاَبِیْهِ وَقَوْمِهٖۤ اِنَّنِیْ بَرَآءٌ مِّمَّا تَعْبُدُوْنَ",
    "اِلَّا الَّذِیْ فَطَرَنِیْ فَاِنَّهٗ سَیَهْدِیْنِ",
    "وَجَعَلَهَا كَلِمَةً بَاقِیَةً فِیْ عَقِبِهٖ لَعَلَّهُمْ یَرْجِعُوْنَ",
    "بَلْ مَتَّعْتُ هٰۤؤُلَآءِ وَاٰبَآءَهُمْ حَتّٰی جَآءَهُمُ الْحَقُّ وَرَسُوْلٌ مُّبِیْنٌ",
    "وَلَمَّا جَآءَهُمُ الْحَقُّ قَالُوْا هٰذَا سِحْرٌ وَّاِنَّا بِهٖ كٰفِرُوْنَ",
    "وَقَالُوْا لَوْلَا نُزِّلَ هٰذَا الْقُرْاٰنُ عَلٰی رَجُلٍ مِّنَ الْقَرْیَتَیْنِ عَظِیْمٍ",
    "اَهُمْ یَقْسِمُوْنَ رَحْمَتَ رَبِّكَ نَحْنُ قَسَمْنَا بَیْنَهُمْ مَّعِیْشَتَهُمْ فِی الْحَیٰوةِ الدُّنْیَا وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجٰتٍ لِّیَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِیًّا وَرَحْمَتُ رَبِّكَ خَیْرٌ مِّمَّا یَجْمَعُوْنَ",
    "وَلَوْلَاۤ اَنْ یَّكُوْنَ النَّاسُ اُمَّةً وَّاحِدَةً لَّجَعَلْنَا لِمَنْ یَّكْفُرُ بِالرَّحْمٰنِ لِبُیُوْتِهِمْ سُقُفًا مِّنْ فِضَّةٍ وَّمَعَارِجَ عَلَیْهَا یَظْهَرُوْنَ",
    "وَلِبُیُوْتِهِمْ اَبْوَابًا وَّسُرُرًا عَلَیْهَا یَتَّكِـُٔوْنَ",
    "وَزُخْرُفًا وَاِنْ كُلُّ ذٰلِكَ لَمَّا مَتَاعُ الْحَیٰوةِ الدُّنْیَا وَالْاٰخِرَةُ عِنْدَ رَبِّكَ لِلْمُتَّقِیْنَ",
    "وَمَنْ یَّعْشُ عَنْ ذِكْرِ الرَّحْمٰنِ نُقَیِّضْ لَهٗ شَیْطٰنًا فَهُوَ لَهٗ قَرِیْنٌ",
    "وَاِنَّهُمْ لَیَصُدُّوْنَهُمْ عَنِ السَّبِیْلِ وَیَحْسَبُوْنَ اَنَّهُمْ مُّهْتَدُوْنَ",
    "حَتّٰۤی اِذَا جَآءَنَا قَالَ یٰلَیْتَ بَیْنِیْ وَبَیْنَكَ بُعْدَ الْمَشْرِقَیْنِ فَبِئْسَ الْقَرِیْنُ",
    "وَلَنْ یَّنْفَعَكُمُ الْیَوْمَ اِذْ ظَّلَمْتُمْ اَنَّكُمْ فِی الْعَذَابِ مُشْتَرِكُوْنَ",
    "اَفَاَنْتَ تُسْمِعُ الصُّمَّ اَوْ تَهْدِی الْعُمْیَ وَمَنْ كَانَ فِیْ ضَلٰلٍ مُّبِیْنٍ",
    "فَاِمَّا نَذْهَبَنَّ بِكَ فَاِنَّا مِنْهُمْ مُّنْتَقِمُوْنَ",
    "اَوْ نُرِیَنَّكَ الَّذِیْ وَعَدْنٰهُمْ فَاِنَّا عَلَیْهِمْ مُّقْتَدِرُوْنَ",
    "فَاسْتَمْسِكْ بِالَّذِیْۤ اُوْحِیَ اِلَیْكَ اِنَّكَ عَلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "وَاِنَّهٗ لَذِكْرٌ لَّكَ وَلِقَوْمِكَ وَسَوْفَ تُسْـَٔلُوْنَ",
    "وَسْـَٔلْ مَنْ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رُّسُلِنَاۤ اَجَعَلْنَا مِنْ دُوْنِ الرَّحْمٰنِ اٰلِهَةً یُّعْبَدُوْنَ",
    "وَلَقَدْ اَرْسَلْنَا مُوْسٰی بِاٰیٰتِنَاۤ اِلٰی فِرْعَوْنَ وَمَلَاۡىِٕهٖ فَقَالَ اِنِّیْ رَسُوْلُ رَبِّ الْعٰلَمِیْنَ",
    "فَلَمَّا جَآءَهُمْ بِاٰیٰتِنَاۤ اِذَا هُمْ مِّنْهَا یَضْحَكُوْنَ",
    "وَمَا نُرِیْهِمْ مِّنْ اٰیَةٍ اِلَّا هِیَ اَكْبَرُ مِنْ اُخْتِهَا وَاَخَذْنٰهُمْ بِالْعَذَابِ لَعَلَّهُمْ یَرْجِعُوْنَ",
    "وَقَالُوْا یٰۤاَیُّهَ السّٰحِرُ ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِنْدَكَ اِنَّنَا لَمُهْتَدُوْنَ",
    "فَلَمَّا كَشَفْنَا عَنْهُمُ الْعَذَابَ اِذَا هُمْ یَنْكُثُوْنَ",
    "وَنَادٰی فِرْعَوْنُ فِیْ قَوْمِهٖ قَالَ یٰقَوْمِ اَلَیْسَ لِیْ مُلْكُ مِصْرَ وَهٰذِهِ الْاَنْهٰرُ تَجْرِیْ مِنْ تَحْتِیْ اَفَلَا تُبْصِرُوْنَ",
    "اَمْ اَنَا خَیْرٌ مِّنْ هٰذَا الَّذِیْ هُوَ مَهِیْنٌ وَّلَا یَكَادُ یُبِیْنُ",
    "فَلَوْلَاۤ اُلْقِیَ عَلَیْهِ اَسْوِرَةٌ مِّنْ ذَهَبٍ اَوْ جَآءَ مَعَهُ الْمَلٰٓىِٕكَةُ مُقْتَرِنِیْنَ",
    "فَاسْتَخَفَّ قَوْمَهٗ فَاَطَاعُوْهُ اِنَّهُمْ كَانُوْا قَوْمًا فٰسِقِیْنَ",
    "فَلَمَّاۤ اٰسَفُوْنَا انْتَقَمْنَا مِنْهُمْ فَاَغْرَقْنٰهُمْ اَجْمَعِیْنَ",
    "فَجَعَلْنٰهُمْ سَلَفًا وَّمَثَلًا لِّلْاٰخِرِیْنَ",
    "وَلَمَّا ضُرِبَ ابْنُ مَرْیَمَ مَثَلًا اِذَا قَوْمُكَ مِنْهُ یَصِدُّوْنَ",
    "وَقَالُوْۤا ءَاٰلِهَتُنَا خَیْرٌ اَمْ هُوَ مَا ضَرَبُوْهُ لَكَ اِلَّا جَدَلًا بَلْ هُمْ قَوْمٌ خَصِمُوْنَ",
    "اِنْ هُوَ اِلَّا عَبْدٌ اَنْعَمْنَا عَلَیْهِ وَجَعَلْنٰهُ مَثَلًا لِّبَنِیْۤ اِسْرَآءِیْلَ",
    "وَلَوْ نَشَآءُ لَجَعَلْنَا مِنْكُمْ مَّلٰٓىِٕكَةً فِی الْاَرْضِ یَخْلُفُوْنَ",
    "وَاِنَّهٗ لَعِلْمٌ لِّلسَّاعَةِ فَلَا تَمْتَرُنَّ بِهَا وَاتَّبِعُوْنِ هٰذَا صِرَاطٌ مُّسْتَقِیْمٌ",
    "وَلَا یَصُدَّنَّكُمُ الشَّیْطٰنُ اِنَّهٗ لَكُمْ عَدُوٌّ مُّبِیْنٌ",
    "وَلَمَّا جَآءَ عِیْسٰی بِالْبَیِّنٰتِ قَالَ قَدْ جِئْتُكُمْ بِالْحِكْمَةِ وَلِاُبَیِّنَ لَكُمْ بَعْضَ الَّذِیْ تَخْتَلِفُوْنَ فِیْهِ فَاتَّقُوا اللّٰهَ وَاَطِیْعُوْنِ",
    "اِنَّ اللّٰهَ هُوَ رَبِّیْ وَرَبُّكُمْ فَاعْبُدُوْهُ هٰذَا صِرَاطٌ مُّسْتَقِیْمٌ",
    "فَاخْتَلَفَ الْاَحْزَابُ مِنْ بَیْنِهِمْ فَوَیْلٌ لِّلَّذِیْنَ ظَلَمُوْا مِنْ عَذَابِ یَوْمٍ اَلِیْمٍ",
    "هَلْ یَنْظُرُوْنَ اِلَّا السَّاعَةَ اَنْ تَاْتِیَهُمْ بَغْتَةً وَّهُمْ لَا یَشْعُرُوْنَ",
    "اَلْاَخِلَّآءُ یَوْمَىِٕذٍ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ اِلَّا الْمُتَّقِیْنَ",
    "یٰعِبَادِ لَا خَوْفٌ عَلَیْكُمُ الْیَوْمَ وَلَاۤ اَنْتُمْ تَحْزَنُوْنَ",
    "اَلَّذِیْنَ اٰمَنُوْا بِاٰیٰتِنَا وَكَانُوْا مُسْلِمِیْنَ",
    "اُدْخُلُوا الْجَنَّةَ اَنْتُمْ وَاَزْوَاجُكُمْ تُحْبَرُوْنَ",
    "یُطَافُ عَلَیْهِمْ بِصِحَافٍ مِّنْ ذَهَبٍ وَّاَكْوَابٍ وَفِیْهَا مَا تَشْتَهِیْهِ الْاَنْفُسُ وَتَلَذُّ الْاَعْیُنُ وَاَنْتُمْ فِیْهَا خٰلِدُوْنَ",
    "وَتِلْكَ الْجَنَّةُ الَّتِیْۤ اُوْرِثْتُمُوْهَا بِمَا كُنْتُمْ تَعْمَلُوْنَ",
    "لَكُمْ فِیْهَا فَاكِهَةٌ كَثِیْرَةٌ مِّنْهَا تَاْكُلُوْنَ",
    "اِنَّ الْمُجْرِمِیْنَ فِیْ عَذَابِ جَهَنَّمَ خٰلِدُوْنَ",
    "لَا یُفَتَّرُ عَنْهُمْ وَهُمْ فِیْهِ مُبْلِسُوْنَ",
    "وَمَا ظَلَمْنٰهُمْ وَلٰكِنْ كَانُوْا هُمُ الظّٰلِمِیْنَ",
    "وَنَادَوْا یٰمٰلِكُ لِیَقْضِ عَلَیْنَا رَبُّكَ قَالَ اِنَّكُمْ مّٰكِثُوْنَ",
    "لَقَدْ جِئْنٰكُمْ بِالْحَقِّ وَلٰكِنَّ اَكْثَرَكُمْ لِلْحَقِّ كٰرِهُوْنَ",
    "اَمْ اَبْرَمُوْۤا اَمْرًا فَاِنَّا مُبْرِمُوْنَ",
    "اَمْ یَحْسَبُوْنَ اَنَّا لَا نَسْمَعُ سِرَّهُمْ وَنَجْوٰىهُمْ بَلٰی وَرُسُلُنَا لَدَیْهِمْ یَكْتُبُوْنَ",
    "قُلْ اِنْ كَانَ لِلرَّحْمٰنِ وَلَدٌ ۖ فَاَنَا اَوَّلُ الْعٰبِدِیْنَ",
    "سُبْحٰنَ رَبِّ السَّمٰوٰتِ وَالْاَرْضِ رَبِّ الْعَرْشِ عَمَّا یَصِفُوْنَ",
    "فَذَرْهُمْ یَخُوْضُوْا وَیَلْعَبُوْا حَتّٰی یُلٰقُوْا یَوْمَهُمُ الَّذِیْ یُوْعَدُوْنَ",
    "وَهُوَ الَّذِیْ فِی السَّمَآءِ اِلٰهٌ وَّفِی الْاَرْضِ اِلٰهٌ وَهُوَ الْحَكِیْمُ الْعَلِیْمُ",
    "وَتَبٰرَكَ الَّذِیْ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَیْنَهُمَا وَعِنْدَهٗ عِلْمُ السَّاعَةِ وَاِلَیْهِ تُرْجَعُوْنَ",
    "وَلَا یَمْلِكُ الَّذِیْنَ یَدْعُوْنَ مِنْ دُوْنِهِ الشَّفَاعَةَ اِلَّا مَنْ شَهِدَ بِالْحَقِّ وَهُمْ یَعْلَمُوْنَ",
    "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَهُمْ لَیَقُوْلُنَّ اللّٰهُ فَاَنّٰی یُؤْفَكُوْنَ",
    "وَقِیْلِهٖ یٰرَبِّ اِنَّ هٰۤؤُلَآءِ قَوْمٌ لَّا یُؤْمِنُوْنَ",
    "فَاصْفَحْ عَنْهُمْ وَقُلْ سَلٰمٌ فَسَوْفَ یَعْلَمُوْنَ"
  ],
  "bengali": [
    "হা-মীম।",
    "সুস্পষ্ট কিতাবের কসম!",
    "নিশ্চয় আমি তো একে আরবী কুরআন বানিয়েছি, যাতে তোমরা বুঝতে পার।",
    "আর নিশ্চয় তা আমার কাছে উম্মুল কিতাবে সুউচ্চ মর্যাদাসম্পন্ন, প্রজ্ঞাপূর্ণ।",
    "তোমরা সীমালঙ্ঘনকারী জাতি, এ কারণে কি আমি তোমাদের কাছ থেকে এ উপদেশবাণী সম্পূর্ণরূপে প্রত্যাহার করে নেব?",
    "আর পূর্ববর্তীদের মধ্যে আমি বহু নবী পাঠিয়েছিলাম।",
    "আর যখনই তাদের কাছে কোন নবী এসেছে তারা তাকে নিয়ে ঠাট্টা-বিদ্রূপ করেছে।",
    "ফলে তাদের চেয়েও শক্তিতে প্রবলদেরকে আমি ধ্বংস করে দিয়েছিলাম। আর পূর্ববর্তীদের দৃষ্টান্ত অতীত হয়ে গেছে।",
    "আর তুমি যদি জিজ্ঞাসা কর, আসমানসমূহ ও যমীন কে সৃষ্টি করেছেন? তারা অবশ্যই বলবে, মহাপরাক্রমশালী সর্বজ্ঞই কেবল এগুলো সৃষ্টি করেছেন।",
    "যিনি যমীনকে তোমাদের জন্য শয্যা বানিয়েছেন এবং তাতে তোমাদের জন্য বানিয়েছেন চলার পথ, যাতে তোমরা সঠিক পথ পেতে পার।",
    "আর যিনি আসমান থেকে পরিমিতভাবে পানি বর্ষণ করেন। অতঃপর আমি তা দ্বারা মৃত জনপদকে সঞ্জীবিত করি। এভাবেই তোমাদেরকে বের করা হবে।",
    "আর যিনি সব কিছুই জোড়া জোড়া সৃষ্টি করেছেন এবং তিনি তোমাদের জন্য নৌযান ও গৃহপালিত জন্তু সৃষ্টি করেছেন, যাতে তোমরা আরোহণ কর,",
    "যাতে তোমরা এর পিঠে স্থির থাকতে পার তারপর তোমাদের রবের অনুগ্রহ স্মরণ করবে, যখন তোমরা এর উপর স্থির হয়ে বসবে আর বলবে, ‘পবিত্র-মহান সেই সত্তা যিনি এগুলোকে আমাদের বশীভূত করে দিয়েছেন। আর আমরা এগুলোকে নিয়ন্ত্রণ করতে সক্ষম ছিলাম না’।",
    "আর নিশ্চয় আমরা আমাদের রবের কাছেই প্রত্যাবর্তনকারী।",
    "আর তারা তাঁর বান্দাদের মধ্য থেকে তাঁর অংশ সাব্যস্ত করেছে। নিশ্চয়ই মানুষ স্পষ্ট অকৃতজ্ঞ।",
    "তিনি কি যা সৃষ্টি করেছেন তা থেকে কন্যা সন্তান গ্রহণ করেছেন, আর তোমাদেরকে বিশিষ্ট করেছেন পুত্র সন্তান দ্বারা?",
    "আর যখন তাদের কাউকে সুসংবাদ দেয়া হয়, যা রহমানের প্রতি তারা দৃষ্টান্ত পেশ করে, তখন তার মুখমন্ডল মলিন হয়ে যায়। এমতাবস্থায় যে, সে দুঃসহ যাতনাপিষ্ট।",
    "আর যে অলংকারে লালিত পালিত হয়; এবং বিতর্ককালে সুস্পষ্ট বক্তব্য প্রদানে অক্ষম।",
    "আর তারা গণ্য করেছে রহমানের বান্দা ফেরেশতাদেরকে নারী। তারা কি তাদের সৃষ্টি প্রত্যক্ষ করেছে? তাদের সাক্ষ্য অবশ্যই লিখে রাখা হবে এবং তাদেরকে জিজ্ঞাসাবাদ করা হবে।",
    "তারা আর বলে, ‘পরম করুণাময় আল্লাহ ইচ্ছা করলে আমরা এদের ইবাদাত করতাম না’, এ বিষয়ে তাদের কোন জ্ঞান নেই। তারা শুধু মনগড়া কথা বলছে।",
    "আমি কি তাদেরকে কুরআনের পূর্বে কোন কিতাব দিয়েছি, অতঃপর তারা তা দৃঢ়ভাবে ধারণ করে আছে?",
    "বরং তারা বলে, ‘আমরা নিশ্চয় আমাদের পিতৃপুরুষদেরকে এক মতাদর্শের উপর পেয়েছি, আর নিশ্চয় আমরা তাদের পদাঙ্ক অনুসরণে হিদায়াতপ্রাপ্ত হব’।",
    "আর এভাবেই তোমাদের পূর্বে যখনই আমি কোন জনপদে সতর্ককারী পাঠিয়েছি, তখনই সেখানকার বিলাসপ্রিয়রা বলেছে, ‘নিশ্চয় আমরা আমাদের পিতৃপুরুষদেরকে এক মতাদর্শের উপর পেয়েছি এবং নিশ্চয় আমরা তাদের পদাঙ্ক অনুসরণ করব’।",
    "তখন সে (সতর্ককারী) বলেছে, ‘তোমরা তোমাদের পিতৃপুরুষদেরকে যে মতাদর্শে পেয়েছ, আমি যদি তোমাদের কাছে তার চেয়ে উৎকৃষ্ট পথে নিয়ে আসি তবুও কি’? (তোমরা তাদের অনুসরণ করবে?) তারা বলেছে, ‘নিশ্চয় তোমাদেরকে যা দিয়ে পাঠানো হয়েছে আমরা তার অস্বীকারকারী’।",
    "ফলে আমি তাদের থেকে প্রতিশোধ নিলাম। অতএব দেখ, মিথ্যারোপকারীদের পরিণতি কেমন হয়েছিল?",
    "আর স্মরণ কর, যখন ইবরাহীম স্বীয় পিতা ও তার কওমকে বলেছিল, ‘তোমরা যেগুলোর ইবাদাত কর, নিশ্চয় আমি তাদের থেকে সম্পর্কমুক্ত’।",
    "‘তবে (তিনি ছাড়া) যিনি আমাকে সৃষ্টি করেছেন। অতঃপর নিশ্চয় তিনি আমাকে শীঘ্রই হিদায়াত দিবেন।’",
    "আর এটিকে সে তার উত্তরসূরীদের মধ্যে এক চিরন্তন বাণী বানিয়ে রেখে গেল, যাতে তারা প্রত্যাবর্তন করতে পারে।",
    "বরং তাদের কাছে সত্য ও স্পষ্ট বর্ণনাকারী রাসূল আগমন না করা পর্যন্ত আমি তাদের এবং তাদের পিতৃপুরুষদের ভোগ করার সুযোগ দিয়েছিলাম।",
    "অথচ যখন সত্য তাদের কাছে আসল তখন তারা বলল, ‘এতো যাদু এবং নিশ্চয় আমরা তা অস্বীকার করছি।’",
    "আর তারা বলল, ‘এ কুরআন কেন দুই জনপদের মধ্যকার কোন মহান ব্যক্তির উপর নাযিল করা হল না’?।",
    "তারা কি তোমার রবের রহমত ভাগ-বণ্টন করে? আমিই দুনিয়ার জীবনে তাদের মধ্যে তাদের জীবিকা বণ্টন করে দেই এবং তাদের একজনকে অপর জনের উপর মর্যাদায় উন্নীত করি যাতে একে অপরকে অধিনস্থ হিসেবে গ্রহণ করতে পারে। আর তারা যা সঞ্চয় করে তোমার রবের রহমত তা অপেক্ষা উৎকৃষ্ট।",
    "যদি সব মানুষ একই জাতিতে পরিণত হয়ে যাওয়ার আশঙ্কা না থাকত, তবে যারা পরম করুণাময়ের প্রতি কুফরী করে আমি তাদের গৃহসমূহের জন্য রৌপ্যনির্মিত ছাদ ও ঊর্ধ্বে আরোহণের সিঁড়ি তৈরী করে দিতাম।",
    "আর তাদের গৃহসমূহের জন্য দরজা ও পালঙ্ক, যাতে তারা হেলান দেয়।",
    "আর তাদের জন্য স্বর্ণনির্মিত এর সব কয়টিই দুনিয়ার জীবনের ভোগ-সামগ্রী। আর আখিরাত তো তোমার রবের কাছে মুত্তাকীদের জন্য ।",
    "আর যে পরম করুণাময়ের যিকির থেকে বিমুখ থাকে আমি তার জন্য এক শয়তানকে নিয়োজিত করি, ফলে সে হয়ে যায় তার সঙ্গী।",
    "আর নিশ্চয় তারাই (শয়তান) মানুষদেরকে আল্লাহর পথ থেকে বাধা দেয়। অথচ মানুষ মনে করে তারা হিদায়াতপ্রাপ্ত।",
    "অবশেষে যখন সে আমার নিকট আসবে তখন সে [তার শয়তান সংগীকে উদ্দেশ্য করে] বলবে, ‘হায়, আমার ও তোমার মধ্যে যদি পূর্ব-পশ্চিমের ব্যবধান থাকত’ সুতরাং কতইনা নিকৃষ্ট সে সঙ্গী!",
    "আর আজ তা [তোমাদের এই অনুতাপ] তোমাদের কোন উপকারেই আসবে না। যেহেতু তোমরা যুলম করেছিলে। নিশ্চয় তোমরা আযাবে পরস্পর অংশীদার হয়ে থাকবে।",
    "তুমি কি বধিরকে শুনাতে পারবে অথবা হিদায়াত করতে পারবে অন্ধকে এবং তাকে যে স্পষ্ট পথভ্রষ্টতায় রয়েছে?",
    "অতঃপর যদি আমি তোমাকে নিয়ে যাই, তবে নিশ্চয় আমি তাদের থেকে প্রতিশোধ গ্রহণ করব।",
    "অথবা আমি তাদের যে শাস্তির ওয়াদা দিয়েছি তা যদি তোমাকে প্রত্যক্ষ করাই, তবে নিশ্চয় আমি তাদের উপর পূর্ণ ক্ষমতাবান থাকব।",
    "অতএব তোমার প্রতি যা ওহী করা হয়েছে তাকে তুমি সুদৃঢ়ভাবে ধারণ কর। নিশ্চয় তুমি সরল পথের উপর রয়েছ।",
    "নিশ্চয় এ কুরআন তোমার জন্য এবং তোমার কওমের জন্য উপদেশ। আর অচিরেই তোমাদেরকে জিজ্ঞাসা করা হবে।",
    "আর তোমার পূর্বে আমি রাসূলগণ থেকে যাদের প্রেরণ করেছিলাম তুমি তাদেরকে জিজ্ঞাসা করে দেখ, আমি কি রহমানের পরিবর্তে অন্য কোন উপাস্য নির্ধারণ করে দিয়েছিলাম, যাদের ইবাদাত করা যাবে?",
    "আর অবশ্যই আমি মূসাকে আমার নিদর্শনাবলী দিয়ে ফির‘আউন ও তার নেতৃবর্গের নিকট প্রেরণ করেছিলাম। সে বলেছিল, ‘নিশ্চয় আমি সৃষ্টিকুলের রবের একজন রাসূল’।",
    "অতঃপর যখন সে আমার নিদর্শনাবলী নিয়ে তাদের কাছে আসল, তখন তারা তা নিয়ে হাসি-ঠাট্টা করতে লাগল।",
    "আমি তাদের যে নিদর্শনই দেখাইনা কেন তা ছিল তার অনুরূপ নিদর্শন অপেক্ষা শ্রেষ্ঠতর। আর আমি তাদেরকে আযাবের মাধ্যমে পাকড়াও করলাম, যাতে তারা ফিরে আসে।",
    "আর তারা বলল, ‘হে যাদুকর, তোমার রবের কাছে তুমি আমাদের জন্য তাই প্রার্থনা কর, যার ওয়াদা তিনি তোমার সাথে করেছেন। নিশ্চয় আমরা হিদায়াতের পথে আসব।’",
    "অতঃপর যখন আমি তাদের থেকে আযাব সরিয়ে নিলাম, তখনই তারা অঙ্গীকার ভঙ্গ করে বসল।",
    "আর ফির‘আউন তার কওমের মধ্যে ঘোষণা দিয়ে বলল, ‘হে আমার কওম, মিসরের রাজত্ব কি আমার নয়? আর এ সব নদ-নদী কি আমার পাদদেশ দিয়ে প্রবাহিত হচ্ছে না, তোমরা কি দেখছ না’?",
    "‘আমি কি এই ব্যক্তি থেকে শ্রেষ্ঠ নই, যে হীন এবং স্পষ্ট বর্ণনা করতে প্রায় অক্ষম’?",
    "‘তবে তাকে কেন স্বর্ণবলয় প্রদান করা হল না অথবা দলবদ্ধভাবে ফেরেশতাগণ তার সাথে কেন আসল না?’",
    "এভাবেই সে তার কওমকে বোকা বানালো, ফলে তারা তার আনুগত্য করল। নিশ্চয় তারা ছিল এক ফাসিক কওম।",
    "তারপর যখন তারা আমাকে ক্রোধান্বিত করল, তখন আমি তাদের থেকে প্রতিশোধ গ্রহণ করলাম এবং তাদের সকলকে নিমজ্জিত করে দিলাম।",
    "ফলে আমি তাদেরকে পরবর্তীদের জন্য অতীত ইতিহাস ও দৃষ্টান্ত বানালাম।",
    "আর যখনই মারইয়াম পুত্রকে দৃষ্টান্তস্বরূপ পেশ করা হয়, তখন তোমার কওম শোরগোল শুরু করে দেয়।",
    "আর তারা বলে, ‘আমাদের উপাস্যরা শ্রেষ্ঠ নাকি ঈসা’? তারা কেবল কূটতর্কের খাতিরেই তাকে তোমার সামনে পেশ করে। বরং এরাই এক ঝগড়াটে সম্প্রদায়।",
    "সে কেবল আমার এক বান্দা। আমি তার উপর অনুগ্রহ করেছিলাম এবং বনী ইসরাঈলের জন্য তাকে দৃষ্টান্ত বানিয়েছিলাম।",
    "আর যদি আমি চাইতাম, তবে আমি তোমাদের পরিবর্তে ফেরেশতা সৃষ্টি করে পাঠাতাম যারা যমীনে তোমাদের উত্তরাধিকার হত।",
    "আর নিশ্চয় সে (ঈসা) হবে কিয়ামতের এক সুনিশ্চিত আলামত। সুতরাং তোমরা কিয়ামত সম্পর্কে সংশয় পোষণ করো না। তোমরা আমারই অনুসরণ কর। এটিই সরল পথ।",
    "শয়তান যেন তোমাদের কিছুতেই বাধা দিতে না পারে। নিশ্চয় সে তোমাদের প্রকাশ্য শত্রু।",
    "আর যখন ঈসা সুস্পষ্ট প্রমাণাদি নিয়ে আসল, তখন সে বলল, ‘আমি অবশ্যই তোমাদের কাছে হিকমত নিয়ে এসেছি এবং এসেছি তোমরা যে কতক বিষয়ে মতবিরোধে লিপ্ত তা স্পষ্ট করে দিতে। অতএব তোমরা আল্লাহকে ভয় কর এবং আমার আনুগত্য কর’।",
    "‘নিশ্চয় আল্লাহ, তিনিই আমার রব ও তোমাদের রব। অতএব তাঁর ইবাদাত কর; এটিই সরল পথ’।",
    "অতঃপর তাদের মধ্যকার কতগুলি দল মতভেদ করেছিল। সুতরাং যালিমদের জন্য যন্ত্রণাদায়ক দিনের আযাবের দুর্ভোগ!",
    "তারা তো তাদের অজ্ঞাতসারে অকস্মাৎ কিয়ামত আসার অপেক্ষা করছে।",
    "সেদিন বন্ধুরা একে অন্যের শত্রু হবে, মুত্তাকীরা ছাড়া।",
    "হে আমার বান্দাগণ, আজ তোমাদের কোন ভয় নেই এবং তোমরা চিন্তিতও হবে না।",
    "যারা আমার আয়াতে ঈমান এনেছিল এবং যারা ছিল মুসলিম।",
    "তোমরা সস্ত্রীক সানন্দে জান্নাতে প্রবেশ কর।",
    "স্বর্ণখচিত থালা ও পানপাত্র নিয়ে তাদেরকে প্রদক্ষিণ করা হবে, সেখানে মন যা চায় আর যাতে চোখ তৃপ্ত হয় তা-ই থাকবে এবং সেখানে তোমরা হবে স্থায়ী।",
    "আর এটিই জান্নাত, নিজদের আমলের ফলস্বরূপ তোমাদেরকে এর অধিকারী করা হয়েছে।",
    "সেখানে তোমাদের জন্য রয়েছে অনেক ফলমূল, যা থেকে তোমরা খাবে।",
    "নিশ্চয় অপরাধীরা জাহান্নামের আযাবে স্থায়ী হবে;",
    "তাদের থেকে আযাব কমানো হবে না এবং তাতে তারা হতাশ হয়ে পড়বে।",
    "আর আমি তাদের উপর যুলম করিনি; কিন্তু তারাই ছিল যালিম।",
    "তারা চিৎকার করে বলবে, ‘হে মালিক, তোমার রব যেন আমাদেরকে শেষ করে দেন’। সে বলবে, ‘নিশ্চয় তোমরা অবস্থানকারী’।",
    "‘অবশ্যই তোমাদের কাছে আমি সত্য নিয়ে এসেছিলাম; কিন্তু তোমাদের অধিকাংশই ছিলে সত্য অপছন্দকারী*। \n* কথাটি আল্লাহর। অর্থ আমিতো তোমাদের কাছে সত্যবাণী পৌঁছিয়েছিলাম।",
    "না কি তারা কোন ব্যাপারে পাকা সিদ্ধান্ত নিয়েছে? নিশ্চয় আমি চূড়ান্ত সিদ্ধান্তকারী।",
    "না কি তারা মনে করে, আমি তাদের গোপনীয় বিষয় ও নিভৃত সলাপরামর্শ শুনতে পাই না? অবশ্যই হ্যাঁ, আর আমার ফেরেশতাগণ তাদের কাছে থেকে লিখছে।",
    "বল, ‘রহমানের যদি সন্তান থাকত তবে আমি প্রথম তাঁর ইবাদাতকারী হতাম।",
    "তারা যা আরোপ করে, আসমানসমূহ ও যমীনের রব এবং আরশের রব তা থেকে পবিত্র-মহান।",
    "অতএব তাদেরকে ছেড়ে দাও, তারা মগ্ন থাকুক বেহুদা কথায় আর খেল-তামাশায় মত্ত থাকুক যতক্ষণ না সেদিনের সাথে তারা সাক্ষাৎ করে যার প্রতিশ্রুতি তাদেরকে দেয়া হয়েছে।",
    "আর তিনিই আসমানে ইলাহ এবং তিনিই যমীনে ইলাহ; আর তিনি প্রজ্ঞাময়, সর্বজ্ঞ।",
    "আর তিনি বরকতময়, যার কর্তৃত্বে রয়েছে আসমানসমূহ, যমীন ও এ দু’য়ের মধ্যবর্তী সবকিছু; আর কিয়ামতের জ্ঞান কেবল তাঁরই আছে এবং তাঁরই নিকট তোমাদেরকে ফিরিয়ে নেয়া হবে।",
    "আর তিনি ছাড়া যাদেরকে তারা আহবান করে তারা সুপারিশের মালিক হবে না; তবে তারা ছাড়া যারা জেনে-শুনে সত্য সাক্ষ্য দেয় ।",
    "আর তুমি যদি তাদেরকে জিজ্ঞাসা কর, কে তাদেরকে সৃষ্টি করেছে? তারা অবশ্যই বলবে, ‘আল্লাহ।’ তবু তারা কীভাবে বিমুখ হয়?",
    "আর তার (রাসূলের) বাণী ‘হে আমার রব, নিশ্চয় এরা এমন কওম যারা ঈমান আনবে না।’",
    "অতএব তুমি তাদেরকে এড়িয়ে চল এবং বল, ‘সালাম’; তবে তারা শীঘ্রই জানতে পারবে।"
  ]
}