{
  "surahName": "Al-Hijr",
  "surahNameArabic": "الحجر",
  "surahNameArabicLong": "سورة الحجر",
  "surahNameTranslation": "The Rock",
  "revelationPlace": "Mecca",
  "totalAyah": 99,
  "surahNo": 15,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/15.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/015.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/15.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/015.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/15.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/015.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/15.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/015.mp3"
    }
  },
  "english": [
    "Alif-Lãm-Ra. These are the verses of the Book; the clear Quran.",
    "˹The day will come when˺ the disbelievers will certainly wish they had submitted ˹to Allah˺.",
    "˹So˺ let them eat and enjoy themselves and be diverted by ˹false˺ hope, for they will soon know.",
    "We have never destroyed a society without a destined term.",
    "No people can advance their doom, nor can they delay it.",
    "They say, “O you to whom the Reminder is revealed! You must be insane!",
    "Why do you not bring us the angels, if what you say is true?”",
    "We do not send the angels down except for a just cause, and then ˹the end of˺ the disbelievers will not be delayed.",
    "It is certainly We Who have revealed the Reminder, and it is certainly We Who will preserve it.",
    "Indeed, We sent messengers before you ˹O Prophet˺ among the groups of early peoples",
    "but no messenger ever came to them without being mocked.",
    "This is how We allow disbelief ˹to steep˺ into the hearts of the wicked.",
    "They would not believe in this ˹Quran˺ despite the ˹many˺ examples of those ˹destroyed˺ before.",
    "And even if We opened for them a gate to heaven, through which they continued to ascend",
    "still they would say, “Our eyes have truly been dazzled! In fact, we must have been bewitched.”",
    "Indeed, We have placed constellations in the sky, and adorned it for all to see.",
    "And We protected it from every accursed devil",
    "except the one eavesdropping, who is then pursued by a visible flare.",
    "As for the earth, We spread it out and placed upon it firm mountains, and caused everything to grow there in perfect balance.",
    "And We made in it means of sustenance for you and others, who you do not provide for.",
    "There is not any means ˹of sustenance˺ whose reserves We do not hold, only bringing it forth in precise measure.",
    "We send fertilizing winds, and bring down rain from the sky for you to drink. It is not you who hold its reserves.",
    "Surely it is We Who give life and cause death. And We are the ˹Eternal˺ Successor.",
    "We certainly know those who have gone before you and those who will come after ˹you˺.",
    "Surely your Lord ˹alone˺ will gather them together ˹for judgment˺. He is truly All-Wise, All-Knowing.",
    "Indeed, We created man from sounding clay moulded from black mud.",
    "As for the jinn, We created them earlier from smokeless fire.",
    "˹Remember, O  Prophet˺ when your Lord said to the angels, “I am going to create a human being from sounding clay moulded from black mud.",
    "So when I have fashioned him and had a spirit of My Own ˹creation˺ breathed into him, fall down in prostration to him.”",
    "So the angels prostrated all together—",
    "but not Iblîs, who refused to prostrate with the others.",
    "Allah asked, “O Iblîs! What is the matter with you that you did not join others in prostration?”",
    "He replied, “It is not for me to prostrate to a human You created from sounding clay moulded from black mud.”",
    "Allah commanded, “Then get out of Paradise, for you are truly cursed.",
    "And surely upon you is condemnation until the Day of Judgment.”",
    "Satan appealed, “My Lord! Then delay my end until the Day of their resurrection.”",
    "Allah said, “You will be delayed",
    "until the appointed Day.”",
    "Satan responded, “My Lord! For allowing me to stray I will surely tempt them on earth and mislead them all together",
    "except Your chosen servants among them.”",
    "Allah said, “This is the Way, binding on Me:",
    "you will certainly have no authority over My servants, except the deviant who follow you",
    "and surely Hell is their destined place, all together.",
    "It has seven gates, to each a group of them is designated.”",
    "Indeed, the righteous will be amid Gardens and springs.",
    "˹It will be said to them,˺ “Enter in peace and security.”",
    "We will remove whatever bitterness they had in their hearts. In a friendly manner, they will be on thrones, facing one another.",
    "No fatigue will touch them there, nor will they ever be asked to leave.",
    "Inform My servants ˹O Prophet˺ that I am truly the All-Forgiving, Most Merciful",
    "and that My torment is indeed the most painful.",
    "And inform them ˹O Prophet˺ about Abraham’s guests",
    "who entered upon him and greeted ˹him with˺, “Peace!” He ˹later˺ said, “Surely we are afraid of you.”",
    "They reassured ˹him˺, “Do not be afraid! Surely we give you good news of a knowledgeable son.”",
    "He wondered, “Do you give me good news despite my old age? What unlikely news!”",
    "They responded, “We give you good news in all truth, so do not be one of those who despair.”",
    "He exclaimed, “Who would despair of the mercy of their Lord except the misguided?”",
    "He ˹then˺ added, “What is your mission, O  messenger-angels?”",
    "They replied, “We have actually been sent to a wicked people.",
    "As for the family of Lot, we will certainly deliver them all",
    "except his wife. We have determined that she will be one of the doomed.”",
    "So when the messengers came to the family of Lot",
    "he said, “You are surely an unfamiliar people!”",
    "They responded, “We have come to you with that ˹torment˺ which they have doubted.",
    "We come to you with the truth, and we are certainly truthful.",
    "So travel with your family in the dark of night, and follow ˹closely˺ behind them. Do not let any of you look back, and go where you are commanded.”",
    "We revealed to him this decree: “Those ˹sinners˺ will be uprooted in the morning.”",
    "And there came the men of the city, rejoicing.",
    "Lot pleaded, “Indeed, these are my guests, so do not embarrass me.",
    "Fear Allah and do not humiliate me.”",
    "They responded, “Have we not forbidden you from protecting anyone?”",
    "He said, “O my people! Here are my daughters ˹so marry them˺ if you wish to do so.”",
    "By your life ˹O Prophet˺, they certainly wandered blindly, intoxicated ˹by lust˺.",
    "So the ˹mighty˺ blast overtook them at sunrise.",
    "And We turned the cities ˹of Sodom and Gomorrah˺ upside down and rained upon them stones of baked clay.",
    "Surely in this are signs for those who contemplate.",
    "Their ruins still lie along a known route.",
    "Surely in this is a sign for those who believe.",
    "And the residents of the Forest were truly wrongdoers",
    "so We inflicted punishment upon them. The ruins of both nations still lie on a well-known road.",
    "Indeed, the residents of the Stone Valley also denied the messengers.",
    "We gave them Our signs, but they turned away from them.",
    "They carved their homes in the mountains, feeling secure.",
    "But the ˹mighty˺ blast overtook them in the morning",
    "and all they achieved was of no help to them.",
    "We have not created the heavens and the earth and everything in between except for a purpose. And the Hour is certain to come, so forgive graciously.",
    "Surely your Lord is the Master Creator, All-Knowing.",
    "We have certainly granted you the seven often-repeated verses and the great Quran.",
    "Do not let your eyes crave the ˹fleeting˺ pleasures We have provided for some of the disbelievers, nor grieve for them. And be gracious to the believers.",
    "And say, “I am truly sent with a clear warning”—",
    "˹a warning˺ similar to what We sent to those who divided ˹the Scriptures˺",
    "who ˹now˺ accept parts of the Quran, rejecting others.",
    "So by your Lord! We will certainly question them all",
    "about what they used to do.",
    "So proclaim what you have been commanded, and turn away from the polytheists.",
    "Surely We will be sufficient for you against the mockers",
    "who set up ˹other˺ gods with Allah. They will soon come to know.",
    "We certainly know that your heart is truly distressed by what they say.",
    "So glorify the praises of your Lord and be one of those who ˹always˺ pray",
    "and worship your Lord until the inevitable comes your way."
  ],
  "arabic1": [
    "الٓرٰ ۫ تِلْكَ اٰیٰتُ الْكِتٰبِ وَقُرْاٰنٍ مُّبِیْنٍ",
    "رُبَمَا یَوَدُّ الَّذِیْنَ كَفَرُوْا لَوْ كَانُوْا مُسْلِمِیْنَ",
    "ذَرْهُمْ یَاْكُلُوْا وَیَتَمَتَّعُوْا وَیُلْهِهِمُ الْاَمَلُ فَسَوْفَ یَعْلَمُوْنَ",
    "وَمَاۤ اَهْلَكْنَا مِنْ قَرْیَةٍ اِلَّا وَلَهَا كِتَابٌ مَّعْلُوْمٌ",
    "مَا تَسْبِقُ مِنْ اُمَّةٍ اَجَلَهَا وَمَا یَسْتَاْخِرُوْنَ",
    "وَقَالُوْا یٰۤاَیُّهَا الَّذِیْ نُزِّلَ عَلَیْهِ الذِّكْرُ اِنَّكَ لَمَجْنُوْنٌ",
    "لَوْ مَا تَاْتِیْنَا بِالْمَلٰٓىِٕكَةِ اِنْ كُنْتَ مِنَ الصّٰدِقِیْنَ",
    "مَا نُنَزِّلُ الْمَلٰٓىِٕكَةَ اِلَّا بِالْحَقِّ وَمَا كَانُوْۤا اِذًا مُّنْظَرِیْنَ",
    "اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَاِنَّا لَهٗ لَحٰفِظُوْنَ",
    "وَلَقَدْ اَرْسَلْنَا مِنْ قَبْلِكَ فِیْ شِیَعِ الْاَوَّلِیْنَ",
    "وَمَا یَاْتِیْهِمْ مِّنْ رَّسُوْلٍ اِلَّا كَانُوْا بِهٖ یَسْتَهْزِءُوْنَ",
    "كَذٰلِكَ نَسْلُكُهٗ فِیْ قُلُوْبِ الْمُجْرِمِیْنَ",
    "لَا یُؤْمِنُوْنَ بِهٖ وَقَدْ خَلَتْ سُنَّةُ الْاَوَّلِیْنَ",
    "وَلَوْ فَتَحْنَا عَلَیْهِمْ بَابًا مِّنَ السَّمَآءِ فَظَلُّوْا فِیْهِ یَعْرُجُوْنَ",
    "لَقَالُوْۤا اِنَّمَا سُكِّرَتْ اَبْصَارُنَا بَلْ نَحْنُ قَوْمٌ مَّسْحُوْرُوْنَ",
    "وَلَقَدْ جَعَلْنَا فِی السَّمَآءِ بُرُوْجًا وَّزَیَّنّٰهَا لِلنّٰظِرِیْنَ",
    "وَحَفِظْنٰهَا مِنْ كُلِّ شَیْطٰنٍ رَّجِیْمٍ",
    "اِلَّا مَنِ اسْتَرَقَ السَّمْعَ فَاَتْبَعَهٗ شِهَابٌ مُّبِیْنٌ",
    "وَالْاَرْضَ مَدَدْنٰهَا وَاَلْقَیْنَا فِیْهَا رَوَاسِیَ وَاَنْۢبَتْنَا فِیْهَا مِنْ كُلِّ شَیْءٍ مَّوْزُوْنٍ",
    "وَجَعَلْنَا لَكُمْ فِیْهَا مَعَایِشَ وَمَنْ لَّسْتُمْ لَهٗ بِرٰزِقِیْنَ",
    "وَاِنْ مِّنْ شَیْءٍ اِلَّا عِنْدَنَا خَزَآىِٕنُهٗ وَمَا نُنَزِّلُهٗۤ اِلَّا بِقَدَرٍ مَّعْلُوْمٍ",
    "وَاَرْسَلْنَا الرِّیٰحَ لَوَاقِحَ فَاَنْزَلْنَا مِنَ السَّمَآءِ مَآءً فَاَسْقَیْنٰكُمُوْهُ وَمَاۤ اَنْتُمْ لَهٗ بِخٰزِنِیْنَ",
    "وَاِنَّا لَنَحْنُ نُحْیٖ وَنُمِیْتُ وَنَحْنُ الْوٰرِثُوْنَ",
    "وَلَقَدْ عَلِمْنَا الْمُسْتَقْدِمِیْنَ مِنْكُمْ وَلَقَدْ عَلِمْنَا الْمُسْتَاْخِرِیْنَ",
    "وَاِنَّ رَبَّكَ هُوَ یَحْشُرُهُمْ اِنَّهٗ حَكِیْمٌ عَلِیْمٌ",
    "وَلَقَدْ خَلَقْنَا الْاِنْسَانَ مِنْ صَلْصَالٍ مِّنْ حَمَاٍ مَّسْنُوْنٍ",
    "وَالْجَآنَّ خَلَقْنٰهُ مِنْ قَبْلُ مِنْ نَّارِ السَّمُوْمِ",
    "وَاِذْ قَالَ رَبُّكَ لِلْمَلٰٓىِٕكَةِ اِنِّیْ خَالِقٌۢ بَشَرًا مِّنْ صَلْصَالٍ مِّنْ حَمَاٍ مَّسْنُوْنٍ",
    "فَاِذَا سَوَّیْتُهٗ وَنَفَخْتُ فِیْهِ مِنْ رُّوْحِیْ فَقَعُوْا لَهٗ سٰجِدِیْنَ",
    "فَسَجَدَ الْمَلٰٓىِٕكَةُ كُلُّهُمْ اَجْمَعُوْنَ",
    "اِلَّاۤ اِبْلِیْسَ اَبٰۤی اَنْ یَّكُوْنَ مَعَ السّٰجِدِیْنَ",
    "قَالَ یٰۤاِبْلِیْسُ مَا لَكَ اَلَّا تَكُوْنَ مَعَ السّٰجِدِیْنَ",
    "قَالَ لَمْ اَكُنْ لِّاَسْجُدَ لِبَشَرٍ خَلَقْتَهٗ مِنْ صَلْصَالٍ مِّنْ حَمَاٍ مَّسْنُوْنٍ",
    "قَالَ فَاخْرُجْ مِنْهَا فَاِنَّكَ رَجِیْمٌ",
    "وَّاِنَّ عَلَیْكَ اللَّعْنَةَ اِلٰی یَوْمِ الدِّیْنِ",
    "قَالَ رَبِّ فَاَنْظِرْنِیْۤ اِلٰی یَوْمِ یُبْعَثُوْنَ",
    "قَالَ فَاِنَّكَ مِنَ الْمُنْظَرِیْنَ",
    "اِلٰی یَوْمِ الْوَقْتِ الْمَعْلُوْمِ",
    "قَالَ رَبِّ بِمَاۤ اَغْوَیْتَنِیْ لَاُزَیِّنَنَّ لَهُمْ فِی الْاَرْضِ وَلَاُغْوِیَنَّهُمْ اَجْمَعِیْنَ",
    "اِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِیْنَ",
    "قَالَ هٰذَا صِرَاطٌ عَلَیَّ مُسْتَقِیْمٌ",
    "اِنَّ عِبَادِیْ لَیْسَ لَكَ عَلَیْهِمْ سُلْطٰنٌ اِلَّا مَنِ اتَّبَعَكَ مِنَ الْغٰوِیْنَ",
    "وَاِنَّ جَهَنَّمَ لَمَوْعِدُهُمْ اَجْمَعِیْنَ",
    "لَهَا سَبْعَةُ اَبْوَابٍ لِكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُوْمٌ",
    "اِنَّ الْمُتَّقِیْنَ فِیْ جَنّٰتٍ وَّعُیُوْنٍ",
    "اُدْخُلُوْهَا بِسَلٰمٍ اٰمِنِیْنَ",
    "وَنَزَعْنَا مَا فِیْ صُدُوْرِهِمْ مِّنْ غِلٍّ اِخْوَانًا عَلٰی سُرُرٍ مُّتَقٰبِلِیْنَ",
    "لَا یَمَسُّهُمْ فِیْهَا نَصَبٌ وَّمَا هُمْ مِّنْهَا بِمُخْرَجِیْنَ",
    "نَبِّئْ عِبَادِیْۤ اَنِّیْۤ اَنَا الْغَفُوْرُ الرَّحِیْمُ",
    "وَاَنَّ عَذَابِیْ هُوَ الْعَذَابُ الْاَلِیْمُ",
    "وَنَبِّئْهُمْ عَنْ ضَیْفِ اِبْرٰهِیْمَ",
    "اِذْ دَخَلُوْا عَلَیْهِ فَقَالُوْا سَلٰمًا قَالَ اِنَّا مِنْكُمْ وَجِلُوْنَ",
    "قَالُوْا لَا تَوْجَلْ اِنَّا نُبَشِّرُكَ بِغُلٰمٍ عَلِیْمٍ",
    "قَالَ اَبَشَّرْتُمُوْنِیْ عَلٰۤی اَنْ مَّسَّنِیَ الْكِبَرُ فَبِمَ تُبَشِّرُوْنَ",
    "قَالُوْا بَشَّرْنٰكَ بِالْحَقِّ فَلَا تَكُنْ مِّنَ الْقٰنِطِیْنَ",
    "قَالَ وَمَنْ یَّقْنَطُ مِنْ رَّحْمَةِ رَبِّهٖۤ اِلَّا الضَّآلُّوْنَ",
    "قَالَ فَمَا خَطْبُكُمْ اَیُّهَا الْمُرْسَلُوْنَ",
    "قَالُوْۤا اِنَّاۤ اُرْسِلْنَاۤ اِلٰی قَوْمٍ مُّجْرِمِیْنَ",
    "اِلَّاۤ اٰلَ لُوْطٍ اِنَّا لَمُنَجُّوْهُمْ اَجْمَعِیْنَ",
    "اِلَّا امْرَاَتَهٗ قَدَّرْنَاۤ اِنَّهَا لَمِنَ الْغٰبِرِیْنَ",
    "فَلَمَّا جَآءَ اٰلَ لُوْطِ ١لْمُرْسَلُوْنَ",
    "قَالَ اِنَّكُمْ قَوْمٌ مُّنْكَرُوْنَ",
    "قَالُوْا بَلْ جِئْنٰكَ بِمَا كَانُوْا فِیْهِ یَمْتَرُوْنَ",
    "وَاَتَیْنٰكَ بِالْحَقِّ وَاِنَّا لَصٰدِقُوْنَ",
    "فَاَسْرِ بِاَهْلِكَ بِقِطْعٍ مِّنَ الَّیْلِ وَاتَّبِعْ اَدْبَارَهُمْ وَلَا یَلْتَفِتْ مِنْكُمْ اَحَدٌ وَّامْضُوْا حَیْثُ تُؤْمَرُوْنَ",
    "وَقَضَیْنَاۤ اِلَیْهِ ذٰلِكَ الْاَمْرَ اَنَّ دَابِرَ هٰۤؤُلَآءِ مَقْطُوْعٌ مُّصْبِحِیْنَ",
    "وَجَآءَ اَهْلُ الْمَدِیْنَةِ یَسْتَبْشِرُوْنَ",
    "قَالَ اِنَّ هٰۤؤُلَآءِ ضَیْفِیْ فَلَا تَفْضَحُوْنِ",
    "وَاتَّقُوا اللّٰهَ وَلَا تُخْزُوْنِ",
    "قَالُوْۤا اَوَلَمْ نَنْهَكَ عَنِ الْعٰلَمِیْنَ",
    "قَالَ هٰۤؤُلَآءِ بَنَاتِیْۤ اِنْ كُنْتُمْ فٰعِلِیْنَ",
    "لَعَمْرُكَ اِنَّهُمْ لَفِیْ سَكْرَتِهِمْ یَعْمَهُوْنَ",
    "فَاَخَذَتْهُمُ الصَّیْحَةُ مُشْرِقِیْنَ",
    "فَجَعَلْنَا عَالِیَهَا سَافِلَهَا وَاَمْطَرْنَا عَلَیْهِمْ حِجَارَةً مِّنْ سِجِّیْلٍ",
    "اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّلْمُتَوَسِّمِیْنَ",
    "وَاِنَّهَا لَبِسَبِیْلٍ مُّقِیْمٍ",
    "اِنَّ فِیْ ذٰلِكَ لَاٰیَةً لِّلْمُؤْمِنِیْنَ",
    "وَاِنْ كَانَ اَصْحٰبُ الْاَیْكَةِ لَظٰلِمِیْنَ",
    "فَانْتَقَمْنَا مِنْهُمْ وَاِنَّهُمَا لَبِاِمَامٍ مُّبِیْنٍ",
    "وَلَقَدْ كَذَّبَ اَصْحٰبُ الْحِجْرِ الْمُرْسَلِیْنَ",
    "وَاٰتَیْنٰهُمْ اٰیٰتِنَا فَكَانُوْا عَنْهَا مُعْرِضِیْنَ",
    "وَكَانُوْا یَنْحِتُوْنَ مِنَ الْجِبَالِ بُیُوْتًا اٰمِنِیْنَ",
    "فَاَخَذَتْهُمُ الصَّیْحَةُ مُصْبِحِیْنَ",
    "فَمَاۤ اَغْنٰی عَنْهُمْ مَّا كَانُوْا یَكْسِبُوْنَ",
    "وَمَا خَلَقْنَا السَّمٰوٰتِ وَالْاَرْضَ وَمَا بَیْنَهُمَاۤ اِلَّا بِالْحَقِّ وَاِنَّ السَّاعَةَ لَاٰتِیَةٌ فَاصْفَحِ الصَّفْحَ الْجَمِیْلَ",
    "اِنَّ رَبَّكَ هُوَ الْخَلّٰقُ الْعَلِیْمُ",
    "وَلَقَدْ اٰتَیْنٰكَ سَبْعًا مِّنَ الْمَثَانِیْ وَالْقُرْاٰنَ الْعَظِیْمَ",
    "لَا تَمُدَّنَّ عَیْنَیْكَ اِلٰی مَا مَتَّعْنَا بِهٖۤ اَزْوَاجًا مِّنْهُمْ وَلَا تَحْزَنْ عَلَیْهِمْ وَاخْفِضْ جَنَاحَكَ لِلْمُؤْمِنِیْنَ",
    "وَقُلْ اِنِّیْۤ اَنَا النَّذِیْرُ الْمُبِیْنُ",
    "كَمَاۤ اَنْزَلْنَا عَلَی الْمُقْتَسِمِیْنَ",
    "الَّذِیْنَ جَعَلُوا الْقُرْاٰنَ عِضِیْنَ",
    "فَوَرَبِّكَ لَنَسْـَٔلَنَّهُمْ اَجْمَعِیْنَ",
    "عَمَّا كَانُوْا یَعْمَلُوْنَ",
    "فَاصْدَعْ بِمَا تُؤْمَرُ وَاَعْرِضْ عَنِ الْمُشْرِكِیْنَ",
    "اِنَّا كَفَیْنٰكَ الْمُسْتَهْزِءِیْنَ",
    "الَّذِیْنَ یَجْعَلُوْنَ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ فَسَوْفَ یَعْلَمُوْنَ",
    "وَلَقَدْ نَعْلَمُ اَنَّكَ یَضِیْقُ صَدْرُكَ بِمَا یَقُوْلُوْنَ",
    "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُنْ مِّنَ السّٰجِدِیْنَ",
    "وَاعْبُدْ رَبَّكَ حَتّٰی یَاْتِیَكَ الْیَقِیْنُ"
  ],
  "bengali": [
    "আলিফ-লাম-রা; এ হল কিতাব ও সুস্পষ্ট কুরআনের আয়াতসমূহ।",
    "কোন কোন সময় কাফিরেরা আকাংখা করবে যে, তারা যদি মুসলিম হত!",
    "তাদেরকে ছেড়ে দাও, আহারে ও ভোগে তারা মত্ত থাকুক এবং আশা তাদেরকে গাফেল করে রাখুক, আর অচিরেই তারা জানতে পারবে।",
    "আর আমি কোন জনপদকে ধ্বংস করিনি তার জন্য নির্ধারিত সময় ছাড়া।",
    "কোন জাতিই তাদের সুনির্ধারিত সময় থেকে আগে বাড়তে পারে না আর পিছাতেও পারে না।",
    "আর তারা বলল, ‘হে ঐ ব্যক্তি, যার উপর কুরআন নাযিল করা হয়েছে, তুমি তো নিশ্চিত পাগল’।",
    "‘কেন আমাদের কাছে ফেরেশতা নিয়ে আসছ না, যদি তুমি সত্যবাদীদের অন্তর্ভুক্ত হয়ে থাক’?",
    "আমি যথাযথ কারণ ছাড়া ফেরেশতাদের নাযিল করি না, আর (নাযিল করলে) তখন তারা অবকাশও পেত না।",
    "নিশ্চয় আমি কুরআন* নাযিল করেছি, আর আমিই তার হেফাযতকারী। \n* الذكر দ্বারা উদ্দেশ্য কুরআন।",
    "আর আমি তোমার পূর্বে অতীত সম্প্রদায়গুলোর মধ্যে রাসূল প্রেরণ করেছি।",
    "আর যখনই তাদের নিকট কোন রাসূল আসত তারা তাকে নিয়ে উপহাস করত।",
    "এমনিভাবে আমি তা অপরাধীদের অন্তরে সঞ্চার করি।",
    "তারা এতে ঈমান আনবে না, আর পূর্ববর্তীদের (ব্যাপারে আল্লাহর) রীতি তো বিগত হয়েছে।",
    "আর যদি আমি তাদের জন্য আসমানের কোন দরজা খুলে দিতাম, অতঃপর তারা তাতে আরোহণ করতে থাকত ।",
    "তবুও তারা বলত, নিশ্চয় আমাদের দৃষ্টি কেড়ে নেয়া হয়েছে, বরং আমরা তো যাদুগ্রস্ত সম্প্রদায়।",
    "আর আমি আসমানে স্থাপন করেছি কক্ষপথসমূহ এবং তাকে সৌন্দর্যমন্ডিত করেছি দর্শকদের জন্য।",
    "আর আমি তাকে সুরক্ষিত করেছি প্রত্যেক বিতাড়িত শয়তান থেকে।",
    "তবে যে গোপনে শোনে, তৎক্ষণাৎ সুস্পষ্ট জ্বলন্ত অগ্নিশিখা তার পিছু নেয়।",
    "আর যমীনকে আমি বিস্তৃত করেছি এবং তাতে সুদৃঢ় পাহাড় স্থাপন করেছি। আর তাতে উৎপন্ন করেছি সকল প্রকার বস্তু সুনির্দিষ্ট পরিমাণে ।",
    "আর তাতে তোমাদের জন্য এবং তোমরা যার রিয্ক দাতা নও তাদের জন্য রেখেছি জীবনোপকরণ ।",
    "আর প্রতিটি বস্তুরই ভান্ডারসমূহ রয়েছে আমার কাছে এবং আমি তা অবতীর্ণ করি কেবল নির্দিষ্ট পরিমাণে।",
    "আর আমি বায়ুকে ঊর্বরকারীরূপে প্রেরণ করি অতঃপর আসমান থেকে বৃষ্টি বর্ষণ করি এবং তা তোমাদের পান করাই। তবে তোমরা তার সংরক্ষণকারী নও।",
    "আর নিশ্চয় আমি জীবিত করি ও মৃত্যু দেই এবং আমিই ওয়ারিস।",
    "আর অবশ্যই আমি জানি তোমাদের পূর্ববর্তীদেরকে এবং অবশ্যই জানি পরবর্তীদেরকে।",
    "আর নিশ্চয় তোমার রব তাদেরকে একত্র করবেন। নিশ্চয় তিনি প্রজ্ঞাময় ও সর্বজ্ঞানী।",
    "আর অবশ্যই আমি মানুষকে সৃষ্টি করেছি শুকনো ঠনঠনে, কালচে কাদামাটি থেকে।",
    "আর ইতঃপূর্বে জিনকে সৃষ্টি করেছি উত্তপ্ত অগ্নিশিখা থেকে।",
    "আর স্মরণ কর, যখন তোমার রব ফেরেশতাদের বললেন, ‘আমি একজন মানুষ সৃষ্টি করতে যাচ্ছি শুকনো ঠনঠনে কালচে মাটি থেকে’।",
    "‘অতএব যখন আমি তাকে পূর্ণাঙ্গ রূপ দেব এবং তার মধ্যে আমার রূহ ফুঁকে দেব, তখন তোমরা তার জন্য সিজদাবনত হও’।",
    "অতঃপর, ফেরেশতারা সকলেই সিজদা করল।",
    "ইবলীস ছাড়া। সে সিজদাকারীদের সঙ্গী হতে অস্বীকার করল।",
    "তিনি বললেন, ‘হে ইবলীস, তোমার কী হল যে, তুমি সিজদাকারীদের সঙ্গী হলে না’?",
    "সে বলল, ‘আমি তো এমন নই যে, একজন মানুষকে আমি সিজদা করব, যাকে আপনি সৃষ্টি করেছেন শুকনো ঠনঠনে কালচে মাটি থেকে’।",
    "তিনি বললেন, ‘তাহলে তুমি এখান থেকে বেরিয়ে যাও, তুমি বিতাড়িত’।",
    "‘আর নিশ্চয় কিয়ামত দিবস পর্যন্ত তোমার উপর লা‘নত’।",
    "সে বলল, ‘হে আমার রব, তাহলে আমাকে অবকাশ দিন সে দিন পর্যন্ত, যেদিন তাদেরকে পুনরুজ্জীবিত করা হবে’।",
    "তিনি বললেন, ‘তুমি নিশ্চয় অবকাশপ্রাপ্তদের একজন’।",
    "‘নির্ধারিত সময়ের দিন পর্যন্ত’।",
    "সে বলল, ‘হে আমার রব, যেহেতু আপনি আমাকে পথভ্রষ্ট করেছেন, তাই যমীনে আমি তাদের জন্য (পাপকে) শোভিত করব এবং নিশ্চয় তাদের সকলকে পথভ্রষ্ট করব’।",
    "তাদের মধ্য থেকে আপনার একান্ত বান্দাগণ ছাড়া।",
    "তিনি বললেন, ‘এটা আমার দিকে আনয়নকারী সরল পথ’।",
    "‘নিশ্চয় আমার বান্দাদের উপর তোমার কোন ক্ষমতা নেই, তবে পথভ্রষ্টরা ছাড়া যারা তোমাকে অনুসরণ করেছে’।",
    "‘আর নিশ্চয় জাহান্নাম তাদের সকলের প্রতিশ্রুত স্থান’।",
    "‘তার সাতটি দরজা রয়েছে। প্রতিটি দরজার জন্য রয়েছে তাদের মধ্য থেকে নির্দিষ্ট একটি শ্রেণী’।",
    "নিশ্চয় মুত্তাকীগণ থাকবে জান্নাত ও ঝর্ণাধারাসমূহে।",
    "‘তোমরা তাতে প্রবেশ কর শান্তিতে, নিরাপদ হয়ে’।",
    "আর আমি তাদের অন্তর থেকে হিংসা বিদ্বেষ বের করে ফেলব, তারা সেখানে ভাই ভাই হয়ে আসনে মুখোমুখি বসবে।",
    "সেখানে তাদেরকে ক্লান্তি স্পর্শ করবে না এবং তারা সেখান থেকে বহিষ্কৃতও হবে না।",
    "আমার বান্দাদের জানিয়ে দাও যে, আমি নিশ্চয় ক্ষমাশীল, পরম দয়ালু।",
    "আর আমার আযাবই যন্ত্রণাদায়ক আযাব।",
    "আর তাদেরকে বলঃ ইবরাহীমের অতিথিদের কথা।",
    "যখন তারা তার নিকট প্রবেশ করল, অতঃপর বলল, ‘সালাম’। সে বলল, ‘আমরা নিশ্চয় তোমাদের ব্যাপারে শঙ্কিত’।",
    "তারা বলল, ‘তুমি ভীত হয়ো না, নিশ্চয় আমরা তোমাকে এক জ্ঞানী শিশুর সুসংবাদ দিচ্ছি’।",
    "সে বলল, ‘তোমরা কি আমাকে সুসংবাদ দিচ্ছ, যখন বার্ধক্য আমাকে স্পর্শ করেছে ? সুতরাং তোমরা কিসের সুসংবাদ দিচ্ছ’ ?",
    "তারা বলল, ‘আমরা তোমাকে যথার্থ সুসংবাদ দিচ্ছি। সুতরাং তুমি নিরাশদের অন্তর্ভুক্ত হয়ো না’।",
    "সে বলল, ‘পথভ্রষ্টরা ছাড়া, কে তার রবের রহমত থেকে নিরাশ হয়’ ?",
    "সে বলল, ‘তবে তোমাদের কী কাজ হে প্রেরিতগণ’ ?",
    "তারা বলল, ‘নিশ্চয় আমরা প্রেরিত হয়েছি অপরাধী কওমের নিকট’।",
    "‘লূতের পরিবার ছাড়া, আমরা নিশ্চয় তাদের সবাইকে রক্ষা করব’।",
    "‘তবে তার স্ত্রী ছাড়া, আমরা সিদ্ধান্ত নিয়েছি যে, নিশ্চয় সে শাস্তিপ্রাপ্তদের দলভুক্ত’।",
    "এরপর যখন ফেরেশতাগণ লূতের পরিবারের কাছে আসল,",
    "সে বলল, ‘তোমরা তো অপরিচিত লোক’।",
    "তারা বলল, ‘বরং আমরা তোমার কাছে এমন বিষয় নিয়ে এসেছি, যাতে তারা সন্দেহ করত’।",
    "‘আর আমরা তোমার নিকট সত্য নিয়ে এসেছি এবং আমরা অবশ্যই সত্যবাদী’।",
    "‘সুতরাং তুমি তোমার পরিবার নিয়ে বেরিয়ে পড় রাতের একাংশে, আর তুমি তাদের পেছনে চল, আর তোমাদের কেউ পেছনে ফিরে তাকাবে না এবং যেভাবে তোমাদের নির্দেশ করা হয়েছে সেভাবেই চলতে থাকবে’।",
    "আর আমি তাকে এ সিদ্ধান্ত জানিয়ে দিয়েছিলাম যে, নিশ্চয় সকালে এদের শিকড় কেটে ফেলা হবে।",
    "আর শহরের অধিবাসীরা উৎফুল্ল হয়ে হাযির হল।",
    "সে বলল, ‘নিশ্চয় এরা আমার মেহমান, সুতরাং আমাকে অপমানিত করো না’।",
    "‘তোমরা আল্লাহকে ভয় কর এবং আমাকে লাঞ্ছিত করো না’।",
    "তারা বলল, ‘আমরা কি জগদ্বাসীর কারো মেহমানদারী করতে তোমাকে নিষেধ করিনি’?",
    "সে বলল, ‘ওরা আমার মেয়ে* , যদি তোমরা করতেই চাও (তবে বিবাহের মাধ্যমে বৈধ উপায়ে কর)। \n*‘আমার মেয়ে’ দ্বারা উদ্দেশ্য কওমের মেয়েরা। কারণ, যে কোন কওমের নবী তাদের পিতাতুল্য।",
    "তোমার জীবনের কসম, নিশ্চয় তারা তাদেরকে নেশায় ঘুরপাক খাচ্ছিল।",
    "অতএব সূর্যোদয়কালে বিকট আওয়াজ তাদের পেয়ে বসল।",
    "অতঃপর আমি তার (নগরীর) উপরকে নিচে উলটে দিলাম এবং তাদের উপর বর্ষণ করলাম পোড়া মাটির পাথর।",
    "নিশ্চয় এতে পর্যবেক্ষণকারীদের জন্য রয়েছে নিদর্শনমালা।",
    "আর নিশ্চয়ই তা পথের পাশেই বিদ্যমান ।",
    "নিশ্চয় এতে মুমিনদের জন্য রয়েছে নিদর্শন।",
    "আর নিশ্চয় আইকার* অধিবাসীরা ছিল যালিম। \n* الأيكة বলা হয় ঘন উদ্যানকে। শুআইব (আ:)-এর কওম গহীন বনে বসবাস করত, তাই তাদেরকে أصحاب الأيكة বলা হয়।",
    "অতঃপর আমি তাদের থেকে প্রতিশোধ নিলাম। আর এ (জনপদ) দু’টি উন্মুক্ত রাস্তার পাশেই বিদ্যমান।",
    "আর অবশ্যই হিজরের অধিবাসীরা [সালেহের (আঃ) কওম] রাসূলদেরকে অস্বীকার করেছে।",
    "আর আমি তাদেরকে আমার আয়াতসমূহ দিয়েছিলাম, তবে তারা তা থেকে বিমুখ হয়েছে।",
    "আর তারা পাহাড় কেটে বাড়ি বানাত নিরাপদে।",
    "কিন্তু ভোরে বিকট আওয়াজ তাদেরকে পাকড়াও করল।",
    "আর তারা যা উপার্জন করত, তা তাদের কাজে আসল না।",
    "আর আমি আসমানসমূহ, যমীন ও এ দুয়ের মধ্যে যা আছে, তা যথার্থতা ছাড়া সৃষ্টি করিনি এবং নিশ্চয় কিয়ামত আসবে। সুতরাং তুমি সুন্দরভাবে তাদেরকে এড়িয়ে যাও।",
    "নিশ্চয় তোমার রবই সৃষ্টিকর্তা, মহাজ্ঞানী।",
    "আর আমি তো তোমাকে দিয়েছি পুনঃপুনঃ পঠিত সাতটি আয়াত ও মহান কুরআন।",
    "আমি তাদের কিছু শ্রেণীকে যে ভোগ-উপকরণ দিয়েছি, তার প্রতি তুমি দু’চোখ প্রসারিত করো না। আর তাদের জন্য দুঃখিত হয়ো না এবং মুমিনদের জন্য তোমার বাহু অবনত কর।",
    "আর বল, ‘নিশ্চয় আমিই সুস্পষ্ট সতর্ককারী’।",
    "যেভাবে আমি নাযিল করেছিলাম বিভক্তকারীদের (ইয়াহূদী ও নাসারা) উপর,",
    "যারা কুরআনকে বিভিন্ন অংশে ভাগ করেছিল।* \n* ‘বিভিন্ন অংশে ভাগ করেছিল, অর্থাৎ কুরআনকে তারা বিভিন্ন নামে ও বিভিন্ন অভিধায় চি‎‎হ্নত করত, যেমন কেউ বলত, এটি যাদু, কেউ বলত, কবিতা, আবার কেউ বলত, গণকদের গণনা ইত্যাদি।",
    "অতএব তোমার রবের কসম, আমি তাদের সকলকে অবশ্যই জেরা করব,",
    "তারা যা করত, সে সম্পর্কে।",
    "সুতরাং তোমাকে যে আদেশ দেয়া হয়েছে, তা ব্যাপকভাবে প্রচার কর এবং মুশরিকদের থেকে মুখ ফিরিয়ে নাও।",
    "নিশ্চয় আমি তোমার জন্য উপহাসকারীদের বিপক্ষে যথেষ্ট।",
    "যারা আল্লাহর সাথে অন্য ইলাহ নির্ধারণ করে। অতএব তারা অচিরেই জানতে পারবে।",
    "আর অবশ্যই আমি জানি যে, তারা যা বলে তাতে তোমার অন্তর সঙ্কুচিত হয়।",
    "সুতরাং তুমি তোমার রবের প্রশংসায় তাসবীহ পাঠ কর এবং সিজদাকারীদের অন্তর্ভুক্ত হও।",
    "আর ইয়াকীন (মৃত্যু) আসা পর্যন্ত তুমি তোমার রবের ইবাদাত কর।"
  ]
}