{
  "surahName": "Ibrahim",
  "surahNameArabic": "ابراهيم",
  "surahNameArabicLong": "سورة ابراهيم",
  "surahNameTranslation": "Abraham",
  "revelationPlace": "Mecca",
  "totalAyah": 52,
  "surahNo": 14,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/14.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/014.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/14.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/014.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/14.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/014.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/14.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/014.mp3"
    }
  },
  "english": [
    "Alif-Lãm-Ra. ˹This is˺ a Book which We have revealed to you ˹O Prophet˺ so that you may lead people out of darkness and into light, by the Will of their Lord, to the Path of the Almighty, the Praiseworthy—",
    "Allah, to Whom belongs whatever is in the heavens and whatever is on the earth. And woe to the disbelievers because of a severe torment!",
    "˹They are˺ the ones who favour the life of this world over the Hereafter and hinder ˹others˺ from the Way of Allah, striving to make it ˹appear˺ crooked. It is they who have gone far astray.",
    "We have not sent a messenger except in the language of his people to clarify ˹the message˺ for them. Then Allah leaves whoever He wills to stray and guides whoever He wills. And He is the Almighty, All-Wise.",
    "Indeed, We sent Moses with Our signs, ˹ordering him,˺ “Lead your people out of darkness and into light, and remind them of Allah’s days ˹of favour˺.” Surely in this are signs for whoever is steadfast, grateful.",
    "˹Consider˺ when Moses said to his people, “Remember Allah’s favour upon you when He rescued you from the people of Pharaoh, who afflicted you with dreadful torment—slaughtering your sons and keeping your women. That was a severe test from your Lord.",
    "And ˹remember˺ when your Lord proclaimed, ‘If you are grateful, I will certainly give you more. But if you are ungrateful, surely My punishment is severe.’”",
    "Moses added, “If you along with everyone on earth were to be ungrateful, then ˹know that˺ Allah is indeed Self-Sufficient, Praiseworthy.”",
    "Have you not ˹already˺ received the stories of those who were before you: the people of Noah, ’Âd, Thamûd, and those after them? Only Allah knows how many they were. Their messengers came to them with clear proofs, but they put their hands over their mouths and said, “We totally reject what you have been sent with, and we are certainly in alarming doubt about what you are inviting us to.”",
    "Their messengers asked ˹them˺, “Is there any doubt about Allah, the Originator of the heavens and the earth? He is inviting you in order to forgive your sins, and delay your end until your appointed term.” They argued, “You are no more than humans like us! You ˹only˺ wish to turn us away from what our forefathers worshipped. So bring us some compelling proof.”",
    "Their messengers said to them, “We are ˹indeed˺ only humans like you, but Allah favours whoever He chooses of His servants. It is not for us to bring you any proof without Allah’s permission. And in Allah let the believers put their trust.",
    "Why should we not put our trust in Allah, when He has truly guided us to ˹the very best of˺ ways? Indeed, we will patiently endure whatever harm you may cause us. And in Allah let the faithful put their trust.”",
    "The disbelievers then threatened their messengers, “We will certainly expel you from our land, unless you return to our faith.” So their Lord revealed to them, “We will surely destroy the wrongdoers",
    "and make you reside in the land after them. This is for whoever is in awe of standing before Me and fears My warning.”",
    "And both sides called for judgment, so every stubborn tyrant was doomed.",
    "Awaiting them is Hell, and they will be left to drink oozing pus",
    "which they will sip with difficulty, and can hardly swallow. Death will overwhelm them from every side, yet they will not ˹be able to˺ die. Awaiting them still is harsher torment.",
    "The parable of the deeds of those who disbelieve in their Lord is that of ashes fiercely blown away by wind on a stormy day. They will gain nothing from what they have earned. That is ˹truly˺ the farthest one can stray.",
    "Have you not seen that Allah created the heavens and the earth for a reason? If He wills, He can eliminate you and produce a new creation.",
    "And that is not difficult for Allah ˹at all˺.",
    "They will all appear before Allah, and the lowly ˹followers˺ will appeal to the arrogant ˹leaders˺, “We were your ˹dedicated˺ followers, so will you ˹then˺ protect us from Allah’s torment in any way?” They will reply, “Had Allah guided us, we would have guided you. ˹Now˺ it is all the same for us whether we suffer patiently or impatiently, there is no escape for us.”",
    "And Satan will say ˹to his followers˺ after the judgment has been passed, “Indeed, Allah has made you a true promise. I too made you a promise, but I failed you. I did not have any authority over you. I only called you, and you responded to me. So do not blame me; blame yourselves. I cannot save you, nor can you save me. Indeed, I denounce your previous association of me with Allah ˹in loyalty˺. Surely the wrongdoers will suffer a painful punishment.”",
    "Those who believe and do good will be admitted into Gardens, under which rivers flow—to stay there forever by the Will of their Lord—where they will be greeted with “Peace!”",
    "Do you not see how Allah compares a good word to a good tree? Its root is firm and its branches reach the sky",
    "˹always˺ yielding its fruit in every season by the Will of its Lord. This is how Allah sets forth parables for the people, so perhaps they will be mindful.",
    "And the parable of an evil word is that of an evil tree, uprooted from the earth, having no stability.",
    "Allah makes the believers steadfast with the firm Word ˹of faith˺ in this worldly life and the Hereafter. And Allah leaves the wrongdoers to stray. For Allah does what He wills.",
    "Have you not seen those ˹disbelievers˺ who meet Allah’s favours with ingratitude and lead their own people to their doom?",
    "In Hell they will burn. What an evil place for settlement.",
    "They set up equals to Allah to mislead ˹others˺ from His Way. Say, ˹O Prophet,˺ “Enjoy yourselves! Surely your destination is the Fire.”",
    "Tell My believing servants to establish prayer and donate from what We have provided for them—openly and secretly—before the arrival of a Day in which there will be no ransom or friendly connections.",
    "It is Allah Who created the heavens and the earth and sends down rain from the sky, causing fruits to grow as a provision for you. He has subjected the ships for your service, sailing through the sea by His command, and has subjected the rivers for you.",
    "He has ˹also˺ subjected for you the sun and the moon, both constantly orbiting, and has subjected the day and night for you.",
    "And He has granted you all that you asked Him for. If you tried to count Allah’s blessings, you would never be able to number them. Indeed humankind is truly unfair, ˹totally˺ ungrateful.",
    "˹Remember˺ when Abraham prayed, “My Lord! Make this city ˹of Mecca˺ secure, and keep me and my children away from the worship of idols.",
    "My Lord! They have caused many people to go astray. So whoever follows me is with me, and whoever disobeys me—then surely You are ˹still˺ All-Forgiving, Most Merciful.",
    "Our Lord! I have settled some of my offspring in a barren valley, near Your Sacred House, our Lord, so that they may establish prayer. So make the hearts of ˹believing˺ people incline towards them and provide them with fruits, so perhaps they will be thankful.",
    "Our Lord! You certainly know what we conceal and what we reveal. Nothing on earth or in heaven is hidden from Allah.",
    "All praise is for Allah who has blessed me with Ishmael and Isaac in my old age. My Lord is indeed the Hearer of ˹all˺ prayers.",
    "My Lord! Make me and those ˹believers˺ of my descendants keep up prayer. Our Lord! Accept my prayers.",
    "Our Lord! Forgive me, my parents, and the believers on the Day when the judgment will come to pass.”",
    "Do not think ˹O Prophet˺ that Allah is unaware of what the wrongdoers do. He only delays them until a Day when ˹their˺ eyes will stare in horror—",
    "rushing forth, heads raised, never blinking, hearts void.",
    "And warn the people of the Day when the punishment will overtake ˹the wicked among˺ them, and the wrongdoers will cry, “Our Lord! Delay us for a little while. We will respond to Your call and follow the messengers!” ˹It will be said,˺ “Did you not swear before that you would never be removed ˹to the next life˺?”",
    "You passed by the ruins of those ˹destroyed peoples˺ who had wronged themselves. It was made clear to you how We dealt with them, and We gave you ˹many˺ examples.",
    "They devised every plot, which was fully known to Allah, but their plotting was not enough to ˹even˺ overpower mountains ˹let alone Allah˺.",
    "So do not think ˹O Prophet˺ that Allah will fail to keep His promise to His messengers. Allah is indeed Almighty, capable of punishment.",
    "˹Watch for˺ the Day ˹when˺ the earth will be changed into a different earth and the heavens as well, and all will appear before Allah—the One, the Supreme.",
    "On that Day you will see the wicked bound together in chains",
    "with garments of tar, and their faces covered with flames.",
    "As such, Allah will reward every soul for what it has committed. Surely Allah is swift in reckoning.",
    "This ˹Quran˺ is a ˹sufficient˺ message for humanity so that they may take it as a warning and know that there is only One God, and so that people of reason may be mindful."
  ],
  "arabic1": [
    "الٓرٰ ۫ كِتٰبٌ اَنْزَلْنٰهُ اِلَیْكَ لِتُخْرِجَ النَّاسَ مِنَ الظُّلُمٰتِ اِلَی النُّوْرِ بِاِذْنِ رَبِّهِمْ اِلٰی صِرَاطِ الْعَزِیْزِ الْحَمِیْدِ",
    "اللّٰهِ الَّذِیْ لَهٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَوَیْلٌ لِّلْكٰفِرِیْنَ مِنْ عَذَابٍ شَدِیْدِ",
    "١لَّذِیْنَ یَسْتَحِبُّوْنَ الْحَیٰوةَ الدُّنْیَا عَلَی الْاٰخِرَةِ وَیَصُدُّوْنَ عَنْ سَبِیْلِ اللّٰهِ وَیَبْغُوْنَهَا عِوَجًا اُولٰٓىِٕكَ فِیْ ضَلٰلٍۢ بَعِیْدٍ",
    "وَمَاۤ اَرْسَلْنَا مِنْ رَّسُوْلٍ اِلَّا بِلِسَانِ قَوْمِهٖ لِیُبَیِّنَ لَهُمْ فَیُضِلُّ اللّٰهُ مَنْ یَّشَآءُ وَیَهْدِیْ مَنْ یَّشَآءُ وَهُوَ الْعَزِیْزُ الْحَكِیْمُ",
    "وَلَقَدْ اَرْسَلْنَا مُوْسٰی بِاٰیٰتِنَاۤ اَنْ اَخْرِجْ قَوْمَكَ مِنَ الظُّلُمٰتِ اِلَی النُّوْرِ وَذَكِّرْهُمْ بِاَیّٰىمِ اللّٰهِ اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّكُلِّ صَبَّارٍ شَكُوْرٍ",
    "وَاِذْ قَالَ مُوْسٰی لِقَوْمِهِ اذْكُرُوْا نِعْمَةَ اللّٰهِ عَلَیْكُمْ اِذْ اَنْجٰىكُمْ مِّنْ اٰلِ فِرْعَوْنَ یَسُوْمُوْنَكُمْ سُوْٓءَ الْعَذَابِ وَیُذَبِّحُوْنَ اَبْنَآءَكُمْ وَیَسْتَحْیُوْنَ نِسَآءَكُمْ وَفِیْ ذٰلِكُمْ بَلَآءٌ مِّنْ رَّبِّكُمْ عَظِیْمٌ",
    "وَاِذْ تَاَذَّنَ رَبُّكُمْ لَىِٕنْ شَكَرْتُمْ لَاَزِیْدَنَّكُمْ وَلَىِٕنْ كَفَرْتُمْ اِنَّ عَذَابِیْ لَشَدِیْدٌ",
    "وَقَالَ مُوْسٰۤی اِنْ تَكْفُرُوْۤا اَنْتُمْ وَمَنْ فِی الْاَرْضِ جَمِیْعًا فَاِنَّ اللّٰهَ لَغَنِیٌّ حَمِیْدٌ",
    "اَلَمْ یَاْتِكُمْ نَبَؤُا الَّذِیْنَ مِنْ قَبْلِكُمْ قَوْمِ نُوْحٍ وَّعَادٍ وَّثَمُوْدَ وَالَّذِیْنَ مِنْ بَعْدِهِمْ لَا یَعْلَمُهُمْ اِلَّا اللّٰهُ جَآءَتْهُمْ رُسُلُهُمْ بِالْبَیِّنٰتِ فَرَدُّوْۤا اَیْدِیَهُمْ فِیْۤ اَفْوَاهِهِمْ وَقَالُوْۤا اِنَّا كَفَرْنَا بِمَاۤ اُرْسِلْتُمْ بِهٖ وَاِنَّا لَفِیْ شَكٍّ مِّمَّا تَدْعُوْنَنَاۤ اِلَیْهِ مُرِیْبٍ",
    "قَالَتْ رُسُلُهُمْ اَفِی اللّٰهِ شَكٌّ فَاطِرِ السَّمٰوٰتِ وَالْاَرْضِ یَدْعُوْكُمْ لِیَغْفِرَ لَكُمْ مِّنْ ذُنُوْبِكُمْ وَیُؤَخِّرَكُمْ اِلٰۤی اَجَلٍ مُّسَمًّی قَالُوْۤا اِنْ اَنْتُمْ اِلَّا بَشَرٌ مِّثْلُنَا تُرِیْدُوْنَ اَنْ تَصُدُّوْنَا عَمَّا كَانَ یَعْبُدُ اٰبَآؤُنَا فَاْتُوْنَا بِسُلْطٰنٍ مُّبِیْنٍ",
    "قَالَتْ لَهُمْ رُسُلُهُمْ اِنْ نَّحْنُ اِلَّا بَشَرٌ مِّثْلُكُمْ وَلٰكِنَّ اللّٰهَ یَمُنُّ عَلٰی مَنْ یَّشَآءُ مِنْ عِبَادِهٖ وَمَا كَانَ لَنَاۤ اَنْ نَّاْتِیَكُمْ بِسُلْطٰنٍ اِلَّا بِاِذْنِ اللّٰهِ وَعَلَی اللّٰهِ فَلْیَتَوَكَّلِ الْمُؤْمِنُوْنَ",
    "وَمَا لَنَاۤ اَلَّا نَتَوَكَّلَ عَلَی اللّٰهِ وَقَدْ هَدٰىنَا سُبُلَنَا وَلَنَصْبِرَنَّ عَلٰی مَاۤ اٰذَیْتُمُوْنَا وَعَلَی اللّٰهِ فَلْیَتَوَكَّلِ الْمُتَوَكِّلُوْنَ",
    "وَقَالَ الَّذِیْنَ كَفَرُوْا لِرُسُلِهِمْ لَنُخْرِجَنَّكُمْ مِّنْ اَرْضِنَاۤ اَوْ لَتَعُوْدُنَّ فِیْ مِلَّتِنَا فَاَوْحٰۤی اِلَیْهِمْ رَبُّهُمْ لَنُهْلِكَنَّ الظّٰلِمِیْنَ",
    "وَلَنُسْكِنَنَّكُمُ الْاَرْضَ مِنْ بَعْدِهِمْ ذٰلِكَ لِمَنْ خَافَ مَقَامِیْ وَخَافَ وَعِیْدِ",
    "وَاسْتَفْتَحُوْا وَخَابَ كُلُّ جَبَّارٍ عَنِیْدٍ",
    "مِّنْ وَّرَآىِٕهٖ جَهَنَّمُ وَیُسْقٰی مِنْ مَّآءٍ صَدِیْدٍ",
    "یَّتَجَرَّعُهٗ وَلَا یَكَادُ یُسِیْغُهٗ وَیَاْتِیْهِ الْمَوْتُ مِنْ كُلِّ مَكَانٍ وَّمَا هُوَ بِمَیِّتٍ وَمِنْ وَّرَآىِٕهٖ عَذَابٌ غَلِیْظٌ",
    "مَثَلُ الَّذِیْنَ كَفَرُوْا بِرَبِّهِمْ اَعْمَالُهُمْ كَرَمَادِ ١شْتَدَّتْ بِهِ الرِّیْحُ فِیْ یَوْمٍ عَاصِفٍ لَا یَقْدِرُوْنَ مِمَّا كَسَبُوْا عَلٰی شَیْءٍ ذٰلِكَ هُوَ الضَّلٰلُ الْبَعِیْدُ",
    "اَلَمْ تَرَ اَنَّ اللّٰهَ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّ اِنْ یَّشَاْ یُذْهِبْكُمْ وَیَاْتِ بِخَلْقٍ جَدِیْدٍ",
    "وَّمَا ذٰلِكَ عَلَی اللّٰهِ بِعَزِیْزٍ",
    "وَبَرَزُوْا لِلّٰهِ جَمِیْعًا فَقَالَ الضُّعَفٰٓؤُا لِلَّذِیْنَ اسْتَكْبَرُوْۤا اِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ اَنْتُمْ مُّغْنُوْنَ عَنَّا مِنْ عَذَابِ اللّٰهِ مِنْ شَیْءٍ قَالُوْا لَوْ هَدٰىنَا اللّٰهُ لَهَدَیْنٰكُمْ سَوَآءٌ عَلَیْنَاۤ اَجَزِعْنَاۤ اَمْ صَبَرْنَا مَا لَنَا مِنْ مَّحِیْصٍ",
    "وَقَالَ الشَّیْطٰنُ لَمَّا قُضِیَ الْاَمْرُ اِنَّ اللّٰهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدْتُّكُمْ فَاَخْلَفْتُكُمْ وَمَا كَانَ لِیَ عَلَیْكُمْ مِّنْ سُلْطٰنٍ اِلَّاۤ اَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِیْ فَلَا تَلُوْمُوْنِیْ وَلُوْمُوْۤا اَنْفُسَكُمْ مَاۤ اَنَا بِمُصْرِخِكُمْ وَمَاۤ اَنْتُمْ بِمُصْرِخِیَّ اِنِّیْ كَفَرْتُ بِمَاۤ اَشْرَكْتُمُوْنِ مِنْ قَبْلُ اِنَّ الظّٰلِمِیْنَ لَهُمْ عَذَابٌ اَلِیْمٌ",
    "وَاُدْخِلَ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِیْنَ فِیْهَا بِاِذْنِ رَبِّهِمْ تَحِیَّتُهُمْ فِیْهَا سَلٰمٌ",
    "اَلَمْ تَرَ كَیْفَ ضَرَبَ اللّٰهُ مَثَلًا كَلِمَةً طَیِّبَةً كَشَجَرَةٍ طَیِّبَةٍ اَصْلُهَا ثَابِتٌ وَّفَرْعُهَا فِی السَّمَآءِ",
    "تُؤْتِیْۤ اُكُلَهَا كُلَّ حِیْنٍ بِاِذْنِ رَبِّهَا وَیَضْرِبُ اللّٰهُ الْاَمْثَالَ لِلنَّاسِ لَعَلَّهُمْ یَتَذَكَّرُوْنَ",
    "وَمَثَلُ كَلِمَةٍ خَبِیْثَةٍ كَشَجَرَةٍ خَبِیْثَةِ ١جْتُثَّتْ مِنْ فَوْقِ الْاَرْضِ مَا لَهَا مِنْ قَرَارٍ",
    "یُثَبِّتُ اللّٰهُ الَّذِیْنَ اٰمَنُوْا بِالْقَوْلِ الثَّابِتِ فِی الْحَیٰوةِ الدُّنْیَا وَفِی الْاٰخِرَةِ وَیُضِلُّ اللّٰهُ الظّٰلِمِیْنَ ۫ وَیَفْعَلُ اللّٰهُ مَا یَشَآءُ",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ بَدَّلُوْا نِعْمَتَ اللّٰهِ كُفْرًا وَّاَحَلُّوْا قَوْمَهُمْ دَارَ الْبَوَارِ",
    "جَهَنَّمَ یَصْلَوْنَهَا وَبِئْسَ الْقَرَارُ",
    "وَجَعَلُوْا لِلّٰهِ اَنْدَادًا لِّیُضِلُّوْا عَنْ سَبِیْلِهٖ قُلْ تَمَتَّعُوْا فَاِنَّ مَصِیْرَكُمْ اِلَی النَّارِ",
    "قُلْ لِّعِبَادِیَ الَّذِیْنَ اٰمَنُوْا یُقِیْمُوا الصَّلٰوةَ وَیُنْفِقُوْا مِمَّا رَزَقْنٰهُمْ سِرًّا وَّعَلَانِیَةً مِّنْ قَبْلِ اَنْ یَّاْتِیَ یَوْمٌ لَّا بَیْعٌ فِیْهِ وَلَا خِلٰلٌ",
    "اَللّٰهُ الَّذِیْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ وَاَنْزَلَ مِنَ السَّمَآءِ مَآءً فَاَخْرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزْقًا لَّكُمْ وَسَخَّرَ لَكُمُ الْفُلْكَ لِتَجْرِیَ فِی الْبَحْرِ بِاَمْرِهٖ وَسَخَّرَ لَكُمُ الْاَنْهٰرَ",
    "وَسَخَّرَ لَكُمُ الشَّمْسَ وَالْقَمَرَ دَآىِٕبَیْنِ وَسَخَّرَ لَكُمُ الَّیْلَ وَالنَّهَارَ",
    "وَاٰتٰىكُمْ مِّنْ كُلِّ مَا سَاَلْتُمُوْهُ وَاِنْ تَعُدُّوْا نِعْمَتَ اللّٰهِ لَا تُحْصُوْهَا اِنَّ الْاِنْسَانَ لَظَلُوْمٌ كَفَّارٌ",
    "وَاِذْ قَالَ اِبْرٰهِیْمُ رَبِّ اجْعَلْ هٰذَا الْبَلَدَ اٰمِنًا وَّاجْنُبْنِیْ وَبَنِیَّ اَنْ نَّعْبُدَ الْاَصْنَامَ",
    "رَبِّ اِنَّهُنَّ اَضْلَلْنَ كَثِیْرًا مِّنَ النَّاسِ فَمَنْ تَبِعَنِیْ فَاِنَّهٗ مِنِّیْ وَمَنْ عَصَانِیْ فَاِنَّكَ غَفُوْرٌ رَّحِیْمٌ",
    "رَبَّنَاۤ اِنِّیْۤ اَسْكَنْتُ مِنْ ذُرِّیَّتِیْ بِوَادٍ غَیْرِ ذِیْ زَرْعٍ عِنْدَ بَیْتِكَ الْمُحَرَّمِ رَبَّنَا لِیُقِیْمُوا الصَّلٰوةَ فَاجْعَلْ اَفْىِٕدَةً مِّنَ النَّاسِ تَهْوِیْۤ اِلَیْهِمْ وَارْزُقْهُمْ مِّنَ الثَّمَرٰتِ لَعَلَّهُمْ یَشْكُرُوْنَ",
    "رَبَّنَاۤ اِنَّكَ تَعْلَمُ مَا نُخْفِیْ وَمَا نُعْلِنُ وَمَا یَخْفٰی عَلَی اللّٰهِ مِنْ شَیْءٍ فِی الْاَرْضِ وَلَا فِی السَّمَآءِ",
    "اَلْحَمْدُ لِلّٰهِ الَّذِیْ وَهَبَ لِیْ عَلَی الْكِبَرِ اِسْمٰعِیْلَ وَاِسْحٰقَ اِنَّ رَبِّیْ لَسَمِیْعُ الدُّعَآءِ",
    "رَبِّ اجْعَلْنِیْ مُقِیْمَ الصَّلٰوةِ وَمِنْ ذُرِّیَّتِیْ ۖ رَبَّنَا وَتَقَبَّلْ دُعَآءِ",
    "رَبَّنَا اغْفِرْ لِیْ وَلِوَالِدَیَّ وَلِلْمُؤْمِنِیْنَ یَوْمَ یَقُوْمُ الْحِسَابُ",
    "وَلَا تَحْسَبَنَّ اللّٰهَ غَافِلًا عَمَّا یَعْمَلُ الظّٰلِمُوْنَ اِنَّمَا یُؤَخِّرُهُمْ لِیَوْمٍ تَشْخَصُ فِیْهِ الْاَبْصَارُ",
    "مُهْطِعِیْنَ مُقْنِعِیْ رُءُوْسِهِمْ لَا یَرْتَدُّ اِلَیْهِمْ طَرْفُهُمْ وَاَفْـِٕدَتُهُمْ هَوَآءٌ",
    "وَاَنْذِرِ النَّاسَ یَوْمَ یَاْتِیْهِمُ الْعَذَابُ فَیَقُوْلُ الَّذِیْنَ ظَلَمُوْا رَبَّنَاۤ اَخِّرْنَاۤ اِلٰۤی اَجَلٍ قَرِیْبٍ نُّجِبْ دَعْوَتَكَ وَنَتَّبِعِ الرُّسُلَ اَوَلَمْ تَكُوْنُوْۤا اَقْسَمْتُمْ مِّنْ قَبْلُ مَا لَكُمْ مِّنْ زَوَالٍ",
    "وَّسَكَنْتُمْ فِیْ مَسٰكِنِ الَّذِیْنَ ظَلَمُوْۤا اَنْفُسَهُمْ وَتَبَیَّنَ لَكُمْ كَیْفَ فَعَلْنَا بِهِمْ وَضَرَبْنَا لَكُمُ الْاَمْثَالَ",
    "وَقَدْ مَكَرُوْا مَكْرَهُمْ وَعِنْدَ اللّٰهِ مَكْرُهُمْ وَاِنْ كَانَ مَكْرُهُمْ لِتَزُوْلَ مِنْهُ الْجِبَالُ",
    "فَلَا تَحْسَبَنَّ اللّٰهَ مُخْلِفَ وَعْدِهٖ رُسُلَهٗ اِنَّ اللّٰهَ عَزِیْزٌ ذُو انْتِقَامٍ",
    "یَوْمَ تُبَدَّلُ الْاَرْضُ غَیْرَ الْاَرْضِ وَالسَّمٰوٰتُ وَبَرَزُوْا لِلّٰهِ الْوَاحِدِ الْقَهَّارِ",
    "وَتَرَی الْمُجْرِمِیْنَ یَوْمَىِٕذٍ مُّقَرَّنِیْنَ فِی الْاَصْفَادِ",
    "سَرَابِیْلُهُمْ مِّنْ قَطِرَانٍ وَّتَغْشٰی وُجُوْهَهُمُ النَّارُ",
    "لِیَجْزِیَ اللّٰهُ كُلَّ نَفْسٍ مَّا كَسَبَتْ اِنَّ اللّٰهَ سَرِیْعُ الْحِسَابِ",
    "هٰذَا بَلٰغٌ لِّلنَّاسِ وَلِیُنْذَرُوْا بِهٖ وَلِیَعْلَمُوْۤا اَنَّمَا هُوَ اِلٰهٌ وَّاحِدٌ وَّلِیَذَّكَّرَ اُولُوا الْاَلْبَابِ"
  ],
  "bengali": [
    "আলিফ-লাম-রা; এই কিতাব, যা আমি তোমার প্রতি নাযিল করেছি, যাতে তুমি মানুষকে তাদের রবের অনুমতিক্রমে অন্ধকার থেকে আলোর দিকে বের করে আন, পরাক্রমশালী সর্বপ্রশংসিতের পথের দিকে।",
    "আল্লাহর (পথ), আসমানসমূহ ও যমীনের সব কিছুই যার মালিকানায় এবং কাফিরদের জন্য রয়েছে কঠিন আযাবের দুর্ভোগ।",
    "যারা দুনিয়ার জীবনকে আখিরাত থেকে অধিক পছন্দ করে, আর আল্লাহর পথে বাধা দেয় এবং তাতে বক্রতার সন্ধান করে; তারা ঘোরতর ভ্রষ্টতায় রয়েছে।",
    "আর আমি প্রত্যেক রাসূলকে তার কওমের ভাষাতেই পাঠিয়েছি, যাতে সে তাদের কাছে বর্ণনা দেয়, সুতরাং আল্লাহ যাকে ইচ্ছা পথভ্রষ্ট করেন এবং যাকে ইচ্ছা সঠিক পথ দেখান। আর তিনি পরাক্রমশালী, প্রজ্ঞাময়।",
    "আর আমি মূসাকে আমার আয়াতসমূহ দিয়ে পাঠিয়েছি যে, ‘তুমি তোমার কওমকে অন্ধকার হতে আলোর দিকে বের করে আন এবং আল্লাহর দিবসসমূহ* তাদের স্মরণ করিয়ে দাও’। নিশ্চয় এতে প্রতিটি ধৈর্যশীল, কৃতজ্ঞ ব্যক্তির জন্য রয়েছে অসংখ্য নিদর্শন। \n* দিবসসমূহ দ্বারা উদ্দেশ্য ইতঃপূর্বের ঐতিহাসিক ঘটনাসমূহ।",
    "আর যখন মূসা তার কওমকে বলেছিল, তোমাদের প্রতি আল্লাহর নিয়ামাত স্মরণ কর, যখন তিনি তোমাদেরকে ফির‘আউন পরিবারের কবল থেকে রক্ষা করেছেন, তারা তোমাদের জঘন্য আযাব দিত। আর তারা তোমাদের ছেলেদেরকে যবেহ করত এবং নারীদেরকে জীবিত রাখত। আর তাতে ছিল তোমাদের রবের পক্ষ থেকে মহাপরীক্ষা।",
    "আর যখন তোমাদের রব ঘোষণা দিলেন, ‘যদি তোমরা শুকরিয়া আদায় কর, তবে আমি অবশ্যই তোমাদের বাড়িয়ে দেব, আর যদি তোমরা অকৃতজ্ঞ হও, নিশ্চয় আমার আযাব বড় কঠিন’।",
    "আর মূসা বলল, ‘যদি তোমরা ও যমীনের সকলে কুফরী কর, তাহলে নিশ্চয় আল্লাহ অমুখাপেক্ষী, প্রশংসিত’।",
    "তোমাদের কাছে কি তোমাদের পূর্বের লোকদের সংবাদ পৌছেনি? নূহ, আদ ও সামূদ জাতির এবং যারা তাদের পরের, যাদেরকে আল্লাহ ছাড়া কেউ জানে না। তাদের রাসূলগণ তাদের নিকট স্পষ্ট প্রমাণাদি নিয়ে এসেছিল, ফলে তারা ফিরিয়ে দিল তাদের হাত তাদের মুখে এবং বলল, ‘নিশ্চয় তোমাদেরকে যা দিয়ে প্রেরণ করা হয়েছে, তা আমরা অস্বীকার করলাম। আর তোমরা আমাদের যে বিষয়ের প্রতি দাওয়াত দিচ্ছ, সে বিষয়ে আমরা ঘোর সন্দেহে রয়েছি’।",
    "তাদের রাসূলগণ বলেছিল, ‘আল্লাহর ব্যাপারেও কি সন্দেহ, যিনি আসমানসমূহ ও যমীনের সৃষ্টিকর্তা? তিনি তোমাদেরকে আহবান করেন যাতে তিনি তোমাদের পাপসমূহ ক্ষমা করেন এবং তিনি নির্দিষ্ট সময় পর্যন্ত তোমাদেরকে অবকাশ দেন’। তারা বলল, ‘তোমরা তো আমাদের মতই মানুষ, ‘তোমরা আমাদেরকে আমাদের পিতৃপুরুষরা যার ইবাদাত করত, তা থেকে ফিরাতে চাও। অতএব তোমরা আমাদের কাছে স্পষ্ট প্রমাণ নিয়ে আস’।",
    "তাদেরকে তাদের রাসূলগণ বলল, ‘আমরা তো কেবল তোমাদের মতই মানুষ, কিন্তু আল্লাহ তার বান্দাদের মধ্যে যাকে ইচ্ছা অনুগ্রহ করেন। আর আল্লাহর অনুমতি ছাড়া তোমাদের কাছে প্রমাণ নিয়ে আসার সাধ্য আমাদের নেই। আর কেবল আল্লাহর উপরই মুমিনদের তাওয়াক্কুল করা উচিত’।",
    "‘আর আমরা কেন আল্লাহর উপর তাওয়াক্কুল করব না, অথচ তিনিই আমাদেরকে আমাদের পথের দিশা দিয়েছেন। আর তোমরা আমাদের যে কষ্ট দিচ্ছ, আমরা তার উপর অবশ্যই সবর করব। আর আল্লাহর উপরই যেন তাওয়াক্কুলকারীরা তাওয়াক্কুল করে’।",
    "আর যারা কুফরী করেছে, তারা তাদের রাসূলদের বলল, ‘আমরা তোমাদেরকে আমাদের ভূ-খন্ড থেকে অবশ্যই বের করে দেব, অথবা তোমরা অবশ্যই আমাদের মিল্লাতে ফিরে আসবে’। অতঃপর তাদের রব তাদের নিকট ওহী পাঠালেন, ‘আমি অবশ্যই যালিমদের ধ্বংস করে দেব’।",
    "‘আর নিশ্চয় আমি তাদের পর তোমাদেরকে যমীনে বাস করতে দেব। এটা তার জন্য, যে আমার অবস্থানকে ভয় করে এবং ভয় করে আমার ধমকের’।",
    "আর তারা বিজয় কামনা করল, আর ব্যর্থ হল সকল স্বেচ্ছাচারী, হঠকারী।",
    "এর সামনে রয়েছে জাহান্নাম, আর তাদের পান করানো হবে গলিত পুঁজ থেকে।",
    "সে তা গিলতে চাইবে এবং প্রায় সহজে সে তা গিলতে পারবে না। আর তার কাছে সকল স্থান থেকে মৃত্যু ধেঁয়ে আসবে, অথচ সে মরবে না। আর এর পরেও রয়েছে কঠিন আযাব ।",
    "যারা তাদের রবের সাথে কুফরী করে তাদের আমলসমূহের দৃষ্টান্ত হল এমন ছাইয়ের মত, প্রবল ঘুর্ণিঝড়ের দিনে বাতাস প্রচন্ড বেগে যা বহন করে নিয়ে যায়। তারা যা অর্জন করেছে, তার মাধ্যমে কিছুই করতে পারে না। এ তো ঘোরতর বিভ্রান্তি।",
    "তুমি কি দেখ না যে, আল্লাহ আসমানসমূহ এবং যমীন সৃষ্টি করেছেন যথাযথভাবে? তিনি ইচ্ছা করলে তোমাদেরকে নিশ্চি‎হ্ন করতে পারেন এবং অস্তিত্বে আনতে পারেন নতুন সৃষ্টি ।",
    "আর এটা আল্লাহর জন্য মোটেই কঠিন নয়।",
    "আর তারা সবাই আল্লাহর সামনে হাজির হবে, অতঃপর যারা অহঙ্কার করেছে দুর্বলরা তাদেরকে বলবে, ‘নিশ্চয় আমরা তোমাদের অনুসারী ছিলাম। সুতরাং তোমরা কি আল্লাহর আযাবের মোকাবেলায় আমাদের কোন উপকারে আসবে’? তারা বলবে, ‘যদি আল্লাহ আমাদের হিদায়াত করতেন, তাহলে আমরাও তোমাদের হিদায়াত করতাম, এখন আমরা অস্থির হই কিংবা সবর করি, উভয় অবস্থাই আমাদের জন্য সমান, আমাদের পালানোর কোন জায়গা নেই’।",
    "আর যখন যাবতীয় বিষয়ের ফয়সালা হয়ে যাবে, তখন শয়তান বলবে, ‘নিশ্চয় আল্লাহ তোমাদেরকে ওয়াদা দিয়েছিলেন সত্য ওয়াদা, তোমাদের উপর আমার কোন আধিপত্য ছিল না, তবে আমিও তোমাদেরকে ওয়াদা দিয়েছিলাম, এখন আমি তা ভঙ্গ করলাম। তোমাদেরকে দাওয়াত দিয়েছি, আর তোমরা আমার দাওয়াতে সাড়া দিয়েছ। সুতরাং তোমরা আমাকে ভৎর্সনা করো না, বরং নিজদেরকেই ভৎর্সনা কর। আমি তোমাদের উদ্ধারকারী নই, আর তোমরাও আমার উদ্ধারকারী নও। ইতঃপূর্বে তোমরা আমাকে যার সাথে শরীক করেছ, নিশ্চয় আমি তা অস্বীকার করছি। নিশ্চয় যালিমদের জন্য রয়েছে বেদনাদায়ক আযাব’ ।",
    "আর যারা ঈমান আনে এবং নেক আমল করে তাদের জান্নাতে প্রবেশ করানো হবে, যার তলদেশে নহরসমূহ প্রবাহিত হবে, তারা তাতে তাদের রবের অনুমতিক্রমে স্থায়ী হবে। তথায় তাদের অভিবাদন হবে ‘সালাম’।",
    "তুমি কি দেখ না, আল্লাহ কীভাবে উপমা পেশ করেছেন? কালিমা তাইয়েবা, যা একটি ভাল বৃক্ষের ন্যায়, যার মূল সুস্থির আর শাখা-প্রশাখা আকাশে।",
    "সেটি তার রবের অনুমতিতে সব সময় ফল দান করে; আর আল্লাহ মানুষের জন্য নানা দৃষ্টান্ত প্রদান করেন, যাতে তারা উপদেশ গ্রহণ করে।",
    "আর অপবিত্র বাক্যের উপমা নিকৃষ্ট বৃক্ষের ন্যায়, যাকে মাটির উপর থেকে সমূলে উপড়ে ফেলা হয়েছে, যার কোন স্থিতি নেই।",
    "আল্লাহ অবিচল রাখেন ঈমানদারদেরকে সুদৃঢ় বাণী দ্বারা দুনিয়ার জীবনে ও আখিরাতে। আর আল্লাহ যালিমদের পথভ্রষ্ট করেন এবং আল্লাহ যা ইচ্ছা তা করেন।",
    "তুমি কি তাদেরকে দেখ না, যারা আল্লাহর নিআমতকে কুফরী দ্বারা পরিবর্তন করেছে এবং তাদের কওমকে ধ্বংসের ঘরে নামিয়ে দিয়েছে?",
    "জাহান্নামে, যাতে তারা দগ্ধ হবে, আর তা কতইনা নিকৃষ্ট অবস্থান!",
    "আর তারা আল্লাহর জন্য সমকক্ষ নির্ধারণ করে, যেন তারা তাঁর পথ থেকে বিভ্রান্ত করতে পারে। বল, ‘তোমরা ভোগ করতে থাক। কেননা, তোমাদের গন্তব্য তো আগুনের দিকে’।",
    "আমার বান্দাদের বল, ‘যারা ঈমান এনেছে, তারা যেন সালাত কায়েম করে এবং আমি তাদেরকে যে রিয্ক দিয়েছি তা থেকে গোপনে ও প্রকাশ্যে ব্যয় করে, ঐ দিন আসার পূর্বে যে দিন কোন বেচা-কেনা থাকবে না এবং থাকবে না বন্ধুত্বও।",
    "আল্লাহ, যিনি আসমানসমূহ ও যমীন সৃষ্টি করেছেন। আর তিনি আসমান থেকে বৃষ্টি বর্ষণ করেন ফলে তা দ্বারা ফল-ফলাদি থেকে তোমাদের জন্য রিয্ক উৎপাদন করেন এবং তিনি নৌযানকে তোমাদের জন্য নিয়োজিত করেছেন, যাতে তাঁর আদেশে সমুদ্রে তা চলাচল করে এবং নদীসমূহকে তোমাদের জন্য নিয়োজিত করেছেন।",
    "আর তিনি সূর্য ও চাঁদকে তোমাদের জন্য নিয়োজিত করেছেন বিরামহীনভাবে এবং তোমাদের জন্য নিয়োজিত করেছেন রাত ও দিনকে।",
    "আর তোমরা যা চেয়েছ, তার প্রত্যেকটি থেকে তিনি তোমাদের দিয়েছেন এবং যদি তোমরা আল্লাহর নিআমত গণনা কর, তবে তার সংখ্যা নিরূপণ করতে পারবে না। নিশ্চয় মানুষ অধিক অত্যাচারী ও অকৃতজ্ঞ।",
    "আর স্মরণ কর ‘যখন ইবরাহীম বলল, ‘হে আমার রব, আপনি এ শহরকে নিরাপদ করে দিন এবং আমাকে ও আমার সন্তানদেরকে মূর্তি পূজা থেকে দূরে রাখুন’।",
    "‘হে আমার রব, নিশ্চয় এসব মূর্তি অনেক মানুষকে পথভ্রষ্ট করেছে, সুতরাং যে আমার অনুসরণ করেছে, নিশ্চয় সে আমার দলভুক্ত, আর যে আমার অবাধ্য হয়েছে, তবে নিশ্চয় আপনি ক্ষমাশীল, পরম দয়ালু’।",
    "‘হে আমাদের রব, নিশ্চয় আমি আমার কিছু বংশধরদেরকে ফসলহীন উপত্যকায় তোমার পবিত্র ঘরের নিকট বসতি স্থাপন করালাম, হে আমাদের রব, যাতে তারা সালাত কায়েম করে। সুতরাং কিছু মানুষের হৃদয় আপনি তাদের দিকে ঝুঁকিয়ে দিন এবং তাদেরকে রিয্ক প্রদান করুন ফল-ফলাদি থেকে, আশা করা যায় তারা শুকরিয়া আদায় করবে’।",
    "হে আমাদের রব, নিশ্চয় আপনি জানেন, যা আমরা গোপন করি এবং যা প্রকাশ করি, আর কোন কিছু আল্লাহর নিকট গোপন নেই, না যমীনে না আসমানে।",
    "‘সকল প্রশংসা আল্লাহর, যিনি বৃদ্ধ বয়সে আমাকে ঈসমাঈল ও ইসহাককে দান করেছেন। নিশ্চয় আমার রব দো‘আ শ্রবণকারী’।",
    "‘হে আমার রব, আমাকে সালাত কায়েমকারী বানান এবং আমার বংশধরদের মধ্য থেকেও, হে আমাদের রব, আর আমার দো‘আ কবূল করুন’।",
    "‘হে আমাদের রব, যেদিন হিসাব কায়েম হবে, সেদিন আপনি আমাকে, আমার পিতামাতাকে ও মুমিনদেরকে ক্ষমা করে দিবেন’।",
    "আর যালিমরা যা করছে, আল্লাহকে তুমি সে বিষয়ে মোটেই গাফেল মনে করো না, আল্লাহ তো তাদের অবকাশ দিচ্ছেন, ঐ দিন পর্যন্ত যে দিন চোখ পলকহীন তাকিয়ে থাকবে।",
    "তারা মাথা তুলে দৌড়াতে থাকবে, তাদের দৃষ্টি নিজদের দিকে ফিরবে না এবং তাদের অন্তর হবে শূন্য।",
    "আর তুমি মানুষদেরকে সতর্ক কর, যেদিন তাদের উপর আযাব নেমে আসবে। অতঃপর তখন যারা যুলম করেছে তারা বলবে, ‘হে আমাদের রব, তুমি আমাদেরকে কিছু সময়ের জন্য অবকাশ দাও, আমরা তোমার ডাকে সাড়া দেব এবং রাসূলদের অনুসরণ করব’। ইতঃপূর্বে তোমরা কি কসম করনি যে, তোমাদের কোন পতন নেই?",
    "আর তোমরা বাস করছিলে সেসব লোকদের বাসস্থানে, যারা নিজদের উপর যুলম করত এবং তোমাদের নিকট স্পষ্ট হয়েছিল আমি তাদের সাথে কিরূপ করেছি এবং আমি তোমাদের জন্য উপমা বর্ণনা করেছি।",
    "আর তারা তাদের ষড়যন্ত্র করেছিল, আর আল্লাহর কাছেই তাদের ষড়যন্ত্র, যদিও তাদের ষড়যন্ত্র এমন ছিল যা দ্বারা পাহাড় অপসারিত হয়ে যায়।",
    "সুতরাং তুমি কখনো আল্লা¬হকে তাঁর রাসূলদের দেয়া প্রতিশ্রুতি ভঙ্গকারী মনে করো না। নিশ্চয় আল্লাহ পরাক্রমশালী, প্রতিশোধ গ্রহণকারী।",
    "যেদিন এ যমীন ভিন্ন যমীনে রূপান্তরিত হবে এবং আসমানসমূহও। আর তারা পরাক্রমশালী এক আল্লাহর সামনে হাযির হবে।",
    "আর সে দিন তুমি অপরাধীদের দেখবে তারা শিকলে বাঁধা।",
    "তাদের পোশাক হবে আলকাতরার* এবং আগুন তাদের চেহারাসমূহকে ঢেকে ফেলবে। \n* قطران হচ্ছে এমন আলকাতরা, যাতে দ্রুত আগুন দাউ দাউ করে জ্বলে উঠে।",
    "এটা এ জন্য যে, আল্লাহ প্রত্যেকের কৃতকর্মের প্রতিফল দিবেন, আল্লাহ হিসাব গ্রহণে তৎপর।",
    "এটা মানুষের জন্য পয়গাম। আর যা দ্বারা তাদেরকে সতর্ক করা হয় এবং তারা জানতে পারে যে, তিনি কেবল এক ইলাহ, আর যাতে বুদ্ধিমানরা উপদেশ গ্রহণ করে।"
  ]
}