{
  "surahName": "Al-An'aam",
  "surahNameArabic": "الأنعام",
  "surahNameArabicLong": "سورة الأنعام",
  "surahNameTranslation": "The Cattle",
  "revelationPlace": "Mecca",
  "totalAyah": 165,
  "surahNo": 6,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/6.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/006.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/6.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/006.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/6.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/006.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/6.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/006.mp3"
    }
  },
  "english": [
    "All praise is for Allah Who created the heavens and the earth and made darkness and light. Yet the disbelievers set up equals to their Lord ˹in worship˺.",
    "He is the One Who created you from clay, then appointed a term ˹for your death˺ and another known only to Him ˹for your resurrection˺—yet you continue to doubt!",
    "He is the Only True God in the heavens and the earth. He knows whatever you conceal and whatever you reveal, and knows whatever you do.",
    "Whenever a sign comes to them from their Lord, they turn away from it.",
    "They have indeed rejected the truth when it came to them, so they will soon face the consequences of their ridicule.",
    "Have they not seen how many ˹disbelieving˺ peoples We destroyed before them? We had made them more established in the land than you. We sent down abundant rain for them and made rivers flow at their feet. Then We destroyed them for their sins and replaced them with other peoples.",
    "Had We sent down to you ˹O Prophet˺ a revelation in writing and they were to touch it with their own hands, the disbelievers would still have said, “This is nothing but pure magic!”",
    "They say, “Why has no ˹visible˺ angel come with him?” Had We sent down an angel, the matter would have certainly been settled ˹at once˺, and they would have never been given more time ˹to repent˺.",
    "And if We had sent an angel, We would have certainly made it ˹assume the form of˺ a man—leaving them more confused than they already are.",
    "˹Other˺ messengers had already been ridiculed before you ˹O Prophet˺, but those who mocked them were overtaken by what they used to ridicule.",
    "Say, “Travel throughout the land and see the fate of the deniers.”",
    "Ask ˹them, O  Prophet˺, “To whom belongs everything in the heavens and the earth?” Say, “To Allah!” He has taken upon Himself to be Merciful. He will certainly gather ˹all of˺ you together for the Day of Judgment—about which there is no doubt. But those who have ruined themselves will never believe.",
    "To Him belongs whatever exists in the day and night. And He is the All-Hearing, All-Knowing.",
    "Say, ˹O Prophet,˺ “Will I take any guardian other than Allah, the Originator of the heavens and the earth, Who provides for all and is not in need of provision?” Say, “I have been commanded to be the first to submit and not be one of the polytheists.”",
    "Say, “I truly fear—if I were to disobey my Lord—the torment of a tremendous Day.”",
    "Whoever is spared the torment of that Day will have certainly been shown Allah’s mercy. And that is the absolute triumph.",
    "If Allah touches you with harm, none can undo it except Him. And if He touches you with a blessing, He is Most Capable of everything.",
    "He reigns supreme over His creation. And He is the All-Wise, All-Aware.",
    "Ask ˹them, O  Prophet˺, “Who is the best witness?” Say, “Allah is! He is a Witness between me and you. And this Quran has been revealed to me so that, with it, I may warn you and whoever it reaches. Do you ˹pagans˺ testify that there are other gods besides Allah?” ˹Then˺ say, “I will never testify ˹to this˺!” ˹And˺ say, “There is only One God. And I totally reject whatever ˹idols˺ you associate with Him.”",
    "Those to whom We gave the Scripture recognize him ˹to be a true prophet˺ as they recognize their own children. Those who have ruined themselves will never believe.",
    "Who does more wrong than those who fabricate lies against Allah or deny His signs? Indeed, the wrongdoers will never succeed.",
    "˹Consider˺ the Day We will gather them all together then ask those who associated others ˹with Allah in worship˺, “Where are those gods you used to claim?”",
    "Their only argument will be: “By Allah, our Lord! We were never polytheists.”",
    "See how they will lie about themselves and how those ˹gods˺ they fabricated will fail them!",
    "There are some of them who ˹pretend to˺ listen to your recitation ˹of the Quran˺, but We have cast veils over their hearts—leaving them unable to comprehend it—and deafness in their ears. Even if they were to see every sign, they still would not believe in them. The disbelievers would ˹even˺ come to argue with you, saying, “This ˹Quran˺ is nothing but ancient fables!”",
    "They turn others away from the Prophet and distance themselves as well. They ruin none but themselves, yet they fail to perceive it.",
    "If only you could see when they will be detained before the Fire! They will cry, “Oh! If only we could be sent back, we would never deny the signs of our Lord and we would ˹surely˺ be of the believers.”",
    "But no! ˹They only say this˺ because the truth they used to hide will become all too clear to them. Even if they were to be sent back, they would certainly revert to what they were forbidden. Indeed they are liars!",
    "They insisted, “There is nothing beyond this worldly life and we will never be resurrected.”",
    "But if only you could see when they will be detained before their Lord! He will ask ˹them˺, “Is this ˹Hereafter˺ not the truth?” They will cry, “Absolutely, by our Lord!” He will say, “Then taste the punishment for your disbelief.”",
    "Losers indeed are those who deny the meeting with Allah until the Hour takes them by surprise, then they will cry, “Woe to us for having ignored this!” They will bear ˹the burden of˺ their sins on their backs. Evil indeed is their burden!",
    "This worldly life is no more than play and amusement, but far better is the ˹eternal˺ Home of the Hereafter for those mindful ˹of Allah˺. Will you not then understand?",
    "We certainly know that what they say grieves you ˹O Prophet˺. It is not your honesty they question—it is Allah’s signs that the wrongdoers deny.",
    "Indeed, messengers before you were rejected but patiently endured rejection and persecution until Our help came to them. And Allah’s promise ˹to help˺ is never broken. And you have already received some of the narratives of these messengers.",
    "If you find their denial unbearable, then build—if you can—a tunnel through the earth or stairs to the sky to bring them a ˹more compelling˺ sign. Had Allah so willed, He could have guided them all. So do not be one of those ignorant ˹of this fact˺.",
    "Only the attentive will respond ˹to your call˺. As for the dead, Allah will raise them up, then to Him they will ˹all˺ be returned.",
    "They ask, “Why has no ˹other˺ sign been sent down to him from his Lord?” Say, ˹O Prophet,˺ “Allah certainly has the power to send down a sign”—though most of them do not know.",
    "All living beings roaming the earth and winged birds soaring in the sky are communities like yourselves. We have left nothing out of the Record. Then to their Lord they will be gathered all together.",
    "Those who deny Our signs are ˹wilfully˺ deaf and dumb—lost in darkness. Allah leaves whoever He wills to stray and guides whoever He wills to the Straight Way.",
    "Ask ˹them, O  Prophet˺, “Imagine if you were overwhelmed by Allah’s torment or the Hour—would you call upon any other than Allah ˹for help˺? ˹Answer me˺ if your claims are true!",
    "No! He is the only One you would call. And if He willed, He could remove the affliction that made you invoke Him. Only then will you forget whatever you associate with Him ˹in worship˺.”",
    "Indeed, We have sent messengers before you ˹O Prophet˺ to other people who We put through suffering and adversity ˹for their denial˺, so perhaps they would be humbled.",
    "Why did they not humble themselves when We made them suffer? Instead, their hearts were hardened, and Satan made their misdeeds appealing to them.",
    "When they became oblivious to warnings, We showered them with everything they desired. But just as they became prideful of what they were given, We seized them by surprise, then they instantly fell into despair!",
    "So the wrongdoers were utterly uprooted. And all praise is for Allah—Lord of all worlds.",
    "Ask ˹them, O  Prophet˺, “Imagine if Allah were to take away your hearing or sight, or seal your hearts—who else other than Allah could restore it?” See ˹O Prophet˺ how We vary the signs, yet they still turn away.",
    "Ask, “Imagine if Allah’s punishment were to overwhelm you with or without warning—who would be destroyed other than the wrongdoers?”",
    "We have sent messengers only as deliverers of good news and as warners. Whoever believes and does good, there will be no fear for them, nor will they grieve.",
    "But those who deny Our signs will be afflicted with punishment for their rebelliousness.",
    "Say, ˹O Prophet,˺ “I do not say to you that I possess Allah’s treasuries or know the unseen, nor do I claim to be an angel. I only follow what is revealed to me.” Say, “Are those blind ˹to the truth˺ equal to those who can see? Will you not then reflect?”",
    "Warn with this ˹Quran˺ those who are awed by the prospect of being gathered before their Lord—when they will have no protector or intercessor besides Him—so perhaps they will be mindful ˹of Him˺.",
    "˹O Prophet!˺ Do not dismiss those ˹poor believers˺ who invoke their Lord morning and evening, seeking His pleasure. You are not accountable for them whatsoever, nor are they accountable for you. So do not dismiss them, or you will be one of the wrongdoers.",
    "In this way We have tested some by means of others, so those ˹disbelievers˺ may say, “Has Allah favoured these ˹poor believers˺ out of all of us?” Does Allah not best recognize the grateful?",
    "When the believers in Our revelations come to you, say, “Peace be upon you! Your Lord has taken upon Himself to be Merciful. Whoever among you commits evil ignorantly ˹or recklessly˺ then repents afterwards and mends their ways, then Allah is truly All-Forgiving, Most Merciful.”",
    "This is how We make Our signs clear, so the way of the wicked may become distinct.",
    "Say, ˹O Prophet,˺ “I have been forbidden to worship those you invoke besides Allah.” Say, “I will not follow your desires, for I then would certainly be astray and not one of those ˹rightly˺ guided.”",
    "Say, ˹O Prophet,˺ “Indeed, I stand on a clear proof from my Lord—yet you have denied it. That ˹torment˺ you seek to hasten is not within my power. It is only Allah Who decides ˹its time˺. He declares the truth. And He is the Best of Judges.”",
    "Say ˹also˺, “If what you seek to hasten were within my power, the matter between us would have already been settled. But Allah knows the wrongdoers best.”",
    "With Him are the keys of the unseen—no one knows them except Him. And He knows what is in the land and sea. Not even a leaf falls without His knowledge, nor a grain in the darkness of the earth or anything—green or dry—but is ˹written˺ in a perfect Record.",
    "He is the One Who calls back your souls by night and knows what you do by day, then revives you daily to complete your appointed term. To Him is your ˹ultimate˺ return, then He will inform you of what you used to do.",
    "He reigns supreme over all of His creation, and sends recording-angels, watching over you. When death comes to any of you, Our angels take their soul, never neglecting this duty.",
    "Then they are ˹all˺ returned to Allah—their True Master. Judgment is His ˹alone˺. And He is the Swiftest Reckoner.",
    "Say, ˹O Prophet,˺ “Who rescues you from the darkest times on land and at sea? He ˹alone˺ you call upon with humility, openly and secretly: “If You rescue us from this, we will be ever grateful.”",
    "Say, “˹Only˺ Allah rescues you from this and any other distress, yet you associate others with Him ˹in worship˺.”",
    "Say, “He ˹alone˺ has the power to unleash upon you a torment from above or below you or split you into ˹conflicting˺ factions and make you taste the violence of one another.” See how We vary the signs, so perhaps they will comprehend.",
    "Still your people ˹O Prophet˺ have rejected this ˹Quran˺, although it is the truth. Say, “I am not a keeper over you.”",
    "Every ˹destined˺ matter has a ˹set˺ time to transpire. And you will soon come to know.",
    "And when you come across those who ridicule Our revelations, do not sit with them unless they engage in a different topic. Should Satan make you forget, then once you remember, do not ˹continue to˺ sit with the wrongdoing people.",
    "Those mindful ˹of Allah˺ will not be accountable for those ˹who ridicule it˺ whatsoever—their duty is to advise, so perhaps the ridiculers will abstain.",
    "And leave those who take this faith ˹of Islam˺ as mere play and amusement and are deluded by ˹their˺ worldly life. Yet remind them by this ˹Quran˺, so no one should be ruined for their misdeeds. They will have no protector or intercessor other than Allah. Even if they were to offer every ˹possible˺ ransom, none will be accepted from them. Those are the ones who will be ruined for their misdeeds. They will have a boiling drink and painful punishment for their disbelief.",
    "Ask ˹them, O  Prophet˺, “Should we invoke, other than Allah, those ˹idols˺ which cannot benefit or harm us, and turn back to disbelief after Allah has guided us? ˹If we do so, we will be˺ like those disoriented by devils in the wilderness, while their companions call them to guidance, ˹saying˺, ‘Come to us!’ Say, ˹O Prophet,˺ “Allah’s guidance is the ˹only˺ true guidance. And we are commanded to submit to the Lord of all worlds",
    "establish prayer, and be mindful of Him. To Him you will all be gathered together.",
    "He is the One Who created the heavens and the earth in truth. On the Day ˹of Judgment˺ He will say, ‘Be!’ And there will be! His command is truth. All authority is His ˹alone˺ on the Day the Trumpet will be blown. He is the Knower of all—seen or unseen. And He is the All-Wise, All-Aware.”",
    "And ˹remember˺ when Abraham said to his father, Ȃzar, “Do you take idols as gods? It is clear to me that you and your people are entirely misguided.”",
    "We also showed Abraham the wonders of the heavens and the earth, so he would be sure in faith.",
    "When the night grew dark upon him, he saw a star and said, “This is my Lord!” But when it set, he said, “I do not love things that set.”",
    "Then when he saw the moon rising, he said, “This one is my Lord!” But when it disappeared, he said, “If my Lord does not guide me, I will certainly be one of the misguided people.”",
    "Then when he saw the sun shining, he said, “This must be my Lord—it is the greatest!” But again when it set, he declared, “O my people! I totally reject whatever you associate ˹with Allah in worship˺.",
    "I have turned my face towards the One Who has originated the heavens and the earth—being upright—and I am not one of the polytheists.”",
    "And his people argued with him. He responded, “Are you arguing with me about Allah, while He has guided me? I am not afraid of whatever ˹idols˺ you associate with Him—˹none can harm me,˺ unless my Lord so wills. My Lord encompasses everything in ˹His˺ knowledge. Will you not be mindful?",
    "And how should I fear your associate-gods, while you have no fear in associating ˹others˺ with Allah—a practice He has never authorized? Which side has more right to security? ˹Tell me˺ if you really know!”",
    "It is ˹only˺ those who are faithful and do not tarnish their faith with falsehood who are guaranteed security and are ˹rightly˺ guided.",
    "This was the argument We gave Abraham against his people. We elevate in rank whoever We please. Surely your Lord is All-Wise, All-Knowing.",
    "And We blessed him with Isaac and Jacob. We guided them all as We previously guided Noah and those among his descendants: David, Solomon, Job, Joseph, Moses, and Aaron. This is how We reward the good-doers.",
    "Likewise, ˹We guided˺ Zachariah, John, Jesus, and Elias, who were all of the righteous.",
    "˹We also guided˺ Ishmael, Elisha, Jonah, and Lot, favouring each over other people ˹of their time˺.",
    "And ˹We favoured˺ some of their forefathers, their descendants, and their brothers. We chose them and guided them to the Straight Path.",
    "This is Allah’s guidance with which He guides whoever He wills of His servants. Had they associated others with Him ˹in worship˺, their ˹good˺ deeds would have been wasted.",
    "Those were the ones to whom We gave the Scripture, wisdom, and prophethood. But if these ˹pagans˺ disbelieve in this ˹message˺, then We have already entrusted it to a people who will never disbelieve in it.",
    "These ˹prophets˺ were ˹rightly˺ guided by Allah, so follow their guidance. Say, “I ask no reward of you for this ˹Quran˺—it is a reminder to the whole world.”",
    "And they have not shown Allah His proper reverence when they said, “Allah has revealed nothing to any human being.” Say, ˹O Prophet,˺ “Who then revealed the Book brought forth by Moses as a light and guidance for people, which you split into separate sheets—revealing some and hiding much? You have been taught ˹through this Quran˺ what neither you nor your forefathers knew.” Say, ˹O Prophet,˺ “Allah ˹revealed it˺!” Then leave them to amuse themselves with falsehood.",
    "This is a blessed Book which We have revealed—confirming what came before it—so you may warn the Mother of Cities and everyone around it. Those who believe in the Hereafter ˹truly˺ believe in it and guard their prayers.",
    "Who does more wrong than the one who fabricates lies against Allah or claims, “I have received revelations!”—although nothing was revealed to them—or the one who says, “I can reveal the like of Allah’s revelations!”? If you ˹O Prophet˺ could only see the wrongdoers in the throes of death while the angels are stretching out their hands ˹saying˺, “Give up your souls! Today you will be rewarded with the torment of disgrace for telling lies about Allah and for being arrogant towards His revelations!”",
    "˹Today˺ you have come back to Us all alone as We created you the first time—leaving behind everything We have provided you with. We do not see your intercessors with you—those you claimed were Allah’s partners ˹in worship˺. All your ties have been broken and all your claims have let you down.”",
    "Indeed, Allah is the One Who causes seeds and fruit stones to sprout. He brings forth the living from the dead and the dead from the living. That is Allah! How can you then be deluded ˹from the truth˺?",
    "He causes the dawn to break, and has made the night for rest and ˹made˺ the sun and the moon ˹to travel˺ with precision. That is the design of the Almighty, All-Knowing.",
    "And He is the One Who has made the stars as your guide through the darkness of land and sea. We have already made the signs clear for people who know.",
    "And He is the One Who originated you all from a single soul, then assigned you a place to live and another to ˹be laid to˺ rest. We have already made the signs clear for people who comprehend.",
    "And He is the One Who sends down rain from the sky—causing all kinds of plants to grow—producing green stalks from which We bring forth clustered grain. And from palm trees come clusters of dates hanging within reach. ˹There are˺ also gardens of grapevines, olives, and pomegranates, similar ˹in shape˺ but dissimilar ˹in taste˺. Look at their fruit as it yields and ripens! Indeed, in these are signs for people who believe.",
    "Yet they associate the jinn with Allah ˹in worship˺, even though He created them, and they falsely attribute to Him sons and daughters out of ignorance. Glorified and Exalted is He above what they claim!",
    "˹He is˺ the Originator of the heavens and earth. How could He have children when He has no mate? He created all things and has ˹perfect˺ knowledge of everything.",
    "That is Allah—your Lord! There is no god ˹worthy of worship˺ except Him. ˹He is˺ the Creator of all things, so worship Him ˹alone˺. And He is the Maintainer of everything.",
    "No vision can encompass Him, but He encompasses all vision. For He is the Most Subtle, All-Aware.",
    "Indeed, there have come to you insights from your Lord. So whoever chooses to see, it is for their own good. But whoever chooses to be blind, it is to their own loss. And I am not a keeper over you.",
    "And so We vary our signs to the extent that they will say, “You have studied ˹previous scriptures˺,” and We make this ˹Quran˺ clear for people who know.",
    "˹O Prophet!˺ Follow what is revealed to you from your Lord—there is no god ˹worthy of worship˺ except Him—and turn away from the polytheists.",
    "Had Allah willed, they would not have been polytheists. We have not appointed you as their keeper, nor are you their maintainer.",
    "˹O believers!˺ Do not insult what they invoke besides Allah or they will insult Allah spitefully out of ignorance. This is how We have made each people’s deeds appealing to them. Then to their Lord is their return, and He will inform them of what they used to do.",
    "They swear by Allah their most solemn oaths that if a sign were to come to them, they would certainly believe in it. Say, ˹O Prophet,˺ “Signs are only with Allah.” What will make you ˹believers˺ realize that even if a sign were to come to them, they still would not believe?",
    "We turn their hearts and eyes away ˹from the truth˺ as they refused to believe at first, leaving them to wander blindly in their defiance.",
    "Even if We had sent them the angels, made the dead speak to them, and assembled before their own eyes every sign ˹they demanded˺, they still would not have believed—unless Allah so willed. But most of them are ignorant ˹of this˺.",
    "And so We have made for every prophet enemies—devilish humans and jinn—whispering to one another with elegant words of deception. Had it been your Lord’s Will, they would not have done such a thing. So leave them and their deceit",
    "so that the hearts of those who disbelieve in the Hereafter may be receptive to it, be pleased with it, and be persistent in their evil pursuits.",
    "˹Say, O  Prophet,˺ “Should I seek a judge other than Allah while He is the One Who has revealed for you the Book ˹with the truth˺ perfectly explained?” Those who were given the Scripture know that it has been revealed ˹to you˺ from your Lord in truth. So do not be one of those who doubt.",
    "The Word of your Lord has been perfected in truth and justice. None can change His Words. And He is the All-Hearing, All- Knowing.",
    "˹O Prophet!˺ If you were to obey most of those on earth, they would lead you away from Allah’s Way. They follow nothing but assumptions and do nothing but lie.",
    "Indeed, your Lord knows best who has strayed from His Way and who is ˹rightly˺ guided.",
    "So eat only of what is slaughtered in Allah’s Name if you truly believe in His revelations.",
    "Why should you not eat of what is slaughtered in Allah’s Name when He has already explained to you what He has forbidden to you—except when compelled by necessity? Many ˹deviants˺ certainly mislead others by their whims out of ignorance. Surely your Lord knows the transgressors best.",
    "Shun all sin—open and secret. Indeed, those who commit sin will be punished for what they earn.",
    "Do not eat of what is not slaughtered in Allah’s Name. For that would certainly be ˹an act of˺ disobedience. Surely the devils whisper to their ˹human˺ associates to argue with you. If you were to obey them, then you ˹too˺ would be polytheists.",
    "Can those who had been dead, to whom We gave life and a light with which they can walk among people, be compared to those in complete darkness from which they can never emerge? That is how the misdeeds of the disbelievers have been made appealing to them.",
    "And so We have placed in every society the most wicked to conspire in it. Yet they plot only against themselves, but they fail to perceive it.",
    "Whenever a sign comes to them, they say, “We will never believe until we receive what Allah’s messengers received.” Allah knows best where to place His message. The wicked will soon be overwhelmed by humiliation from Allah and a severe punishment for their evil plots.",
    "Whoever Allah wills to guide, He opens their heart to Islam. But whoever He wills to leave astray, He makes their chest tight and constricted as if they were climbing up into the sky. This is how Allah dooms those who disbelieve.",
    "That is your Lord’s Path—perfectly straight. We have already made the signs clear to those who are mindful.",
    "They will have the Home of Peace with their Lord, Who will be their Guardian because of what they used to do.",
    "˹Consider˺ the Day He will gather them ˹all˺ together and say, “O assembly of jinn! You misled humans in great numbers.” And their human associates will say, “Our Lord! We benefited from each other’s company, but now we have reached the term which You appointed for us.” ˹Then˺ He will say, “The Fire is your home, yours to stay in forever, except whoever Allah wills to spare.” Surely your Lord is All-Wise, All-Knowing.",
    "This is how We make the wrongdoers ˹destructive˺ allies of one another because of their misdeeds.",
    "˹Allah will ask,˺ “O assembly of jinn and humans! Did messengers not come from among you, proclaiming My revelations and warning you of the coming of this Day of yours?” They will say, “We confess against ourselves!” For they have been deluded by ˹their˺ worldly life. And they will testify against themselves that they were disbelievers.",
    "This ˹sending of the messengers˺ is because your Lord would never destroy a society for their wrongdoing while its people are unaware ˹of the truth˺.",
    "They will each be assigned ranks according to their deeds. And your Lord is not unaware of what they do.",
    "Your Lord is the Self-Sufficient, Full of Mercy. If He wills, He can do away with you and replace you with whoever He wills, just as He produced you from the offspring of other people.",
    "Indeed, what you have been promised will certainly come to pass. And you will have no escape.",
    "Say, ˹O Prophet,˺ “O my people! Persist in your ways, for I ˹too˺ will persist in mine. You will soon know who will fare best in the end. Indeed, the wrongdoers will never succeed.”",
    "The pagans set aside for Allah a share of the crops and cattle He created, saying, “This ˹portion˺ is for Allah,” so they claim, “and this ˹one˺ for our associate-gods.” Yet the portion of their associate-gods is not shared with Allah while Allah’s portion is shared with their associate-gods. What unfair judgment!",
    "Likewise, the pagans’ evil associates have made it appealing to them to kill their own children—only leading to their destruction as well as confusion in their faith. Had it been Allah’s Will, they would not have done such a thing. So leave them and their falsehood.",
    "They say, “These cattle and crops are reserved—none may eat them except those we permit,” so they claim. Some other cattle are exempted from labour and others are not slaughtered in Allah’s Name—falsely attributing lies to Him. He will repay them for their lies.",
    "They ˹also˺ say, “The offspring of this cattle is reserved for our males and forbidden to our females; but if it is stillborn, they may all share it.” He will repay them for their falsehood. Surely He is All-Wise, All-Knowing.",
    "Lost indeed are those who have murdered their own children foolishly out of ignorance and have forbidden what Allah has provided for them—falsely attributing lies to Allah. They have certainly strayed and are not ˹rightly˺ guided.",
    "He is the One Who produces gardens—both cultivated and wild—and palm trees, crops of different flavours, olives, and pomegranates—similar ˹in shape˺, but dissimilar ˹in taste˺. Eat of the fruit they bear and pay the dues at harvest, but do not waste. Surely He does not like the wasteful.",
    "Some cattle are fit for labour, others are too small. Eat of what Allah has provided for you and do not follow Satan’s footsteps. Certainly, he is your sworn enemy.",
    "˹Allah has created˺ four pairs: a pair of sheep and a pair of goats—ask ˹them, O  Prophet˺, “Has He forbidden ˹to you˺ the two males or the two females or what is in the wombs of the two females? Tell me with knowledge, if what you say is true.”—",
    "and a pair of camels and a pair of oxen. Ask ˹them˺, “Has He forbidden ˹to you˺ the two males or the two females or what is in the wombs of the two females? Or were you present when Allah gave you this commandment?” Who does more wrong than those who fabricate lies against Allah to mislead others without ˹any˺ knowledge? Surely Allah does not guide the wrongdoing people.",
    "Say, ˹O Prophet,˺ “I do not find in what has been revealed to me anything forbidden to eat except carrion, running blood, swine—which is impure—or a sinful offering in the name of any other than Allah. But if someone is compelled by necessity—neither driven by desire nor exceeding immediate need—then surely your Lord is All-Forgiving, Most Merciful.”",
    "For those who are Jewish, We forbade every animal with undivided hoofs and the fat of oxen and sheep except what is joined to their backs or intestines or mixed with bone. In this way We rewarded them for their violations. And We are certainly truthful.",
    "But if they deny you ˹O Prophet˺, say, “Your Lord is infinite in mercy, yet His punishment will not be averted from the wicked people.”",
    "The polytheists will argue, “Had it been Allah’s Will, neither we nor our forefathers would have associated others with Him ˹in worship˺ or made anything unlawful.” Likewise, those before them rejected the truth until they tasted Our punishment. Ask ˹them, O  Prophet˺, “Do you have any knowledge that you can produce for us? Surely you follow nothing but ˹false˺ assumptions and you do nothing but lie.”",
    "Say, “Allah has the most conclusive argument. Had it been His Will, He would have easily imposed guidance upon all of you.”",
    "Say, ˹O Prophet,˺ “Bring your witnesses who can testify that Allah has forbidden this.” If they ˹falsely˺ testify, do not testify with them. And do not follow the desires of those who deny Our proofs, disbelieve in the Hereafter, and set up equals with their Lord.",
    "Say, ˹O Prophet,˺ “Come! Let me recite to you what your Lord has forbidden to you: do not associate others with Him ˹in worship˺. ˹Do not fail to˺ honour your parents. Do not kill your children for fear of poverty. We provide for you and for them. Do not come near indecencies, openly or secretly. Do not take a ˹human˺ life—made sacred by Allah—except with ˹legal˺ right. This is what He has commanded you, so perhaps you will understand.",
    "And do not come near the wealth of the orphan—unless intending to enhance it—until they attain maturity. Give full measure and weigh with justice. We never require of any soul more than what it can afford. Whenever you speak, maintain justice—even regarding a close relative. And fulfil your covenant with Allah. This is what He has commanded you, so perhaps you will be mindful.",
    "Indeed, that is My Path—perfectly straight. So follow it and do not follow other ways, for they will lead you away from His Way. This is what He has commanded you, so perhaps you will be conscious ˹of Allah˺.”",
    "Additionally, We gave Moses the Scripture, completing the favour upon those who do good, detailing everything, and as a guide and a mercy, so perhaps they would be certain of the meeting with their Lord.",
    "This is a blessed Book We have revealed. So follow it and be mindful ˹of Allah˺, so you may be shown mercy.",
    "You ˹pagans˺ can no longer say, “Scriptures were only revealed to two groups before us and we were unaware of their teachings.”",
    "Nor can you say, “If only the Scriptures had been revealed to us, we would have been better guided than they.” Now there has come to you from your Lord a clear proof—a guide and mercy. Who then does more wrong than those who deny Allah’s revelations and turn away from them? We will reward those who turn away from Our revelations with a dreadful punishment for turning away.",
    "Are they awaiting the coming of the angels, or your Lord ˹Himself˺, or some of your Lord’s ˹major˺ signs? On the Day your Lord’s signs arrive, belief will not benefit those who did not believe earlier or those who did no good through their faith. Say, “Keep waiting! We too are waiting.”",
    "Indeed, you ˹O Prophet˺ are not responsible whatsoever for those who have divided their faith and split into sects. Their judgment rests only with Allah. And He will inform them of what they used to do.",
    "Whoever comes with a good deed will be rewarded tenfold. But whoever comes with a bad deed will be punished for only one. None will be wronged.",
    "Say, ˹O Prophet,˺ “Surely my Lord has guided me to the Straight Path, a perfect way, the faith of Abraham, the upright, who was not one of the polytheists.”",
    "Say, “Surely my prayer, my worship, my life, and my death are all for Allah—Lord of all worlds.",
    "He has no partner. So I am commanded, and so I am the first to submit.”",
    "Say, ˹O Prophet,˺ “Should I seek a lord other than Allah while He is the Lord of everything?” No one will reap except what they sow. No soul burdened with sin will bear the burden of another. Then to your Lord is your return, and He will inform you of your differences.",
    "He is the One Who has placed you as successors on earth and elevated some of you in rank over others, so He may test you with what He has given you. Surely your Lord is swift in punishment, but He is certainly All-Forgiving, Most Merciful."
  ],
  "arabic1": [
    "اَلْحَمْدُ لِلّٰهِ الَّذِیْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ وَجَعَلَ الظُّلُمٰتِ وَالنُّوْرَ ثُمَّ الَّذِیْنَ كَفَرُوْا بِرَبِّهِمْ یَعْدِلُوْنَ",
    "هُوَ الَّذِیْ خَلَقَكُمْ مِّنْ طِیْنٍ ثُمَّ قَضٰۤی اَجَلًا وَاَجَلٌ مُّسَمًّی عِنْدَهٗ ثُمَّ اَنْتُمْ تَمْتَرُوْنَ",
    "وَهُوَ اللّٰهُ فِی السَّمٰوٰتِ وَفِی الْاَرْضِ یَعْلَمُ سِرَّكُمْ وَجَهْرَكُمْ وَیَعْلَمُ مَا تَكْسِبُوْنَ",
    "وَمَا تَاْتِیْهِمْ مِّنْ اٰیَةٍ مِّنْ اٰیٰتِ رَبِّهِمْ اِلَّا كَانُوْا عَنْهَا مُعْرِضِیْنَ",
    "فَقَدْ كَذَّبُوْا بِالْحَقِّ لَمَّا جَآءَهُمْ فَسَوْفَ یَاْتِیْهِمْ اَنْۢبٰٓؤُا مَا كَانُوْا بِهٖ یَسْتَهْزِءُوْنَ",
    "اَلَمْ یَرَوْا كَمْ اَهْلَكْنَا مِنْ قَبْلِهِمْ مِّنْ قَرْنٍ مَّكَّنّٰهُمْ فِی الْاَرْضِ مَا لَمْ نُمَكِّنْ لَّكُمْ وَاَرْسَلْنَا السَّمَآءَ عَلَیْهِمْ مِّدْرَارًا وَّجَعَلْنَا الْاَنْهٰرَ تَجْرِیْ مِنْ تَحْتِهِمْ فَاَهْلَكْنٰهُمْ بِذُنُوْبِهِمْ وَاَنْشَاْنَا مِنْ بَعْدِهِمْ قَرْنًا اٰخَرِیْنَ",
    "وَلَوْ نَزَّلْنَا عَلَیْكَ كِتٰبًا فِیْ قِرْطَاسٍ فَلَمَسُوْهُ بِاَیْدِیْهِمْ لَقَالَ الَّذِیْنَ كَفَرُوْۤا اِنْ هٰذَاۤ اِلَّا سِحْرٌ مُّبِیْنٌ",
    "وَقَالُوْا لَوْلَاۤ اُنْزِلَ عَلَیْهِ مَلَكٌ وَلَوْ اَنْزَلْنَا مَلَكًا لَّقُضِیَ الْاَمْرُ ثُمَّ لَا یُنْظَرُوْنَ",
    "وَلَوْ جَعَلْنٰهُ مَلَكًا لَّجَعَلْنٰهُ رَجُلًا وَّلَلَبَسْنَا عَلَیْهِمْ مَّا یَلْبِسُوْنَ",
    "وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّنْ قَبْلِكَ فَحَاقَ بِالَّذِیْنَ سَخِرُوْا مِنْهُمْ مَّا كَانُوْا بِهٖ یَسْتَهْزِءُوْنَ",
    "قُلْ سِیْرُوْا فِی الْاَرْضِ ثُمَّ اَنْظُرُوْا كَیْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِیْنَ",
    "قُلْ لِّمَنْ مَّا فِی السَّمٰوٰتِ وَالْاَرْضِ قُلْ لِّلّٰهِ كَتَبَ عَلٰی نَفْسِهِ الرَّحْمَةَ لَیَجْمَعَنَّكُمْ اِلٰی یَوْمِ الْقِیٰمَةِ لَا رَیْبَ فِیْهِ اَلَّذِیْنَ خَسِرُوْۤا اَنْفُسَهُمْ فَهُمْ لَا یُؤْمِنُوْنَ",
    "وَلَهٗ مَا سَكَنَ فِی الَّیْلِ وَالنَّهَارِ وَهُوَ السَّمِیْعُ الْعَلِیْمُ",
    "قُلْ اَغَیْرَ اللّٰهِ اَتَّخِذُ وَلِیًّا فَاطِرِ السَّمٰوٰتِ وَالْاَرْضِ وَهُوَ یُطْعِمُ وَلَا یُطْعَمُ قُلْ اِنِّیْۤ اُمِرْتُ اَنْ اَكُوْنَ اَوَّلَ مَنْ اَسْلَمَ وَلَا تَكُوْنَنَّ مِنَ الْمُشْرِكِیْنَ",
    "قُلْ اِنِّیْۤ اَخَافُ اِنْ عَصَیْتُ رَبِّیْ عَذَابَ یَوْمٍ عَظِیْمٍ",
    "مَنْ یُّصْرَفْ عَنْهُ یَوْمَىِٕذٍ فَقَدْ رَحِمَهٗ وَذٰلِكَ الْفَوْزُ الْمُبِیْنُ",
    "وَاِنْ یَّمْسَسْكَ اللّٰهُ بِضُرٍّ فَلَا كَاشِفَ لَهٗۤ اِلَّا هُوَ وَاِنْ یَّمْسَسْكَ بِخَیْرٍ فَهُوَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهٖ وَهُوَ الْحَكِیْمُ الْخَبِیْرُ",
    "قُلْ اَیُّ شَیْءٍ اَكْبَرُ شَهَادَةً قُلِ اللّٰهُ ۫ شَهِیْدٌۢ بَیْنِیْ وَبَیْنَكُمْ ۫ وَاُوْحِیَ اِلَیَّ هٰذَا الْقُرْاٰنُ لِاُنْذِرَكُمْ بِهٖ وَمَنْ بَلَغَ اَىِٕنَّكُمْ لَتَشْهَدُوْنَ اَنَّ مَعَ اللّٰهِ اٰلِهَةً اُخْرٰی قُلْ لَّاۤ اَشْهَدُ قُلْ اِنَّمَا هُوَ اِلٰهٌ وَّاحِدٌ وَّاِنَّنِیْ بَرِیْٓءٌ مِّمَّا تُشْرِكُوْنَ",
    "اَلَّذِیْنَ اٰتَیْنٰهُمُ الْكِتٰبَ یَعْرِفُوْنَهٗ كَمَا یَعْرِفُوْنَ اَبْنَآءَهُمْ اَلَّذِیْنَ خَسِرُوْۤا اَنْفُسَهُمْ فَهُمْ لَا یُؤْمِنُوْنَ",
    "وَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰی عَلَی اللّٰهِ كَذِبًا اَوْ كَذَّبَ بِاٰیٰتِهٖ اِنَّهٗ لَا یُفْلِحُ الظّٰلِمُوْنَ",
    "وَیَوْمَ نَحْشُرُهُمْ جَمِیْعًا ثُمَّ نَقُوْلُ لِلَّذِیْنَ اَشْرَكُوْۤا اَیْنَ شُرَكَآؤُكُمُ الَّذِیْنَ كُنْتُمْ تَزْعُمُوْنَ",
    "ثُمَّ لَمْ تَكُنْ فِتْنَتُهُمْ اِلَّاۤ اَنْ قَالُوْا وَاللّٰهِ رَبِّنَا مَا كُنَّا مُشْرِكِیْنَ",
    "اُنْظُرْ كَیْفَ كَذَبُوْا عَلٰۤی اَنْفُسِهِمْ وَضَلَّ عَنْهُمْ مَّا كَانُوْا یَفْتَرُوْنَ",
    "وَمِنْهُمْ مَّنْ یَّسْتَمِعُ اِلَیْكَ وَجَعَلْنَا عَلٰی قُلُوْبِهِمْ اَكِنَّةً اَنْ یَّفْقَهُوْهُ وَفِیْۤ اٰذَانِهِمْ وَقْرًا وَاِنْ یَّرَوْا كُلَّ اٰیَةٍ لَّا یُؤْمِنُوْا بِهَا حَتّٰۤی اِذَا جَآءُوْكَ یُجَادِلُوْنَكَ یَقُوْلُ الَّذِیْنَ كَفَرُوْۤا اِنْ هٰذَاۤ اِلَّاۤ اَسَاطِیْرُ الْاَوَّلِیْنَ",
    "وَهُمْ یَنْهَوْنَ عَنْهُ وَیَنْـَٔوْنَ عَنْهُ وَاِنْ یُّهْلِكُوْنَ اِلَّاۤ اَنْفُسَهُمْ وَمَا یَشْعُرُوْنَ",
    "وَلَوْ تَرٰۤی اِذْ وُقِفُوْا عَلَی النَّارِ فَقَالُوْا یٰلَیْتَنَا نُرَدُّ وَلَا نُكَذِّبَ بِاٰیٰتِ رَبِّنَا وَنَكُوْنَ مِنَ الْمُؤْمِنِیْنَ",
    "بَلْ بَدَا لَهُمْ مَّا كَانُوْا یُخْفُوْنَ مِنْ قَبْلُ وَلَوْ رُدُّوْا لَعَادُوْا لِمَا نُهُوْا عَنْهُ وَاِنَّهُمْ لَكٰذِبُوْنَ",
    "وَقَالُوْۤا اِنْ هِیَ اِلَّا حَیَاتُنَا الدُّنْیَا وَمَا نَحْنُ بِمَبْعُوْثِیْنَ",
    "وَلَوْ تَرٰۤی اِذْ وُقِفُوْا عَلٰی رَبِّهِمْ قَالَ اَلَیْسَ هٰذَا بِالْحَقِّ قَالُوْا بَلٰی وَرَبِّنَا قَالَ فَذُوْقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُوْنَ",
    "قَدْ خَسِرَ الَّذِیْنَ كَذَّبُوْا بِلِقَآءِ اللّٰهِ حَتّٰۤی اِذَا جَآءَتْهُمُ السَّاعَةُ بَغْتَةً قَالُوْا یٰحَسْرَتَنَا عَلٰی مَا فَرَّطْنَا فِیْهَا وَهُمْ یَحْمِلُوْنَ اَوْزَارَهُمْ عَلٰی ظُهُوْرِهِمْ اَلَا سَآءَ مَا یَزِرُوْنَ",
    "وَمَا الْحَیٰوةُ الدُّنْیَاۤ اِلَّا لَعِبٌ وَّلَهْوٌ وَلَلدَّارُ الْاٰخِرَةُ خَیْرٌ لِّلَّذِیْنَ یَتَّقُوْنَ اَفَلَا تَعْقِلُوْنَ",
    "قَدْ نَعْلَمُ اِنَّهٗ لَیَحْزُنُكَ الَّذِیْ یَقُوْلُوْنَ فَاِنَّهُمْ لَا یُكَذِّبُوْنَكَ وَلٰكِنَّ الظّٰلِمِیْنَ بِاٰیٰتِ اللّٰهِ یَجْحَدُوْنَ",
    "وَلَقَدْ كُذِّبَتْ رُسُلٌ مِّنْ قَبْلِكَ فَصَبَرُوْا عَلٰی مَا كُذِّبُوْا وَاُوْذُوْا حَتّٰۤی اَتٰىهُمْ نَصْرُنَا وَلَا مُبَدِّلَ لِكَلِمٰتِ اللّٰهِ وَلَقَدْ جَآءَكَ مِنْ نَّبَاۡ الْمُرْسَلِیْنَ",
    "وَاِنْ كَانَ كَبُرَ عَلَیْكَ اِعْرَاضُهُمْ فَاِنِ اسْتَطَعْتَ اَنْ تَبْتَغِیَ نَفَقًا فِی الْاَرْضِ اَوْ سُلَّمًا فِی السَّمَآءِ فَتَاْتِیَهُمْ بِاٰیَةٍ وَلَوْ شَآءَ اللّٰهُ لَجَمَعَهُمْ عَلَی الْهُدٰی فَلَا تَكُوْنَنَّ مِنَ الْجٰهِلِیْنَ",
    "اِنَّمَا یَسْتَجِیْبُ الَّذِیْنَ یَسْمَعُوْنَ وَالْمَوْتٰی یَبْعَثُهُمُ اللّٰهُ ثُمَّ اِلَیْهِ یُرْجَعُوْنَ",
    "وَقَالُوْا لَوْلَا نُزِّلَ عَلَیْهِ اٰیَةٌ مِّنْ رَّبِّهٖ قُلْ اِنَّ اللّٰهَ قَادِرٌ عَلٰۤی اَنْ یُّنَزِّلَ اٰیَةً وَّلٰكِنَّ اَكْثَرَهُمْ لَا یَعْلَمُوْنَ",
    "وَمَا مِنْ دَآبَّةٍ فِی الْاَرْضِ وَلَا طٰٓىِٕرٍ یَّطِیْرُ بِجَنَاحَیْهِ اِلَّاۤ اُمَمٌ اَمْثَالُكُمْ مَا فَرَّطْنَا فِی الْكِتٰبِ مِنْ شَیْءٍ ثُمَّ اِلٰی رَبِّهِمْ یُحْشَرُوْنَ",
    "وَالَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا صُمٌّ وَّبُكْمٌ فِی الظُّلُمٰتِ مَنْ یَّشَاِ اللّٰهُ یُضْلِلْهُ وَمَنْ یَّشَاْ یَجْعَلْهُ عَلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "قُلْ اَرَءَیْتَكُمْ اِنْ اَتٰىكُمْ عَذَابُ اللّٰهِ اَوْ اَتَتْكُمُ السَّاعَةُ اَغَیْرَ اللّٰهِ تَدْعُوْنَ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "بَلْ اِیَّاهُ تَدْعُوْنَ فَیَكْشِفُ مَا تَدْعُوْنَ اِلَیْهِ اِنْ شَآءَ وَتَنْسَوْنَ مَا تُشْرِكُوْنَ",
    "وَلَقَدْ اَرْسَلْنَاۤ اِلٰۤی اُمَمٍ مِّنْ قَبْلِكَ فَاَخَذْنٰهُمْ بِالْبَاْسَآءِ وَالضَّرَّآءِ لَعَلَّهُمْ یَتَضَرَّعُوْنَ",
    "فَلَوْلَاۤ اِذْ جَآءَهُمْ بَاْسُنَا تَضَرَّعُوْا وَلٰكِنْ قَسَتْ قُلُوْبُهُمْ وَزَیَّنَ لَهُمُ الشَّیْطٰنُ مَا كَانُوْا یَعْمَلُوْنَ",
    "فَلَمَّا نَسُوْا مَا ذُكِّرُوْا بِهٖ فَتَحْنَا عَلَیْهِمْ اَبْوَابَ كُلِّ شَیْءٍ حَتّٰۤی اِذَا فَرِحُوْا بِمَاۤ اُوْتُوْۤا اَخَذْنٰهُمْ بَغْتَةً فَاِذَا هُمْ مُّبْلِسُوْنَ",
    "فَقُطِعَ دَابِرُ الْقَوْمِ الَّذِیْنَ ظَلَمُوْا وَالْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِیْنَ",
    "قُلْ اَرَءَیْتُمْ اِنْ اَخَذَ اللّٰهُ سَمْعَكُمْ وَاَبْصَارَكُمْ وَخَتَمَ عَلٰی قُلُوْبِكُمْ مَّنْ اِلٰهٌ غَیْرُ اللّٰهِ یَاْتِیْكُمْ بِهٖ اُنْظُرْ كَیْفَ نُصَرِّفُ الْاٰیٰتِ ثُمَّ هُمْ یَصْدِفُوْنَ",
    "قُلْ اَرَءَیْتَكُمْ اِنْ اَتٰىكُمْ عَذَابُ اللّٰهِ بَغْتَةً اَوْ جَهْرَةً هَلْ یُهْلَكُ اِلَّا الْقَوْمُ الظّٰلِمُوْنَ",
    "وَمَا نُرْسِلُ الْمُرْسَلِیْنَ اِلَّا مُبَشِّرِیْنَ وَمُنْذِرِیْنَ فَمَنْ اٰمَنَ وَاَصْلَحَ فَلَا خَوْفٌ عَلَیْهِمْ وَلَا هُمْ یَحْزَنُوْنَ",
    "وَالَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا یَمَسُّهُمُ الْعَذَابُ بِمَا كَانُوْا یَفْسُقُوْنَ",
    "قُلْ لَّاۤ اَقُوْلُ لَكُمْ عِنْدِیْ خَزَآىِٕنُ اللّٰهِ وَلَاۤ اَعْلَمُ الْغَیْبَ وَلَاۤ اَقُوْلُ لَكُمْ اِنِّیْ مَلَكٌ اِنْ اَتَّبِعُ اِلَّا مَا یُوْحٰۤی اِلَیَّ قُلْ هَلْ یَسْتَوِی الْاَعْمٰی وَالْبَصِیْرُ اَفَلَا تَتَفَكَّرُوْنَ",
    "وَاَنْذِرْ بِهِ الَّذِیْنَ یَخَافُوْنَ اَنْ یُّحْشَرُوْۤا اِلٰی رَبِّهِمْ لَیْسَ لَهُمْ مِّنْ دُوْنِهٖ وَلِیٌّ وَّلَا شَفِیْعٌ لَّعَلَّهُمْ یَتَّقُوْنَ",
    "وَلَا تَطْرُدِ الَّذِیْنَ یَدْعُوْنَ رَبَّهُمْ بِالْغَدٰوةِ وَالْعَشِیِّ یُرِیْدُوْنَ وَجْهَهٗ مَا عَلَیْكَ مِنْ حِسَابِهِمْ مِّنْ شَیْءٍ وَّمَا مِنْ حِسَابِكَ عَلَیْهِمْ مِّنْ شَیْءٍ فَتَطْرُدَهُمْ فَتَكُوْنَ مِنَ الظّٰلِمِیْنَ",
    "وَكَذٰلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ لِّیَقُوْلُوْۤا اَهٰۤؤُلَآءِ مَنَّ اللّٰهُ عَلَیْهِمْ مِّنْ بَیْنِنَا اَلَیْسَ اللّٰهُ بِاَعْلَمَ بِالشّٰكِرِیْنَ",
    "وَاِذَا جَآءَكَ الَّذِیْنَ یُؤْمِنُوْنَ بِاٰیٰتِنَا فَقُلْ سَلٰمٌ عَلَیْكُمْ كَتَبَ رَبُّكُمْ عَلٰی نَفْسِهِ الرَّحْمَةَ اَنَّهٗ مَنْ عَمِلَ مِنْكُمْ سُوْٓءًا بِجَهَالَةٍ ثُمَّ تَابَ مِنْ بَعْدِهٖ وَاَصْلَحَ فَاَنَّهٗ غَفُوْرٌ رَّحِیْمٌ",
    "وَكَذٰلِكَ نُفَصِّلُ الْاٰیٰتِ وَلِتَسْتَبِیْنَ سَبِیْلُ الْمُجْرِمِیْنَ",
    "قُلْ اِنِّیْ نُهِیْتُ اَنْ اَعْبُدَ الَّذِیْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ قُلْ لَّاۤ اَتَّبِعُ اَهْوَآءَكُمْ قَدْ ضَلَلْتُ اِذًا وَّمَاۤ اَنَا مِنَ الْمُهْتَدِیْنَ",
    "قُلْ اِنِّیْ عَلٰی بَیِّنَةٍ مِّنْ رَّبِّیْ وَكَذَّبْتُمْ بِهٖ مَا عِنْدِیْ مَا تَسْتَعْجِلُوْنَ بِهٖ اِنِ الْحُكْمُ اِلَّا لِلّٰهِ یَقُصُّ الْحَقَّ وَهُوَ خَیْرُ الْفٰصِلِیْنَ",
    "قُلْ لَّوْ اَنَّ عِنْدِیْ مَا تَسْتَعْجِلُوْنَ بِهٖ لَقُضِیَ الْاَمْرُ بَیْنِیْ وَبَیْنَكُمْ وَاللّٰهُ اَعْلَمُ بِالظّٰلِمِیْنَ",
    "وَعِنْدَهٗ مَفَاتِحُ الْغَیْبِ لَا یَعْلَمُهَاۤ اِلَّا هُوَ وَیَعْلَمُ مَا فِی الْبَرِّ وَالْبَحْرِ وَمَا تَسْقُطُ مِنْ وَّرَقَةٍ اِلَّا یَعْلَمُهَا وَلَا حَبَّةٍ فِیْ ظُلُمٰتِ الْاَرْضِ وَلَا رَطْبٍ وَّلَا یَابِسٍ اِلَّا فِیْ كِتٰبٍ مُّبِیْنٍ",
    "وَهُوَ الَّذِیْ یَتَوَفّٰىكُمْ بِالَّیْلِ وَیَعْلَمُ مَا جَرَحْتُمْ بِالنَّهَارِ ثُمَّ یَبْعَثُكُمْ فِیْهِ لِیُقْضٰۤی اَجَلٌ مُّسَمًّی ثُمَّ اِلَیْهِ مَرْجِعُكُمْ ثُمَّ یُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ",
    "وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهٖ وَیُرْسِلُ عَلَیْكُمْ حَفَظَةً حَتّٰۤی اِذَا جَآءَ اَحَدَكُمُ الْمَوْتُ تَوَفَّتْهُ رُسُلُنَا وَهُمْ لَا یُفَرِّطُوْنَ",
    "ثُمَّ رُدُّوْۤا اِلَی اللّٰهِ مَوْلٰىهُمُ الْحَقِّ اَلَا لَهُ الْحُكْمُ ۫ وَهُوَ اَسْرَعُ الْحٰسِبِیْنَ",
    "قُلْ مَنْ یُّنَجِّیْكُمْ مِّنْ ظُلُمٰتِ الْبَرِّ وَالْبَحْرِ تَدْعُوْنَهٗ تَضَرُّعًا وَّخُفْیَةً لَىِٕنْ اَنْجٰىنَا مِنْ هٰذِهٖ لَنَكُوْنَنَّ مِنَ الشّٰكِرِیْنَ",
    "قُلِ اللّٰهُ یُنَجِّیْكُمْ مِّنْهَا وَمِنْ كُلِّ كَرْبٍ ثُمَّ اَنْتُمْ تُشْرِكُوْنَ",
    "قُلْ هُوَ الْقَادِرُ عَلٰۤی اَنْ یَّبْعَثَ عَلَیْكُمْ عَذَابًا مِّنْ فَوْقِكُمْ اَوْ مِنْ تَحْتِ اَرْجُلِكُمْ اَوْ یَلْبِسَكُمْ شِیَعًا وَّیُذِیْقَ بَعْضَكُمْ بَاْسَ بَعْضٍ اُنْظُرْ كَیْفَ نُصَرِّفُ الْاٰیٰتِ لَعَلَّهُمْ یَفْقَهُوْنَ",
    "وَكَذَّبَ بِهٖ قَوْمُكَ وَهُوَ الْحَقُّ قُلْ لَّسْتُ عَلَیْكُمْ بِوَكِیْلٍ",
    "لِكُلِّ نَبَاٍ مُّسْتَقَرٌّ وَّسَوْفَ تَعْلَمُوْنَ",
    "وَاِذَا رَاَیْتَ الَّذِیْنَ یَخُوْضُوْنَ فِیْۤ اٰیٰتِنَا فَاَعْرِضْ عَنْهُمْ حَتّٰی یَخُوْضُوْا فِیْ حَدِیْثٍ غَیْرِهٖ وَاِمَّا یُنْسِیَنَّكَ الشَّیْطٰنُ فَلَا تَقْعُدْ بَعْدَ الذِّكْرٰی مَعَ الْقَوْمِ الظّٰلِمِیْنَ",
    "وَمَا عَلَی الَّذِیْنَ یَتَّقُوْنَ مِنْ حِسَابِهِمْ مِّنْ شَیْءٍ وَّلٰكِنْ ذِكْرٰی لَعَلَّهُمْ یَتَّقُوْنَ",
    "وَذَرِ الَّذِیْنَ اتَّخَذُوْا دِیْنَهُمْ لَعِبًا وَّلَهْوًا وَّغَرَّتْهُمُ الْحَیٰوةُ الدُّنْیَا وَذَكِّرْ بِهٖۤ اَنْ تُبْسَلَ نَفْسٌ بِمَا كَسَبَتْ ۖ لَیْسَ لَهَا مِنْ دُوْنِ اللّٰهِ وَلِیٌّ وَّلَا شَفِیْعٌ وَاِنْ تَعْدِلْ كُلَّ عَدْلٍ لَّا یُؤْخَذْ مِنْهَا اُولٰٓىِٕكَ الَّذِیْنَ اُبْسِلُوْا بِمَا كَسَبُوْا لَهُمْ شَرَابٌ مِّنْ حَمِیْمٍ وَّعَذَابٌ اَلِیْمٌ بِمَا كَانُوْا یَكْفُرُوْنَ",
    "قُلْ اَنَدْعُوْا مِنْ دُوْنِ اللّٰهِ مَا لَا یَنْفَعُنَا وَلَا یَضُرُّنَا وَنُرَدُّ عَلٰۤی اَعْقَابِنَا بَعْدَ اِذْ هَدٰىنَا اللّٰهُ كَالَّذِی اسْتَهْوَتْهُ الشَّیٰطِیْنُ فِی الْاَرْضِ حَیْرَانَ لَهٗۤ اَصْحٰبٌ یَّدْعُوْنَهٗۤ اِلَی الْهُدَی ائْتِنَا قُلْ اِنَّ هُدَی اللّٰهِ هُوَ الْهُدٰی وَاُمِرْنَا لِنُسْلِمَ لِرَبِّ الْعٰلَمِیْنَ",
    "وَاَنْ اَقِیْمُوا الصَّلٰوةَ وَاتَّقُوْهُ وَهُوَ الَّذِیْۤ اِلَیْهِ تُحْشَرُوْنَ",
    "وَهُوَ الَّذِیْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّ وَیَوْمَ یَقُوْلُ كُنْ فَیَكُوْنُ ۬ قَوْلُهُ الْحَقُّ وَلَهُ الْمُلْكُ یَوْمَ یُنْفَخُ فِی الصُّوْرِ عٰلِمُ الْغَیْبِ وَالشَّهَادَةِ وَهُوَ الْحَكِیْمُ الْخَبِیْرُ",
    "وَاِذْ قَالَ اِبْرٰهِیْمُ لِاَبِیْهِ اٰزَرَ اَتَتَّخِذُ اَصْنَامًا اٰلِهَةً اِنِّیْۤ اَرٰىكَ وَقَوْمَكَ فِیْ ضَلٰلٍ مُّبِیْنٍ",
    "وَكَذٰلِكَ نُرِیْۤ اِبْرٰهِیْمَ مَلَكُوْتَ السَّمٰوٰتِ وَالْاَرْضِ وَلِیَكُوْنَ مِنَ الْمُوْقِنِیْنَ",
    "فَلَمَّا جَنَّ عَلَیْهِ الَّیْلُ رَاٰ كَوْكَبًا قَالَ هٰذَا رَبِّیْ فَلَمَّاۤ اَفَلَ قَالَ لَاۤ اُحِبُّ الْاٰفِلِیْنَ",
    "فَلَمَّا رَاَ الْقَمَرَ بَازِغًا قَالَ هٰذَا رَبِّیْ فَلَمَّاۤ اَفَلَ قَالَ لَىِٕنْ لَّمْ یَهْدِنِیْ رَبِّیْ لَاَكُوْنَنَّ مِنَ الْقَوْمِ الضَّآلِّیْنَ",
    "فَلَمَّا رَاَ الشَّمْسَ بَازِغَةً قَالَ هٰذَا رَبِّیْ هٰذَاۤ اَكْبَرُ فَلَمَّاۤ اَفَلَتْ قَالَ یٰقَوْمِ اِنِّیْ بَرِیْٓءٌ مِّمَّا تُشْرِكُوْنَ",
    "اِنِّیْ وَجَّهْتُ وَجْهِیَ لِلَّذِیْ فَطَرَ السَّمٰوٰتِ وَالْاَرْضَ حَنِیْفًا وَّمَاۤ اَنَا مِنَ الْمُشْرِكِیْنَ",
    "وَحَآجَّهٗ قَوْمُهٗ قَالَ اَتُحَآجُّوْٓنِّیْ فِی اللّٰهِ وَقَدْ هَدٰىنِ وَلَاۤ اَخَافُ مَا تُشْرِكُوْنَ بِهٖۤ اِلَّاۤ اَنْ یَّشَآءَ رَبِّیْ شَیْـًٔا وَسِعَ رَبِّیْ كُلَّ شَیْءٍ عِلْمًا اَفَلَا تَتَذَكَّرُوْنَ",
    "وَكَیْفَ اَخَافُ مَاۤ اَشْرَكْتُمْ وَلَا تَخَافُوْنَ اَنَّكُمْ اَشْرَكْتُمْ بِاللّٰهِ مَا لَمْ یُنَزِّلْ بِهٖ عَلَیْكُمْ سُلْطٰنًا فَاَیُّ الْفَرِیْقَیْنِ اَحَقُّ بِالْاَمْنِ اِنْ كُنْتُمْ تَعْلَمُوْنَ",
    "اَلَّذِیْنَ اٰمَنُوْا وَلَمْ یَلْبِسُوْۤا اِیْمَانَهُمْ بِظُلْمٍ اُولٰٓىِٕكَ لَهُمُ الْاَمْنُ وَهُمْ مُّهْتَدُوْنَ",
    "وَتِلْكَ حُجَّتُنَاۤ اٰتَیْنٰهَاۤ اِبْرٰهِیْمَ عَلٰی قَوْمِهٖ نَرْفَعُ دَرَجٰتٍ مَّنْ نَّشَآءُ اِنَّ رَبَّكَ حَكِیْمٌ عَلِیْمٌ",
    "وَوَهَبْنَا لَهٗۤ اِسْحٰقَ وَیَعْقُوْبَ كُلًّا هَدَیْنَا وَنُوْحًا هَدَیْنَا مِنْ قَبْلُ وَمِنْ ذُرِّیَّتِهٖ دَاوٗدَ وَسُلَیْمٰنَ وَاَیُّوْبَ وَیُوْسُفَ وَمُوْسٰی وَهٰرُوْنَ وَكَذٰلِكَ نَجْزِی الْمُحْسِنِیْنَ",
    "وَزَكَرِیَّا وَیَحْیٰی وَعِیْسٰی وَاِلْیَاسَ كُلٌّ مِّنَ الصّٰلِحِیْنَ",
    "وَاِسْمٰعِیْلَ وَالْیَسَعَ وَیُوْنُسَ وَلُوْطًا وَكُلًّا فَضَّلْنَا عَلَی الْعٰلَمِیْنَ",
    "وَمِنْ اٰبَآىِٕهِمْ وَذُرِّیّٰتِهِمْ وَاِخْوَانِهِمْ وَاجْتَبَیْنٰهُمْ وَهَدَیْنٰهُمْ اِلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "ذٰلِكَ هُدَی اللّٰهِ یَهْدِیْ بِهٖ مَنْ یَّشَآءُ مِنْ عِبَادِهٖ وَلَوْ اَشْرَكُوْا لَحَبِطَ عَنْهُمْ مَّا كَانُوْا یَعْمَلُوْنَ",
    "اُولٰٓىِٕكَ الَّذِیْنَ اٰتَیْنٰهُمُ الْكِتٰبَ وَالْحُكْمَ وَالنُّبُوَّةَ فَاِنْ یَّكْفُرْ بِهَا هٰۤؤُلَآءِ فَقَدْ وَكَّلْنَا بِهَا قَوْمًا لَّیْسُوْا بِهَا بِكٰفِرِیْنَ",
    "اُولٰٓىِٕكَ الَّذِیْنَ هَدَی اللّٰهُ فَبِهُدٰىهُمُ اقْتَدِهْ قُلْ لَّاۤ اَسْـَٔلُكُمْ عَلَیْهِ اَجْرًا اِنْ هُوَ اِلَّا ذِكْرٰی لِلْعٰلَمِیْنَ",
    "وَمَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖۤ اِذْ قَالُوْا مَاۤ اَنْزَلَ اللّٰهُ عَلٰی بَشَرٍ مِّنْ شَیْءٍ قُلْ مَنْ اَنْزَلَ الْكِتٰبَ الَّذِیْ جَآءَ بِهٖ مُوْسٰی نُوْرًا وَّهُدًی لِّلنَّاسِ تَجْعَلُوْنَهٗ قَرَاطِیْسَ تُبْدُوْنَهَا وَتُخْفُوْنَ كَثِیْرًا وَعُلِّمْتُمْ مَّا لَمْ تَعْلَمُوْۤا اَنْتُمْ وَلَاۤ اٰبَآؤُكُمْ قُلِ اللّٰهُ ثُمَّ ذَرْهُمْ فِیْ خَوْضِهِمْ یَلْعَبُوْنَ",
    "وَهٰذَا كِتٰبٌ اَنْزَلْنٰهُ مُبٰرَكٌ مُّصَدِّقُ الَّذِیْ بَیْنَ یَدَیْهِ وَلِتُنْذِرَ اُمَّ الْقُرٰی وَمَنْ حَوْلَهَا وَالَّذِیْنَ یُؤْمِنُوْنَ بِالْاٰخِرَةِ یُؤْمِنُوْنَ بِهٖ وَهُمْ عَلٰی صَلَاتِهِمْ یُحَافِظُوْنَ",
    "وَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰی عَلَی اللّٰهِ كَذِبًا اَوْ قَالَ اُوْحِیَ اِلَیَّ وَلَمْ یُوْحَ اِلَیْهِ شَیْءٌ وَّمَنْ قَالَ سَاُنْزِلُ مِثْلَ مَاۤ اَنْزَلَ اللّٰهُ وَلَوْ تَرٰۤی اِذِ الظّٰلِمُوْنَ فِیْ غَمَرٰتِ الْمَوْتِ وَالْمَلٰٓىِٕكَةُ بَاسِطُوْۤا اَیْدِیْهِمْ اَخْرِجُوْۤا اَنْفُسَكُمْ اَلْیَوْمَ تُجْزَوْنَ عَذَابَ الْهُوْنِ بِمَا كُنْتُمْ تَقُوْلُوْنَ عَلَی اللّٰهِ غَیْرَ الْحَقِّ وَكُنْتُمْ عَنْ اٰیٰتِهٖ تَسْتَكْبِرُوْنَ",
    "وَلَقَدْ جِئْتُمُوْنَا فُرَادٰی كَمَا خَلَقْنٰكُمْ اَوَّلَ مَرَّةٍ وَّتَرَكْتُمْ مَّا خَوَّلْنٰكُمْ وَرَآءَ ظُهُوْرِكُمْ وَمَا نَرٰی مَعَكُمْ شُفَعَآءَكُمُ الَّذِیْنَ زَعَمْتُمْ اَنَّهُمْ فِیْكُمْ شُرَكٰٓؤُا لَقَدْ تَّقَطَّعَ بَیْنَكُمْ وَضَلَّ عَنْكُمْ مَّا كُنْتُمْ تَزْعُمُوْنَ",
    "اِنَّ اللّٰهَ فَالِقُ الْحَبِّ وَالنَّوٰی یُخْرِجُ الْحَیَّ مِنَ الْمَیِّتِ وَمُخْرِجُ الْمَیِّتِ مِنَ الْحَیِّ ذٰلِكُمُ اللّٰهُ فَاَنّٰی تُؤْفَكُوْنَ",
    "فَالِقُ الْاِصْبَاحِ وَجَعَلَ الَّیْلَ سَكَنًا وَّالشَّمْسَ وَالْقَمَرَ حُسْبَانًا ذٰلِكَ تَقْدِیْرُ الْعَزِیْزِ الْعَلِیْمِ",
    "وَهُوَ الَّذِیْ جَعَلَ لَكُمُ النُّجُوْمَ لِتَهْتَدُوْا بِهَا فِیْ ظُلُمٰتِ الْبَرِّ وَالْبَحْرِ قَدْ فَصَّلْنَا الْاٰیٰتِ لِقَوْمٍ یَّعْلَمُوْنَ",
    "وَهُوَ الَّذِیْۤ اَنْشَاَكُمْ مِّنْ نَّفْسٍ وَّاحِدَةٍ فَمُسْتَقَرٌّ وَّمُسْتَوْدَعٌ قَدْ فَصَّلْنَا الْاٰیٰتِ لِقَوْمٍ یَّفْقَهُوْنَ",
    "وَهُوَ الَّذِیْۤ اَنْزَلَ مِنَ السَّمَآءِ مَآءً فَاَخْرَجْنَا بِهٖ نَبَاتَ كُلِّ شَیْءٍ فَاَخْرَجْنَا مِنْهُ خَضِرًا نُّخْرِجُ مِنْهُ حَبًّا مُّتَرَاكِبًا وَمِنَ النَّخْلِ مِنْ طَلْعِهَا قِنْوَانٌ دَانِیَةٌ وَّجَنّٰتٍ مِّنْ اَعْنَابٍ وَّالزَّیْتُوْنَ وَالرُّمَّانَ مُشْتَبِهًا وَّغَیْرَ مُتَشَابِهٍ اُنْظُرُوْۤا اِلٰی ثَمَرِهٖۤ اِذَاۤ اَثْمَرَ وَیَنْعِهٖ اِنَّ فِیْ ذٰلِكُمْ لَاٰیٰتٍ لِّقَوْمٍ یُّؤْمِنُوْنَ",
    "وَجَعَلُوْا لِلّٰهِ شُرَكَآءَ الْجِنَّ وَخَلَقَهُمْ وَخَرَقُوْا لَهٗ بَنِیْنَ وَبَنٰتٍ بِغَیْرِ عِلْمٍ سُبْحٰنَهٗ وَتَعٰلٰی عَمَّا یَصِفُوْنَ",
    "بَدِیْعُ السَّمٰوٰتِ وَالْاَرْضِ اَنّٰی یَكُوْنُ لَهٗ وَلَدٌ وَّلَمْ تَكُنْ لَّهٗ صَاحِبَةٌ وَخَلَقَ كُلَّ شَیْءٍ وَهُوَ بِكُلِّ شَیْءٍ عَلِیْمٌ",
    "ذٰلِكُمُ اللّٰهُ رَبُّكُمْ لَاۤ اِلٰهَ اِلَّا هُوَ خَالِقُ كُلِّ شَیْءٍ فَاعْبُدُوْهُ وَهُوَ عَلٰی كُلِّ شَیْءٍ وَّكِیْلٌ",
    "لَا تُدْرِكُهُ الْاَبْصَارُ وَهُوَ یُدْرِكُ الْاَبْصَارَ وَهُوَ اللَّطِیْفُ الْخَبِیْرُ",
    "قَدْ جَآءَكُمْ بَصَآىِٕرُ مِنْ رَّبِّكُمْ فَمَنْ اَبْصَرَ فَلِنَفْسِهٖ وَمَنْ عَمِیَ فَعَلَیْهَا وَمَاۤ اَنَا عَلَیْكُمْ بِحَفِیْظٍ",
    "وَكَذٰلِكَ نُصَرِّفُ الْاٰیٰتِ وَلِیَقُوْلُوْا دَرَسْتَ وَلِنُبَیِّنَهٗ لِقَوْمٍ یَّعْلَمُوْنَ",
    "اِتَّبِعْ مَاۤ اُوْحِیَ اِلَیْكَ مِنْ رَّبِّكَ لَاۤ اِلٰهَ اِلَّا هُوَ وَاَعْرِضْ عَنِ الْمُشْرِكِیْنَ",
    "وَلَوْ شَآءَ اللّٰهُ مَاۤ اَشْرَكُوْا وَمَا جَعَلْنٰكَ عَلَیْهِمْ حَفِیْظًا وَمَاۤ اَنْتَ عَلَیْهِمْ بِوَكِیْلٍ",
    "وَلَا تَسُبُّوا الَّذِیْنَ یَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ فَیَسُبُّوا اللّٰهَ عَدْوًا بِغَیْرِ عِلْمٍ كَذٰلِكَ زَیَّنَّا لِكُلِّ اُمَّةٍ عَمَلَهُمْ ثُمَّ اِلٰی رَبِّهِمْ مَّرْجِعُهُمْ فَیُنَبِّئُهُمْ بِمَا كَانُوْا یَعْمَلُوْنَ",
    "وَاَقْسَمُوْا بِاللّٰهِ جَهْدَ اَیْمَانِهِمْ لَىِٕنْ جَآءَتْهُمْ اٰیَةٌ لَّیُؤْمِنُنَّ بِهَا قُلْ اِنَّمَا الْاٰیٰتُ عِنْدَ اللّٰهِ وَمَا یُشْعِرُكُمْ اَنَّهَاۤ اِذَا جَآءَتْ لَا یُؤْمِنُوْنَ",
    "وَنُقَلِّبُ اَفْـِٕدَتَهُمْ وَاَبْصَارَهُمْ كَمَا لَمْ یُؤْمِنُوْا بِهٖۤ اَوَّلَ مَرَّةٍ وَّنَذَرُهُمْ فِیْ طُغْیَانِهِمْ یَعْمَهُوْنَ",
    "وَلَوْ اَنَّنَا نَزَّلْنَاۤ اِلَیْهِمُ الْمَلٰٓىِٕكَةَ وَكَلَّمَهُمُ الْمَوْتٰی وَحَشَرْنَا عَلَیْهِمْ كُلَّ شَیْءٍ قُبُلًا مَّا كَانُوْا لِیُؤْمِنُوْۤا اِلَّاۤ اَنْ یَّشَآءَ اللّٰهُ وَلٰكِنَّ اَكْثَرَهُمْ یَجْهَلُوْنَ",
    "وَكَذٰلِكَ جَعَلْنَا لِكُلِّ نَبِیٍّ عَدُوًّا شَیٰطِیْنَ الْاِنْسِ وَالْجِنِّ یُوْحِیْ بَعْضُهُمْ اِلٰی بَعْضٍ زُخْرُفَ الْقَوْلِ غُرُوْرًا وَلَوْ شَآءَ رَبُّكَ مَا فَعَلُوْهُ فَذَرْهُمْ وَمَا یَفْتَرُوْنَ",
    "وَلِتَصْغٰۤی اِلَیْهِ اَفْـِٕدَةُ الَّذِیْنَ لَا یُؤْمِنُوْنَ بِالْاٰخِرَةِ وَلِیَرْضَوْهُ وَلِیَقْتَرِفُوْا مَا هُمْ مُّقْتَرِفُوْنَ",
    "اَفَغَیْرَ اللّٰهِ اَبْتَغِیْ حَكَمًا وَّهُوَ الَّذِیْۤ اَنْزَلَ اِلَیْكُمُ الْكِتٰبَ مُفَصَّلًا وَالَّذِیْنَ اٰتَیْنٰهُمُ الْكِتٰبَ یَعْلَمُوْنَ اَنَّهٗ مُنَزَّلٌ مِّنْ رَّبِّكَ بِالْحَقِّ فَلَا تَكُوْنَنَّ مِنَ الْمُمْتَرِیْنَ",
    "وَتَمَّتْ كَلِمَتُ رَبِّكَ صِدْقًا وَّعَدْلًا لَا مُبَدِّلَ لِكَلِمٰتِهٖ وَهُوَ السَّمِیْعُ الْعَلِیْمُ",
    "وَاِنْ تُطِعْ اَكْثَرَ مَنْ فِی الْاَرْضِ یُضِلُّوْكَ عَنْ سَبِیْلِ اللّٰهِ اِنْ یَّتَّبِعُوْنَ اِلَّا الظَّنَّ وَاِنْ هُمْ اِلَّا یَخْرُصُوْنَ",
    "اِنَّ رَبَّكَ هُوَ اَعْلَمُ مَنْ یَّضِلُّ عَنْ سَبِیْلِهٖ وَهُوَ اَعْلَمُ بِالْمُهْتَدِیْنَ",
    "فَكُلُوْا مِمَّا ذُكِرَ اسْمُ اللّٰهِ عَلَیْهِ اِنْ كُنْتُمْ بِاٰیٰتِهٖ مُؤْمِنِیْنَ",
    "وَمَا لَكُمْ اَلَّا تَاْكُلُوْا مِمَّا ذُكِرَ اسْمُ اللّٰهِ عَلَیْهِ وَقَدْ فَصَّلَ لَكُمْ مَّا حَرَّمَ عَلَیْكُمْ اِلَّا مَا اضْطُرِرْتُمْ اِلَیْهِ وَاِنَّ كَثِیْرًا لَّیُضِلُّوْنَ بِاَهْوَآىِٕهِمْ بِغَیْرِ عِلْمٍ اِنَّ رَبَّكَ هُوَ اَعْلَمُ بِالْمُعْتَدِیْنَ",
    "وَذَرُوْا ظَاهِرَ الْاِثْمِ وَبَاطِنَهٗ اِنَّ الَّذِیْنَ یَكْسِبُوْنَ الْاِثْمَ سَیُجْزَوْنَ بِمَا كَانُوْا یَقْتَرِفُوْنَ",
    "وَلَا تَاْكُلُوْا مِمَّا لَمْ یُذْكَرِ اسْمُ اللّٰهِ عَلَیْهِ وَاِنَّهٗ لَفِسْقٌ وَاِنَّ الشَّیٰطِیْنَ لَیُوْحُوْنَ اِلٰۤی اَوْلِیٰٓـِٕهِمْ لِیُجَادِلُوْكُمْ وَاِنْ اَطَعْتُمُوْهُمْ اِنَّكُمْ لَمُشْرِكُوْنَ",
    "اَوَمَنْ كَانَ مَیْتًا فَاَحْیَیْنٰهُ وَجَعَلْنَا لَهٗ نُوْرًا یَّمْشِیْ بِهٖ فِی النَّاسِ كَمَنْ مَّثَلُهٗ فِی الظُّلُمٰتِ لَیْسَ بِخَارِجٍ مِّنْهَا كَذٰلِكَ زُیِّنَ لِلْكٰفِرِیْنَ مَا كَانُوْا یَعْمَلُوْنَ",
    "وَكَذٰلِكَ جَعَلْنَا فِیْ كُلِّ قَرْیَةٍ اَكٰبِرَ مُجْرِمِیْهَا لِیَمْكُرُوْا فِیْهَا وَمَا یَمْكُرُوْنَ اِلَّا بِاَنْفُسِهِمْ وَمَا یَشْعُرُوْنَ",
    "وَاِذَا جَآءَتْهُمْ اٰیَةٌ قَالُوْا لَنْ نُّؤْمِنَ حَتّٰی نُؤْتٰی مِثْلَ مَاۤ اُوْتِیَ رُسُلُ اللّٰهِ اَللّٰهُ اَعْلَمُ حَیْثُ یَجْعَلُ رِسَالَتَهٗ سَیُصِیْبُ الَّذِیْنَ اَجْرَمُوْا صَغَارٌ عِنْدَ اللّٰهِ وَعَذَابٌ شَدِیْدٌۢ بِمَا كَانُوْا یَمْكُرُوْنَ",
    "فَمَنْ یُّرِدِ اللّٰهُ اَنْ یَّهْدِیَهٗ یَشْرَحْ صَدْرَهٗ لِلْاِسْلَامِ وَمَنْ یُّرِدْ اَنْ یُّضِلَّهٗ یَجْعَلْ صَدْرَهٗ ضَیِّقًا حَرَجًا كَاَنَّمَا یَصَّعَّدُ فِی السَّمَآءِ كَذٰلِكَ یَجْعَلُ اللّٰهُ الرِّجْسَ عَلَی الَّذِیْنَ لَا یُؤْمِنُوْنَ",
    "وَهٰذَا صِرَاطُ رَبِّكَ مُسْتَقِیْمًا قَدْ فَصَّلْنَا الْاٰیٰتِ لِقَوْمٍ یَّذَّكَّرُوْنَ",
    "لَهُمْ دَارُ السَّلٰمِ عِنْدَ رَبِّهِمْ وَهُوَ وَلِیُّهُمْ بِمَا كَانُوْا یَعْمَلُوْنَ",
    "وَیَوْمَ یَحْشُرُهُمْ جَمِیْعًا یٰمَعْشَرَ الْجِنِّ قَدِ اسْتَكْثَرْتُمْ مِّنَ الْاِنْسِ وَقَالَ اَوْلِیٰٓؤُهُمْ مِّنَ الْاِنْسِ رَبَّنَا اسْتَمْتَعَ بَعْضُنَا بِبَعْضٍ وَّبَلَغْنَاۤ اَجَلَنَا الَّذِیْۤ اَجَّلْتَ لَنَا قَالَ النَّارُ مَثْوٰىكُمْ خٰلِدِیْنَ فِیْهَاۤ اِلَّا مَا شَآءَ اللّٰهُ اِنَّ رَبَّكَ حَكِیْمٌ عَلِیْمٌ",
    "وَكَذٰلِكَ نُوَلِّیْ بَعْضَ الظّٰلِمِیْنَ بَعْضًا بِمَا كَانُوْا یَكْسِبُوْنَ",
    "یٰمَعْشَرَ الْجِنِّ وَالْاِنْسِ اَلَمْ یَاْتِكُمْ رُسُلٌ مِّنْكُمْ یَقُصُّوْنَ عَلَیْكُمْ اٰیٰتِیْ وَیُنْذِرُوْنَكُمْ لِقَآءَ یَوْمِكُمْ هٰذَا قَالُوْا شَهِدْنَا عَلٰۤی اَنْفُسِنَا وَغَرَّتْهُمُ الْحَیٰوةُ الدُّنْیَا وَشَهِدُوْا عَلٰۤی اَنْفُسِهِمْ اَنَّهُمْ كَانُوْا كٰفِرِیْنَ",
    "ذٰلِكَ اَنْ لَّمْ یَكُنْ رَّبُّكَ مُهْلِكَ الْقُرٰی بِظُلْمٍ وَّاَهْلُهَا غٰفِلُوْنَ",
    "وَلِكُلٍّ دَرَجٰتٌ مِّمَّا عَمِلُوْا وَمَا رَبُّكَ بِغَافِلٍ عَمَّا یَعْمَلُوْنَ",
    "وَرَبُّكَ الْغَنِیُّ ذُو الرَّحْمَةِ اِنْ یَّشَاْ یُذْهِبْكُمْ وَیَسْتَخْلِفْ مِنْ بَعْدِكُمْ مَّا یَشَآءُ كَمَاۤ اَنْشَاَكُمْ مِّنْ ذُرِّیَّةِ قَوْمٍ اٰخَرِیْنَ",
    "اِنَّ مَا تُوْعَدُوْنَ لَاٰتٍ وَّمَاۤ اَنْتُمْ بِمُعْجِزِیْنَ",
    "قُلْ یٰقَوْمِ اعْمَلُوْا عَلٰی مَكَانَتِكُمْ اِنِّیْ عَامِلٌ فَسَوْفَ تَعْلَمُوْنَ مَنْ تَكُوْنُ لَهٗ عَاقِبَةُ الدَّارِ اِنَّهٗ لَا یُفْلِحُ الظّٰلِمُوْنَ",
    "وَجَعَلُوْا لِلّٰهِ مِمَّا ذَرَاَ مِنَ الْحَرْثِ وَالْاَنْعَامِ نَصِیْبًا فَقَالُوْا هٰذَا لِلّٰهِ بِزَعْمِهِمْ وَهٰذَا لِشُرَكَآىِٕنَا فَمَا كَانَ لِشُرَكَآىِٕهِمْ فَلَا یَصِلُ اِلَی اللّٰهِ وَمَا كَانَ لِلّٰهِ فَهُوَ یَصِلُ اِلٰی شُرَكَآىِٕهِمْ سَآءَ مَا یَحْكُمُوْنَ",
    "وَكَذٰلِكَ زَیَّنَ لِكَثِیْرٍ مِّنَ الْمُشْرِكِیْنَ قَتْلَ اَوْلَادِهِمْ شُرَكَآؤُهُمْ لِیُرْدُوْهُمْ وَلِیَلْبِسُوْا عَلَیْهِمْ دِیْنَهُمْ وَلَوْ شَآءَ اللّٰهُ مَا فَعَلُوْهُ فَذَرْهُمْ وَمَا یَفْتَرُوْنَ",
    "وَقَالُوْا هٰذِهٖۤ اَنْعَامٌ وَّحَرْثٌ حِجْرٌ ۖ لَّا یَطْعَمُهَاۤ اِلَّا مَنْ نَّشَآءُ بِزَعْمِهِمْ وَاَنْعَامٌ حُرِّمَتْ ظُهُوْرُهَا وَاَنْعَامٌ لَّا یَذْكُرُوْنَ اسْمَ اللّٰهِ عَلَیْهَا افْتِرَآءً عَلَیْهِ سَیَجْزِیْهِمْ بِمَا كَانُوْا یَفْتَرُوْنَ",
    "وَقَالُوْا مَا فِیْ بُطُوْنِ هٰذِهِ الْاَنْعَامِ خَالِصَةٌ لِّذُكُوْرِنَا وَمُحَرَّمٌ عَلٰۤی اَزْوَاجِنَا وَاِنْ یَّكُنْ مَّیْتَةً فَهُمْ فِیْهِ شُرَكَآءُ سَیَجْزِیْهِمْ وَصْفَهُمْ اِنَّهٗ حَكِیْمٌ عَلِیْمٌ",
    "قَدْ خَسِرَ الَّذِیْنَ قَتَلُوْۤا اَوْلَادَهُمْ سَفَهًا بِغَیْرِ عِلْمٍ وَّحَرَّمُوْا مَا رَزَقَهُمُ اللّٰهُ افْتِرَآءً عَلَی اللّٰهِ قَدْ ضَلُّوْا وَمَا كَانُوْا مُهْتَدِیْنَ",
    "وَهُوَ الَّذِیْۤ اَنْشَاَ جَنّٰتٍ مَّعْرُوْشٰتٍ وَّغَیْرَ مَعْرُوْشٰتٍ وَّالنَّخْلَ وَالزَّرْعَ مُخْتَلِفًا اُكُلُهٗ وَالزَّیْتُوْنَ وَالرُّمَّانَ مُتَشَابِهًا وَّغَیْرَ مُتَشَابِهٍ كُلُوْا مِنْ ثَمَرِهٖۤ اِذَاۤ اَثْمَرَ وَاٰتُوْا حَقَّهٗ یَوْمَ حَصَادِهٖ ۖ وَلَا تُسْرِفُوْا اِنَّهٗ لَا یُحِبُّ الْمُسْرِفِیْنَ",
    "وَمِنَ الْاَنْعَامِ حَمُوْلَةً وَّفَرْشًا كُلُوْا مِمَّا رَزَقَكُمُ اللّٰهُ وَلَا تَتَّبِعُوْا خُطُوٰتِ الشَّیْطٰنِ اِنَّهٗ لَكُمْ عَدُوٌّ مُّبِیْنٌ",
    "ثَمٰنِیَةَ اَزْوَاجٍ مِنَ الضَّاْنِ اثْنَیْنِ وَمِنَ الْمَعْزِ اثْنَیْنِ قُلْ ءٰٓالذَّكَرَیْنِ حَرَّمَ اَمِ الْاُنْثَیَیْنِ اَمَّا اشْتَمَلَتْ عَلَیْهِ اَرْحَامُ الْاُنْثَیَیْنِ نَبِّـُٔوْنِیْ بِعِلْمٍ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "وَمِنَ الْاِبِلِ اثْنَیْنِ وَمِنَ الْبَقَرِ اثْنَیْنِ قُلْ ءٰٓالذَّكَرَیْنِ حَرَّمَ اَمِ الْاُنْثَیَیْنِ اَمَّا اشْتَمَلَتْ عَلَیْهِ اَرْحَامُ الْاُنْثَیَیْنِ اَمْ كُنْتُمْ شُهَدَآءَ اِذْ وَصّٰىكُمُ اللّٰهُ بِهٰذَا فَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰی عَلَی اللّٰهِ كَذِبًا لِّیُضِلَّ النَّاسَ بِغَیْرِ عِلْمٍ اِنَّ اللّٰهَ لَا یَهْدِی الْقَوْمَ الظّٰلِمِیْنَ",
    "قُلْ لَّاۤ اَجِدُ فِیْ مَاۤ اُوْحِیَ اِلَیَّ مُحَرَّمًا عَلٰی طَاعِمٍ یَّطْعَمُهٗۤ اِلَّاۤ اَنْ یَّكُوْنَ مَیْتَةً اَوْ دَمًا مَّسْفُوْحًا اَوْ لَحْمَ خِنْزِیْرٍ فَاِنَّهٗ رِجْسٌ اَوْ فِسْقًا اُهِلَّ لِغَیْرِ اللّٰهِ بِهٖ فَمَنِ اضْطُرَّ غَیْرَ بَاغٍ وَّلَا عَادٍ فَاِنَّ رَبَّكَ غَفُوْرٌ رَّحِیْمٌ",
    "وَعَلَی الَّذِیْنَ هَادُوْا حَرَّمْنَا كُلَّ ذِیْ ظُفُرٍ وَمِنَ الْبَقَرِ وَالْغَنَمِ حَرَّمْنَا عَلَیْهِمْ شُحُوْمَهُمَاۤ اِلَّا مَا حَمَلَتْ ظُهُوْرُهُمَاۤ اَوِ الْحَوَایَاۤ اَوْ مَا اخْتَلَطَ بِعَظْمٍ ذٰلِكَ جَزَیْنٰهُمْ بِبَغْیِهِمْ ۖ وَاِنَّا لَصٰدِقُوْنَ",
    "فَاِنْ كَذَّبُوْكَ فَقُلْ رَّبُّكُمْ ذُوْ رَحْمَةٍ وَّاسِعَةٍ وَلَا یُرَدُّ بَاْسُهٗ عَنِ الْقَوْمِ الْمُجْرِمِیْنَ",
    "سَیَقُوْلُ الَّذِیْنَ اَشْرَكُوْا لَوْ شَآءَ اللّٰهُ مَاۤ اَشْرَكْنَا وَلَاۤ اٰبَآؤُنَا وَلَا حَرَّمْنَا مِنْ شَیْءٍ كَذٰلِكَ كَذَّبَ الَّذِیْنَ مِنْ قَبْلِهِمْ حَتّٰی ذَاقُوْا بَاْسَنَا قُلْ هَلْ عِنْدَكُمْ مِّنْ عِلْمٍ فَتُخْرِجُوْهُ لَنَا اِنْ تَتَّبِعُوْنَ اِلَّا الظَّنَّ وَاِنْ اَنْتُمْ اِلَّا تَخْرُصُوْنَ",
    "قُلْ فَلِلّٰهِ الْحُجَّةُ الْبَالِغَةُ فَلَوْ شَآءَ لَهَدٰىكُمْ اَجْمَعِیْنَ",
    "قُلْ هَلُمَّ شُهَدَآءَكُمُ الَّذِیْنَ یَشْهَدُوْنَ اَنَّ اللّٰهَ حَرَّمَ هٰذَا فَاِنْ شَهِدُوْا فَلَا تَشْهَدْ مَعَهُمْ وَلَا تَتَّبِعْ اَهْوَآءَ الَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا وَالَّذِیْنَ لَا یُؤْمِنُوْنَ بِالْاٰخِرَةِ وَهُمْ بِرَبِّهِمْ یَعْدِلُوْنَ",
    "قُلْ تَعَالَوْا اَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَیْكُمْ اَلَّا تُشْرِكُوْا بِهٖ شَیْـًٔا وَّبِالْوَالِدَیْنِ اِحْسَانًا وَلَا تَقْتُلُوْۤا اَوْلَادَكُمْ مِّنْ اِمْلَاقٍ نَحْنُ نَرْزُقُكُمْ وَاِیَّاهُمْ وَلَا تَقْرَبُوا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَلَا تَقْتُلُوا النَّفْسَ الَّتِیْ حَرَّمَ اللّٰهُ اِلَّا بِالْحَقِّ ذٰلِكُمْ وَصّٰىكُمْ بِهٖ لَعَلَّكُمْ تَعْقِلُوْنَ",
    "وَلَا تَقْرَبُوْا مَالَ الْیَتِیْمِ اِلَّا بِالَّتِیْ هِیَ اَحْسَنُ حَتّٰی یَبْلُغَ اَشُدَّهٗ وَاَوْفُوا الْكَیْلَ وَالْمِیْزَانَ بِالْقِسْطِ لَا نُكَلِّفُ نَفْسًا اِلَّا وُسْعَهَا وَاِذَا قُلْتُمْ فَاعْدِلُوْا وَلَوْ كَانَ ذَا قُرْبٰی وَبِعَهْدِ اللّٰهِ اَوْفُوْا ذٰلِكُمْ وَصّٰىكُمْ بِهٖ لَعَلَّكُمْ تَذَكَّرُوْنَ",
    "وَاَنَّ هٰذَا صِرَاطِیْ مُسْتَقِیْمًا فَاتَّبِعُوْهُ وَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِیْلِهٖ ذٰلِكُمْ وَصّٰىكُمْ بِهٖ لَعَلَّكُمْ تَتَّقُوْنَ",
    "ثُمَّ اٰتَیْنَا مُوْسَی الْكِتٰبَ تَمَامًا عَلَی الَّذِیْۤ اَحْسَنَ وَتَفْصِیْلًا لِّكُلِّ شَیْءٍ وَّهُدًی وَّرَحْمَةً لَّعَلَّهُمْ بِلِقَآءِ رَبِّهِمْ یُؤْمِنُوْنَ",
    "وَهٰذَا كِتٰبٌ اَنْزَلْنٰهُ مُبٰرَكٌ فَاتَّبِعُوْهُ وَاتَّقُوْا لَعَلَّكُمْ تُرْحَمُوْنَ",
    "اَنْ تَقُوْلُوْۤا اِنَّمَاۤ اُنْزِلَ الْكِتٰبُ عَلٰی طَآىِٕفَتَیْنِ مِنْ قَبْلِنَا وَاِنْ كُنَّا عَنْ دِرَاسَتِهِمْ لَغٰفِلِیْنَ",
    "اَوْ تَقُوْلُوْا لَوْ اَنَّاۤ اُنْزِلَ عَلَیْنَا الْكِتٰبُ لَكُنَّاۤ اَهْدٰی مِنْهُمْ فَقَدْ جَآءَكُمْ بَیِّنَةٌ مِّنْ رَّبِّكُمْ وَهُدًی وَّرَحْمَةٌ فَمَنْ اَظْلَمُ مِمَّنْ كَذَّبَ بِاٰیٰتِ اللّٰهِ وَصَدَفَ عَنْهَا سَنَجْزِی الَّذِیْنَ یَصْدِفُوْنَ عَنْ اٰیٰتِنَا سُوْٓءَ الْعَذَابِ بِمَا كَانُوْا یَصْدِفُوْنَ",
    "هَلْ یَنْظُرُوْنَ اِلَّاۤ اَنْ تَاْتِیَهُمُ الْمَلٰٓىِٕكَةُ اَوْ یَاْتِیَ رَبُّكَ اَوْ یَاْتِیَ بَعْضُ اٰیٰتِ رَبِّكَ یَوْمَ یَاْتِیْ بَعْضُ اٰیٰتِ رَبِّكَ لَا یَنْفَعُ نَفْسًا اِیْمَانُهَا لَمْ تَكُنْ اٰمَنَتْ مِنْ قَبْلُ اَوْ كَسَبَتْ فِیْۤ اِیْمَانِهَا خَیْرًا قُلِ انْتَظِرُوْۤا اِنَّا مُنْتَظِرُوْنَ",
    "اِنَّ الَّذِیْنَ فَرَّقُوْا دِیْنَهُمْ وَكَانُوْا شِیَعًا لَّسْتَ مِنْهُمْ فِیْ شَیْءٍ اِنَّمَاۤ اَمْرُهُمْ اِلَی اللّٰهِ ثُمَّ یُنَبِّئُهُمْ بِمَا كَانُوْا یَفْعَلُوْنَ",
    "مَنْ جَآءَ بِالْحَسَنَةِ فَلَهٗ عَشْرُ اَمْثَالِهَا وَمَنْ جَآءَ بِالسَّیِّئَةِ فَلَا یُجْزٰۤی اِلَّا مِثْلَهَا وَهُمْ لَا یُظْلَمُوْنَ",
    "قُلْ اِنَّنِیْ هَدٰىنِیْ رَبِّیْۤ اِلٰی صِرَاطٍ مُّسْتَقِیْمٍ دِیْنًا قِیَمًا مِّلَّةَ اِبْرٰهِیْمَ حَنِیْفًا وَمَا كَانَ مِنَ الْمُشْرِكِیْنَ",
    "قُلْ اِنَّ صَلَاتِیْ وَنُسُكِیْ وَمَحْیَایَ وَمَمَاتِیْ لِلّٰهِ رَبِّ الْعٰلَمِیْنَ",
    "لَا شَرِیْكَ لَهٗ وَبِذٰلِكَ اُمِرْتُ وَاَنَا اَوَّلُ الْمُسْلِمِیْنَ",
    "قُلْ اَغَیْرَ اللّٰهِ اَبْغِیْ رَبًّا وَّهُوَ رَبُّ كُلِّ شَیْءٍ وَلَا تَكْسِبُ كُلُّ نَفْسٍ اِلَّا عَلَیْهَا وَلَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰی ثُمَّ اِلٰی رَبِّكُمْ مَّرْجِعُكُمْ فَیُنَبِّئُكُمْ بِمَا كُنْتُمْ فِیْهِ تَخْتَلِفُوْنَ",
    "وَهُوَ الَّذِیْ جَعَلَكُمْ خَلٰٓىِٕفَ الْاَرْضِ وَرَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجٰتٍ لِّیَبْلُوَكُمْ فِیْ مَاۤ اٰتٰىكُمْ اِنَّ رَبَّكَ سَرِیْعُ الْعِقَابِ ۖ وَاِنَّهٗ لَغَفُوْرٌ رَّحِیْمٌ"
  ],
  "bengali": [
    "সকল প্রশংসা আল্লাহর জন্য যিনি সৃষ্টি করেছেন আসমান ও যমীন এবং সৃষ্টি করেছেন অন্ধকার ও আলো। তারপর কাফিররা তাদের রবের সমতুল্য স্থির করে।",
    "তিনিই তোমাদেরকে সৃষ্টি করেছেন কাদা মাটি থেকে তারপর নির্ধারণ করেছেন একটি কাল, আর তাঁর কাছে আছে একটি নির্দিষ্ট কাল, তারপর তোমরা সন্দেহ কর।",
    "আর আসমানসমূহ ও যমীনে তিনিই আল্লাহ, তিনি জানেন তোমাদের গোপন ও প্রকাশ্য এবং জানেন যা তোমরা অর্জন কর।",
    "আর তাদের কাছে তাদের রবের আয়াতসমূহের কোন আয়াত আসলেই তারা তা থেকে মুখ ফিরিয়ে নেয়।",
    "অতঃপর অবশ্যই তারা সত্যকে অস্বীকার করেছে, যখন তা তাদের কাছে এসেছে। সুতরাং অচিরেই তাদের কাছে সে বিষয়ের সংবাদ আসবে যা নিয়ে তারা উপহাস করত।",
    "তারা কি দেখে না, আমি তাদের পূর্বে বহু প্রজন্মকে ধ্বংস করেছি? যাদেরকে যমীনে এমনভাবে প্রতিষ্ঠিত করেছিলাম যেভাবে তোমাদেরকে প্রতিষ্ঠিত করিনি। আর তাদের উপর বৃষ্টি পাঠিয়েছিলাম মুষলধারে এবং সৃষ্টি করেছিলাম নদীসমূহ যা তাদের নীচে প্রবাহিত হত। অতঃপর তাদের পাপের কারণে তাদেরকে ধ্বংস করেছি এবং তাদের পরে অন্য প্রজন্মকে সৃষ্টি করেছি।",
    "আর যদি আমি কাগজে লিখিত কিতাব তোমার উপর নাযিল করতাম অতঃপর তারা তা হাত দিয়ে স্পর্শ করত তবুও যারা কুফরী করেছে তারা বলত, ‘এ তো প্রকাশ্য যাদু ছাড়া কিছু না।’",
    "আর তারা বলে, ‘কেন তার উপর কোন ফেরেশ্তা নাযিল করা হয়নি?’ যদি আমি ফেরেশ্তা নাযিল করতাম তাহলে বিষয়টি ফয়সালা হয়ে যেত, তারপর তাদের সুযোগ দেয়া হত না।",
    "আর যদি রাসূলকে ফেরেশতা বানাতাম তবে তাকে পুরুষ মানুষই বানাতাম। ফলে তারা যে সন্দেহ করে, সে সন্দেহেই তাদেরকে রেখে দিতাম।",
    "আর অবশ্যই তোমার পূর্বে রাসূলগণকে নিয়ে উপহাস করা হয়েছিল। ফলে যারা তাদের সাথে উপহাস করেছিল, তাদেরকে তাদের উপহাস বেষ্টন করে নিয়েছে।",
    "বল, ‘তোমরা যমীনে ভ্রমণ কর তারপর দেখ, অস্বীকারকারীদের পরিণাম কেমন হয়েছে।’",
    "বল, ‘আসমানসমূহ ও যমীনে যা আছে তা কার’? বল, ‘আল্লাহর জন্য’; তিনি তাঁর নিজের উপর রহমত লিখে নিয়েছেন। তিনি অবশ্যই তোমাদেরকে একত্র করবেন কিয়ামতের দিনে, এতে কোন সন্দেহ নেই। যারা নিজদের ক্ষতি করেছে তারা ঈমান আনবে না।",
    "যা কিছু রাতে ও দিনে স্থিত হয় তা তাঁরই। আর তিনি সর্বশ্রোতা, সর্বজ্ঞ।",
    "বল, ‘আমি কি আল্লাহ ছাড়া অন্যকে অভিভাবক হিসেবে গ্রহণ করব, যিনি আসমানসমূহ ও যমীনের স্রষ্টা? তিনি আহার দেন, তাঁকে আহার দেয়া হয় না।’ বল, ‘নিশ্চয় আমি আদিষ্ট হয়েছি যে, যারা ইসলাম গ্রহণ করেছে যেন আমি তাদের প্রথম হই’। আর তুমি কখনো মুশরিকদের অন্তর্ভুক্ত হয়ো না’।",
    "বল, ‘যদি আমি আমার রবের অবাধ্য হই তবে নিশ্চয় আমি ভয় করি মহা দিবসের আযাবকে।",
    "সেদিন যার থেকে আযাব সরিয়ে নেয়া হবে তাকেই তিনি অনুগ্রহ করবেন, আর এটাই প্রকাশ্য সফলতা।",
    "আর যদি আল্লাহ তোমাকে কোন দুর্দশা দ্বারা স্পর্শ করেন, তবে তিনি ছাড়া তা দূরকারী কেউ নেই। আর যদি কোন কল্যাণ দ্বারা স্পর্শ করেন তবে তিনিই তো সব কিছুর উপর ক্ষমতাবান।",
    "আর তিনিই তাঁর বান্দাদের উপর ক্ষমতাবান; আর তিনি প্রজ্ঞাময়, সম্যক অবহিত।",
    "বল, ‘সাক্ষ্য হিসেবে সবচেয়ে বড় বস্তু কী?’ বল, ‘আল্লাহ সাক্ষী আমার ও তোমাদের মধ্যে। আর এ কুরআন আমার কাছে ওহী করে পাঠানো হয়েছে যেন তোমাদেরকে ও যার কাছে এটা পৌঁছবে তাদেরকে এর মাধ্যমে আমি সতর্ক করি। তোমরাই কি সাক্ষ্য দাও যে, আল্লাহর সাথে রয়েছে অন্যান্য উপাস্য? বল, ‘আমি সাক্ষ্য দেই না’। বল, ‘তিনি কেবল এক ইলাহ আর তোমরা যা শরীক কর আমি নিশ্চয়ই তা থেকে মুক্ত’।",
    "যাদেরকে আমি কিতাব দিয়েছি তারা তাকে চিনে যেরূপ চিনে তাদের ছেলে-সন্তানদেরকে। যারা নিজদের ক্ষতি করেছে তারা ঈমান আনবে না।",
    "আর তার চেয়ে বড় যালিম আর কে যে আল্লাহর উপর মিথ্যা রটনা করে অথবা তার আয়াতসমূহকে অস্বীকার করে? নিশ্চয়ই যালিমরা সফলকাম হয় না।",
    "আর যেদিন আমি তাদের সকলকে সমবেত করব তারপর যারা শির্‌ক করেছে তাদেরকে বলব, ‘তোমাদের শরীকরা কোথায়, যাদেরকে তোমরা (শরীক) মনে করতে?’",
    "অতঃপর তাদের পরীক্ষার জবাব শুধু এ হবে যে, তারপর তারা বলবে, ‘আমাদের রব আল্লাহর কসম! আমরা মুশরিক ছিলাম না’।",
    "দেখ, তারা কীভাবে মিথ্যা বলেছে নিজদের উপর, তারা যে মিথ্যা রটনা করত, তা তাদের থেকে হারিয়ে গেল।",
    "আর তাদের কেউ তোমার প্রতি কান পেতে শোনে, কিন্তু আমি তাদের অন্তরের উপর রেখে দিয়েছি আবরণ যেন তারা অনুধাবন না করে, আর তাদের কানে রেখেছি ছিপি। আর যদি তারা প্রতিটি আয়াতও দেখে, তারা তার প্রতি ঈমান আনবে না; এমনকি যখন তারা তোমার কাছে এসে বাদানুবাদে লিপ্ত হয়, যারা কুফরী করেছে তারা বলে, ‘এটা পূর্ববর্তীদের কল্পকাহিনী ছাড়া কিছুই নয়।’",
    "আর তারা তার থেকে নিষেধ করে এবং তার থেকে দূরে থাকে। আর তারা ধ্বংস করে কেবল নিজদেরকে, অথচ তারা অনুভব করে না।",
    "আর যদি তুমি দেখতে, যখন তাদেরকে আগুনের উপর আটকানো হবে, তখন তারা বলবে, ‘হায়! যদি আমাদেরকে ফেরত পাঠানো হত। আর আমরা আমাদের রবের আয়াতসমূহ অস্বীকার না করতাম এবং আমরা মুমিনদের অন্তর্ভুক্ত হতাম!’",
    "বরং তাদের কাছে প্রকাশ হয়ে গিয়েছে পূর্বে যা তারা গোপন করত। আর যদি তাদের ফেরত পাঠানো হয় অবশ্যই যা থেকে তাদেরকে নিষেধ করা হয়েছে তারা তাতে ফিরে যেত এবং নিশ্চয়ই তারা মিথ্যাবাদী।",
    "আর তারা বলেছিল, ‘আমাদের এ দুনিয়ার জীবন ছাড়া কিছু নেই এবং আমরা পুনরুজ্জীবিত হব না।’",
    "আর যদি তুমি দেখতে যখন তাদেরকে দাঁড় করানো হবে তাদের রবের সামনে এবং তিনি বলবেন ‘এটা কি সত্য নয়’? তারা বলবে, ‘হ্যাঁ, আমাদের রবের কসম!’ তিনি বলবেন, ‘সুতরাং তোমরা যে কুফরী করতে তার কারণে আযাব আস্বাদন কর।’",
    "যারা আল্লাহর সাক্ষাৎ অস্বীকার করেছে তারা অবশ্যই ক্ষতিগ্রস্ত হয়েছে, এমনকি যখন হঠাৎ তাদের কাছে কিয়ামত এসে যাবে, তারা বলবে, ‘হায় আফসোস! সেখানে আমরা যে ত্রুটি করেছি তার উপর।’ তারা তাদের পাপসমূহ তাদের পিঠে বহন করবে; সাবধান! তারা যা বহন করবে তা কত নিকৃষ্ট!",
    "আর দুনিয়ার জীবন খেলাধুলা ও তামাশা ছাড়া কিছু না। আর যারা তাকওয়া অবলম্বন করে তাদের জন্য আখিরাতের আবাস উত্তম। অতএব তোমরা কি বুঝবে না?",
    "আমি অবশ্যই জানি যে, তারা যা বলে তা তোমাকে দুঃখ দেয়। কিন্তু তারা তো তোমাকে অস্বীকার করে না, বরং যালিমরা আল্লাহর আয়াতসমূহকে অস্বীকার করে।",
    "আর অবশ্যই তোমার পূর্বে অনেক রাসূলকে অস্বীকার করা হয়েছে, অতঃপর তারা তাদেরকে অস্বীকার করা ও কষ্ট দেয়ার ক্ষেত্রে ধৈর্যধারণ করেছে, যতক্ষণ না আমার সাহায্য তাদের কাছে এসেছে। আর আল্লাহর বাণীসমূহের কোন পরিবর্তনকারী নেই এবং অবশ্যই রাসূলগণের কিছু সংবাদ তোমার কাছে এসেছে।",
    "আর যদি তাদের উপেক্ষা তোমার উপর কঠিন মনে হয়, তাহলে যদি তুমি পার যমীনে কোন সুড়ঙ্গ অথবা আসমানে কোন সিঁড়ি অনুসন্ধান করতে, অতঃপর তাদের কাছে কোন নিদর্শন নিয়ে আসতে (তবে কর)। যদি আল্লাহ চাইতেন তিনি অবশ্যই তাদেরকে হিদায়াতের উপর একত্র করতেন। সুতরাং তুমি কখনো মূর্খদের অন্তর্ভুক্ত হয়ো না।",
    "তারাই সাড়া দেয় যারা শুনে। আর মৃতদেরকে আল্লাহ পুনরায় জীবিত করবেন। তারপর তার দিকেই প্রত্যাবর্তিত হবে।",
    "আর তারা বলে, ‘কেন তার উপর তার রবের পক্ষ থেকে কোন নিদর্শন নাযিল করা হয়নি’? বল, ‘নিশ্চয় আল্লাহ যে কোন নিদর্শন নাযিল করতে সক্ষম। কিন্তু তাদের অধিকাংশ জানে না’।",
    "আর যমীনে বিচরণকারী প্রতিটি প্রাণী এবং দু’ডানা দিয়ে উড়ে এমন প্রতিটি পাখি, তোমাদের মত এক একটি উম্মত। আমি কিতাবে কোন ত্রুটি করিনি। অতঃপর তাদেরকে তাদের রবের কাছে সমবেত করা হবে।",
    "আর যারা আমার আয়াতসমূহকে অস্বীকার করেছে, তারা বোবা ও বধির, অন্ধকারে রয়েছে। আল্লাহ যাকে চান, তাকে পথভ্রষ্ট করেন এবং যাকে চান তাকে সরল পথে অটল রাখেন।",
    "বল, ‘তোমরা কি বিবেচনা কর, যদি তোমাদের কাছে আল্লাহর আযাব এসে যায় অথবা কিয়ামত আগমন করে, তবে কি তোমরা আল্লাহ ছাড়া অন্য কাউকে ডাকবে, যদি তোমরা সত্যবাদী হও?",
    "বরং তাকেই তোমরা ডাকবে। অতঃপর যদি তিনি চান, যে জন্য তাকে ডাকছ, তা তিনি দূর করে দেবেন। আর তোমরা যা শরীক কর, তা তোমরা ভুলে যাবে।",
    "আর আমি তোমাদের পূর্বেকার জাতিসমূহের কাছে বহু রাসূল পাঠিয়েছি, আমি তাদের প্রতি ক্ষুধা, দারিদ্রতা ও রোগ ব্যাধি চাপিয়ে দিয়েছি, যেন তারা নম্রতা প্রকাশ করে আমার সামনে নতি স্বীকার করে।",
    "সুতরাং তারা কেন বিনীত হয়নি, যখন আমার আযাব তাদের কাছে আসল? কিন্তু তাদের হৃদয় নিষ্ঠুর হয়ে গিয়েছে। আর তারা যা করত, শয়তান তাদের জন্য তা শোভিত করেছে।",
    "অতঃপর তাদেরকে যে উপদেশ দেয়া হয়েছিল, তারা যখন তা ভুলে গেল, আমি তাদের উপর সব কিছুর দরজা খুলে দিলাম। অবশেষে যখন তাদেরকে যা প্রদান করা হয়েছিল তার কারণে তারা উৎফুল্ল হল, আমি হঠাৎ তাদেরকে পাকড়াও করলাম। ফলে তখন তারা হতাশ হয়ে গেল।",
    "অতএব যালিম সম্প্রদায়ের মূল কেটে ফেলা হল। আর সকল প্রশংসা রাববুল আলামীন আল্লাহর জন্য।",
    "বল, ‘তোমরা আমাকে জানাও, যদি আল্লাহ তোমাদের শ্রবণ ও দৃষ্টিসমূহ কেড়ে নেন এবং তোমাদের অন্তরসমূহে মোহর এঁটে দেন, কে আছে ইলাহ, আল্লাহ ছাড়া, যে তোমাদের এগুলো নিয়ে আসবে?’ দেখ, কীভাবে আমি বিভিন্নরূপে নিদর্শনসমূহ বর্ণনা করি, তারপর তারা এড়িয়ে চলে।",
    "বল, ‘তোমরা আমাকে জানাও, যদি আল্লাহর আযাব হঠাৎ কিংবা প্রকাশ্যে তোমাদের কাছে এসে যায়, যালিম কওম ছাড়া অন্য কাউকে ধ্বংস করা হবে কি?’",
    "আর আমি রাসূলদেরকে কেবল সুসংবাদদাতা ও সতর্ককারী হিসেবে প্রেরণ করি। অতএব যারা ঈমান এনেছে ও শুধরে নিয়েছে, তাদের উপর কোন ভয় নেই এবং তারা চি‎‎ন্তিত হবে না।",
    "আর যারা আমার আয়াতসমূহকে অস্বীকার করেছে তাদেরকে স্পর্শ করবে আযাব, এ কারণে যে, তারা নাফরমানী করত।",
    "বল, ‘তোমাদেরকে আমি বলি না, আমার কাছে আল্লাহর ভান্ডারসমূহ রয়েছে এবং আমি গায়েব জানি না এবং তোমাদেরকে বলি না, নিশ্চয় আমি ফেরেশতা। আমি কেবল তাই অনুসরণ করি যা আমার কাছে ওহী প্রেরণ করা হয়’। বল, ‘অন্ধ আর চক্ষুষ্মান কি সমান হতে পারে? অতএব তোমরা কি চিন্তা করবে না?’",
    "আর এ দ্বারা তুমি তাদেরকে সতর্ক কর, যারা ভয় করে যে, তাদেরকে তাদের রবের দিকে সমবেত করা হবে, (এ অবস্থায় যে) তিনি ছাড়া তাদের জন্য থাকবে না কোন সাহায্যকারী আর না সুপারিশকারী। হয়ত তারা তাকওয়া অবলম্বন করবে।",
    "আর তুমি তাড়িয়ে দিয়ো না তাদেরকে, যারা নিজ রবকে সকাল সন্ধ্যায় ডাকে, তারা তার সন্তুষ্টি চায়। তাদের কোন হিসাব তোমার উপর নেই এবং তোমার কোন হিসাব তাদের উপর নেই, ফলে তুমি তাদেরকে তাড়িয়ে দিবে এবং তুমি যালিমদের অন্তর্ভুক্ত হবে।",
    "আর এভাবেই আমি এককে অন্যের দ্বারা পরীক্ষা করেছি, যাতে তারা বলে, ‘এরাই কি, আমাদের মধ্য থেকে যাদের উপর আল্লাহ অনুগ্রহ করেছেন? আল্লাহ কি কৃতজ্ঞদের ব্যাপারে পূর্ণ জ্ঞাত নয়?",
    "আর যারা আমার আয়াতসমূহের উপর ঈমান আনে, তারা যখন তোমার কাছে আসে, তখন তুমি বল, ‘তোমাদের উপর সালাম’। তোমাদের রব তাঁর নিজের উপর লিখে নিয়েছেন দয়া, নিশ্চয় যে তোমাদের মধ্য থেকে না জেনে খারাপ কাজ করে তারপর তাওবা করে এবং শুধরে নেয়, তবে তিনি ক্ষমাশীল, পরম দয়ালু।",
    "আর এভাবেই আমি আয়াতসমূহ বিস্তারিত বর্ণনা করি। আর যাতে অপরাধীদের পথ স্পষ্ট হয়ে যায়।",
    "বল, ‘নিশ্চয় আমাকে নিষেধ করা হয়েছে তাদের ইবাদাত করতে, যাদেরকে তোমরা ডাক আল্লাহ ছাড়া। বল, ‘আমি তোমাদের প্রবৃত্তির অনুসরণ করি না, (যদি করি) নিশ্চয় তখন পথভ্রষ্ট হব এবং আমি হিদায়াতপ্রাপ্তদের অন্তর্ভুক্ত হব না।",
    "বল, ‘নিশ্চয় আমি আমার রবের পক্ষ থেকে স্পষ্ট প্রমাণের উপর রয়েছি আর তোমরা তা অস্বীকার করছ। তোমরা যা নিয়ে তাড়াহুড়া করছ তা আমার কাছে নেই। হুকুম কেবল আল্লাহর কাছে। তিনি সত্য বর্ণনা করেন এবং তিনি সর্বোত্তম ফয়সালাকারী’।",
    "বল, ‘তোমরা যা নিয়ে তাড়াহুড়া করছ, তা যদি আমার কাছে থাকত, অবশ্যই আমার ও তোমাদের মাঝে বিষয়টির মীমাংসা হয়ে যেত। আর আল্লাহ যালিমদের ব্যাপারে অধিক জ্ঞাত’।",
    "আর তাঁর কাছে রয়েছে গায়েবের চাবিসমূহ, তিনি ছাড়া এ বিষয়ে কেউ জানে না এবং তিনি অবগত রয়েছেন স্থলে ও সমুদ্রে যা কিছু আছে। আর কোন পাতা ঝরে না, কিন্তু তিনি তা জানেন এবং যমীনের অন্ধকারে কোন দানা পড়ে না, না কোন ভেজা এবং না কোন শুষ্ক কিছু; কিন্তু রয়েছে সুস্পষ্ট কিতাবে।",
    "আর তিনিই রাতে তোমাদেরকে মৃত্যু দেন এবং দিনে তোমরা যা কামাই কর তিনি তা জানেন। তারপর তিনি তোমাদেরকে দিনে পুনরায় জাগিয়ে তুলেন, যাতে নির্দিষ্ট মেয়াদ পূর্ণ করা হয়। তারপর তাঁর দিকেই তোমাদের প্রত্যাবর্তন। তারপর তোমরা যা করতে তিনি তোমাদেরকে সে বিষয়ে অবহিত করবেন।",
    "আর তিনিই নিজ বান্দাদের উপর ক্ষমতাবান এবং তোমাদের উপর প্রেরণ করেন হিফাযতকারীদেরকে। অবশেষে যখন তোমাদের কারো কাছে মৃত্যু আসে, আমার প্রেরিত দূতগণ তার মৃত্যু ঘটায়। আর তারা কোন ত্রুটি করে না।",
    "তারপর তাদেরকে প্রত্যাবর্তিত করা হয় তাদের সত্য মাওলা আল্লাহর কাছে। সাবধান! হুকুম প্রাদানের ক্ষমতা তাঁরই। আর তিনি হচ্ছেন খুব দ্রুত হিসাবকারী।",
    "বল, ‘কে তোমাদেরকে নাজাত দেন স্থল ও সমুদ্রের যাবতীয় অন্ধকার থেকে? তোমরা তাকে ডাক অনুনয় বিনয় করে ও চুপিসারে যে, যদি তিনি আমাদেরকে এ থেকে নাজাত দেন, আমরা অবশ্যই কৃতজ্ঞদের অন্তর্ভুক্ত হব’।",
    "বল, ‘আল্লাহ তা থেকে তোমাদেরকে নাজাত দেন এবং প্রত্যেক বিপদ থেকে। তারপর তোমরা শিরক কর’।",
    "বল, ‘তিনি তো সক্ষম তোমাদের উপর থেকে অথবা তোমাদের পায়ের নীচ থেকে তোমাদের উপর আযাব প্রেরণ করতে, অথবা তোমাদেরকে বিভিন্ন সন্দেহপূর্ণ দলে বিভক্ত করতে এবং তোমাদের একদলকে অন্য দলের ভীতি আস্বাদন করাতে’। দেখ, কীভাবে আমি আয়াতসমূহ নানাভাবে বর্ণনা করি, যাতে তারা ভালভাবে বুঝতে পারে।",
    "আর তোমার কওম তা অস্বীকার করেছে, অথচ তা সত্য। বল, ‘আমি তোমাদের উপর তত্ত্বাবধায়ক নই’।",
    "প্রত্যেক সংবাদের নির্ধারিত সময় রয়েছে এবং অচিরেই তোমরা জানবে।",
    "আর যখন তুমি তাদেরকে দেখ, যারা আমার আয়াতসমূহের ব্যাপারে উপহাসমূলক সমালোচনায় রত আছে, তুমি তাদের থেকে মুখ ফিরিয়ে নাও, যতক্ষণ না তারা অন্য কথাবার্তায় লিপ্ত হয়। আর যদি শয়তান তোমাকে ভুলিয়ে দেয়, তবে স্মরণের পর যালিম সম্প্রদায়ের সাথে বসো না।",
    "আর যারা তাকওয়া অবলম্বন করে, যালিমদের কোন হিসেব তাদের উপর নেই। কিন্তু (তাদের কর্তব্য হচ্ছে) উপদেশ দেয়া, যাতে তারা তাকওয়া অবলম্বন করে।",
    "আর তুমি পরিত্যাগ কর তাদেরকে, যারা নিজদের দীনকে গ্রহণ করেছে খেল-তামাশা রূপে এবং প্রতারিত করেছে যাদেরকে দুনিয়ার জীবন। আর তুমি কুরআন দ্বারা উপদেশ দাও, যাতে কোন ব্যক্তি তার কৃতকর্মের দরুন ধ্বংসের শিকার না হয়, তার জন্য আল্লাহ ছাড়া নেই কোন অভিভাবক এবং নেই কোন সুপারিশকারী। আর যদি সে সব ধরণের মুক্তিপণও দেয়, তার থেকে তা গ্রহণ করা হবে না। এরাই তারা, যারা ধ্বংসের শিকার হয়েছে তাদের কৃতকর্মের দরুন। তাদের জন্য রয়েছে ফুটন্ত পানীয় এবং বেদনাদায়ক আযাব, যেহেতু তারা কুফরী করত।",
    "বল, ‘আমরা কি ডাকব আল্লাহ ছাড়া এমন কিছুকে, যা আমাদেরকে কোন উপকার করে না এবং ক্ষতি করে না? আর আল্লাহ আমাদেরকে পথ দেখানোর পর আমাদেরকে কি ফিরানো হবে আমাদের পশ্চাতে সেই ব্যক্তির ন্যায় যাকে শয়তান যমীনে এমন শক্তভাবে পেয়ে বসেছে যে, সে দিশেহারা? তার রয়েছে সহচরবৃন্দ, তারা তাকে সঠিক পথের দিকে ডাকে, ‘আমাদের কাছে আস।’ বল, ‘আল্লাহর পথই সঠিক পথ। আর আমরা রাব্বুল আলামীনের আনুগত্য করতে আদিষ্ট হয়েছি’ ।",
    "আর (আদিষ্ট হয়েছি যে,) তোমরা সালাত কায়েম কর এবং তাঁর তাকওয়া অবলম্বন কর। আর তিনিই, যার কাছে তোমাদেরকে সমবেত করা হবে।",
    "আর তিনিই, আসমানসমূহ ও যমীন যথাযথভাবে সৃষ্টি করেছেন। আর যেদিন তিনি বলবেন, ‘হও’ তখন হয়ে যাবে। তাঁর কথাই যথার্থ। আর তাঁর জন্যই রয়েছে সেদিনের রাজত্ব, যেদিন শিংগায় ফুঁক দেয়া হবে। তিনি গায়েব ও উপস্থিত বিষয়ে পরিজ্ঞাত এবং তিনি প্রজ্ঞাময়, অধিক অবহিত।",
    "আর (স্মরণ কর) যখন ইবরাহীম তার পিতা আযরকে বলেছিল, ‘তুমি কি মূর্তিগুলোকে ইলাহরূপে গ্রহণ করছ? নিশ্চয় আমি তোমাকে তোমার কওমকে স্পষ্ট গোমরাহীতে দেখছি’।",
    "আর এভাবেই আমি ইবরাহীমকে আসমানসমূহ ও যমীনের রাজত্ব দেখাই এবং যাতে সে দৃঢ় বিশ্বাসীদের অন্তর্ভুক্ত হয়।",
    "অতঃপর যখন রাত তার উপর আচ্ছন্ন হল, সে তারকা দেখল, বলল, ‘এ আমার রব’। অতঃপর যখন তা ডুবে গেল, তখন সে বলল, ‘যারা ডুবে যায় আমি তাদেরকে ভালবাসি না’।",
    "অতঃপর যখন সে চাঁদ উজ্জ্বলরূপে উদীয়মান দেখল, বলল, ‘এ আমার রব’। পরে যখন তা ডুবে গেল, বলল, ‘যদি আমার রব আমাকে হিদায়াত না করেন, নিশ্চয় আমি পথহারা কওমের অন্তর্ভুক্ত হয়ে যাব’।",
    "অতঃপর যখন সে সূর্য উজ্জ্বলরূপে উদীয়মান দেখল, বলল, ‘এ আমার রব, এ সবচেয়ে বড়’। পরে যখন তা ডুবে গেল, তখন সে বলল, ‘হে আমার কওম, তোমরা যা শরীক কর, নিশ্চয় আমি তা থেকে মুক্ত’।",
    "‘নিশ্চয় আমি নিবিষ্ট করেছি আমার চেহারা একনিষ্ঠভাবে তাঁর জন্য, যিনি আসমানসমূহ ও যমীন সৃষ্টি করেছেন। আর আমি মুশরিকদের অন্তর্ভুক্ত নই’।",
    "আর তার কওম তার সাথে বাদানুবাদ করল। সে বলল, তোমরা কি বাদানুবাদ করছ আমার সাথে আল্লাহর ব্যাপারে, অথচ তিনি আমাকে হিদায়াত দিয়েছেন? তোমরা তাঁর সাথে যা শরীক কর, আমি তাকে ভয় করি না, তবে আমার রব যদি কিছু করতে চান। আমার রব ইলম দ্বারা সব কিছু পরিব্যাপ্ত করে আছেন। অতঃপর তোমরা কি উপদেশ গ্রহণ করবে না’?",
    "‘তোমরা যা শরীক করেছ কীভাবে আমি তাকে ভয় করব? অথচ তোমরা ভয় করছ না যে, তোমরা শরীক করেছ আল্লাহর সাথে এমন কিছু, যার পক্ষে তিনি তোমাদের উপর কোন প্রমাণ নাযিল করেননি। অতএব কোন্ দল নিরাপত্তার বেশি হকদার, যদি তোমরা জান’?",
    "যারা ঈমান এনেছে এবং নিজ ঈমানকে যুলমের সাথে সংমিশ্রণ করেনি, তাদের জন্যই নিরাপত্তা এবং তারাই হিদায়াতপ্রাপ্ত।",
    "আর এ হচ্ছে আমার দলীল, আমি তা ইবরাহীমকে তার কওমের উপর দান করেছি। আমি যাকে চাই, তাকে মর্যাদায় উঁচু করি। নিশ্চয় তোমার রব প্রজ্ঞাময়, সর্বজ্ঞ।",
    "আর আমি তাকে দান করেছি ইসহাক ও ইয়াকূবকে। প্রত্যেককে আমি হিদায়াত দিয়েছি এবং নূহকে পূর্বে হিদায়াত দিয়েছি। আর তার সন্তানদের মধ্য থেকে দাঊদ, সুলাইমান, আইয়ুব, ইউসুফ, মূসা ও হারূনকে। আর আমি এভাবেই সৎকর্মশীলদেরকে প্রতিদান দেই।",
    "আর যাকারিয়্যা, ইয়াহইয়া, ঈসা ও ইলয়াসকে। প্রত্যেকেই নেককারদের অন্তর্ভুক্ত।",
    "আর ইসমাঈল, আল ইয়াসা‘, ইউনুস ও লূতকে। প্রত্যেককে আমি সৃষ্টিকুলের উপর শ্রেষ্ঠত্ব দান করেছি।",
    "আর (আমি হিদায়াত দান করেছি) তাদের পিতৃপুরুষ, বংশধর ও ভাইদের মধ্য থেকে, আর তাদেরকে আমি বাছাই করেছি এবং তাদেরকে সরল পথের দিকে পরিচালিত করেছি।",
    "এ হচ্ছে আল্লাহর হিদায়াত, এ দ্বারা তিনি নিজ বান্দাদের মধ্য থেকে যাকে ইচ্ছা হিদায়াত করেন। আর যদি তারা শির্‌ক করত, তবে তারা যা আমল করছিল তা অবশ্যই বরবাদ হয়ে যেত।",
    "এরাই তারা, যাদেরকে আমি দান করেছি কিতাব, হুকুম ও নবুওয়াত। অতএব যদি তারা এর সাথে কুফরী করে, তবে আমি এগুলোর তত্ত্বাবধায়ক এমন কওমকে করেছি, যারা এর ব্যাপারে কাফির নয়।",
    "এরাই তারা, যাদেরকে আল্লাহ হিদায়াত করেছেন। অতএব তাদের হিদায়াত তুমি অনুসরণ কর। বল, ‘আমি তোমাদের কাছে এর উপর কোন বিনিময় চাই না। এটা তো সৃষ্টিকুলের জন্য উপদেশমাত্র।",
    "আর তারা আল্লাহকে যথার্থ সম্মান দেয়নি, যখন তারা বলছে, আল্লাহ কোন মানুষের উপর কিছুই নাযিল করেননি। বল, ‘কে নাযিল করেছে সে কিতাব, যা মূসা নিয়ে এসেছে মানুষের জন্য আলো ও পথনির্দেশস্বরূপ, তোমরা তা বিভিন্ন কাগজে লিখে রাখতে, তোমরা তা প্রকাশ করতে আর অনেক অংশ গোপন রাখতে; আর তোমাদেরকে শিক্ষা দেয়া হয়েছিল যা জানতে না তোমরা ও তোমাদের পিতৃপুরুষ’? বল, ‘আল্লাহ’। তারপর তাদেরকে ছেড়ে দাও, তারা তাদের অযাচিত সমালোচনায় খেলতে থাকুক।",
    "আর এটি একটি কিতাব, আমি তা নাযিল করেছি, বরকতময়, যা তাদের সামনে আছে তার সত্যায়নকারী। আর যাতে তুমি সতর্ক কর উম্মুল কুরা (মক্কা) ও তার আশ-পাশে যারা আছে তাদেরকে। আর যারা আখেরাতের প্রতি ঈমান রাখে তারা এ কিতাবের প্রতি ঈমান আনে এবং তারা তাদের সালাতের উপর যত্নবান থাকে।",
    "আর তার চেয়ে বড় যালিম কে, যে আল্লাহর উপর মিথ্যা রটনা করে, অথবা বলে, ‘আমার উপর ওহী প্রেরণ করা হয়েছে’, অথচ তার প্রতি কোন কিছুই প্রেরণ করা হয়নি? এবং যে বলে ‘আমি অচিরেই নাযিল করব, যেরূপ আল্লাহ নাযিল করেছেন’। আর যদি তুমি দেখতে, যখন যালিমরা মৃত্যু কষ্টে থাকে, এমতাবস্থায় ফেরেশতারা তাদের হাত প্রসারিত করে আছে (তারা বলে), ‘তোমাদের জান বের কর। আজ তোমাদেরকে প্রতিদান দেয়া হবে লাঞ্ছনার আযাব, কারণ তোমরা আল্লাহর উপর অসত্য বলতে এবং তোমরা তার আয়াতসমূহ সম্পর্কে অহঙ্কার করতে।",
    "আর নিশ্চয় তোমরা এসেছ আমার কাছে একা একা, যেরূপ সৃষ্টি করেছি আমি তোমাদেরকে প্রথমবার এবং আমি তোমাদেরকে যা দান করেছি, তা তোমরা ছেড়ে রেখেছ তোমাদের পিঠের পেছনে। আর আমি তোমাদের সাথে তোমাদের সুপারিশকারীদের দেখছি না, যাদের তোমরা মনে করেছ যে, নিশ্চয় তারা তোমাদের মধ্যে (আল্লাহর) অংশীদার। অবশ্যই ছিন্ন হয়ে গেছে তোমাদের পরস্পরের সম্পর্ক। আর তোমরা যা ধারণা করতে, তা তোমাদের থেকে হারিয়ে গিয়েছে।",
    "নিশ্চয় আল্লাহ বীজ ও আঁটি বিদীর্ণকারী। তিনি মৃত থেকে জীবিতকে বের করেন এবং জীবিত থেকে মৃতকে বেরকারী। তিনিই আল্লাহ, সুতরাং (সৎপথ থেকে) কোথায় তোমাদেরকে ফিরিয়ে নেয়া হচ্ছে?",
    "(তিনি) প্রভাত উদ্ভাসক। তিনি বানিয়েছেন রাতকে প্রশান্তি এবং সূর্য ও চন্দ্রকে সময় নিরূপক। এটা সর্বজ্ঞ পরাক্রমশালীর নির্ধারণ।",
    "আর তিনিই সৃষ্টি করেছেন তোমাদের জন্য তারকারাজি, যাতে তোমরা এ দ্বারা পথপ্রাপ্ত হও স্থল ও সমুদ্রের অন্ধকারে। অবশ্যই আমি আয়াতসমূহকে বিস্তারিত বর্ণনা করেছি এমন কওমের জন্য যারা জানে।",
    "আর তিনিই সৃষ্টি করেছেন তোমাদেরকে এক নফস থেকে। অতঃপর রয়েছে আবাসস্থল ও সমাধিস্থল। অবশ্যই আমি আয়াতসমূহ বিস্তারিত বর্ণনা করেছি, এমন কওমের জন্য যারা ভালভাবে বুঝে।",
    "আর তিনিই আসমান থেকে বর্ষণ করেছেন বৃষ্টি। অতঃপর আমি এ দ্বারা উৎপন্ন করেছি সব জাতের উদ্ভিদ। অতঃপর আমি তা থেকে বের করেছি সবুজ ডাল-পালা। আমি তা থেকে বের করি ঘন সন্নিবিষ্ট শস্যদানা। আর খেজুর বৃক্ষের মাথি থেকে (বের করি) ঝুলন্ত থোকা। আর (উৎপন্ন করি) আঙ্গুরের বাগান এবং সাদৃশ্যপূর্ণ ও সাদৃশ্যহীন যয়তুন ও আনার। দেখ তার ফলের দিকে, যখন সে ফলবান হয় এবং তার পাকার প্রতি। নিশ্চয় এতে নিদর্শন রয়েছে এমন কওমের জন্য যারা ঈমান আনে।",
    "আর তারা জিনকে আল্লাহর জন্য শরীক সাব্যস্ত করেছে, অথচ তিনি তাদেরকে সৃষ্টি করেছেন। আর তারা অজ্ঞতাবশত মনগড়াভাবে নির্ধারণ করেছে তার জন্য পুত্র ও কন্যা সন্তান। তিনি পবিত্র মহান এবং তারা যা বিবরণ দেয় তা থেকে ঊর্ধ্বে।",
    "তিনিই আল্লাহ, তোমাদের রব। তিনি ছাড়া কোন (সত্য) ইলাহ নেই। তিনি প্রতিটি জিনিসের স্রষ্টা। সুতরাং তোমরা তাঁর ইবাদাত কর। আর তিনি প্রতিটি জিনিসের উপর তত্ত্বাবধায়ক।",
    "তিনিই আল্লাহ, তোমাদের রব। তিনি ছাড়া কোন (সত্য) ইলাহ নেই। তিনি প্রতিটি জিনিসের স্রষ্টা। সুতরাং তোমরা তাঁর ইবাদাত কর। আর তিনি প্রতিটি জিনিসের উপর তত্ত্বাবধায়ক।",
    "চক্ষুসমূহ তাকে আয়ত্ব করতে পারে না। আর তিনি চক্ষুসমূহকে আয়ত্ব করেন। আর তিনি সূক্ষ্মদর্শী, সম্যক অবহিত।",
    "নিশ্চয় তোমাদের কাছে চাক্ষুষ নিদর্শনাবলী এসেছে তোমাদের রবের পক্ষ থেকে। অতএব যে চক্ষুষ্মান হবে, তবে সে তার নিজের জন্যই হবে। আর যে অন্ধ সাজবে, তবে তা তার উপরই (বর্তাবে)। আর আমি তোমাদের উপর সংরক্ষক নই।",
    "আর এভাবেই আমি নানাভাবে আয়াতসমূহ বিস্তারিত বর্ণনা করি এবং যাতে তারা বলে, তুমি পাঠ করেছ এবং আমি যাতে বর্ণনা করি, এ কুরআন এমন কওমের জন্য যারা জানে।",
    "তুমি অনুসরণ কর তার, তোমার প্রতি যা ওহী প্রেরণ করা হয়েছে তোমার রবের পক্ষ থেকে। তিনি ছাড়া কোন (সত্য) ইলাহ নেই। আর মুশরিকদের থেকে তুমি বিমুখ থাক।",
    "আর যদি আল্লাহ চাইতেন, তারা শির্‌ক করত না এবং আমি তোমাকে তাদের উপর হিফাযতকারী বানাইনি। আর তুমি তাদের উপর তত্ত্বাবধায়ক নও।",
    "আর তোমরা তাদেরকে গালমন্দ করো না, আল্লাহ ছাড়া যাদেরকে তারা ডাকে, ফলে তারা গালমন্দ করবে আল্লাহকে, শত্রুতা পোষণ করে অজ্ঞতাবশত। এভাবেই আমি প্রত্যেক উম্মতের জন্য তাদের কর্ম শোভিত করে দিয়েছি। তারপর তাদের রবের কাছে তাদের প্রত্যাবর্তন। অতঃপর তিনি জানিয়ে দেবেন তাদেরকে, যা তারা করত।",
    "আর তারা আল্লাহর নামে কঠিন কসম করেছে, যদি তাদের কাছে কোন নিদর্শন আসে, তবে তারা অবশ্যই তার প্রতি ঈমান আনবে। বল, ‘সমস্ত নিদর্শন তো কেবল আল্লাহর কাছে। আর কিসে তোমাদের উপলব্ধি ঘটাবে যে, যখন তা এসে যাবে, তারা ঈমান আনবে না?",
    "আর আমি তাদের অন্তর ও দৃষ্টিসমূহ পালটে দেব যেমন তারা কুরআনের প্রতি প্রথমবার ঈমান আনেনি এবং আমি তাদেরকে তাদের অবাধ্যতায় ঘুরপাক খাওয়া অবস্থায় ছেড়ে দেব।",
    "আর যদি আমি তাদের নিকট ফেরেশতা নাযিল করতাম এবং মৃতরা তাদের সাথে কথা বলত। আর সবকিছু সরাসরি তাদের সামনে সমবেত করতাম, তাহলেও তারা ঈমান আনত না, যদি না আল্লাহ চাইতেন; কিন্তু তাদের অধিকাংশই মূর্খ।",
    "আর এভাবেই আমি প্রত্যেক নবীর শত্রু করেছি মানুষ ও জিনের মধ্য থেকে শয়তানদেরকে, তারা প্রতারণার উদ্দেশ্যে একে অপরকে চাকচিক্যপূর্ণ কথার কুমন্ত্রণা দেয় এবং তোমার রব যদি চাইতেন, তবে তারা তা করত না। সুতরাং তুমি তাদেরকে ও তারা যে মিথ্যা রটায়, তা ত্যাগ কর।",
    "আর কুমন্ত্রণা এ কারণে যে, যারা আখিরাতের উপর ঈমান রাখে না তাদের অন্তর যেন এর (চাকচিক্যপূর্ণ কথার) প্রতি আকৃষ্ট হয় এবং যাতে তারা তা পছন্দ করে, আর তারা যা (যে পাপ) অর্জন করছে, তা যেন অর্জন করে।",
    "আমি কি আল্লাহ ছাড়া অন্য কাউকে বিচারক হিসেবে তালাশ করব? অথচ তিনিই তোমাদের নিকট বিস্তারিত কিতাব নাযিল করেছেন। আর যাদেরকে আমি কিতাব দিয়েছিলাম তারা জানত যে, তা তোমার রবের পক্ষ থেকে যথাযথভাবে নাযিলকৃত। সুতরাং তুমি কখনো সন্দেহকারীদের অন্তর্ভুক্ত হয়ো না।",
    "আর তোমার রবের বাণী সত্য ও ন্যায়পরায়ণতার দিক থেকে পরিপূর্ণ হয়েছে। তাঁর বাণীসমূহের কোন পরিবর্তনকারী নেই। আর তিনিই সর্বশ্রোতা ও সর্বজ্ঞানী।",
    "আর যদি তুমি যারা যমীনে আছে তাদের অধিকাংশের আনুগত্য কর, তবে তারা তোমাকে আল্লাহর পথ থেকে বিচ্যুত করবে। তারা শুধু ধারণারই অনুসরণ করে এবং তারা শুধু অনুমানই করে।",
    "নিশ্চয় তোমার রব অধিক অবগত তার সম্পর্কে, যে তাঁর পথ থেকে বিচ্যুত হয় এবং তিনি অধিক অবগত হিদায়াতপ্রাপ্তদের সম্পর্কে।",
    "সুতরাং তোমরা আহার কর তা থেকে, যার উপর আল্লাহর নাম নেয়া হয়েছে, যদি তোমরা তাঁর আয়াতসমূহের ব্যাপারে বিশ্বাসী হও।",
    "আর তোমাদের কী হল যে তোমরা তা থেকে আহার করো না, যার উপর আল্লাহর নাম উচ্চারণ করা হয়েছে! অথচ তিনি তোমাদের জন্য বিস্তারিত বর্ণনা করেছেন, যা তোমাদের উপর হারাম করেছেন। তবে যার প্রতি তোমরা বাধ্য হয়েছ এবং নিশ্চয় অনেকে না জেনে তাদের খেয়াল-খুশি দ্বারা পথভ্রষ্ট করে। নিশ্চয় তোমার রব সীমালঙ্ঘনকারীদের সম্পর্কে অধিক জ্ঞাত।",
    "আর তোমরা প্রকাশ্য ও গোপন পাপ ত্যাগ কর। নিশ্চয় যারা পাপ অর্জন করে, তাদেরকে অচিরেই প্রতিদান দেয়া হবে, তারা যা অর্জন করে তার বিনিময়ে।",
    "আর তোমরা তা থেকে আহার করো না, যার উপর আল্লাহর নাম উচ্চারণ করা হয়নি এবং নিশ্চয় তা সীমালঙ্ঘন এবং শয়তানরা তাদের বন্ধুদেরকে প্ররোচনা দেয়, যাতে তারা তোমাদের সাথে বিবাদ করে। আর যদি তোমরা তাদের আনুগত্য কর, তবে নিশ্চয় তোমরা মুশরিক।",
    "যে ছিল মৃত, অতঃপর আমি তাকে জীবন দিয়েছি এবং তার জন্য নির্ধারণ করেছি আলো, যার মাধ্যমে সে মানুষের মধ্যে চলে, সে কি তার মত যে ঘোর অন্ধকারে রয়েছে, যেখান থেকে সে বের হতে পারে না? এভাবেই কাফিরদের জন্য তাদের কৃতকর্ম সুশোভিত করা হয়।",
    "আর এভাবে আমি প্রতিটি জনপদে তার অপরাধীদের সর্দারদেরকে ছেড়ে দিয়েছি, যাতে তারা সেখানে চক্রান্ত করে। আর তারা শুধু নিজেদের সাথেই চক্রান্ত করে অথচ তারা উপলব্ধি করে না।",
    "আর যখন তাদের নিকট কোন নিদর্শন আসে, তারা বলে, আমরা কখনই ঈমান আনব না, যতক্ষণ না আল্লাহর রাসূলদেরকে যা দেয়া হয়েছে আমাদেরকে তার অনুরূপ দেয়া হয়। আল্লাহ ভালো জানেন, তিনি কোথায় তাঁর রিসালাত অর্পণ করবেন। যারা অপরাধ করেছে, অচিরেই তাদেরকে আক্রান্ত করবে আল্লাহর নিকট লাঞ্ছনা ও কঠোর আযাব, কারণ তারা চক্রান্ত করত।",
    "সুতরাং যাকে আল্লাহ হিদায়াত করতে চান, ইসলামের জন্য তার বুক উন্মুক্ত করে দেন। আর যাকে ভ্রষ্ট করতে চান, তার বুক সঙ্কীর্ণ-সঙ্কুচিত করে দেন, যেন সে আসমানে আরোহণ করছে। এমনিভাবে আল্লাহ অকল্যাণ দেন তাদের উপর, যারা ঈমান আনে না।",
    "আর এ হচ্ছে তোমার রবের সরল পথ। আমি তো বিস্তারিতভাবে আয়াতসমূহ বর্ণনা করেছি এমন কওমের জন্য, যারা উপদেশ গ্রহণ করে।",
    "তাদের জন্য তাদের রবের নিকট রয়েছে শান্তির আবাস এবং তারা যে আমল করত, তার কারণে তিনি তাদের অভিভাবক।",
    "আর যেদিন আল্লাহ তাদের সবাইকে সমবেত করবেন। সেদিন বলবেন, ‘হে জিনের দল, মানুষের অনেককে তোমরা বিভ্রান্ত করেছিলে’ এবং মানুষদের মধ্য থেকে তাদের অভিভাবকরা বলবে, ‘হে আমাদের রব, আমরা একে অপরের দ্বারা লাভবান হয়েছি এবং আমরা সে সময়ে উপনীত হয়েছি, যা আপনি আমাদের জন্য নির্ধারণ করে দিয়েছেন’। তিনি বলবেন, ‘আগুন তোমাদের ঠিকানা, তোমরা সেখানে স্থায়ী হবে। তবে আল্লাহ যা চান (তা ভিন্ন)’। নিশ্চয় তোমার রব প্রজ্ঞাময়, সর্বজ্ঞ।",
    "আর এভাবেই আমি যালিমদের কতককে কতকের বন্ধু বানিয়ে দেই, তারা যা অর্জন করত সে কারণে।",
    "‘হে জিন ও মানুষের দল, তোমাদের মধ্য থেকে কি তোমাদের নিকট রাসূলগণ আসেনি, যারা তোমাদের নিকট আমার আয়াতসমূহ বর্ণনা করত এবং তোমাদের এই দিনের সাক্ষাতের ব্যাপারে তোমাদেরকে সতর্ক করত?’ তারা বলবে, ‘আমরা আমাদের নিজদের বিরুদ্ধে সাক্ষ্য দিলাম।’ আর দুনিয়ার জীবন তাদেরকে প্রতারিত করেছে এবং তারা নিজেদের বিরুদ্ধে সাক্ষ্য দেবে যে, তারা ছিল কাফির।",
    "তা এই কারণে যে, তোমার রব যুলমের কারণে জনপদসমূহকে ধ্বংস করেন না তার অধিবাসীরা গাফিল থাকা অবস্থায় ।",
    "আর তারা যা করে, সে অনুসারে প্রত্যেকের মর্যাদা রয়েছে এবং তোমার রব তারা যা করে সে সম্পর্কে গাফিল নন।",
    "আর তোমার রব অমুখাপেক্ষী, দয়ালু। যদি তিনি চান, তোমাদেরকে সরিয়ে নেবেন এবং তোমাদের পরে যা ইচ্ছে স্থলাভিষিক্ত করবেন, যেমন তিনি তোমাদেরকে অন্য কওমের বংশ থেকে সৃষ্টি করেছেন।",
    "নিশ্চয় তোমাদেরকে যে ওয়াদা দেয়া হচ্ছে, তা অবশ্যই আসবে এবং (এ ব্যাপারে তাঁকে) তোমরা অক্ষম করতে পারবে না।",
    "বল, ‘হে আমার কওম, তোমরা তোমাদের অবস্থানে থেকে কাজ কর, নিশ্চয় আমিও কাজ করছি। অচিরেই তোমরা জানতে পারবে কার জন্য হবে আখিরাতের পরিণতি। নিশ্চয় যালিমরা সফল হয় না।’",
    "আর আল্লাহ যে শস্য ও চতুষ্পদ জন্তু সৃষ্টি করেছেন, সেখান থেকে তারা আল্লাহর জন্য একটি অংশ নির্ধারণ করে। অতঃপর তাদের ধারণা অনুসারে তারা বলে, ‘এটি আল্লাহর জন্য এবং এটি আমাদের শরীকদের জন্য।’ অতঃপর যা তাদের শরীকদের জন্য, তা আল্লাহর নিকট পৌঁছে না, আর যা আল্লাহর জন্য তা তাদের শরীকদের নিকট পৌঁছে যায়। তারা যে ফয়সালা করে, তা কতই না মন্দ !",
    "আর এভাবে অনেক মুশরিকের জন্য তাদের শরীকরা তাদের সন্তানদেরকে হত্যা করা শোভিত করেছে, যাতে তাদেরকে ধ্বংস করতে পারে এবং তাদের নিকট তাদের দীনকে সংশয়পূর্ণ করতে পারে। আর আল্লাহ যদি চাইতেন, তারা তা করত না। সুতরাং তারা যে মিথ্যা বানায়, তা নিয়ে তুমি তাদেরকে থাকতে দাও।",
    "আর তারা তাদের ধারণা অনুসারে বলে, ‘এই চতুষ্পদ জন্তুগুলো ও শস্য নিষিদ্ধ। আমরা যাকে চাই, সে ছাড়া কেউ তা খাবে না’ এবং কিছু চতুষ্পদ জন্তু, যার পিঠে চড়া হারাম করা হয়েছে, আর কিছু চতুষ্পদ জন্তু রয়েছে যার উপর তারা আল্লাহর নাম উচ্চারণ করে না, আল্লাহর উপর মিথ্যা অপবাদস্বরূপ। তারা যে মিথ্যা বানায়, তার কারণে তাদেরকে অচিরেই তিনি প্রতিফল দেবেন।",
    "আর তারা বলে, ‘এই চতুষ্পদ জন্তুগুলোর পেটে যা আছে, তা আমাদের পুরুষদের জন্য নির্দিষ্ট এবং আমাদের স্ত্রীদের জন্য হারাম। আর যদি তা মৃত হয়, তবে তারা সবাই তাতে শরীক’। অচিরেই তিনি তাদেরকে তাদের কথার প্রতিদান দেবেন। নিশ্চয় তিনি প্রজ্ঞাবান, জ্ঞানী।",
    "অবশ্যই তারা ক্ষতিগ্রস্ত হয়েছে যারা তাদের সন্তানদেরকে নির্বুদ্ধিতাবশত হত্যা করেছে না জেনে এবং আল্লাহর উপর মিথ্যা অপবাদস্বরূপ আল্লাহ তাদেরকে যে রিয্ক দিয়েছেন তা হারাম করেছে। অবশ্যই তারা পথভ্রষ্ট হয়েছে এবং তারা হিদায়াতপ্রাপ্ত হয়নি।",
    "আর তিনিই সৃষ্টি করেছেন এমন বাগানসমূহ যার কিছু মাচায় তোলা হয় আর কিছু তোলা হয় না* এবং খেজুর গাছ ও শস্য, যার স্বাদ বিভিন্ন রকম, যায়তুন ও আনার যার কিছু দেখতে একরকম, আর কিছু ভিন্ন রকম। তোমরা তার ফল থেকে আহার কর, যখন তা ফলদান করে এবং ফল কাটার দিনেই তার হক দিয়ে দাও। আর অপচয় করো না। নিশ্চয়ই তিনি অপচয়কারীদেরকে ভালবাসেন না।\n* معروشات এর অর্থ ঐ সমস্ত লতাগুল্ম, যেগুলোকে পরিচর্যার উদ্দেশ্যে মাচায় উঠিয়ে দেয়া হয়। আর غيرمعروشات এর অর্থ হচ্ছে যে গাছ মাচায় উঠানোর প্রয়োজন হয় না; বরং স্বীয় কান্ডের উপর তা বেড়ে উঠে।",
    "আর চতুষ্পদ জন্তু থেকে (কিছুকে সৃষ্টি করেছেন) বোঝা বহনকারী ও ক্ষুদ্রাকৃতির। তোমরা আহার কর তা থেকে, যা আল্লাহ তোমাদেরকে রিয্ক দিয়েছেন এবং শয়তানের পদাঙ্ক অনুসরণ করো না। নিশ্চয় সে তোমাদের জন্য স্পষ্ট শত্রু।",
    "(তিনি সৃষ্টি করেছেন) আট প্রকারের জোড়া। মেষ থেকে দু’টি, ছাগল থেকে দু’টি। বল, ‘নর দু’টিকে তিনি হারাম করেছেন নাকি মাদি দু’টিকে? নাকি তা, যা মাদি দু’টির পেটে আছে? তোমরা জেনে-শুনে আমাকে জানাও, যদি তোমরা সত্যবাদী হয়ে থাক।’",
    "আর উট থেকে দু’টি ও গাভী থেকে দু’টি। বল, ‘নর দু’টিকে তিনি হারাম করেছেন নাকি মাদি দু’টিকে? নাকি তা, যা মাদি দু’টির পেটে আছে? অথবা তোমরা কি হাজির ছিলে, যখন আল্লাহ তোমাদেরকে এর নির্দেশ দিয়েছিলেন?’ সুতরাং তার চেয়ে অধিক যালিম কে, যে না জেনে মানুষকে বিভ্রান্ত করার জন্য আল্লাহর উপর মিথ্যা অপবাদ দেয়? নিশ্চয় আল্লাহ যালিম কওমকে হিদায়াত করেন না।",
    "বল, ‘আমার নিকট যে ওহী পাঠানো হয়, তাতে আমি আহারকারীর উপর কোন হারাম পাই না, যা সে আহার করে। তবে যদি মৃত কিংবা প্রবাহিত রক্ত অথবা শূকরের গোশ্ত হয়- কারণ, নিশ্চয় তা অপবিত্র কিংবা এমন অবৈধ যা আল্লাহ ছাড়া অন্য কারো জন্য যবেহ করা হয়েছে। তবে যে ব্যক্তি নিরুপায় হয়ে অবাধ্য ও সীমালঙ্ঘনকারী না হয়ে তা গ্রহণে বাধ্য হয়েছে, তাহলে নিশ্চয় তোমার রব ক্ষমাশীল, পরম দয়ালু।",
    "আর ইয়াহূদীদের উপর আমি নখবিশিষ্ট সব জন্তু হারাম করেছিলাম এবং গরু ও ছাগলের চর্বিও তাদের উপরে হারাম করেছিলাম- তবে যা এগুলোর পিঠে ও ভুঁড়িতে থাকে, কিংবা যা কোন হাড়ের সাথে লেগে থাকে, তা ছাড়া। এটি তাদেরকে প্রতিফল দিয়েছিলাম তাদের অবাধ্যতার কারণে। আর নিশ্চয় আমি সত্যবাদী।",
    "অতঃপর যদি তারা তোমাকে মিথ্যাবাদী বলে, তবে তুমি বল, তোমাদের রব সর্বব্যাপী দয়ার অধিকারী। আর তার আযাব অপরাধী কওম থেকে ফেরানো হয় না।",
    "অচিরেই মুশরিকরা বলবে, ‘আল্লাহ যদি চাইতেন, আমরা শিরক করতাম না এবং আমাদের পিতৃপুরুষরাও না এবং আমরা কোন কিছু হারাম করতাম না’। এভাবেই তাদের পূর্ববর্তীরা মিথ্যারোপ করেছে, যে পর্যন্ত না তারা আমার আযাব আস্বাদন করেছে। বল, ‘তোমাদের কাছে কি কোন জ্ঞান আছে, যা তোমরা আমাদের জন্য প্রকাশ করবে? তোমরা তো শুধু ধারণার অনুসরণ করছ এবং তোমরা তো কেবল অনুমান করছ’।",
    "বল, ‘চূড়ান্ত প্রমাণ আল্লাহরই। সুতরাং যদি তিনি চান, অবশ্যই তোমাদের সবাইকে হিদায়াত দেবেন।’",
    "বল, ‘তোমাদের সাক্ষীদেরকে নিয়ে আস, যারা সাক্ষ্য দেবে যে, আল্লাহ এটি হারাম করেছেন’। অতএব যদি তারা সাক্ষ্য দেয়, তবে তুমি তাদের সাথে সাক্ষ্য দিয়ো না। আর তাদের প্রবৃত্তির অনুসরণ করো না, যারা আমার আয়াতসমূহকে অস্বীকার করেছে, যারা আখিরাতে বিশ্বাস করে না এবং যারা তাদের রবের সমকক্ষ নির্ধারণ করে।",
    "বল, ‘এসো, তোমাদের উপর তোমাদের রব যা হারাম করেছেন, তা তিলাওয়াত করি যে, তোমরা তার সাথে কোন কিছুকে শরীক করবে না এবং মা-বাবার প্রতি ইহসান করবে আর দারিদ্রের কারণে তোমাদের সন্তানদেরকে হত্যা করবে না। আমিই তোমাদেরকে রিয্ক দেই এবং তাদেরকেও। আর অশ্লীল কাজের নিকটবর্তী হবে না- তা থেকে যা প্রকাশ পায় এবং যা গোপন থাকে। আর বৈধ কারণ ছাড়া তোমরা সেই প্রাণকে হত্যা করো না, আল্লাহ যা হারাম করেছেন। এগুলো আল্লাহ তোমাদেরকে নির্দেশ দিয়েছেন, যাতে তোমরা বুঝতে পার।",
    "আর তোমরা ইয়াতীমের সম্পদের নিকটবর্তী হয়ো না, সুন্দর পন্থা ছাড়া। যতক্ষণ না সে পরিণত বয়সে উপনীত হয়, আর পরিমাপ ও ওযন ইনসাফের সাথে পরিপূর্ণ দেবে। আমি কাউকে তার সাধ্য ছাড়া দায়িত্ব অর্পণ করি না। আর যখন তোমরা কথা বলবে, তখন ইনসাফ কর, যদিও সে আত্মীয় হয় এবং আল্লাহর ওয়াদা পূর্ণ কর। এগুলো তিনি তোমাদেরকে নির্দেশ দিয়েছেন। যাতে তোমরা উপদেশ গ্রহণ কর।",
    "আর এটি তো আমার সোজা পথ। সুতরাং তোমরা তার অনুসরণ কর এবং অন্যান্য পথ অনুসরণ করো না, তাহলে তা তোমাদেরকে তাঁর পথ থেকে বিচ্ছিন্ন করে দেবে। এগুলো তিনি তোমাদেরকে নির্দেশ দিয়েছেন, যাতে তোমরা তাকওয়া অবলম্বন কর।",
    "অতঃপর আমি মূসাকে প্রদান করেছি কিতাব, যে সৎকর্ম করেছে তার জন্য পরিপূর্ণতাস্বরূপ, প্রতিটি বিষয়ের বিস্তারিত ব্যাখ্যা, হিদায়াত ও রহমতস্বরূপ। যাতে তারা তাদের রবের সাক্ষাতের ব্যাপারে ঈমান রাখে।",
    "আর এটি কিতাব- যা আমি নাযিল করেছি- বরকতময়। সুতরাং তোমরা তার অনুসরণ কর এবং তাকওয়া অবলম্বন কর, যাতে তোমরা রহমতপ্রাপ্ত হও।",
    "যেন তোমরা না বল যে, কিতাব তো নাযিল করা হয়েছিল আমাদের পূর্বের দু’টি দলের উপর এবং আমরা তো তাদের অধ্যয়ন সম্পর্কে ছিলাম গাফেল।",
    "কিংবা যেন না বল যে, যদি আমাদের উপর কিতাব অবতীর্ণ করা হত, তবে অবশ্যই আমরা তাদের চেয়ে অধিক হিদায়াতপ্রাপ্ত হতাম। বস্তুত তোমাদের নিকট এসেছে তোমাদের রবের পক্ষ থেকে স্পষ্ট প্রমাণ, হিদায়াত ও রহমত। সুতরাং তার চেয়ে অধিক যালিম কে, যে আল্লাহর আয়াতসমূহকে অস্বীকার করেছে এবং তা থেকে বিমুখ হয়েছে? অচিরেই আমি তাদেরকে মন্দ আযাব দেব, যারা আমার আয়াতসমূহ থেকে বিমুখ হয়, তাদের বিমুখ হওয়ার কারণে।",
    "তারা কি এরই অপেক্ষা করছে যে, তাদের নিকট ফেরেশতাগণ হাযির হবে, কিংবা তোমার রব উপস্থিত হবে অথবা প্রকাশ পাবে তোমার রবের নিদর্শনসমূহের কিছু? যেদিন তোমার রবের নিদর্শনসমূহের কিছু প্রকাশ পাবে, সেদিন কোন ব্যক্তিরই তার ঈমান উপকারে আসবে না, যে পূর্বে ঈমান আনেনি, কিংবা সে তার ঈমানে কোন কল্যাণ অর্জন করেনি। বল, ‘তোমরা অপেক্ষা কর, আমরাও অপেক্ষা করছি’।",
    "নিশ্চয় যারা তাদের দীনকে বিচ্ছিন্ন করেছে এবং দল-উপদলে বিভক্ত হয়েছে, তাদের কোন ব্যাপারে তোমার দায়িত্ব নেই। তাদের বিষয়টি তো আল্লাহর নিকট। অতঃপর তারা যা করত, তিনি তাদেরকে সে বিষয়ে অবগত করবেন।",
    "যে সৎকাজ নিয়ে এসেছে, তার জন্য হবে তার দশ গুণ। আর যে অসৎকাজ নিয়ে এসেছে, তাকে অনুরূপই প্রতিদান দেয়া হবে এবং তাদেরকে যুলম করা হবে না।",
    "বল, ‘নিশ্চয় আমার রব আমাকে সোজা পথের হিদায়াত দিয়েছেন। তা সুপ্রতিষ্ঠিত দীন, ইবরাহীমের আদর্শ, সে ছিল একনিষ্ঠ এবং সে মুশরিকদের অন্তর্ভুক্ত ছিল না’।",
    "বল, ‘নিশ্চয় আমার সালাত, আমার কুরবানী, আমার জীবন ও আমার মৃত্যু আল্লাহর জন্য, যিনি সকল সৃষ্টির রব’।",
    "‘তাঁর কোন শরীক নেই এবং আমাকে এরই নির্দেশ প্রদান করা হয়েছে। আর আমি মুসলমানদের মধ্যে প্রথম’।",
    "বল, ‘আমি কি আল্লাহ ছাড়া অন্য কোন রব অনুসন্ধান করব’ অথচ তিনি সব কিছুর রব’? আর প্রতিটি ব্যক্তি যা অর্জন করে, তা শুধু তারই উপর বর্তায় আর কোন ভারবহনকারী অন্যের ভার বহন করবে না। অতঃপর তোমাদের রবের নিকটই তোমাদের প্রত্যাবর্তনস্থল। সুতরাং তিনি তোমাদেরকে সেই সংবাদ দেবেন, যাতে তোমরা মতবিরোধ করতে।",
    "আর তিনি সে সত্তা, যিনি তোমাদেরকে যমীনের খলীফা বানিয়েছেন এবং তোমাদের কতককে কতকের উপর মর্যাদা দিয়েছেন, যাতে তিনি তোমাদেরকে যা প্রদান করেছেন, তাতে তোমাদেরকে পরীক্ষা করেন। নিশ্চয় তোমার রব দ্রুত শাস্তিদানকারী এবং নিশ্চয় তিনি ক্ষমাশীল, পরম দয়ালু।"
  ]
}