{
  "surahName": "Al-Furqaan",
  "surahNameArabic": "الفرقان",
  "surahNameArabicLong": "سورة الفرقان",
  "surahNameTranslation": "The Criterion",
  "revelationPlace": "Mecca",
  "totalAyah": 77,
  "surahNo": 25,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/25.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/025.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/25.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/025.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/25.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/025.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/25.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/025.mp3"
    }
  },
  "english": [
    "Blessed is the One Who sent down the Standard to His servant, so that he may be a warner to the whole world.",
    "˹Allah is˺ the One to Whom belongs the kingdom of the heavens and the earth, Who has never had ˹any˺ offspring, nor does He have a partner in ˹governing˺ the kingdom. He has created everything, ordaining it precisely.",
    "Yet they have taken besides Him gods who cannot create anything but are themselves created. Nor can they protect or benefit themselves. Nor can they control life, death, or resurrection.",
    "The disbelievers say, “This ˹Quran˺ is nothing but a fabrication which he made up with the help of others.” Their claim is totally unjustified and untrue!",
    "And they say, “˹These revelations are only˺ ancient fables which he has had written down, and they are rehearsed to him morning and evening.”",
    "Say, ˹O Prophet,˺ “This ˹Quran˺ has been revealed by the One Who knows the secrets of the heavens and the earth. Surely He is All-Forgiving, Most Merciful.”",
    "And they say ˹mockingly˺, “What kind of messenger is this who eats food and goes about in market-places ˹for a living˺? If only an angel had been sent down with him to be his co-warner",
    "or a treasure had been cast down to him, or he had had a garden from which he may eat!” And the wrongdoers say ˹to the believers˺, “You are only following a bewitched man.”",
    "See ˹O Prophet˺ how they call you names! So they have gone so ˹far˺ astray that they cannot find the ˹Right˺ Way.",
    "Blessed is the One Who—if He wills—can give you far better than ˹all˺ that: gardens under which rivers flow, and palaces as well.",
    "In fact, they deny the Hour. And for the deniers of the Hour, We have prepared a blazing Fire.",
    "Once it sees them from a distance, they will hear it fuming and growling.",
    "And when they are tossed into a narrow place inside ˹Hell˺, chained together, then and there they will cry out for ˹instant˺ destruction.",
    "˹They will be told,˺ “Do not cry only once for destruction, but cry many times over!”",
    "Say, ˹O Prophet,˺ “Is this better or the Garden of Eternity which the righteous have been promised, as a reward and ˹an ultimate˺ destination?",
    "There they will have whatever they wish for, forever. That is a promise ˹to be sought after˺, binding on your Lord.”",
    "˹Watch for˺ the Day He will gather them along with what they used to worship besides Allah, and ask ˹the objects of worship˺, “Was it you who misled these servants of Mine, or did they stray from the Way ˹on their own˺?”",
    "They will say, “Glory be to You! It was not right for ˹others like˺ us to take any lords besides You, but You allowed enjoyment for them and their forefathers ˹for so long˺ that they forgot ˹Your˺ remembrance and became a doomed people.”",
    "˹The doomed will be told˺, “Your gods have clearly denied your claims. So now you can neither ward off ˹the punishment˺ nor get any help.” And whoever of you does wrong, We will make them taste a horrible punishment.",
    "We never sent any messenger before you ˹O Prophet˺, who did not eat food and go about in market-places. We have made some of you a trial for others. Will you ˹not then˺ be patient? And your Lord is All-Seeing.",
    "Those who do not expect to meet Us say, “If only the angels were sent down to us, or we could see our Lord!” They have certainly been carried away by their arrogance and have entirely exceeded all limits.",
    "˹But˺ on the Day they will see the angels, there will be no good news for the wicked, who will cry, “Keep away! Away ˹from us˺!”",
    "Then We will turn to whatever ˹good˺ deeds they did, reducing them to scattered dust.",
    "˹But˺ on that Day the residents of Paradise will have the best settlement and the finest place to rest.",
    "˹Watch for˺ the Day the heavens will burst with clouds, and the angels will be sent down in successive ranks.",
    "True authority on that Day will belong ˹only˺ to the Most Compassionate. And it will be a hard day for the disbelievers.",
    "And ˹beware of˺ the Day the wrongdoer will bite his nails ˹in regret˺ and say, “Oh! I wish I had followed the Way along with the Messenger!",
    "Woe to me! I wish I had never taken so-and-so as a close friend.",
    "It was he who truly made me stray from the Reminder after it had reached me.” And Satan has always betrayed humanity.",
    "The Messenger has cried, “O my Lord! My people have indeed received this Quran with neglect.”",
    "Similarly, We made enemies for every prophet from among the wicked, but sufficient is your Lord as a Guide and Helper.",
    "The disbelievers say, “If only the Quran had been sent down to him all at once!” ˹We have sent it˺ as such ˹in stages˺ so We may reassure your heart with it. And We have revealed it at a deliberate pace.",
    "Whenever they bring you an argument, We come to you with the right refutation and the best explanation.",
    "Those who will be dragged into Hell on their faces will be in the worst place, and are ˹now˺ farthest from the ˹Right˺ Way.",
    "We certainly gave Moses the Book and appointed his brother Aaron as his helper.",
    "We had ordered ˹them˺, “Go to the people who would deny Our signs.” Then We annihilated the deniers entirely.",
    "And when the people of Noah rejected the messengers, We drowned them, making them an example to humanity. And We have prepared a painful punishment for the wrongdoers.",
    "Also ˹We destroyed˺ ’Ȃd, Thamûd, and the people of the Water-pit, as well as many peoples in between.",
    "For each We set forth ˹various˺ lessons, and We ultimately destroyed each.",
    "They have certainly passed by the city ˹of Sodom˺, which had been showered with a dreadful rain ˹of stones˺. Have they not seen its ruins? But they do not expect to be resurrected.",
    "When they see you ˹O Prophet˺, they only make fun of you, ˹saying,˺ “Is this the one that Allah has sent as a messenger?",
    "He would have almost tricked us away from our gods, had we not been so devoted to them.” ˹But˺ soon they will know, when they face the punishment, who is far astray from the ˹Right˺ Way.",
    "Have you seen ˹O Prophet˺ the one who has taken their own desires as their god? Will you then be a keeper over them?",
    "Or do you think that most of them listen or understand? They are only like cattle—no, more than that, they are astray from the ˹Right˺ Way!",
    "Have you not seen how your Lord extends the shade—He could have simply made it ˹remain˺ still if He so willed—then We make the sun its guide",
    "causing the shade to retreat gradually?",
    "He is the One Who has made the night for you as a cover, and ˹made˺ sleep for resting, and the day for rising.",
    "And He is the One Who sends the winds ushering in His mercy, and We send down pure rain from the sky",
    "giving life to a lifeless land, and providing water for countless animals and humans of Our Own creation.",
    "We certainly disperse it among them so they may be mindful, but most people persist in ungratefulness.",
    "Had We willed, We could have easily sent a warner to every society.",
    "So do not yield to the disbelievers, but strive diligently against them with this ˹Quran˺.",
    "And He is the One Who merges the two bodies of water: one fresh and palatable and the other salty and bitter, placing between them a barrier they cannot cross.",
    "And He is the One Who creates human beings from a ˹humble˺ liquid, then establishes for them bonds of kinship and marriage. For your Lord is Most Capable.",
    "Yet they worship besides Allah what can neither benefit nor harm them. And the disbeliever always collaborates against their Lord.",
    "And We have sent you ˹O Prophet˺ only as a deliverer of good news and a warner.",
    "Say, “I do not ask you for any reward for this ˹message˺, but whoever wishes, let them pursue the Way to their Lord.”",
    "Put your trust in the Ever-Living, Who never dies, and glorify His praises. Sufficient is He as All-Aware of the sins of His servants.",
    "˹He is˺ the One Who created the heavens and the earth and everything in between in six Days, then established Himself on the Throne. ˹He is˺ the Most Compassionate! Ask ˹none other than˺ the All-Knowledgeable about Himself.",
    "When it is said to them, “Prostrate to the Most Compassionate,” they ask ˹in disgust˺, “What is ‘the Most Compassionate’? Will we prostrate to whatever you order us to?” And it only drives them farther away.",
    "Blessed is the One Who has placed constellations in the sky, as well as a ˹radiant˺ lamp and a luminous moon.",
    "And He is the One Who causes the day and the night to alternate, ˹as a sign˺ for whoever desires to be mindful or to be grateful.",
    "The ˹true˺ servants of the Most Compassionate are those who walk on the earth humbly, and when the foolish address them ˹improperly˺, they only respond with peace.",
    "˹They are˺ those who spend ˹a good portion of˺ the night, prostrating themselves and standing before their Lord.",
    "˹They are˺ those who pray, “Our Lord! Keep the punishment of Hell away from us, for its punishment is indeed unrelenting.",
    "It is certainly an evil place to settle and reside.”",
    "˹They are˺ those who spend neither wastefully nor stingily, but moderately in between.",
    "˹They are˺ those who do not invoke any other god besides Allah, nor take a ˹human˺ life—made sacred by Allah—except with ˹legal˺ right, nor commit fornication. And whoever does ˹any of˺ this will face the penalty.",
    "Their punishment will be multiplied on the Day of Judgment, and they will remain in it forever, in disgrace.",
    "As for those who repent, believe, and do good deeds, they are the ones whose evil deeds Allah will change into good deeds. For Allah is All-Forgiving, Most Merciful.",
    "And whoever repents and does good has truly turned to Allah properly.",
    "˹They are˺ those who do not bear false witness, and when they come across falsehood, they pass ˹it˺ by with dignity.",
    "˹They are˺ those who, when reminded of the revelation of their Lord, do not turn a blind eye or a deaf ear to it.",
    "˹They are˺ those who pray, “Our Lord! Bless us with ˹pious˺ spouses and offspring who will be the joy of our hearts, and make us models for the righteous.”",
    "It is they who will be rewarded with ˹elevated˺ mansions ˹in Paradise˺ for their perseverance, and will be received with salutations and ˹greetings of˺ peace",
    "staying there forever. What an excellent place to settle and reside!",
    "Say, ˹O Prophet,˺ “You ˹all˺ would not ˹even˺ matter to my Lord were it not for your faith ˹in Him˺. But now you ˹disbelievers˺ have denied ˹the truth˺, so the torment is bound to come.”"
  ],
  "arabic1": [
    "تَبٰرَكَ الَّذِیْ نَزَّلَ الْفُرْقَانَ عَلٰی عَبْدِهٖ لِیَكُوْنَ لِلْعٰلَمِیْنَ نَذِیْرَا",
    "١لَّذِیْ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَلَمْ یَتَّخِذْ وَلَدًا وَّلَمْ یَكُنْ لَّهٗ شَرِیْكٌ فِی الْمُلْكِ وَخَلَقَ كُلَّ شَیْءٍ فَقَدَّرَهٗ تَقْدِیْرًا",
    "وَاتَّخَذُوْا مِنْ دُوْنِهٖۤ اٰلِهَةً لَّا یَخْلُقُوْنَ شَیْـًٔا وَّهُمْ یُخْلَقُوْنَ وَلَا یَمْلِكُوْنَ لِاَنْفُسِهِمْ ضَرًّا وَّلَا نَفْعًا وَّلَا یَمْلِكُوْنَ مَوْتًا وَّلَا حَیٰوةً وَّلَا نُشُوْرًا",
    "وَقَالَ الَّذِیْنَ كَفَرُوْۤا اِنْ هٰذَاۤ اِلَّاۤ اِفْكُ ١فْتَرٰىهُ وَاَعَانَهٗ عَلَیْهِ قَوْمٌ اٰخَرُوْنَ فَقَدْ جَآءُوْ ظُلْمًا وَّزُوْرًا",
    "وَقَالُوْۤا اَسَاطِیْرُ الْاَوَّلِیْنَ اكْتَتَبَهَا فَهِیَ تُمْلٰی عَلَیْهِ بُكْرَةً وَّاَصِیْلًا",
    "قُلْ اَنْزَلَهُ الَّذِیْ یَعْلَمُ السِّرَّ فِی السَّمٰوٰتِ وَالْاَرْضِ اِنَّهٗ كَانَ غَفُوْرًا رَّحِیْمًا",
    "وَقَالُوْا مَالِ هٰذَا الرَّسُوْلِ یَاْكُلُ الطَّعَامَ وَیَمْشِیْ فِی الْاَسْوَاقِ لَوْلَاۤ اُنْزِلَ اِلَیْهِ مَلَكٌ فَیَكُوْنَ مَعَهٗ نَذِیْرًا",
    "اَوْ یُلْقٰۤی اِلَیْهِ كَنْزٌ اَوْ تَكُوْنُ لَهٗ جَنَّةٌ یَّاْكُلُ مِنْهَا وَقَالَ الظّٰلِمُوْنَ اِنْ تَتَّبِعُوْنَ اِلَّا رَجُلًا مَّسْحُوْرًا",
    "اُنْظُرْ كَیْفَ ضَرَبُوْا لَكَ الْاَمْثَالَ فَضَلُّوْا فَلَا یَسْتَطِیْعُوْنَ سَبِیْلًا",
    "تَبٰرَكَ الَّذِیْۤ اِنْ شَآءَ جَعَلَ لَكَ خَیْرًا مِّنْ ذٰلِكَ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ وَیَجْعَلْ لَّكَ قُصُوْرًا",
    "بَلْ كَذَّبُوْا بِالسَّاعَةِ وَاَعْتَدْنَا لِمَنْ كَذَّبَ بِالسَّاعَةِ سَعِیْرًا",
    "اِذَا رَاَتْهُمْ مِّنْ مَّكَانٍ بَعِیْدٍ سَمِعُوْا لَهَا تَغَیُّظًا وَّزَفِیْرًا",
    "وَاِذَاۤ اُلْقُوْا مِنْهَا مَكَانًا ضَیِّقًا مُّقَرَّنِیْنَ دَعَوْا هُنَالِكَ ثُبُوْرًا",
    "لَا تَدْعُوا الْیَوْمَ ثُبُوْرًا وَّاحِدًا وَّادْعُوْا ثُبُوْرًا كَثِیْرًا",
    "قُلْ اَذٰلِكَ خَیْرٌ اَمْ جَنَّةُ الْخُلْدِ الَّتِیْ وُعِدَ الْمُتَّقُوْنَ كَانَتْ لَهُمْ جَزَآءً وَّمَصِیْرًا",
    "لَهُمْ فِیْهَا مَا یَشَآءُوْنَ خٰلِدِیْنَ كَانَ عَلٰی رَبِّكَ وَعْدًا مَّسْـُٔوْلًا",
    "وَیَوْمَ یَحْشُرُهُمْ وَمَا یَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ فَیَقُوْلُ ءَاَنْتُمْ اَضْلَلْتُمْ عِبَادِیْ هٰۤؤُلَآءِ اَمْ هُمْ ضَلُّوا السَّبِیْلَ",
    "قَالُوْا سُبْحٰنَكَ مَا كَانَ یَنْۢبَغِیْ لَنَاۤ اَنْ نَّتَّخِذَ مِنْ دُوْنِكَ مِنْ اَوْلِیَآءَ وَلٰكِنْ مَّتَّعْتَهُمْ وَاٰبَآءَهُمْ حَتّٰی نَسُوا الذِّكْرَ وَكَانُوْا قَوْمًا بُوْرًا",
    "فَقَدْ كَذَّبُوْكُمْ بِمَا تَقُوْلُوْنَ فَمَا تَسْتَطِیْعُوْنَ صَرْفًا وَّلَا نَصْرًا وَمَنْ یَّظْلِمْ مِّنْكُمْ نُذِقْهُ عَذَابًا كَبِیْرًا",
    "وَمَاۤ اَرْسَلْنَا قَبْلَكَ مِنَ الْمُرْسَلِیْنَ اِلَّاۤ اِنَّهُمْ لَیَاْكُلُوْنَ الطَّعَامَ وَیَمْشُوْنَ فِی الْاَسْوَاقِ وَجَعَلْنَا بَعْضَكُمْ لِبَعْضٍ فِتْنَةً اَتَصْبِرُوْنَ وَكَانَ رَبُّكَ بَصِیْرًا",
    "وَقَالَ الَّذِیْنَ لَا یَرْجُوْنَ لِقَآءَنَا لَوْلَاۤ اُنْزِلَ عَلَیْنَا الْمَلٰٓىِٕكَةُ اَوْ نَرٰی رَبَّنَا لَقَدِ اسْتَكْبَرُوْا فِیْۤ اَنْفُسِهِمْ وَعَتَوْ عُتُوًّا كَبِیْرًا",
    "یَوْمَ یَرَوْنَ الْمَلٰٓىِٕكَةَ لَا بُشْرٰی یَوْمَىِٕذٍ لِّلْمُجْرِمِیْنَ وَیَقُوْلُوْنَ حِجْرًا مَّحْجُوْرًا",
    "وَقَدِمْنَاۤ اِلٰی مَا عَمِلُوْا مِنْ عَمَلٍ فَجَعَلْنٰهُ هَبَآءً مَّنْثُوْرًا",
    "اَصْحٰبُ الْجَنَّةِ یَوْمَىِٕذٍ خَیْرٌ مُّسْتَقَرًّا وَّاَحْسَنُ مَقِیْلًا",
    "وَیَوْمَ تَشَقَّقُ السَّمَآءُ بِالْغَمَامِ وَنُزِّلَ الْمَلٰٓىِٕكَةُ تَنْزِیْلًا",
    "اَلْمُلْكُ یَوْمَىِٕذِ ١لْحَقُّ لِلرَّحْمٰنِ وَكَانَ یَوْمًا عَلَی الْكٰفِرِیْنَ عَسِیْرًا",
    "وَیَوْمَ یَعَضُّ الظَّالِمُ عَلٰی یَدَیْهِ یَقُوْلُ یٰلَیْتَنِی اتَّخَذْتُ مَعَ الرَّسُوْلِ سَبِیْلًا",
    "یٰوَیْلَتٰی لَیْتَنِیْ لَمْ اَتَّخِذْ فُلَانًا خَلِیْلًا",
    "لَقَدْ اَضَلَّنِیْ عَنِ الذِّكْرِ بَعْدَ اِذْ جَآءَنِیْ وَكَانَ الشَّیْطٰنُ لِلْاِنْسَانِ خَذُوْلًا",
    "وَقَالَ الرَّسُوْلُ یٰرَبِّ اِنَّ قَوْمِی اتَّخَذُوْا هٰذَا الْقُرْاٰنَ مَهْجُوْرًا",
    "وَكَذٰلِكَ جَعَلْنَا لِكُلِّ نَبِیٍّ عَدُوًّا مِّنَ الْمُجْرِمِیْنَ وَكَفٰی بِرَبِّكَ هَادِیًا وَّنَصِیْرًا",
    "وَقَالَ الَّذِیْنَ كَفَرُوْا لَوْلَا نُزِّلَ عَلَیْهِ الْقُرْاٰنُ جُمْلَةً وَّاحِدَةً كَذٰلِكَ لِنُثَبِّتَ بِهٖ فُؤَادَكَ وَرَتَّلْنٰهُ تَرْتِیْلًا",
    "وَلَا یَاْتُوْنَكَ بِمَثَلٍ اِلَّا جِئْنٰكَ بِالْحَقِّ وَاَحْسَنَ تَفْسِیْرًا",
    "اَلَّذِیْنَ یُحْشَرُوْنَ عَلٰی وُجُوْهِهِمْ اِلٰی جَهَنَّمَ اُولٰٓىِٕكَ شَرٌّ مَّكَانًا وَّاَضَلُّ سَبِیْلًا",
    "وَلَقَدْ اٰتَیْنَا مُوْسَی الْكِتٰبَ وَجَعَلْنَا مَعَهٗۤ اَخَاهُ هٰرُوْنَ وَزِیْرًا ۖ",
    "فَقُلْنَا اذْهَبَاۤ اِلَی الْقَوْمِ الَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا فَدَمَّرْنٰهُمْ تَدْمِیْرًا",
    "وَقَوْمَ نُوْحٍ لَّمَّا كَذَّبُوا الرُّسُلَ اَغْرَقْنٰهُمْ وَجَعَلْنٰهُمْ لِلنَّاسِ اٰیَةً وَاَعْتَدْنَا لِلظّٰلِمِیْنَ عَذَابًا اَلِیْمًا",
    "وَّعَادًا وَّثَمُوْدَاۡ وَاَصْحٰبَ الرَّسِّ وَقُرُوْنًا بَیْنَ ذٰلِكَ كَثِیْرًا",
    "وَكُلًّا ضَرَبْنَا لَهُ الْاَمْثَالَ وَكُلًّا تَبَّرْنَا تَتْبِیْرًا",
    "وَلَقَدْ اَتَوْا عَلَی الْقَرْیَةِ الَّتِیْۤ اُمْطِرَتْ مَطَرَ السَّوْءِ اَفَلَمْ یَكُوْنُوْا یَرَوْنَهَا بَلْ كَانُوْا لَا یَرْجُوْنَ نُشُوْرًا",
    "وَاِذَا رَاَوْكَ اِنْ یَّتَّخِذُوْنَكَ اِلَّا هُزُوًا اَهٰذَا الَّذِیْ بَعَثَ اللّٰهُ رَسُوْلًا",
    "اِنْ كَادَ لَیُضِلُّنَا عَنْ اٰلِهَتِنَا لَوْلَاۤ اَنْ صَبَرْنَا عَلَیْهَا وَسَوْفَ یَعْلَمُوْنَ حِیْنَ یَرَوْنَ الْعَذَابَ مَنْ اَضَلُّ سَبِیْلًا",
    "اَرَءَیْتَ مَنِ اتَّخَذَ اِلٰهَهٗ هَوٰىهُ اَفَاَنْتَ تَكُوْنُ عَلَیْهِ وَكِیْلًا",
    "اَمْ تَحْسَبُ اَنَّ اَكْثَرَهُمْ یَسْمَعُوْنَ اَوْ یَعْقِلُوْنَ اِنْ هُمْ اِلَّا كَالْاَنْعَامِ بَلْ هُمْ اَضَلُّ سَبِیْلًا",
    "اَلَمْ تَرَ اِلٰی رَبِّكَ كَیْفَ مَدَّ الظِّلَّ وَلَوْ شَآءَ لَجَعَلَهٗ سَاكِنًا ثُمَّ جَعَلْنَا الشَّمْسَ عَلَیْهِ دَلِیْلًا",
    "ثُمَّ قَبَضْنٰهُ اِلَیْنَا قَبْضًا یَّسِیْرًا",
    "وَهُوَ الَّذِیْ جَعَلَ لَكُمُ الَّیْلَ لِبَاسًا وَّالنَّوْمَ سُبَاتًا وَّجَعَلَ النَّهَارَ نُشُوْرًا",
    "وَهُوَ الَّذِیْۤ اَرْسَلَ الرِّیٰحَ بُشْرًاۢ بَیْنَ یَدَیْ رَحْمَتِهٖ وَاَنْزَلْنَا مِنَ السَّمَآءِ مَآءً طَهُوْرًا",
    "لِّنُحْیِ بِهٖ بَلْدَةً مَّیْتًا وَّنُسْقِیَهٗ مِمَّا خَلَقْنَاۤ اَنْعَامًا وَّاَنَاسِیَّ كَثِیْرًا",
    "وَلَقَدْ صَرَّفْنٰهُ بَیْنَهُمْ لِیَذَّكَّرُوْا ۖ فَاَبٰۤی اَكْثَرُ النَّاسِ اِلَّا كُفُوْرًا",
    "وَلَوْ شِئْنَا لَبَعَثْنَا فِیْ كُلِّ قَرْیَةٍ نَّذِیْرًا ۖ",
    "فَلَا تُطِعِ الْكٰفِرِیْنَ وَجَاهِدْهُمْ بِهٖ جِهَادًا كَبِیْرًا",
    "وَهُوَ الَّذِیْ مَرَجَ الْبَحْرَیْنِ هٰذَا عَذْبٌ فُرَاتٌ وَّهٰذَا مِلْحٌ اُجَاجٌ وَجَعَلَ بَیْنَهُمَا بَرْزَخًا وَّحِجْرًا مَّحْجُوْرًا",
    "وَهُوَ الَّذِیْ خَلَقَ مِنَ الْمَآءِ بَشَرًا فَجَعَلَهٗ نَسَبًا وَّصِهْرًا وَكَانَ رَبُّكَ قَدِیْرًا",
    "وَیَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ مَا لَا یَنْفَعُهُمْ وَلَا یَضُرُّهُمْ وَكَانَ الْكَافِرُ عَلٰی رَبِّهٖ ظَهِیْرًا",
    "وَمَاۤ اَرْسَلْنٰكَ اِلَّا مُبَشِّرًا وَّنَذِیْرًا",
    "قُلْ مَاۤ اَسْـَٔلُكُمْ عَلَیْهِ مِنْ اَجْرٍ اِلَّا مَنْ شَآءَ اَنْ یَّتَّخِذَ اِلٰی رَبِّهٖ سَبِیْلًا",
    "وَتَوَكَّلْ عَلَی الْحَیِّ الَّذِیْ لَا یَمُوْتُ وَسَبِّحْ بِحَمْدِهٖ وَكَفٰی بِهٖ بِذُنُوْبِ عِبَادِهٖ خَبِیْرَا",
    "١لَّذِیْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ وَمَا بَیْنَهُمَا فِیْ سِتَّةِ اَیَّامٍ ثُمَّ اسْتَوٰی عَلَی الْعَرْشِ اَلرَّحْمٰنُ فَسْـَٔلْ بِهٖ خَبِیْرًا",
    "وَاِذَا قِیْلَ لَهُمُ اسْجُدُوْا لِلرَّحْمٰنِ قَالُوْا وَمَا الرَّحْمٰنُ اَنَسْجُدُ لِمَا تَاْمُرُنَا وَزَادَهُمْ نُفُوْرًا",
    "تَبٰرَكَ الَّذِیْ جَعَلَ فِی السَّمَآءِ بُرُوْجًا وَّجَعَلَ فِیْهَا سِرٰجًا وَّقَمَرًا مُّنِیْرًا",
    "وَهُوَ الَّذِیْ جَعَلَ الَّیْلَ وَالنَّهَارَ خِلْفَةً لِّمَنْ اَرَادَ اَنْ یَّذَّكَّرَ اَوْ اَرَادَ شُكُوْرًا",
    "وَعِبَادُ الرَّحْمٰنِ الَّذِیْنَ یَمْشُوْنَ عَلَی الْاَرْضِ هَوْنًا وَّاِذَا خَاطَبَهُمُ الْجٰهِلُوْنَ قَالُوْا سَلٰمًا",
    "وَالَّذِیْنَ یَبِیْتُوْنَ لِرَبِّهِمْ سُجَّدًا وَّقِیَامًا",
    "وَالَّذِیْنَ یَقُوْلُوْنَ رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ اِنَّ عَذَابَهَا كَانَ غَرَامًا ۗۖ",
    "اِنَّهَا سَآءَتْ مُسْتَقَرًّا وَّمُقَامًا",
    "وَالَّذِیْنَ اِذَاۤ اَنْفَقُوْا لَمْ یُسْرِفُوْا وَلَمْ یَقْتُرُوْا وَكَانَ بَیْنَ ذٰلِكَ قَوَامًا",
    "وَالَّذِیْنَ لَا یَدْعُوْنَ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ وَلَا یَقْتُلُوْنَ النَّفْسَ الَّتِیْ حَرَّمَ اللّٰهُ اِلَّا بِالْحَقِّ وَلَا یَزْنُوْنَ وَمَنْ یَّفْعَلْ ذٰلِكَ یَلْقَ اَثَامًا",
    "یُّضٰعَفْ لَهُ الْعَذَابُ یَوْمَ الْقِیٰمَةِ وَیَخْلُدْ فِیْهٖ مُهَانًا ۗۖ",
    "اِلَّا مَنْ تَابَ وَاٰمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَاُولٰٓىِٕكَ یُبَدِّلُ اللّٰهُ سَیِّاٰتِهِمْ حَسَنٰتٍ وَكَانَ اللّٰهُ غَفُوْرًا رَّحِیْمًا",
    "وَمَنْ تَابَ وَعَمِلَ صَالِحًا فَاِنَّهٗ یَتُوْبُ اِلَی اللّٰهِ مَتَابًا",
    "وَالَّذِیْنَ لَا یَشْهَدُوْنَ الزُّوْرَ وَاِذَا مَرُّوْا بِاللَّغْوِ مَرُّوْا كِرَامًا",
    "وَالَّذِیْنَ اِذَا ذُكِّرُوْا بِاٰیٰتِ رَبِّهِمْ لَمْ یَخِرُّوْا عَلَیْهَا صُمًّا وَّعُمْیَانًا",
    "وَالَّذِیْنَ یَقُوْلُوْنَ رَبَّنَا هَبْ لَنَا مِنْ اَزْوَاجِنَا وَذُرِّیّٰتِنَا قُرَّةَ اَعْیُنٍ وَّاجْعَلْنَا لِلْمُتَّقِیْنَ اِمَامًا",
    "اُولٰٓىِٕكَ یُجْزَوْنَ الْغُرْفَةَ بِمَا صَبَرُوْا وَیُلَقَّوْنَ فِیْهَا تَحِیَّةً وَّسَلٰمًا",
    "خٰلِدِیْنَ فِیْهَا حَسُنَتْ مُسْتَقَرًّا وَّمُقَامًا",
    "قُلْ مَا یَعْبَؤُا بِكُمْ رَبِّیْ لَوْلَا دُعَآؤُكُمْ فَقَدْ كَذَّبْتُمْ فَسَوْفَ یَكُوْنُ لِزَامًا"
  ],
  "bengali": [
    "তিনি বরকতময় যিনি তাঁর বান্দার উপর ফুরকান নাযিল করেছেন যেন সে জগতবাসীর জন্য সতর্ককারী হতে পারে।",
    "যার অধিকারে রয়েছে আসমান ও যমীনের মালিকানা; আর তিনি কোন সন্তান গ্রহণ করেননি এবং সার্বভৌমত্বে তাঁর কোন শরীক নেই। তিনি সব কিছু সৃষ্টি করেছেন। অতঃপর তা নিপুণভাবে নিরূপণ করেছেন।",
    "আর তারা আল্লাহ ছাড়া অনেক ইলাহ গ্রহণ করেছে, যারা কিছুই সৃষ্টি করতে পারে না, বরং তাদেরকেই সৃষ্টি করা হয়েছে; তারা নিজদের কোন কল্যাণ ও অকল্যাণ করার ক্ষমতা রাখে না এবং মৃত্যু, জীবন ও পুনরুত্থান করতেও সক্ষম হয় না।",
    "কাফিররা বলে ‘এটি তো জঘন্য মিথ্যা যা সে রটনা করেছে আর অন্য এক দল তাকে সাহায্য করেছে।’ এভাবে তারা যুলম ও মিথ্যা নিয়ে এসেছে।",
    "তারা বলে, ‘এটি প্রাচীনকালের উপকথা যা সে লিখিয়ে নিয়েছে; এগুলো সকাল-সন্ধ্যায় তার কাছে পাঠ করা হয়।",
    "বল, ‘যিনি আসমান ও যমীনের রহস্য জানেন তিনি এটি নাযিল করেছেন; নিশ্চয় তিনি অতীব ক্ষমাশীল, পরম দয়ালু।’",
    "আর তারা বলে, ‘এ রাসূলের কী হল, সে আহার করে এবং হাটে-বাজারে চলাফেরা করে; তার কাছে একজন ফেরেশতা পাঠানো হল না কেন, যে তাঁর সাথে সতর্ককারী হত’?",
    "অথবা তাকে ধনভান্ডার ঢেলে দেয়া হয় না কেন অথবা তার জন্য একটি বাগান হয় না কেন যা থেকে সে খেতে পারে?’ যালিমরা বলে, ‘তোমরা শুধু এক যাদুগ্রস্ত লোকের অনুসরণ করছ’।",
    "দেখ, তোমার জন্য তারা কেমন উপমা পেশ করে; ফলে তারা পথভ্রষ্ট হয়েছে, সুতরাং তারা কোন পথ পেতে সক্ষম হয় না।",
    "তিনি বরকতময়, যিনি ইচ্ছা করলে তোমার জন্য করে দিতে পারেন তার চেয়ে উত্তম বস্ত্ত অনেক বাগান, যার পাদদেশে নদীসমূহ প্রবাহিত হয় এবং তিনি তোমাকে প্রাসাদসমূহ দিতে পারেন।",
    "বরং তারা কিয়ামতকে অস্বীকার করেছে আর কিয়ামতকে যে অস্বীকার করে তার জন্য আমি প্রস্তুত রেখেছি জ্বলন্ত আগুন।",
    "দূর হতে আগুন যখন তাদেরকে দেখবে তখন তারা তার ক্রুদ্ধ গর্জন ও প্রচন্ড চিৎকার শুনতে পাবে।",
    "আর যখন তাদেরকে গলায় হাত পেঁচিয়ে জাহান্নামের সংকীর্ণ স্থানে নিক্ষেপ করা হবে, সেখানে তারা নিজদের ধ্বংস আহবান করবে।",
    "‘একবার ধ্বংসকে ডেকো না; বরং অনেকবার ধ্বংসকে ডাকো।’",
    "বল, ‘সেটা উত্তম না স্থায়ী জান্নাত, মুত্তাকীদেরকে যার ওয়াদা দেয়া হয়েছে, তা হবে তাদের পুরস্কার ও প্রতাবর্তনস্থল।",
    "সেখানে তারা যা চাইবে তা-ই তাদের জন্য থাকবে স্থায়ীভাবে; এটি তোমার রবের ওয়াদা,",
    "আর সেদিন তাদেরকে এবং আল্লাহ ছাড়া যা কিছুর উপাসনা তারা করত সবাইকে তিনি একত্র করবেন, তারপর বলবেন, ‘তোমরা কি আমার এই বান্দাদেরকে পথভ্রষ্ট করেছ’ না তারা নিজেরাই পথভ্রষ্ট হয়েছে?’",
    "তারা বলবে, ‘আপনি পবিত্র মহান! আপনি ছাড়া অন্য কাউকে অভিভাবক হিসেবে গ্রহণ করা আমাদের উচিত নয়, বরং আপনি তাদেরকে ও তাদের পিতৃপুরুষদেরকে ভোগসম্ভার দিয়েছেন, অবশেষে আপনার স্মরণকে তারা ভুলে গিয়েছিল এবং ধ্বংসপ্রাপ্ত কওমে পরিণত হয়েছিল।’",
    "অতঃপর তোমরা যা বল তারা তা মিথ্যা বলেছে। অতএব তোমরা আযাব ফেরাতে পারবে না এবং কোন সাহায্যও করতে পারবে না। আর তোমাদের মধ্যে যে যুলম করবে তাকে আমি মহাআযাব আস্বাদন করাব।’",
    "আর তোমার পূর্বে যত নবী আমি পাঠিয়েছি, তারা সবাই আহার করত এবং হাট-বাজারে চলাফেরা করত। আমি তোমাদের একজনকে অপরজনের জন্য পরীক্ষাস্বরূপ করেছি। তোমরা কি ধৈর্যধারণ করবে? আর তোমার রব সর্বদ্রষ্টা।",
    "আর যারা আমার সাক্ষাৎ প্রত্যাশা করে না, তারা বলে, ‘আমাদের নিকট ফেরেশতা নাযিল হয় না কেন? অথবা আমরা আমাদের রবকে দেখতে পাই না কেন’? অবশ্যই তারা তো তাদের অন্তরে অহঙ্কার পোষণ করেছে এবং তারা গুরুতর সীমালংঘন করেছে।",
    "যেদিন তারা ফেরেশতাদের দেখবে, সেদিন অপরাধীদের জন্য কোন সুসংবাদ থাকবে না। আর তারা বলবে, ‘হায় কোন বাধা যদি তা আটকে রাখত’।",
    "আর তারা যে কাজ করেছে আমি সেদিকে অগ্রসর হব। অতঃপর তাকে বিক্ষিপ্ত ধূলিকণায় পরিণত করে দেব।",
    "সেদিন জান্নাতবাসীরা বাসস্থান হিসেবে উত্তম এবং বিশ্রামস্থল হিসেবে উৎকৃষ্ট অবস্থায় থাকবে।",
    "আর সেদিন মেঘমালা দ্বারা আকাশ বিদীর্ণ হবে এবং ফেরেশতাদেরকে দলে দলে অবতরণ করানো হবে।",
    "সেদিন প্রকৃত সার্বভৌমত্ব হবে পরম করুণাময়ের। আর সে দিনটি কাফিরদের জন্য বড়ই কঠিন।",
    "আর সেদিন যালিম নিজের হাত দু’টো কামড়িয়ে বলবে, ‘হায়, আমি যদি রাসূলের সাথে কোন পথ অবলম্বন করতাম’!",
    "'হায় আমার দুর্ভোগ, আমি যদি অমুককে বন্ধুরূপে গ্রহণ না করতাম'।",
    "‘অবশ্যই সে তো আমাকে উপদেশবাণী থেকে বিভ্রান্ত করেছিল, আমার কাছে তা আসার পর। আর শয়তান তো মানুষের জন্য চরম প্রতারক’।",
    "আর রাসূল বলবে, ‘হে আমার রব, নিশ্চয় আমার কওম এ কুরআনকে পরিত্যাজ্য গণ্য করেছে।",
    "আর এভাবেই আমি প্রত্যেক নবীর জন্য অপরাধীদের মধ্য থেকে শত্রু বানিয়েছি। আর পথপ্রদর্শক ও সাহায্যকারী হিসেবে তোমার রবই যথেষ্ট।",
    "আর কাফিররা বলে, ‘তার উপর পুরো কুরআন একসাথে কেন নাযিল করা হল না? এটা এজন্য যে, আমি এর মাধ্যমে তোমার হৃদয়কে সুদৃঢ় করব। আর আমি তা আবৃত্তি করেছি ধীরে ধীরে।",
    "আর তারা তোমার কাছে যে কোন বিষয়ই নিয়ে আসুক না কেন, আমি এর সঠিক সমাধান ও সুন্দর ব্যাখ্যা তোমার কাছে নিয়ে এসেছি।",
    "যাদেরকে মুখের উপর ভর দেয়া অবস্থায় জাহান্নামের দিকে একত্র করা হবে। এরা মর্যাদায় অধিক নিকৃষ্ট এবং পথের দিক থেকে সবচেয়ে বেশী পথভ্রষ্ট।",
    "আর আমি তো মূসাকে কিতাব দিয়েছিলাম এবং তার সাথে তার ভাই হারূনকে সাহায্যকারী বানিয়েছিলাম।",
    "অতঃপর আমি বলেছিলাম, তোমরা দু’জন সেই কওমের নিকট যাও, যারা আমার আয়াতসমূহকে অস্বীকার করেছে। অতঃপর আমি তাদেরকে সম্পূর্ণরূপে বিধ্বস্ত করে দিয়েছিলাম।",
    "আর নূহের কওমকে, যখন তারা রাসূলদেরকে অস্বীকার করল, আমি তাদেরকে ডুবিয়ে দিলাম এবং তাদেরকে মানুষের জন্য নিদর্শন বানিয়ে দিলাম। আর আমি যালিমদের জন্য প্রস্তুত করে রেখেছি যন্ত্রণাদায়ক আযাব।",
    "আর ধ্বংস ‘আদ, সামূদ, ‘রাস’ এর অধিবাসী এবং তাদের মধ্যবর্তী কালের বহু প্রজন্মের উপরও।",
    "আর আমি তাদের প্রত্যেকের জন্য দৃষ্টান্ত উপস্থাপন করেছি এবং তাদের প্রত্যেককেই আমি সম্পূর্ণরূপে ধ্বংস করে দিয়েছি।",
    "আর অবশ্যই তারা সে জনপদ দিয়ে অতিক্রম করেছে, যাতে অকল্যাণের বৃষ্টি বর্ষিত হয়েছিল। তবে কি তারা তা দেখেনি? বরং তারা পুনরুত্থানের প্রত্যাশা করত না।",
    "আর তারা যখন তোমাকে দেখে, তখন তারা তোমাকে ঠাট্টা-বিদ্রূপের পাত্র হিসেবেই গ্রহণ করে, ‘এ-ই কি সেই লোক, যাকে আল্লাহ রাসূল করে পাঠিয়েছেন’?",
    "‘সে তো আমাদেরকে আমাদের দেবতাদের থেকে দূরে সরিয়ে দিত, যদি আমরা তাদের প্রতি অবিচল না থাকতাম’। আর যখন তারা আযাব দেখবে, তখন অবশ্যই জানতে পারবে কে অধিক পথভ্রষ্ট।",
    "তুমি কি তাকে দেখনি, যে তার প্রবৃত্তিকে নিজের ইলাহরূপে গ্রহণ করেছে? তবুও কি তুমি তার যিম্মাদার হবে?",
    "তুমি কি মনে কর যে, তাদের অধিকাংশ লোক শোনে অথবা বুঝে? তারা কেবল পশুদের মতো; বরং তারা আরো অধিক পথভ্রষ্ট।",
    "তুমি কি তোমার রবকে দেখনি, কীভাবে তিনি ছায়াকে দীর্ঘ করেছেন, আর তিনি যদি চাইতেন, তাহলে তাকে অবশ্যই স্থির করে দিতে পারতেন। অতঃপর আমি সূর্যকে তার উপর নির্দেশক বানিয়ে দিয়েছি।",
    "তারপর আমি এটাকে ধীরে ধীরে আমার দিকে গুটিয়ে আনি।",
    "আর তিনিই তোমাদের জন্য রাতকে আবরণ ও নিদ্রাকে আরামপ্রদ করেছেন এবং দিনকে করেছেন জাগ্রত থাকার সময়।",
    "আর তিনিই তাঁর রহমতের প্রাক্কালে সুসংবাদস্বরূপ বায়ু পাঠিয়েছেন এবং আমি আকাশ থেকে পবিত্র পানি বর্ষণ করেছি,",
    "যাতে তা দ্বারা মৃত ভূ-খন্ডকে জীবিত করি এবং আমি যে সকল জীবজন্তু ও মানুষ সৃষ্টি করেছি, তার মধ্য থেকে অনেককে তা পান করাই।",
    "আর আমি তা তাদের মধ্যে বণ্টন করি, যাতে তারা উপদেশ গ্রহণ করতে পারে; তারপর অধিকাংশ লোক শুধু অকৃতজ্ঞতাই প্রকাশ করে।",
    "আর আমি ইচ্ছা করলে প্রতিটি জনপদে একজন সতর্ককারী পাঠাতাম।",
    "সুতরাং তুমি কাফিরদের আনুগত্য করো না এবং তুমি কুরআনের সাহায্যে তাদের বিরুদ্ধে কঠোর সংগ্রাম কর।",
    "আর তিনিই দু’টো সাগরকে একসাথে প্রবাহিত করেছেন। একটি সুপেয় সুস্বাদু, অপরটি লবণাক্ত ক্ষারবিশিষ্ট এবং তিনি এতদোভয়ের মাঝখানে একটি অন্তরায় ও একটি অনতিক্রম্য সীমানা স্থাপন করেছেন।",
    "আর তিনিই পানি থেকে মানুষ সৃষ্টি করেছেন, অতঃপর তিনি তাকে বংশগত ও বৈবাহিক সম্পর্কযুক্ত করেছেন। আর তোমার রব হল প্রভূত ক্ষমতাবান।",
    "আর তারা আল্লাহর পরিবর্তে এমন কিছুর ইবাদাত করে, যা তাদের কোন উপকারও করতে পারে না এবং তাদের কোন ক্ষতিও করতে পারে না। আর কাফির তো তার রবের বিরুদ্ধে সাহায্যকারী।",
    "আর আমি তো তোমাকে শুধুমাত্র সুংসবাদদাতা ও সতর্ককারী রূপেই প্রেরণ করেছি।",
    "বল, ‘আমি এর উপর তোমাদের নিকট কোন প্রতিদান চাই না। তবে যার ইচ্ছা তার রবের দিকে পথ অবলম্বন করুক।",
    "আর তুমি ভরসা কর এমন চিরঞ্জীব সত্তার উপর যিনি মরবেন না। তাঁর প্রশংসায় তাসবীহ পাঠ কর। তাঁর বান্দাদের পাপ সম্পর্কে খবর রাখার ব্যাপারে তিনি যথেষ্ট।",
    "যিনি আসমান, যমীন ও উভয়ের মধ্যবর্তী সবকিছু ছয় দিনে সৃষ্টি করেছেন। তারপর তিনি আরশে উঠেছেন। পরম করুণাময়। সুতরাং তাঁর সম্পর্কে যিনি সম্যক অবহিত, তুমি তাকেই জিজ্ঞাসা কর।",
    "আর যখন তাদেরকে বলা হয়, তোমরা ‘রহমান’ কে সিজদা কর, তখন তারা বলে, রহমান কী আবার? তুমি আমাদেরকে আদেশ করলেই কি আমরা সিজদা করব? আর এটা তাদের পলায়নপরতাই বৃদ্ধি করে।[সাজদাহ]",
    "বরকতময় সে সত্তা যিনি আসমানে সৃষ্টি করেছেন বিশালকায় গ্রহসমূহ। আর তাতে প্রদীপ ও আলো বিকিরণকারী চাঁদ সৃষ্টি করেছেন।",
    "আর তিনি দিবা-রাত্রিকে পরস্পরের অনুগামী করেছেন। যে উপদেশ গ্রহণ করতে চায় অথবা কৃতজ্ঞ হতে চায় তার জন্য।",
    "আর রহমানের বান্দা তারাই যারা পৃথিবীতে নম্রভাবে চলাফেরা করে এবং অজ্ঞ লোকেরা যখন তাদেরকে সম্বোধন করে তখন তারা বলে ‘সালাম’।",
    "আর যারা তাদের রবের জন্য সিজদারত ও দন্ডায়মান হয়ে রাত্রি যাপন করে।",
    "আর যারা বলে, ‘হে আমাদের রব, তুমি আমাদের থেকে জাহান্নামের আযাব ফিরিয়ে নাও। নিশ্চয় এর আযাব হল অবিচ্ছিন্ন’।",
    "‘নিশ্চয় তা অবস্থানস্থল ও আবাসস্থল হিসেবে অত্যন্ত নিকৃষ্ট’।",
    "আর তারা যখন ব্যয় করে তখন অপব্যয় করে না এবং কার্পণ্যও করে না। বরং মাঝামাঝি অবস্থানে থাকে।",
    "আর যারা আল্লাহর সাথে অন্য ইলাহকে ডাকে না এবং যারা আল্লাহ যে নাফসকে হত্যা করা নিষেধ করেছেন যথার্থ কারণ ছাড়া তাকে হত্যা করে না। আর যারা ব্যভিচার করে না। আর যে তা করবে সে আযাবপ্রাপ্ত হবে।",
    "কিয়ামতের দিন তার আযাব বর্ধিত করা হবে এবং সেখানে সে অপমানিত অবস্থায় স্থায়ী হবে।",
    "তবে যে তাওবা করে, ঈমান আনে এবং সৎকর্ম করে। পরিণামে আল্লাহ তাদের পাপগুলোকে পূণ্য দ্বারা পরিবর্তন করে দেবেন। আল্লাহ অতীব ক্ষমাশীল, পরম দয়ালু।",
    "আর যে তাওবা করে এবং সৎকাজ করে তবে নিশ্চয় সে পরিপূর্ণভাবে আল্লাহর দিকে প্রত্যাবর্তন করে।",
    "আর যারা মিথ্যার সাক্ষ্য হয় না এবং যখন তারা অনর্থক কথা-কর্মের পাশ দিয়ে চলে তখন সসম্মানে চলে যায়।",
    "আর যারা তাদের রবের আয়াতসমূহ স্মরণ করিয়ে দিলে অন্ধ ও বধিরদের মত পড়ে থাকে না।",
    "আর যারা বলে, ‘হে আমাদের রব, আপনি আমাদেরকে এমন স্ত্রী ও সন্তানাদি দান করুন যারা আমাদের চক্ষু শীতল করবে। আর আপনি আমাদেরকে মুত্তাকীদের নেতা বানিয়ে দিন’।",
    "তারাই, যাদেরকে [জান্নাতে] সুউচ্চ কক্ষ প্রতিদান হিসাবে দেয়া হবে যেহেতু তারা সবর করেছিল সেজন্য। আর তাদের সেখানে অভ্যর্থনা করা হবে অভিবাদন ও সালাম দ্বারা।",
    "সেখানে তারা স্থায়ী হবে। অবস্থানস্থল ও আবাসস্থল হিসেবে তা কতইনা উৎকৃষ্ট!",
    "বল, ‘যদি তোমরা না-ই ডাক তাহলে আমার রব তোমাদের কোন পরওয়া করেন না। তারপর তোমরা অস্বীকার করেছ। তাই অচিরেই অপরিহার্য হবে আযাব।"
  ]
}