{
  "surahName": "Al-Baqara",
  "surahNameArabic": "البقرة",
  "surahNameArabicLong": "سورة البقرة",
  "surahNameTranslation": "The Cow",
  "revelationPlace": "Madina",
  "totalAyah": 286,
  "surahNo": 2,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/2.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/002.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/2.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/002.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/2.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/002.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/2.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/002.mp3"
    }
  },
  "english": [
    "Alif-Lãm-Mĩm.",
    "This is the Book! There is no doubt about it—a guide for those mindful ˹of Allah˺",
    "who believe in the unseen, establish prayer, and donate from what We have provided for them",
    "and who believe in what has been revealed to you ˹O Prophet˺ and what was revealed before you, and have sure faith in the Hereafter.",
    "It is they who are ˹truly˺ guided by their Lord, and it is they who will be successful.",
    "As for those who persist in disbelief, it is the same whether you warn them or not—they will never believe.",
    "Allah has sealed their hearts and their hearing, and their sight is covered. They will suffer a tremendous punishment.",
    "And there are some who say, “We believe in Allah and the Last Day,” yet they are not ˹true˺ believers.",
    "They seek to deceive Allah and the believers, yet they only deceive themselves, but they fail to perceive it.",
    "There is sickness in their hearts, and Allah ˹only˺ lets their sickness increase. They will suffer a painful punishment for their lies.",
    "When they are told, “Do not spread corruption in the land,” they reply, “We are only peace-makers!”",
    "Indeed, it is they who are the corruptors, but they fail to perceive it.",
    "And when they are told, “Believe as others believe,” they reply, “Will we believe as the fools believe?” Indeed, it is they who are fools, but they do not know.",
    "When they meet the believers they say, “We believe.” But when alone with their evil associates they say, “We are definitely with you; we were only mocking.”",
    "Allah will throw their mockery back at them, leaving them to continue wandering blindly in their defiance.",
    "They are the ones who trade guidance for misguidance. But this trade is profitless, and they are not ˹rightly˺ guided.",
    "Their example is that of someone who kindles a fire, but when it lights up all around them, Allah takes away their light, leaving them in complete darkness—unable to see.",
    "They are ˹wilfully˺ deaf, dumb, and blind, so they will never return ˹to the Right Path˺.",
    "Or ˹those caught in˺ a rainstorm from the sky with darkness, thunder, and lightning. They press their fingers into their ears at the sound of every thunder-clap for fear of death. And Allah encompasses the disbelievers ˹by His might˺.",
    "It is as if the lightning were about to snatch away their sight. Whenever lightning strikes, they walk in its light, but when darkness covers them, they stand still. Had Allah willed, He could have taken away their hearing and sight. Surely Allah is Most Capable of everything.",
    "O humanity! Worship your Lord, Who created you and those before you, so that you may become mindful ˹of Him˺.",
    "˹He is the One˺ Who has made the earth a place of settlement for you and the sky a canopy; and sends down rain from the sky, causing fruits to grow as a provision for you. So do not knowingly set up equals to Allah ˹in worship˺.",
    "And if you are in doubt about what We have revealed to Our servant, then produce a sûrah like it and call your helpers other than Allah, if what you say is true.",
    "But if you are unable to do so—and you will never be able to do so—then fear the Fire fuelled with people and stones, which is prepared for the disbelievers.",
    "Give good news ˹O Prophet˺ to those who believe and do good that they will have Gardens under which rivers flow. Whenever provided with fruit, they will say, “This is what we were given before,” for they will be served fruit that looks similar ˹but tastes different˺. They will have pure spouses, and they will be there forever.",
    "Surely Allah does not shy away from using the parable of a mosquito or what is even smaller. As for the believers, they know that it is the truth from their Lord. And as for the disbelievers, they argue, “What does Allah mean by such a parable?” Through this ˹test˺, He leaves many to stray, and guides many. And He leaves none to stray except the rebellious—",
    "those who violate Allah’s covenant after it has been affirmed, break whatever ˹ties˺ Allah has ordered to be maintained, and spread corruption in the land. It is they who are the ˹true˺ losers.",
    "How can you deny Allah? You were lifeless and He gave you life, then He will cause you to die and again bring you to life, and then to Him you will ˹all˺ be returned.",
    "He is the One Who created everything in the earth for you. Then He turned towards the heaven, forming it into seven heavens. And He has ˹perfect˺ knowledge of all things.",
    "˹Remember˺ when your Lord said to the angels, “I am going to place a successive ˹human˺ authority on earth.” They asked ˹Allah˺, “Will You place in it someone who will spread corruption there and shed blood while we glorify Your praises and proclaim Your holiness?” Allah responded, “I know what you do not know.”",
    "He taught Adam the names of all things, then He presented them to the angels and said, “Tell Me the names of these, if what you say is true?”",
    "They replied, “Glory be to You! We have no knowledge except what You have taught us. You are truly the All-Knowing, All-Wise.”",
    "Allah said, “O Adam! Inform them of their names.” Then when Adam did, Allah said, “Did I not tell you that I know the secrets of the heavens and the earth, and I know what you reveal and what you conceal?”",
    "And ˹remember˺ when We said to the angels, “Prostrate before Adam,” so they all did—but not Iblîs, who refused and acted arrogantly, becoming unfaithful.",
    "We cautioned, “O Adam! Live with your wife in Paradise and eat as freely as you please, but do not approach this tree, or else you will be wrongdoers.”",
    "But Satan deceived them—leading to their fall from the ˹blissful˺ state they were in, and We said, “Descend from the heavens ˹to the earth˺ as enemies to each other. You will find in the earth a residence and provision for your appointed stay.”",
    "Then Adam was inspired with words ˹of prayer˺ by his Lord, so He accepted his repentance. Surely He is the Accepter of Repentance, Most Merciful.",
    "We said, “Descend all of you! Then when guidance comes to you from Me, whoever follows it, there will be no fear for them, nor will they grieve.",
    "But those who disbelieve and deny Our signs will be the residents of the Fire. They will be there forever.”",
    "O children of Israel! Remember My favours upon you. Fulfil your covenant and I will fulfil Mine, and stand in awe of Me ˹alone˺.",
    "Believe in My revelations which confirm your Scriptures. Do not be the first to deny them or trade them for a fleeting gain. And be mindful of Me.",
    "Do not mix truth with falsehood or hide the truth knowingly.",
    "Establish prayer, pay alms-tax, and bow down with those who bow down.",
    "Do you preach righteousness and fail to practice it yourselves, although you read the Scripture? Do you not understand?",
    "And seek help through patience and prayer. Indeed, it is a burden except for the humble—",
    "those who are certain that they will meet their Lord and to Him they will return.",
    "O Children of Israel! Remember ˹all˺ the favours I granted you and how I honoured you above the others.",
    "Guard yourselves against the Day on which no soul will be of help to another. No intercession will be accepted, no ransom taken, and no help will be given.",
    "˹Remember˺ how We delivered you from the people of Pharaoh, who afflicted you with dreadful torment, slaughtering your sons and keeping your women. That was a severe test from your Lord.",
    "And ˹remember˺ when We parted the sea, rescued you, and drowned Pharaoh’s people before your very eyes.",
    "And ˹remember˺ when We appointed forty nights for Moses, then you worshipped the calf in his absence, acting wrongfully.",
    "Even then We ˹still˺ forgave you so perhaps you would be grateful.",
    "And ˹remember˺ when We gave Moses the Scripture—the standard ˹to distinguish between right and wrong˺ that perhaps you would be ˹rightly˺ guided.",
    "And ˹remember˺ when Moses said to his people, “O my people! Surely you have wronged yourselves by worshipping the calf, so turn in repentance to your Creator and execute ˹the calf-worshippers among˺ yourselves. That is best for you in the sight of your Creator.” Then He accepted your repentance. Surely He is the Accepter of Repentance, Most Merciful.",
    "And ˹remember˺ when you said, “O Moses! We will never believe you until we see Allah with our own eyes,” so a thunderbolt struck you while you were looking on.",
    "Then We brought you back to life after your death, so that perhaps you would be grateful.",
    "And ˹remember when˺ We shaded you with clouds and sent down to you manna and quails, ˹saying˺, “Eat from the good things We have provided for you.” The evildoers ˹certainly˺ did not wrong Us, but wronged themselves.",
    "And ˹remember˺ when We said, “Enter this city and eat freely from wherever you please; enter the gate with humility, saying, ‘Absolve us.’ We will forgive your sins and multiply the reward for the good-doers.”",
    "But the wrongdoers changed the words they were commanded to say. So We sent down a punishment from the heavens upon them for their rebelliousness.",
    "And ˹remember˺ when Moses prayed for water for his people, We said, “Strike the rock with your staff.” Then twelve springs gushed out, ˹and˺ each tribe knew its drinking place. ˹We then said,˺ “Eat and drink of Allah’s provisions, and do not go about spreading corruption in the land.”",
    "And ˹remember˺ when you said, “O Moses! We cannot endure the same meal ˹every day˺. So ˹just˺ call upon your Lord on our behalf, He will bring forth for us some of what the earth produces of herbs, cucumbers, garlic, lentils, and onions.” Moses scolded ˹them˺, “Do you exchange what is better for what is worse? ˹You can˺ go down to any village and you will find what you have asked for.” They were stricken with disgrace and misery, and they invited the displeasure of Allah for rejecting Allah’s signs and unjustly killing the prophets. This is ˹a fair reward˺ for their disobedience and violations.",
    "Indeed, the believers, Jews, Christians, and Sabians—whoever ˹truly˺ believes in Allah and the Last Day and does good will have their reward with their Lord. And there will be no fear for them, nor will they grieve.",
    "And ˹remember˺ when We took a covenant from you and raised the mountain above you ˹saying˺, “Hold firmly to that ˹Scripture˺ which We have given you and observe its teachings so perhaps you will become mindful ˹of Allah˺.”",
    "Yet you turned away afterwards. Had it not been for Allah’s grace and mercy upon you, you would have certainly been of the losers.",
    "You are already aware of those of you who broke the Sabbath. We said to them, “Be disgraced apes!”",
    "So We made their fate an example to present and future generations, and a lesson to the God-fearing.",
    "And ˹remember˺ when Moses said to his people, “Allah commands you to sacrifice a cow.” They replied, “Are you mocking us?” Moses responded, “I seek refuge in Allah from acting foolishly!”",
    "They said, “Call upon your Lord to clarify for us what type ˹of cow˺ it should be!” He replied, “Allah says, ‘The cow should neither be old nor young but in between. So do as you are commanded!’”",
    "They said, “Call upon your Lord to specify for us its colour.” He replied, “Allah says, ‘It should be a bright yellow cow—pleasant to see.’”",
    "Again they said, “Call upon your Lord so that He may make clear to us which cow, for all cows look the same to us. Then, Allah willing, we will be guided ˹to the right one˺.”",
    "He replied, “Allah says, ‘It should have been used neither to till the soil nor water the fields; wholesome and without blemish.’” They said, “Now you have come with the truth.” Yet they still slaughtered it hesitantly!",
    "˹This is˺ when a man was killed and you disputed who the killer was, but Allah revealed what you concealed.",
    "So We instructed, “Strike the dead body with a piece of the cow.” This is how ˹easily˺ Allah brings the dead to life, showing you His signs so that you may understand.",
    "Even then your hearts became hardened like a rock or even harder, for some rocks gush rivers; others split, spilling water; while others are humbled in awe of Allah. And Allah is never unaware of what you do.",
    "Do you ˹believers still˺ expect them to be true to you, though a group of them would hear the word of Allah then knowingly corrupt it after understanding it?",
    "When they meet the believers they say, “We believe.” But in private they say ˹to each other˺, “Will you disclose to the believers the knowledge Allah has revealed to you, so that they may use it against you before your Lord? Do you not understand?”",
    "Do they not know that Allah is aware of what they conceal and what they reveal?",
    "And among them are the illiterate who know nothing about the Scripture except lies, and ˹so˺ they ˹wishfully˺ speculate.",
    "So woe to those who distort the Scripture with their own hands then say, “This is from Allah”—seeking a fleeting gain! So woe to them for what their hands have written, and woe to them for what they have earned.",
    "˹Some of˺ the Jews claim, “The Fire will not touch us except for a number of days.” Say, ˹O Prophet,˺ “Have you taken a pledge from Allah—for Allah never breaks His word—or are you ˹just˺ saying about Allah what you do not know?”",
    "But no! Those who commit evil and are engrossed in sin will be the residents of the Fire. They will be there forever.",
    "And those who believe and do good will be the residents of Paradise. They will be there forever.",
    "And ˹remember˺ when We took a covenant from the children of Israel ˹stating˺, “Worship none but Allah; be kind to parents, relatives, orphans and the needy; speak kindly to people; establish prayer; and pay alms-tax.” But you ˹Israelites˺ turned away—except for a few of you—and were indifferent.",
    "And ˹remember˺ when We took your covenant that you would neither shed each other’s blood nor expel each other from their homes, you gave your pledge and bore witness.",
    "But here you are, killing each other and expelling some of your people from their homes, aiding one another in sin and aggression; and when those ˹expelled˺ come to you as captives, you still ransom them—though expelling them was unlawful for you. Do you believe in some of the Scripture and reject the rest? Is there any reward for those who do so among you other than disgrace in this worldly life and being subjected to the harshest punishment on the Day of Judgment? For Allah is never unaware of what you do.",
    "These are the ones who trade the Hereafter for the life of this world. So their punishment will not be reduced, nor will they be helped.",
    "Indeed, We gave Moses the Book and sent after him successive messengers. And We gave Jesus, son of Mary, clear proofs and supported him with the holy spirit. Why is it that every time a messenger comes to you ˹Israelites˺ with something you do not like, you become arrogant, rejecting some and killing others?",
    "They say, “Our hearts are unreceptive!” In fact, Allah has condemned them for their disbelief. They have but little faith.",
    "Although they used to pray for victory ˹by means of the Prophet˺ over the polytheists, when there came to them a Book from Allah which they recognized, confirming the Scripture they had ˹in their hands˺, they rejected it. So may Allah’s condemnation be upon the disbelievers.",
    "Miserable is the price they have sold their souls for—denying Allah’s revelation and resenting Allah for granting His grace to whoever He wills of His servants! They have earned wrath upon wrath. And such disbelievers will suffer a humiliating punishment.",
    "When it is said to them: “Believe in what Allah has revealed,” they reply, “We only believe in what was sent down to us,” and they deny what came afterwards, though it is the truth confirming their own Scriptures! Ask ˹them, O  Prophet˺, “Why then did you kill Allah’s prophets before, if you are ˹truly˺ believers?”",
    "Indeed, Moses came to you with clear proofs, then you worshipped the calf in his absence, acting wrongfully.",
    "And when We took your covenant and raised the mountain above you ˹saying˺, “Hold firmly to that ˹Scripture˺ which We have given you and obey,” they answered, “We hear and disobey.” The love of the calf was rooted in their hearts because of their disbelief. Say, ˹O Prophet,˺ “How evil is what your ˹so-called˺ belief prompts you to do, if you ˹actually˺ believe ˹in the Torah˺!”",
    "Say, ˹O Prophet,˺ “If the ˹eternal˺ Home of the Hereafter with Allah is exclusively for you ˹Israelites˺ out of all humanity, then wish for death if what you say is true!”",
    "But they will never wish for that because of what their hands have done. And Allah has ˹perfect˺ knowledge of the wrongdoers.",
    "You will surely find them clinging to life more eagerly than any other people, even more than polytheists. Each one of them wishes to live a thousand years. But even if they were to live that long, it would not save them from the punishment. And Allah is All-Seeing of what they do.",
    "Say, ˹O Prophet,˺ “Whoever is an enemy of Gabriel should know that he revealed this ˹Quran˺ to your heart by Allah’s Will, confirming what came before it—a guide and good news for the believers.”",
    "Whoever is an enemy of Allah, His angels, His messengers, Gabriel, and Michael, then ˹let them know that˺ Allah is certainly the enemy of the disbelievers.",
    "Indeed, We have sent down to you ˹O Prophet˺ clear revelations. ˹But˺ none will deny them except the rebellious.",
    "Why is it that every time they make a covenant, a group of them casts it aside? In fact, most of them do not believe.",
    "Now, when a messenger from Allah has come to them—confirming their own Scriptures—some of the People of the Book cast the Book of Allah behind their backs as if they did not know.",
    "They ˹instead˺ followed the magic promoted by the devils during the reign of Solomon. Never did Solomon disbelieve, rather the devils disbelieved. They taught magic to the people, along with what had been revealed to the two angels, Hârût and Mârût, in Babylon. The two angels never taught anyone without saying, “We are only a test ˹for you˺, so do not abandon ˹your˺ faith.” Yet people learned ˹magic˺ that caused a rift ˹even˺ between husband and wife; although their magic could not harm anyone except by Allah’s Will. They learned what harmed them and did not benefit them—although they already knew that whoever buys into magic would have no share in the Hereafter. Miserable indeed was the price for which they sold their souls, if only they knew!",
    "If only they were faithful and mindful ˹of Allah˺, there would have been a better reward from Allah, if only they knew!",
    "O believers! Do not say, “Râ’ina.” [Herd us!] But say, “Unẓurna,” [Tend to us!] and listen ˹attentively˺. And the disbelievers will suffer a painful punishment.",
    "The disbelievers from the People of the Book and the polytheists would not want you to receive any blessing from your Lord, but Allah selects whoever He wills for His mercy. And Allah is the Lord of infinite bounty.",
    "If We ever abrogate a verse or cause it to be forgotten, We replace it with a better or similar one. Do you not know that Allah is Most Capable of everything?",
    "Do you not know that the kingdom of the heavens and the earth belongs ˹only˺ to Allah, and you have no guardian or helper besides Allah?",
    "Or do you ˹believers˺ intend to ask of your Messenger as Moses was asked before? But whoever trades belief for disbelief has truly strayed from the Right Way.",
    "Many among the People of the Book wish they could turn you ˹believers˺ back to disbelief because of their envy, after the truth has been made clear to them. Pardon and bear with them until Allah delivers His decision. Surely Allah is Most Capable of everything.",
    "Establish prayer, and pay alms-tax. Whatever good you send forth for yourselves, you will ˹certainly˺ find ˹its reward˺ with Allah. Surely Allah is All-Seeing of what you do.",
    "The Jews and Christians each claim that none will enter Paradise except those of their own faith. These are their desires. Reply, ˹O Prophet,˺ “Show ˹me˺ your proof if what you say is true.”",
    "But no! Whoever submits themselves to Allah and does good will have their reward with their Lord. And there will be no fear for them, nor will they grieve.",
    "The Jews say, “The Christians have nothing to stand on” and the Christians say, “The Jews have nothing to stand on,” although both recite the Scriptures. And those ˹pagans˺ who have no knowledge say the same ˹about people of faith˺. Surely Allah will judge between them on the Day of Judgment regarding their dispute.",
    "Who does more wrong than those who prevent Allah’s Name from being mentioned in His places of worship and strive to destroy them? Such people have no right to enter these places except with fear. For them is disgrace in this world, and they will suffer a tremendous punishment in the Hereafter.",
    "To Allah belong the east and the west, so wherever you turn you are facing ˹towards˺ Allah. Surely Allah is All-Encompassing, All-Knowing.",
    "They say, “Allah has offspring.” Glory be to Him! In fact, to Him belongs whatever is in the heavens and the earth—all are subject to His Will.",
    "˹He is˺ the Originator of the heavens and the earth! When He decrees a matter, He simply tells it, “Be!” And it is!",
    "Those who have no knowledge say, “If only Allah would speak to us or a sign would come to us!” The same was said by those who came before. Their hearts are all alike. Indeed, We have made the signs clear for people of sure faith.",
    "We have surely sent you with the truth ˹O Prophet˺ as a deliverer of good news and a warner. And you will not be accountable for the residents of the Hellfire.",
    "Never will the Jews or Christians be pleased with you, until you follow their faith. Say, “Allah’s guidance is the only ˹true˺ guidance.” And if you were to follow their desires after ˹all˺ the knowledge that has come to you, there would be none to protect or help you against Allah.",
    "Those We have given the Book follow it as it should be followed. It is they who ˹truly˺ believe in it. As for those who reject it, it is they who are the losers.",
    "O Children of Israel! Remember My favours upon you and how I honoured you above the others.",
    "And guard yourselves against the Day when no soul will be of any help to another. No ransom will be taken, no intercession accepted, and no help will be given.",
    "˹Remember˺ when Abraham was tested by his Lord with ˹certain˺ commandments, which he fulfilled. Allah said, “I will certainly make you into a role model for the people.” Abraham asked, “What about my offspring?” Allah replied, “My covenant is not extended to the wrongdoers.”",
    "And ˹remember˺ when We made the Sacred House a centre and a sanctuary for the people ˹saying˺, “˹You may˺ take the standing-place of Abraham as a site of prayer.” And We entrusted Abraham and Ishmael to purify My House for those who circle it, who meditate in it, and who bow and prostrate themselves ˹in prayer˺.",
    "And ˹remember˺ when Abraham said, “My Lord, make this city ˹of Mecca˺ secure and provide fruits to its people—those among them who believe in Allah and the Last Day.” He answered, “As for those who disbelieve, I will let them enjoy themselves for a little while, then I will condemn them to the torment of the Fire. What an evil destination!”",
    "And ˹remember˺ when Abraham raised the foundation of the House with Ishmael, ˹both praying,˺ “Our Lord! Accept ˹this˺ from us. You are indeed the All-Hearing, All-Knowing.",
    "Our Lord! Make us both ˹fully˺ submit to You and from our descendants a nation that will submit to you. Show us our rituals, and turn to us in grace. You are truly the Accepter of Repentance, Most Merciful.",
    "Our Lord! Raise from among them a messenger who will recite to them Your revelations, teach them the Book and wisdom, and purify them. Indeed, You ˹alone˺ are the Almighty, All-Wise.”",
    "And who would reject the faith of Abraham except a fool! We certainly chose him in this life, and in the Hereafter he will surely be among the righteous.",
    "When his Lord ordered him, “Submit ˹to My Will˺,” he responded, “I submit to the Lord of all worlds.”",
    "This was the advice of Abraham—as well as Jacob—to his children, ˹saying˺, “Indeed, Allah has chosen for you this faith; so do not die except in ˹a state of full˺ submission.”",
    "Or did you witness when death came to Jacob? He asked his children, “Who will you worship after my passing?” They replied, “We will ˹continue to˺ worship your God, the God of your forefathers—Abraham, Ishmael, and Isaac—the One God. And to Him we ˹all˺ submit.”",
    "That was a community that had already gone before. For them is what they earned and for you is what you have earned. And you will not be accountable for what they have done.",
    "The Jews and Christians each say, “Follow our faith to be ˹rightly˺ guided.” Say, ˹O Prophet,˺ “No! We follow the faith of Abraham, the upright—who was not a polytheist.”",
    "Say, ˹O believers,˺ “We believe in Allah and what has been revealed to us; and what was revealed to Abraham, Ishmael, Isaac, Jacob, and his descendants; and what was given to Moses, Jesus, and other prophets from their Lord. We make no distinction between any of them. And to Allah we all submit.”",
    "So if they believe in what you believe, then they will indeed be ˹rightly˺ guided. But if they turn away, they are simply opposed ˹to the truth˺. But Allah will spare you their evil. For He is the All-Hearing, All-Knowing.",
    "This is the ˹natural˺ Way of Allah. And who is better than Allah in ordaining a way? And we worship ˹none but˺ Him.",
    "Say, “Would you dispute with us about Allah, while He is our Lord and your Lord? We are accountable for our deeds and you for yours. And we are devoted to Him ˹alone˺.",
    "Do you claim that Abraham, Ishmael, Isaac, Jacob, and his descendants were all Jews or Christians?” Say, “Who is more knowledgeable: you or Allah?” Who does more wrong than those who hide the testimony they received from Allah? And Allah is never unaware of what you do.",
    "That was a community that had already gone before. For them is what they earned and for you is what you have earned. And you will not be accountable for what they have done.",
    "The foolish among the people will ask, “Why did they turn away from the direction of prayer they used to face?” Say, ˹O Prophet,˺ “The east and west belong ˹only˺ to Allah. He guides whoever He wills to the Straight Path.”",
    "And so We have made you ˹believers˺ an upright community so that you may be witnesses over humanity and that the Messenger may be a witness over you. We assigned your former direction of prayer only to distinguish those who would remain faithful to the Messenger from those who would lose faith. It was certainly a difficult test except for those ˹rightly˺ guided by Allah. And Allah would never discount your ˹previous acts of˺ faith. Surely Allah is Ever Gracious and Most Merciful to humanity.",
    "Indeed, We see you ˹O Prophet˺ turning your face towards heaven. Now We will make you turn towards a direction ˹of prayer˺ that will please you. So turn your face towards the Sacred Mosque ˹in Mecca˺—wherever you are, turn your faces towards it. Those who were given the Scripture certainly know this to be the truth from their Lord. And Allah is never unaware of what they do.",
    "Even if you were to bring every proof to the People of the Book, they would not accept your direction ˹of prayer˺, nor would you accept theirs; nor would any of them accept the direction ˹of prayer˺ of another. And if you were to follow their desires after ˹all˺ the knowledge that has come to you, then you would certainly be one of the wrongdoers.",
    "Those We have given the Scripture recognize this ˹Prophet˺ as they recognize their own children. Yet a group of them hides the truth knowingly.",
    "˹This is˺ the truth from your Lord, so do not ever be one of those who doubt.",
    "Everyone turns to their own direction ˹of prayer˺. So compete with one another in doing good. Wherever you are, Allah will bring you all together ˹for judgment˺. Surely Allah is Most Capable of everything.",
    "Wherever you are ˹O Prophet˺, turn your face towards the Sacred Mosque. This is certainly the truth from your Lord. And Allah is never unaware of what you ˹all˺ do.",
    "Wherever you are ˹O Prophet˺, turn your face towards the Sacred Mosque. And wherever you ˹believers˺ are, face towards it, so that people will have no argument against you, except the wrongdoers among them. Do not fear them; fear Me, so that I may ˹continue to˺ perfect My favour upon you and so you may be ˹rightly˺ guided.",
    "Since We have sent you a messenger from among yourselves—reciting to you Our revelations, purifying you, teaching you the Book and wisdom, and teaching you what you never knew—",
    "remember Me; I will remember you. And thank Me, and never be ungrateful.",
    "O believers! Seek comfort in patience and prayer. Allah is truly with those who are patient.",
    "Never say that those martyred in the cause of Allah are dead—in fact, they are alive! But you do not perceive it.",
    "We will certainly test you with a touch of fear and famine and loss of property, life, and crops. Give good news to those who patiently endure—",
    "who, when faced with a disaster, say, “Surely to Allah we belong and to Him we will ˹all˺ return.”",
    "They are the ones who will receive Allah’s blessings and mercy. And it is they who are ˹rightly˺ guided.",
    "Indeed, ˹the hills of˺ Ṣafa and Marwah are among the symbols of Allah. So whoever performs the pilgrimage or minor pilgrimage, let them walk between ˹the two hills˺. And whoever does good willingly, Allah is truly Appreciative, All-Knowing.",
    "Those who hide the clear proofs and guidance that We have revealed—after We made it clear for humanity in the Book—will be condemned by Allah and ˹all˺ those who condemn.",
    "As for those who repent, mend their ways, and let the truth be known, they are the ones to whom I will turn ˹in forgiveness˺, for I am the Accepter of Repentance, Most Merciful.",
    "Surely those who disbelieve and die as disbelievers are condemned by Allah, the angels, and all of humanity.",
    "They will be in Hell forever. Their punishment will not be lightened, nor will they be delayed ˹from it˺.",
    "Your God is ˹only˺ One God. There is no god ˹worthy of worship˺ except Him—the Most Compassionate, Most Merciful.",
    "Indeed, in the creation of the heavens and the earth; the alternation of the day and the night; the ships that sail the sea for the benefit of humanity; the rain sent down by Allah from the skies, reviving the earth after its death; the scattering of all kinds of creatures throughout; the shifting of the winds; and the clouds drifting between the heavens and the earth—˹in all of this˺ are surely signs for people of understanding.",
    "Still there are some who take others as Allah’s equal—they love them as they should love Allah—but the ˹true˺ believers love Allah even more. If only the wrongdoers could see the ˹horrible˺ punishment ˹awaiting them˺, they would certainly realize that all power belongs to Allah and that Allah is indeed severe in punishment.",
    "˹Consider the Day˺ when those who misled others will disown their followers—when they face the torment—and the bonds that united them will be cut off.",
    "The ˹misled˺ followers will cry, “If only we could have a second chance, we would disown them as they disowned us.” And so Allah will make them remorseful of their misdeeds. And they will never ˹be able to˺ leave the Fire.",
    "O humanity! Eat from what is lawful and good on the earth and do not follow Satan’s footsteps. He is truly your sworn enemy.",
    "He only incites you to commit evil and indecency, and to claim against Allah what you do not know.",
    "When it is said to them, “Follow what Allah has revealed,” they reply, “No! We ˹only˺ follow what we found our forefathers practicing.” ˹Would they still do so,˺ even if their forefathers had ˹absolutely˺ no understanding or guidance?",
    "The example of the disbelievers ˹not responding to the Messenger’s warning˺ is like a flock not comprehending the calls and cries of the shepherd. ˹They are wilfully˺ deaf, dumb and blind so they have no understanding.",
    "O believers! Eat from the good things We have provided for you. And give thanks to Allah if you ˹truly˺ worship Him ˹alone˺.",
    "He has only forbidden you ˹to eat˺ carrion, blood, swine, and what is slaughtered in the name of any other than Allah. But if someone is compelled by necessity—neither driven by desire nor exceeding immediate need—they will not be sinful. Surely Allah is All-Forgiving, Most Merciful.",
    "Indeed, those who hide Allah’s revelations, trading them for a fleeting gain consume nothing but fire into their bellies. Allah will neither speak to them on the Day of Judgment, nor will He purify them. And they will suffer a painful punishment.",
    "They are the ones who trade guidance for misguidance and forgiveness for punishment. How persistent are they in pursuit of the Fire!",
    "That is because Allah has revealed the Book in truth. And surely those who differ regarding it are totally engrossed in opposition.",
    "Righteousness is not in turning your faces towards the east or the west. Rather, the righteous are those who believe in Allah, the Last Day, the angels, the Books, and the prophets; who give charity out of their cherished wealth to relatives, orphans, the poor, ˹needy˺ travellers, beggars, and for freeing captives; who establish prayer, pay alms-tax, and keep the pledges they make; and who are patient in times of suffering, adversity, and in ˹the heat of˺ battle. It is they who are true ˹in faith˺, and it is they who are mindful ˹of Allah˺.",
    "O believers! ˹The law of˺ retaliation is set for you in cases of murder—a free man for a free man, a slave for a slave, and a female for a female. But if the offender is pardoned by the victim’s guardian, then blood-money should be decided fairly and payment should be made courteously. This is a concession and a mercy from your Lord. But whoever transgresses after that will suffer a painful punishment.",
    "There is ˹security of˺ life for you in ˹the law of˺ retaliation, O  people of reason, so that you may become mindful ˹of Allah˺.",
    "It is prescribed that when death approaches any of you—if they leave something of value—a will should be made in favour of parents and immediate family with fairness. ˹This is˺ an obligation on those who are mindful ˹of Allah˺.",
    "But whoever changes the will after hearing it, the blame will only be on those who made the change. Indeed, Allah is All-Hearing, All-Knowing.",
    "Whoever suspects an error or an injustice in the will and brings about a ˹fair˺ settlement among the parties will not be sinful. Surely Allah is All-Forgiving, Most Merciful.",
    "O believers! Fasting is prescribed for you—as it was for those before you—so perhaps you will become mindful ˹of Allah˺.",
    "˹Fast a˺ prescribed number of days. But whoever of you is ill or on a journey, then ˹let them fast˺ an equal number of days ˹after Ramaḍân˺. For those who can only fast with extreme difficulty, compensation can be made by feeding a needy person ˹for every day not fasted˺. But whoever volunteers to give more, it is better for them. And to fast is better for you, if only you knew.",
    "Ramaḍân is the month in which the Quran was revealed as a guide for humanity with clear proofs of guidance and the standard ˹to distinguish between right and wrong˺. So whoever is present this month, let them fast. But whoever is ill or on a journey, then ˹let them fast˺ an equal number of days ˹after Ramaḍân˺. Allah intends ease for you, not hardship, so that you may complete the prescribed period and proclaim the greatness of Allah for guiding you, and perhaps you will be grateful.",
    "When My servants ask you ˹O Prophet˺ about Me: I am truly near. I respond to one’s prayer when they call upon Me. So let them respond ˹with obedience˺ to Me and believe in Me, perhaps they will be guided ˹to the Right Way˺.",
    "It has been made permissible for you to be intimate with your wives during the nights preceding the fast. Your spouses are a garment for you as you are for them. Allah knows that you were deceiving yourselves. So He has accepted your repentance and pardoned you. So now you may be intimate with them and seek what Allah has prescribed for you. ˹You may˺ eat and drink until you see the light of dawn breaking the darkness of night, then complete the fast until nightfall. Do not be intimate with your spouses while you are meditating in the mosques. These are the limits set by Allah, so do not exceed them. This is how Allah makes His revelations clear to people, so they may become mindful ˹of Him˺.",
    "Do not consume one another’s wealth unjustly, nor deliberately bribe authorities in order to devour a portion of others’ property, knowing that it is a sin.",
    "They ask you ˹O Prophet˺ about the phases of the moon. Say, “They are a means for people to determine time and pilgrimage.” Righteousness is not in entering your houses from the back doors. Rather, righteousness is to be mindful ˹of Allah˺. So enter your homes through their ˹proper˺ doors, and be mindful of Allah so you may be successful.",
    "Fight in the cause of Allah ˹only˺ against those who wage war against you, but do not exceed the limits. Allah does not like transgressors.",
    "Kill them wherever you come upon them and drive them out of the places from which they have driven you out. For persecution is far worse than killing. And do not fight them at the Sacred Mosque unless they attack you there. If they do so, then fight them—that is the reward of the disbelievers.",
    "But if they cease, then surely Allah is All-Forgiving, Most Merciful.",
    "Fight against them ˹if they persecute you˺ until there is no more persecution, and ˹your˺ devotion will be to Allah ˹alone˺. If they stop ˹persecuting you˺, let there be no hostility except against the aggressors.",
    "˹There will be retaliation in˺ a sacred month for ˹an offence in˺ a sacred month, and all violations will bring about retaliation. So, if anyone attacks you, retaliate in the same manner. ˹But˺ be mindful of Allah, and know that Allah is with those mindful ˹of Him˺.",
    "Spend in the cause of Allah and do not let your own hands throw you into destruction ˹by withholding˺. And do good, for Allah certainly loves the good-doers.",
    "Complete the pilgrimage and minor pilgrimage for Allah. But if prevented ˹from proceeding˺, then ˹offer˺ whatever sacrificial animals you can afford. And do not shave your heads until the sacrificial animal reaches its destination. But if any of you is ill or has a scalp ailment ˹requiring shaving˺, then compensate either by fasting, charity, or a sacrificial offering. In times of peace, you may combine the pilgrimage and minor pilgrimage then make the sacrificial offering you can afford. Whoever cannot afford that ˹offering˺, let them fast three days during pilgrimage and seven after returning ˹home˺—completing ten. These offerings are for those who do not live near the Sacred House. And be mindful of Allah, and know that Allah is severe in punishment.",
    "˹Commitment to˺ pilgrimage is made in appointed months. Whoever commits to ˹performing˺ pilgrimage, let them stay away from intimate relations, foul language, and arguments during pilgrimage. Whatever good you do, Allah ˹fully˺ knows of it. Take ˹necessary˺ provisions ˹for the journey˺—surely the best provision is righteousness. And be mindful of Me, O  people of reason!",
    "There is no blame on you for seeking the bounty of your Lord ˹during this journey˺. When you return from ’Arafât, praise Allah near the sacred place and praise Him for having guided you, for surely before this ˹guidance˺ you were astray.",
    "Then go forth with the rest of the pilgrims. And seek Allah’s forgiveness. Surely Allah is All-Forgiving, Most Merciful.",
    "When you have fulfilled your sacred rites, praise Allah as you used to praise your forefathers ˹before Islam˺, or even more passionately. There are some who say, “Our Lord! Grant us ˹Your bounties˺ in this world,” but they will have no share in the Hereafter.",
    "Yet there are others who say, “Our Lord! Grant us the good of this world and the Hereafter, and protect us from the torment of the Fire.”",
    "It is they who will receive a ˹heavenly˺ reward for the good they have done. Surely Allah is swift in reckoning.",
    "And remember Allah during ˹these˺ appointed days. Whoever departs swiftly on the second day is not sinful, neither are those who stay behind ˹till the third—seeking additional reward˺, so long as they are mindful ˹of their Lord˺. And be mindful of Allah, and know that to Him you will ˹all˺ be gathered.",
    "There are some ˹hypocrites˺ who impress you with their views regarding worldly affairs and openly call upon Allah to witness what is in their hearts, yet they are your worst adversaries.",
    "And when they leave ˹you˺, they strive throughout the land to spread mischief in it and destroy crops and cattle. Allah does not like mischief.",
    "When it is said to them, “Fear Allah,” pride carries them off to sin. Hell will be their proper place. What an evil place to rest!",
    "And there are those who would dedicate their lives to Allah’s pleasure. And Allah is Ever Gracious to ˹His˺ servants.",
    "O believers! Enter into Islam wholeheartedly and do not follow Satan’s footsteps. Surely he is your sworn enemy.",
    "If you falter after receiving the clear proofs, then know that Allah is indeed Almighty, All-Wise.",
    "Are they waiting for Allah ˹Himself˺ to come to them in the shade of clouds, along with the angels? ˹If He did˺, then the matter would be settled ˹at once˺. And to Allah ˹all˺ matters will be returned ˹for judgment˺.",
    "Ask the Children of Israel how many clear signs We have given them. And whoever trades Allah’s favour—after receiving it—˹for disbelief˺ should know that Allah is indeed severe in punishment.",
    "The life of this world has been made appealing to the disbelievers, and they mock the believers. Those who are mindful ˹of Allah˺ will rank above them on the Day of Judgment. And Allah provides for whoever He wills without limit.",
    "Humanity had once been one community ˹of believers before they lost faith˺. Then Allah raised prophets as deliverers of good news and as warners, and revealed to them the Scriptures in truth to judge among people regarding their disputes. And no one disputed the Scriptures except the very people who received them after clear proofs had come to them—out of jealousy. Then Allah, by His grace, has guided the believers to the truth regarding those disputes. And Allah guides whoever He wills to the Straight Path.",
    "Do you think you will be admitted into Paradise without being tested like those before you? They were afflicted with suffering and adversity and were so ˹violently˺ shaken that ˹even˺ the Messenger and the believers with him cried out, “When will Allah’s help come?” Indeed, Allah’s help is ˹always˺ near.",
    "They ask you ˹O Prophet in˺ what ˹way˺ they should donate. Say, “Whatever donations you give are for parents, relatives, orphans, the poor, and ˹needy˺ travellers. Whatever good you do is certainly well known to Allah.”",
    "Fighting has been made obligatory upon you ˹believers˺, though you dislike it. Perhaps you dislike something which is good for you and like something which is bad for you. Allah knows and you do not know.",
    "They ask you ˹O Prophet˺ about fighting in the sacred months. Say, “Fighting during these months is a great sin. But hindering ˹others˺ from the Path of Allah, rejecting Him, and expelling the worshippers from the Sacred Mosque is ˹a˺ greater ˹sin˺ in the sight of Allah. For persecution is far worse than killing. And they will not stop fighting you until they turn you away from your faith—if they can. And whoever among you renounces their own faith and dies a disbeliever, their deeds will become void in this life and in the Hereafter. It is they who will be the residents of the Fire. They will be there forever.”",
    "Surely those who have believed, emigrated, and struggled in the Way of Allah—they can hope for Allah’s mercy. And Allah is All-Forgiving, Most Merciful.",
    "They ask you ˹O Prophet˺ about intoxicants and gambling. Say, “There is great evil in both, as well as some benefit for people—but the evil outweighs the benefit.” They ˹also˺ ask you ˹O Prophet˺ what they should donate. Say, “Whatever you can spare.” This is how Allah makes His revelations clear to you ˹believers˺, so perhaps you may reflect",
    "upon this world and the Hereafter. And they ask you ˹O Prophet˺ concerning orphans. Say, “Improving their condition is best. And if you partner with them, they are bonded with you ˹in faith˺. And Allah knows who intends harm and who intends good. Had Allah willed, He could have made it difficult for you. Surely Allah is Almighty, All-Wise.”",
    "Do not marry polytheistic women until they believe; for a believing slave-woman is better than a free polytheist, even though she may look pleasant to you. And do not marry your women to polytheistic men until they believe, for a believing slave-man is better than a free polytheist, even though he may look pleasant to you. They invite ˹you˺ to the Fire while Allah invites ˹you˺ to Paradise and forgiveness by His grace. He makes His revelations clear to the people so perhaps they will be mindful.",
    "They ask you ˹O Prophet˺ about menstruation. Say, “Beware of its harm! So keep away, and do not have intercourse with your wives during their monthly cycles until they are purified. When they purify themselves, then you may approach them in the manner specified by Allah. Surely Allah loves those who always turn to Him in repentance and those who purify themselves.”",
    "Your wives are like farmland for you, so approach them ˹consensually˺ as you please. And send forth something good for yourselves. Be mindful of Allah, and know that you will meet Him. And give good news to the believers.",
    "Do not use Allah’s Name in your oaths as an excuse for not doing good, not guarding against evil, or not making peace between people. And Allah is All-Hearing, All-Knowing.",
    "Allah will not hold you accountable for unintentional oaths, but for what you intended in your hearts. And Allah is All-Forgiving, Most Forbearing.",
    "Those who swear not to have intercourse with their wives must wait for four months. If they change their mind, then Allah is certainly All-Forgiving, Most Merciful.",
    "But if they settle on divorce, then Allah is indeed All-Hearing, All-Knowing.",
    "Divorced women must wait three monthly cycles ˹before they can re-marry˺. It is not lawful for them to conceal what Allah has created in their wombs, if they ˹truly˺ believe in Allah and the Last Day. And their husbands reserve the right to take them back within that period if they desire reconciliation. Women have rights similar to those of men equitably, although men have a degree ˹of responsibility˺ above them. And Allah is Almighty, All-Wise.",
    "Divorce may be retracted twice, then the husband must retain ˹his wife˺ with honour or separate ˹from her˺ with grace. It is not lawful for husbands to take back anything of the dowry given to their wives, unless the couple fears not being able to keep within the limits of Allah. So if you fear they will not be able to keep within the limits of Allah, there is no blame if the wife compensates the husband to obtain divorce. These are the limits set by Allah, so do not transgress them. And whoever transgresses the limits of Allah, they are the ˹true˺ wrongdoers.",
    "So if a husband divorces his wife ˹three times˺, then it is not lawful for him to remarry her until after she has married another man and then is divorced. Then it is permissible for them to reunite, as long as they feel they are able to maintain the limits of Allah. These are the limits set by Allah, which He makes clear for people of knowledge.",
    "When you divorce women and they have ˹almost˺ reached the end of their waiting period, either retain them honourably or let them go honourably. But do not retain them ˹only˺ to harm them ˹or˺ to take advantage ˹of them˺. Whoever does that surely wrongs his own soul. Do not take Allah’s revelations lightly. Remember Allah’s favours upon you as well as the Book and wisdom He has sent down for your guidance. Be mindful of Allah, and know that Allah has ˹perfect˺ knowledge of all things.",
    "When you have divorced women and they have reached the end of their waiting period, do not prevent them from re-marrying their ex-husbands if they come to an honourable agreement. This is enjoined on whoever has faith in Allah and the Last Day. This is purer and more dignifying for you. Allah knows and you do not know.",
    "˹Divorced˺ mothers will breastfeed their offspring for two whole years, for those who wish to complete the nursing ˹of their child˺. The child’s father will provide reasonable maintenance and clothing for the mother ˹during that period˺. No one will be charged with more than they can bear. No mother or father should be made to suffer for their child. The ˹father’s˺ heirs are under the same obligation. But if both sides decide—after mutual consultation and consent—to wean a child, then there is no blame on them. If you decide to have your children nursed by a wet-nurse, it is permissible as long as you pay fairly. Be mindful of Allah, and know that Allah is All-Seeing of what you do.",
    "As for those of you who die and leave widows behind, let them observe a waiting period of four months and ten days. When they have reached the end of this period, then you are not accountable for what they decide for themselves in a reasonable manner. And Allah is All-Aware of what you do.",
    "There is no blame on you for subtly showing interest in ˹divorced or widowed˺ women or for hiding ˹the intention˺ in your hearts. Allah knows that you are considering them ˹for marriage˺. But do not make a secret commitment with them—you can only show interest in them appropriately. Do not commit to the bond of marriage until the waiting period expires. Know that Allah is aware of what is in your hearts, so beware of Him. And know that Allah is All-Forgiving, Most Forbearing.",
    "There is no blame if you divorce women before the marriage is consummated or the dowry is settled. But give them a ˹suitable˺ compensation—the rich according to his means and the poor according to his. A reasonable compensation is an obligation on the good-doers.",
    "And if you divorce them before consummating the marriage but after deciding on a dowry, pay half of the dowry, unless the wife graciously waives it or the husband graciously pays in full. Graciousness is closer to righteousness. And do not forget kindness among yourselves. Surely Allah is All-Seeing of what you do.",
    "Observe the ˹five obligatory˺ prayers—especially the middle prayer—and stand in true devotion to Allah.",
    "If you are in danger, pray on foot or while riding. But when you are safe, ˹take time to˺ remember Allah for teaching you what you did not know.",
    "Those of you who die leaving widows should bequeath for them a year’s maintenance without forcing them out. But if they choose to leave, you are not accountable for what they reasonably decide for themselves. And Allah is Almighty, All-Wise.",
    "Reasonable provisions must be made for divorced women—a duty on those mindful ˹of Allah˺.",
    "This is how Allah makes His revelations clear to you, so perhaps you will understand.",
    "Have you ˹O Prophet˺ not seen those who fled their homes in the thousands for fear of death? Allah said to them, “Die!” then He gave them life. Surely Allah is ever Bountiful to humanity, but most people are ungrateful.",
    "Fight in the cause of Allah, and know that Allah is All-Hearing, All-Knowing.",
    "Who will lend to Allah a good loan which Allah will multiply many times over? It is Allah ˹alone˺ who decreases and increases ˹wealth˺. And to Him you will ˹all˺ be returned.",
    "Have you not seen those chiefs of the Children of Israel after Moses? They said to one of their prophets, “Appoint for us a king, ˹and˺ we will fight in the cause of Allah.” He said, “Are you not going to cower if ordered to fight?” They replied, “How could we refuse to fight in the cause of Allah, while we were driven out of our homes and ˹separated from˺ our children?” But when they were ordered to fight, they fled, except for a few of them. And Allah has ˹perfect˺ knowledge of the wrongdoers.",
    "Their prophet told them, “Allah has appointed Saul to be your king.” They protested, “How can he be our king when some of us are more deserving of kingship than he, and he has not been blessed with vast riches?” He replied, “Allah has chosen him over you and blessed him with knowledge and stature. Allah grants kingship to whoever He wills. And Allah is All-Bountiful, All-Knowing.”",
    "Their prophet further told them, “The sign of Saul’s kingship is that the Ark will come to you—containing reassurance from your Lord and relics of the family of Moses and the family of Aaron, which will be carried by the angels. Surely in this is a sign for you, if you ˹truly˺ believe.”",
    "When Saul marched forth with his army, he cautioned: “Allah will test you with a river. So whoever drinks ˹his fill˺ from it is not with me, and whoever does not taste it—except a sip from the hollow of his hands—is definitely with me.” They all drank ˹their fill˺ except for a few! When he and the ˹remaining˺ faithful with him crossed the river, they said, “Now we are no match for Goliath and his warriors.” But those ˹believers˺ who were certain they would meet Allah reasoned, “How many times has a small force vanquished a mighty army by the Will of Allah! And Allah is ˹always˺ with the steadfast.”",
    "When they advanced to face Goliath and his warriors, they prayed, “Our Lord! Shower us with perseverance, make our steps firm, and give us victory over the disbelieving people.”",
    "So they defeated them by Allah’s Will, and David killed Goliath. And Allah blessed David with kingship and wisdom and taught him what He willed. Had Allah not repelled a group of people by ˹the might of˺ another, corruption would have dominated the earth, but Allah is Gracious to all.",
    "These are Allah’s revelations which We recite to you ˹O Prophet˺ in truth. And you are truly one of the messengers.",
    "We have chosen some of those messengers above others. Allah spoke directly to some, and raised some high in rank. To Jesus, son of Mary, We gave clear proofs and supported him with the holy spirit. If Allah had willed, succeeding generations would not have fought ˹among themselves˺ after receiving the clear proofs. But they differed—some believed while others disbelieved. Yet if Allah had willed, they would not have fought one another. But Allah does what He wills.",
    "O believers! Donate from what We have provided for you before the arrival of a Day when there will be no bargaining, friendship, or intercession. Those who disbelieve are ˹truly˺ the wrongdoers.",
    "Allah! There is no god ˹worthy of worship˺ except Him, the Ever-Living, All-Sustaining. Neither drowsiness nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who could possibly intercede with Him without His permission? He ˹fully˺ knows what is ahead of them and what is behind them, but no one can grasp any of His knowledge—except what He wills ˹to reveal˺. His Seat encompasses the heavens and the earth, and the preservation of both does not tire Him. For He is the Most High, the Greatest.",
    "Let there be no compulsion in religion, for the truth stands out clearly from falsehood. So whoever renounces false gods and believes in Allah has certainly grasped the firmest, unfailing hand-hold. And Allah is All-Hearing, All-Knowing.",
    "Allah is the Guardian of the believers—He brings them out of darkness and into light. As for the disbelievers, their guardians are false gods who lead them out of light and into darkness. It is they who will be the residents of the Fire. They will be there forever.",
    "Are you ˹O Prophet˺ not aware of the one who argued with Abraham about his Lord because Allah had granted him kingship? ˹Remember˺ when Abraham said, “My Lord is the One Who has power to give life and cause death.” He argued, “I too have the power to give life and cause death.” Abraham challenged ˹him˺, “Allah causes the sun to rise from the east. So make it rise from the west.” And so the disbeliever was dumbstruck. And Allah does not guide the wrongdoing people.",
    "Or ˹are you not aware of˺ the one who passed by a city which was in ruins. He wondered, “How could Allah bring this back to life after its destruction?” So Allah caused him to die for a hundred years then brought him back to life. Allah asked, “How long have you remained ˹in this state˺?” He replied, “Perhaps a day or part of a day.” Allah said, “No! You have remained here for a hundred years! Just look at your food and drink—they have not spoiled. ˹But now˺ look at ˹the remains of˺ your donkey! And ˹so˺ We have made you into a sign for humanity. And look at the bones ˹of the donkey˺, how We bring them together then clothe them with flesh!” When this was made clear to him, he declared, “˹Now˺ I know that Allah is Most Capable of everything.”",
    "And ˹remember˺ when Abraham said, “My Lord! Show me how you give life to the dead.” Allah responded, “Do you not believe?” Abraham replied, “Yes I do, but just so my heart can be reassured.” Allah said, “Then bring four birds, train them to come to you, ˹then cut them into pieces,˺ and scatter them on different hilltops. Then call them back, they will fly to you in haste. And ˹so you will˺ know that Allah is Almighty, All-Wise.”",
    "The example of those who spend their wealth in the cause of Allah is that of a grain that sprouts into seven ears, each bearing one hundred grains. And Allah multiplies ˹the reward even more˺ to whoever He wills. For Allah is All-Bountiful, All-Knowing.",
    "Those who spend their wealth in the cause of Allah and do not follow their charity with reminders of their generosity or hurtful words—they will get their reward from their Lord, and there will be no fear for them, nor will they grieve.",
    "Kind words and forgiveness are better than charity followed by injury. And Allah is Self-Sufficient, Most Forbearing.",
    "O believers! Do not waste your charity with reminders ˹of your generosity˺ or hurtful words, like those who donate their wealth just to show off and do not believe in Allah or the Last Day. Their example is that of a hard barren rock covered with a thin layer of soil hit by a strong rain—leaving it just a bare stone. Such people are unable to preserve the reward of their charity. Allah does not guide ˹such˺ disbelieving people.",
    "And the example of those who donate their wealth, seeking Allah’s pleasure and believing the reward is certain, is that of a garden on a fertile hill: when heavy rain falls, it yields up twice its normal produce. If no heavy rain falls, a drizzle is sufficient. And Allah is All-Seeing of what you do.",
    "Would any of you wish to have a garden with palm trees, grapevines, and all kinds of fruits with rivers flowing underneath and as they grow very old with dependent children, a fiery whirlwind hits the garden, burning it all up? This is how Allah makes His revelations clear to you, so perhaps you will reflect.",
    "O believers! Donate from the best of what you have earned and of what We have produced for you from the earth. Do not pick out worthless things for donation, which you yourselves would only accept with closed eyes. And know that Allah is Self-Sufficient, Praiseworthy.",
    "The Devil threatens you with ˹the prospect of˺ poverty and bids you to the shameful deed ˹of stinginess˺, while Allah promises you forgiveness and ˹great˺ bounties from Him. And Allah is All-Bountiful, All-Knowing.",
    "Allah grants wisdom to whoever He wills. And whoever is granted wisdom is certainly blessed with a great privilege. But none will be mindful ˹of this˺ except people of reason.",
    "Whatever charities you give or vows you make are surely known to Allah. And the wrongdoers will have no helpers.",
    "To give charity publicly is good, but to give to the poor privately is better for you, and will absolve you of your sins. And Allah is All-Aware of what you do.",
    "You are not responsible for people’s guidance ˹O Prophet˺—it is Allah Who guides whoever He wills. Whatever you ˹believers˺ spend in charity, it is for your own good—as long as you do so seeking the pleasure of Allah. Whatever you donate will be paid back to you in full, and you will not be wronged.",
    "˹Charity is˺ for the needy who are too engaged in the cause of Allah to move about in the land ˹for work˺. Those unfamiliar with their situation will think they are not in need ˹of charity˺ because they do not beg. You can recognize them by their appearance. They do not beg people persistently. Whatever you give in charity is certainly well known to Allah.",
    "Those who spend their wealth in charity day and night, secretly and openly—their reward is with their Lord, and there will be no fear for them, nor will they grieve.",
    "Those who consume interest will stand ˹on Judgment Day˺ like those driven to madness by Satan’s touch. That is because they say, “Trade is no different than interest.” But Allah has permitted trading and forbidden interest. Whoever refrains—after having received warning from their Lord—may keep their previous gains, and their case is left to Allah. As for those who persist, it is they who will be the residents of the Fire. They will be there forever.",
    "Allah has made interest fruitless and charity fruitful. And Allah does not like any ungrateful evildoer.",
    "Indeed, those who believe, do good, establish prayer, and pay alms-tax will receive their reward from their Lord, and there will be no fear for them, nor will they grieve.",
    "O believers! Fear Allah, and give up outstanding interest if you are ˹true˺ believers.",
    "If you do not, then beware of a war with Allah and His Messenger! But if you repent, you may retain your principal—neither inflicting nor suffering harm.",
    "If it is difficult for someone to repay a debt, postpone it until a time of ease. And if you waive it as an act of charity, it will be better for you, if only you knew.",
    "Be mindful of the Day when you will ˹all˺ be returned to Allah, then every soul will be paid in full for what it has done, and none will be wronged.",
    "O believers! When you contract a loan for a fixed period of time, commit it to writing. Let the scribe maintain justice between the parties. The scribe should not refuse to write as Allah has taught them to write. They will write what the debtor dictates, bearing Allah in mind and not defrauding the debt. If the debtor is incompetent, weak, or unable to dictate, let their guardian dictate for them with justice. Call upon two of your men to witness. If two men cannot be found, then one man and two women of your choice will witness—so if one of the women forgets the other may remind her. The witnesses must not refuse when they are summoned. You must not be against writing ˹contracts˺ for a fixed period—whether the sum is small or great. This is more just ˹for you˺ in the sight of Allah, and more convenient to establish evidence and remove doubts. However, if you conduct an immediate transaction among yourselves, then there is no need for you to record it, but call upon witnesses when a deal is finalized. Let no harm come to the scribe or witnesses. If you do, then you have gravely exceeded ˹your limits˺. Be mindful of Allah, for Allah ˹is the One Who˺ teaches you. And Allah has ˹perfect˺ knowledge of all things.",
    "If you are on a journey and a scribe cannot be found, then a security can be taken. If you trust one another, then ˹there is no need for a security, but˺ the debtor should honour this trust ˹by repaying the debt˺—and let them fear Allah, their Lord. And do not conceal the testimony, for whoever conceals it, their hearts are indeed sinful. And Allah ˹fully˺ knows what you do.",
    "To Allah ˹alone˺ belongs whatever is in the heavens and whatever is on the earth. Whether you reveal what is in your hearts or conceal it, Allah will call you to account for it. He forgives whoever He wills, and punishes whoever He wills. And Allah is Most Capable of everything.",
    "The Messenger ˹firmly˺ believes in what has been revealed to him from his Lord, and so do the believers. They ˹all˺ believe in Allah, His angels, His Books, and His messengers. ˹They proclaim,˺ “We make no distinction between any of His messengers.” And they say, “We hear and obey. ˹We seek˺ Your forgiveness, our Lord! And to You ˹alone˺ is the final return.”",
    "Allah does not require of any soul more than what it can afford. All good will be for its own benefit, and all evil will be to its own loss. ˹The believers pray,˺ “Our Lord! Do not punish us if we forget or make a mistake. Our Lord! Do not place a burden on us like the one you placed on those before us. Our Lord! Do not burden us with what we cannot bear. Pardon us, forgive us, and have mercy on us. You are our ˹only˺ Guardian. So grant us victory over the disbelieving people.”"
  ],
  "arabic1": [
    "الٓمّٓ",
    "ذٰلِكَ الْكِتٰبُ لَا رَیْبَ فِیْهِ هُدًی لِّلْمُتَّقِیْنَ",
    "الَّذِیْنَ یُؤْمِنُوْنَ بِالْغَیْبِ وَیُقِیْمُوْنَ الصَّلٰوةَ وَمِمَّا رَزَقْنٰهُمْ یُنْفِقُوْنَ",
    "وَالَّذِیْنَ یُؤْمِنُوْنَ بِمَاۤ اُنْزِلَ اِلَیْكَ وَمَاۤ اُنْزِلَ مِنْ قَبْلِكَ وَبِالْاٰخِرَةِ هُمْ یُوْقِنُوْنَ",
    "اُولٰٓىِٕكَ عَلٰی هُدًی مِّنْ رَّبِّهِمْ وَاُولٰٓىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "اِنَّ الَّذِیْنَ كَفَرُوْا سَوَآءٌ عَلَیْهِمْ ءَاَنْذَرْتَهُمْ اَمْ لَمْ تُنْذِرْهُمْ لَا یُؤْمِنُوْنَ",
    "خَتَمَ اللّٰهُ عَلٰی قُلُوْبِهِمْ وَعَلٰی سَمْعِهِمْ وَعَلٰۤی اَبْصَارِهِمْ غِشَاوَةٌ وَّلَهُمْ عَذَابٌ عَظِیْمٌ",
    "وَمِنَ النَّاسِ مَنْ یَّقُوْلُ اٰمَنَّا بِاللّٰهِ وَبِالْیَوْمِ الْاٰخِرِ وَمَا هُمْ بِمُؤْمِنِیْنَ",
    "یُخٰدِعُوْنَ اللّٰهَ وَالَّذِیْنَ اٰمَنُوْا وَمَا یَخْدَعُوْنَ اِلَّاۤ اَنْفُسَهُمْ وَمَا یَشْعُرُوْنَ",
    "فِیْ قُلُوْبِهِمْ مَّرَضٌ فَزَادَهُمُ اللّٰهُ مَرَضًا وَلَهُمْ عَذَابٌ اَلِیْمٌ ۬ بِمَا كَانُوْا یَكْذِبُوْنَ",
    "وَاِذَا قِیْلَ لَهُمْ لَا تُفْسِدُوْا فِی الْاَرْضِ قَالُوْۤا اِنَّمَا نَحْنُ مُصْلِحُوْنَ",
    "اَلَاۤ اِنَّهُمْ هُمُ الْمُفْسِدُوْنَ وَلٰكِنْ لَّا یَشْعُرُوْنَ",
    "وَاِذَا قِیْلَ لَهُمْ اٰمِنُوْا كَمَاۤ اٰمَنَ النَّاسُ قَالُوْۤا اَنُؤْمِنُ كَمَاۤ اٰمَنَ السُّفَهَآءُ اَلَاۤ اِنَّهُمْ هُمُ السُّفَهَآءُ وَلٰكِنْ لَّا یَعْلَمُوْنَ",
    "وَاِذَا لَقُوا الَّذِیْنَ اٰمَنُوْا قَالُوْۤا اٰمَنَّا وَاِذَا خَلَوْا اِلٰی شَیٰطِیْنِهِمْ قَالُوْۤا اِنَّا مَعَكُمْ اِنَّمَا نَحْنُ مُسْتَهْزِءُوْنَ",
    "اَللّٰهُ یَسْتَهْزِئُ بِهِمْ وَیَمُدُّهُمْ فِیْ طُغْیَانِهِمْ یَعْمَهُوْنَ",
    "اُولٰٓىِٕكَ الَّذِیْنَ اشْتَرَوُا الضَّلٰلَةَ بِالْهُدٰی فَمَا رَبِحَتْ تِّجَارَتُهُمْ وَمَا كَانُوْا مُهْتَدِیْنَ",
    "مَثَلُهُمْ كَمَثَلِ الَّذِی اسْتَوْقَدَ نَارًا فَلَمَّاۤ اَضَآءَتْ مَا حَوْلَهٗ ذَهَبَ اللّٰهُ بِنُوْرِهِمْ وَتَرَكَهُمْ فِیْ ظُلُمٰتٍ لَّا یُبْصِرُوْنَ",
    "صُمٌّۢ بُكْمٌ عُمْیٌ فَهُمْ لَا یَرْجِعُوْنَ",
    "اَوْ كَصَیِّبٍ مِّنَ السَّمَآءِ فِیْهِ ظُلُمٰتٌ وَّرَعْدٌ وَّبَرْقٌ یَجْعَلُوْنَ اَصَابِعَهُمْ فِیْۤ اٰذَانِهِمْ مِّنَ الصَّوَاعِقِ حَذَرَ الْمَوْتِ وَاللّٰهُ مُحِیْطٌ بِالْكٰفِرِیْنَ",
    "یَكَادُ الْبَرْقُ یَخْطَفُ اَبْصَارَهُمْ كُلَّمَاۤ اَضَآءَ لَهُمْ مَّشَوْا فِیْهِ وَاِذَاۤ اَظْلَمَ عَلَیْهِمْ قَامُوْا وَلَوْ شَآءَ اللّٰهُ لَذَهَبَ بِسَمْعِهِمْ وَاَبْصَارِهِمْ اِنَّ اللّٰهَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "یٰۤاَیُّهَا النَّاسُ اعْبُدُوْا رَبَّكُمُ الَّذِیْ خَلَقَكُمْ وَالَّذِیْنَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُوْنَ",
    "الَّذِیْ جَعَلَ لَكُمُ الْاَرْضَ فِرَاشًا وَّالسَّمَآءَ بِنَآءً وَّاَنْزَلَ مِنَ السَّمَآءِ مَآءً فَاَخْرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزْقًا لَّكُمْ فَلَا تَجْعَلُوْا لِلّٰهِ اَنْدَادًا وَّاَنْتُمْ تَعْلَمُوْنَ",
    "وَاِنْ كُنْتُمْ فِیْ رَیْبٍ مِّمَّا نَزَّلْنَا عَلٰی عَبْدِنَا فَاْتُوْا بِسُوْرَةٍ مِّنْ مِّثْلِهٖ وَادْعُوْا شُهَدَآءَكُمْ مِّنْ دُوْنِ اللّٰهِ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "فَاِنْ لَّمْ تَفْعَلُوْا وَلَنْ تَفْعَلُوْا فَاتَّقُوا النَّارَ الَّتِیْ وَقُوْدُهَا النَّاسُ وَالْحِجَارَةُ اُعِدَّتْ لِلْكٰفِرِیْنَ",
    "وَبَشِّرِ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ اَنَّ لَهُمْ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ كُلَّمَا رُزِقُوْا مِنْهَا مِنْ ثَمَرَةٍ رِّزْقًا قَالُوْا هٰذَا الَّذِیْ رُزِقْنَا مِنْ قَبْلُ وَاُتُوْا بِهٖ مُتَشَابِهًا وَلَهُمْ فِیْهَاۤ اَزْوَاجٌ مُّطَهَّرَةٌ وَّهُمْ فِیْهَا خٰلِدُوْنَ",
    "اِنَّ اللّٰهَ لَا یَسْتَحْیٖۤ اَنْ یَّضْرِبَ مَثَلًا مَّا بَعُوْضَةً فَمَا فَوْقَهَا فَاَمَّا الَّذِیْنَ اٰمَنُوْا فَیَعْلَمُوْنَ اَنَّهُ الْحَقُّ مِنْ رَّبِّهِمْ وَاَمَّا الَّذِیْنَ كَفَرُوْا فَیَقُوْلُوْنَ مَاذَاۤ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًا یُضِلُّ بِهٖ كَثِیْرًا وَّیَهْدِیْ بِهٖ كَثِیْرًا وَمَا یُضِلُّ بِهٖۤ اِلَّا الْفٰسِقِیْنَ",
    "الَّذِیْنَ یَنْقُضُوْنَ عَهْدَ اللّٰهِ مِنْ بَعْدِ مِیْثَاقِهٖ وَیَقْطَعُوْنَ مَاۤ اَمَرَ اللّٰهُ بِهٖۤ اَنْ یُّوْصَلَ وَیُفْسِدُوْنَ فِی الْاَرْضِ اُولٰٓىِٕكَ هُمُ الْخٰسِرُوْنَ",
    "كَیْفَ تَكْفُرُوْنَ بِاللّٰهِ وَكُنْتُمْ اَمْوَاتًا فَاَحْیَاكُمْ ثُمَّ یُمِیْتُكُمْ ثُمَّ یُحْیِیْكُمْ ثُمَّ اِلَیْهِ تُرْجَعُوْنَ",
    "هُوَ الَّذِیْ خَلَقَ لَكُمْ مَّا فِی الْاَرْضِ جَمِیْعًا ثُمَّ اسْتَوٰۤی اِلَی السَّمَآءِ فَسَوّٰىهُنَّ سَبْعَ سَمٰوٰتٍ وَهُوَ بِكُلِّ شَیْءٍ عَلِیْمٌ",
    "وَاِذْ قَالَ رَبُّكَ لِلْمَلٰٓىِٕكَةِ اِنِّیْ جَاعِلٌ فِی الْاَرْضِ خَلِیْفَةً قَالُوْۤا اَتَجْعَلُ فِیْهَا مَنْ یُّفْسِدُ فِیْهَا وَیَسْفِكُ الدِّمَآءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ قَالَ اِنِّیْۤ اَعْلَمُ مَا لَا تَعْلَمُوْنَ",
    "وَعَلَّمَ اٰدَمَ الْاَسْمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمْ عَلَی الْمَلٰٓىِٕكَةِ فَقَالَ اَنْۢبِـُٔوْنِیْ بِاَسْمَآءِ هٰۤؤُلَآءِ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "قَالُوْا سُبْحٰنَكَ لَا عِلْمَ لَنَاۤ اِلَّا مَا عَلَّمْتَنَا اِنَّكَ اَنْتَ الْعَلِیْمُ الْحَكِیْمُ",
    "قَالَ یٰۤاٰدَمُ اَنْۢبِئْهُمْ بِاَسْمَآىِٕهِمْ فَلَمَّاۤ اَنْۢبَاَهُمْ بِاَسْمَآىِٕهِمْ قَالَ اَلَمْ اَقُلْ لَّكُمْ اِنِّیْۤ اَعْلَمُ غَیْبَ السَّمٰوٰتِ وَالْاَرْضِ وَاَعْلَمُ مَا تُبْدُوْنَ وَمَا كُنْتُمْ تَكْتُمُوْنَ",
    "وَاِذْ قُلْنَا لِلْمَلٰٓىِٕكَةِ اسْجُدُوْا لِاٰدَمَ فَسَجَدُوْۤا اِلَّاۤ اِبْلِیْسَ اَبٰی وَاسْتَكْبَرَ وَكَانَ مِنَ الْكٰفِرِیْنَ",
    "وَقُلْنَا یٰۤاٰدَمُ اسْكُنْ اَنْتَ وَزَوْجُكَ الْجَنَّةَ وَكُلَا مِنْهَا رَغَدًا حَیْثُ شِئْتُمَا وَلَا تَقْرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوْنَا مِنَ الظّٰلِمِیْنَ",
    "فَاَزَلَّهُمَا الشَّیْطٰنُ عَنْهَا فَاَخْرَجَهُمَا مِمَّا كَانَا فِیْهِ وَقُلْنَا اهْبِطُوْا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ وَلَكُمْ فِی الْاَرْضِ مُسْتَقَرٌّ وَّمَتَاعٌ اِلٰی حِیْنٍ",
    "فَتَلَقّٰۤی اٰدَمُ مِنْ رَّبِّهٖ كَلِمٰتٍ فَتَابَ عَلَیْهِ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِیْمُ",
    "قُلْنَا اهْبِطُوْا مِنْهَا جَمِیْعًا فَاِمَّا یَاْتِیَنَّكُمْ مِّنِّیْ هُدًی فَمَنْ تَبِعَ هُدَایَ فَلَا خَوْفٌ عَلَیْهِمْ وَلَا هُمْ یَحْزَنُوْنَ",
    "وَالَّذِیْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰیٰتِنَاۤ اُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "یٰبَنِیْۤ اِسْرَآءِیْلَ اذْكُرُوْا نِعْمَتِیَ الَّتِیْۤ اَنْعَمْتُ عَلَیْكُمْ وَاَوْفُوْا بِعَهْدِیْۤ اُوْفِ بِعَهْدِكُمْ وَاِیَّایَ فَارْهَبُوْنِ",
    "وَاٰمِنُوْا بِمَاۤ اَنْزَلْتُ مُصَدِّقًا لِّمَا مَعَكُمْ وَلَا تَكُوْنُوْۤا اَوَّلَ كَافِرٍ بِهٖ وَلَا تَشْتَرُوْا بِاٰیٰتِیْ ثَمَنًا قَلِیْلًا وَّاِیَّایَ فَاتَّقُوْنِ",
    "وَلَا تَلْبِسُوا الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُوا الْحَقَّ وَاَنْتُمْ تَعْلَمُوْنَ",
    "وَاَقِیْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَارْكَعُوْا مَعَ الرّٰكِعِیْنَ",
    "اَتَاْمُرُوْنَ النَّاسَ بِالْبِرِّ وَتَنْسَوْنَ اَنْفُسَكُمْ وَاَنْتُمْ تَتْلُوْنَ الْكِتٰبَ اَفَلَا تَعْقِلُوْنَ",
    "وَاسْتَعِیْنُوْا بِالصَّبْرِ وَالصَّلٰوةِ وَاِنَّهَا لَكَبِیْرَةٌ اِلَّا عَلَی الْخٰشِعِیْنَ",
    "الَّذِیْنَ یَظُنُّوْنَ اَنَّهُمْ مُّلٰقُوْا رَبِّهِمْ وَاَنَّهُمْ اِلَیْهِ رٰجِعُوْنَ",
    "یٰبَنِیْۤ اِسْرَآءِیْلَ اذْكُرُوْا نِعْمَتِیَ الَّتِیْۤ اَنْعَمْتُ عَلَیْكُمْ وَاَنِّیْ فَضَّلْتُكُمْ عَلَی الْعٰلَمِیْنَ",
    "وَاتَّقُوْا یَوْمًا لَّا تَجْزِیْ نَفْسٌ عَنْ نَّفْسٍ شَیْـًٔا وَّلَا یُقْبَلُ مِنْهَا شَفَاعَةٌ وَّلَا یُؤْخَذُ مِنْهَا عَدْلٌ وَّلَا هُمْ یُنْصَرُوْنَ",
    "وَاِذْ نَجَّیْنٰكُمْ مِّنْ اٰلِ فِرْعَوْنَ یَسُوْمُوْنَكُمْ سُوْٓءَ الْعَذَابِ یُذَبِّحُوْنَ اَبْنَآءَكُمْ وَیَسْتَحْیُوْنَ نِسَآءَكُمْ وَفِیْ ذٰلِكُمْ بَلَآءٌ مِّنْ رَّبِّكُمْ عَظِیْمٌ",
    "وَاِذْ فَرَقْنَا بِكُمُ الْبَحْرَ فَاَنْجَیْنٰكُمْ وَاَغْرَقْنَاۤ اٰلَ فِرْعَوْنَ وَاَنْتُمْ تَنْظُرُوْنَ",
    "وَاِذْ وٰعَدْنَا مُوْسٰۤی اَرْبَعِیْنَ لَیْلَةً ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِنْ بَعْدِهٖ وَاَنْتُمْ ظٰلِمُوْنَ",
    "ثُمَّ عَفَوْنَا عَنْكُمْ مِّنْ بَعْدِ ذٰلِكَ لَعَلَّكُمْ تَشْكُرُوْنَ",
    "وَاِذْ اٰتَیْنَا مُوْسَی الْكِتٰبَ وَالْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُوْنَ",
    "وَاِذْ قَالَ مُوْسٰی لِقَوْمِهٖ یٰقَوْمِ اِنَّكُمْ ظَلَمْتُمْ اَنْفُسَكُمْ بِاتِّخَاذِكُمُ الْعِجْلَ فَتُوْبُوْۤا اِلٰی بَارِىِٕكُمْ فَاقْتُلُوْۤا اَنْفُسَكُمْ ذٰلِكُمْ خَیْرٌ لَّكُمْ عِنْدَ بَارِىِٕكُمْ فَتَابَ عَلَیْكُمْ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِیْمُ",
    "وَاِذْ قُلْتُمْ یٰمُوْسٰی لَنْ نُّؤْمِنَ لَكَ حَتّٰی نَرَی اللّٰهَ جَهْرَةً فَاَخَذَتْكُمُ الصّٰعِقَةُ وَاَنْتُمْ تَنْظُرُوْنَ",
    "ثُمَّ بَعَثْنٰكُمْ مِّنْ بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُوْنَ",
    "وَظَلَّلْنَا عَلَیْكُمُ الْغَمَامَ وَاَنْزَلْنَا عَلَیْكُمُ الْمَنَّ وَالسَّلْوٰی كُلُوْا مِنْ طَیِّبٰتِ مَا رَزَقْنٰكُمْ وَمَا ظَلَمُوْنَا وَلٰكِنْ كَانُوْۤا اَنْفُسَهُمْ یَظْلِمُوْنَ",
    "وَاِذْ قُلْنَا ادْخُلُوْا هٰذِهِ الْقَرْیَةَ فَكُلُوْا مِنْهَا حَیْثُ شِئْتُمْ رَغَدًا وَّادْخُلُوا الْبَابَ سُجَّدًا وَّقُوْلُوْا حِطَّةٌ نَّغْفِرْ لَكُمْ خَطٰیٰكُمْ وَسَنَزِیْدُ الْمُحْسِنِیْنَ",
    "فَبَدَّلَ الَّذِیْنَ ظَلَمُوْا قَوْلًا غَیْرَ الَّذِیْ قِیْلَ لَهُمْ فَاَنْزَلْنَا عَلَی الَّذِیْنَ ظَلَمُوْا رِجْزًا مِّنَ السَّمَآءِ بِمَا كَانُوْا یَفْسُقُوْنَ",
    "وَاِذِ اسْتَسْقٰی مُوْسٰی لِقَوْمِهٖ فَقُلْنَا اضْرِبْ بِّعَصَاكَ الْحَجَرَ فَانْفَجَرَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَیْنًا قَدْ عَلِمَ كُلُّ اُنَاسٍ مَّشْرَبَهُمْ كُلُوْا وَاشْرَبُوْا مِنْ رِّزْقِ اللّٰهِ وَلَا تَعْثَوْا فِی الْاَرْضِ مُفْسِدِیْنَ",
    "وَاِذْ قُلْتُمْ یٰمُوْسٰی لَنْ نَّصْبِرَ عَلٰی طَعَامٍ وَّاحِدٍ فَادْعُ لَنَا رَبَّكَ یُخْرِجْ لَنَا مِمَّا تُنْۢبِتُ الْاَرْضُ مِنْ بَقْلِهَا وَقِثَّآىِٕهَا وَفُوْمِهَا وَعَدَسِهَا وَبَصَلِهَا قَالَ اَتَسْتَبْدِلُوْنَ الَّذِیْ هُوَ اَدْنٰی بِالَّذِیْ هُوَ خَیْرٌ اِهْبِطُوْا مِصْرًا فَاِنَّ لَكُمْ مَّا سَاَلْتُمْ وَضُرِبَتْ عَلَیْهِمُ الذِّلَّةُ وَالْمَسْكَنَةُ وَبَآءُوْ بِغَضَبٍ مِّنَ اللّٰهِ ذٰلِكَ بِاَنَّهُمْ كَانُوْا یَكْفُرُوْنَ بِاٰیٰتِ اللّٰهِ وَیَقْتُلُوْنَ النَّبِیّٖنَ بِغَیْرِ الْحَقِّ ذٰلِكَ بِمَا عَصَوْا وَّكَانُوْا یَعْتَدُوْنَ",
    "اِنَّ الَّذِیْنَ اٰمَنُوْا وَالَّذِیْنَ هَادُوْا وَالنَّصٰرٰی وَالصّٰبِـِٕیْنَ مَنْ اٰمَنَ بِاللّٰهِ وَالْیَوْمِ الْاٰخِرِ وَعَمِلَ صَالِحًا فَلَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلَا خَوْفٌ عَلَیْهِمْ وَلَا هُمْ یَحْزَنُوْنَ",
    "وَاِذْ اَخَذْنَا مِیْثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّوْرَ خُذُوْا مَاۤ اٰتَیْنٰكُمْ بِقُوَّةٍ وَّاذْكُرُوْا مَا فِیْهِ لَعَلَّكُمْ تَتَّقُوْنَ",
    "ثُمَّ تَوَلَّیْتُمْ مِّنْ بَعْدِ ذٰلِكَ فَلَوْلَا فَضْلُ اللّٰهِ عَلَیْكُمْ وَرَحْمَتُهٗ لَكُنْتُمْ مِّنَ الْخٰسِرِیْنَ",
    "وَلَقَدْ عَلِمْتُمُ الَّذِیْنَ اعْتَدَوْا مِنْكُمْ فِی السَّبْتِ فَقُلْنَا لَهُمْ كُوْنُوْا قِرَدَةً خٰسِـِٕیْنَ",
    "فَجَعَلْنٰهَا نَكَالًا لِّمَا بَیْنَ یَدَیْهَا وَمَا خَلْفَهَا وَمَوْعِظَةً لِّلْمُتَّقِیْنَ",
    "وَاِذْ قَالَ مُوْسٰی لِقَوْمِهٖۤ اِنَّ اللّٰهَ یَاْمُرُكُمْ اَنْ تَذْبَحُوْا بَقَرَةً قَالُوْۤا اَتَتَّخِذُنَا هُزُوًا قَالَ اَعُوْذُ بِاللّٰهِ اَنْ اَكُوْنَ مِنَ الْجٰهِلِیْنَ",
    "قَالُوا ادْعُ لَنَا رَبَّكَ یُبَیِّنْ لَّنَا مَا هِیَ قَالَ اِنَّهٗ یَقُوْلُ اِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَّلَا بِكْرٌ عَوَانٌ بَیْنَ ذٰلِكَ فَافْعَلُوْا مَا تُؤْمَرُوْنَ",
    "قَالُوا ادْعُ لَنَا رَبَّكَ یُبَیِّنْ لَّنَا مَا لَوْنُهَا قَالَ اِنَّهٗ یَقُوْلُ اِنَّهَا بَقَرَةٌ صَفْرَآءُ فَاقِعٌ لَّوْنُهَا تَسُرُّ النّٰظِرِیْنَ",
    "قَالُوا ادْعُ لَنَا رَبَّكَ یُبَیِّنْ لَّنَا مَا هِیَ اِنَّ الْبَقَرَ تَشٰبَهَ عَلَیْنَا وَاِنَّاۤ اِنْ شَآءَ اللّٰهُ لَمُهْتَدُوْنَ",
    "قَالَ اِنَّهٗ یَقُوْلُ اِنَّهَا بَقَرَةٌ لَّا ذَلُوْلٌ تُثِیْرُ الْاَرْضَ وَلَا تَسْقِی الْحَرْثَ مُسَلَّمَةٌ لَّا شِیَةَ فِیْهَا قَالُوا الْـٰٔنَ جِئْتَ بِالْحَقِّ فَذَبَحُوْهَا وَمَا كَادُوْا یَفْعَلُوْنَ",
    "وَاِذْ قَتَلْتُمْ نَفْسًا فَادّٰرَءْتُمْ فِیْهَا وَاللّٰهُ مُخْرِجٌ مَّا كُنْتُمْ تَكْتُمُوْنَ",
    "فَقُلْنَا اضْرِبُوْهُ بِبَعْضِهَا كَذٰلِكَ یُحْیِ اللّٰهُ الْمَوْتٰی وَیُرِیْكُمْ اٰیٰتِهٖ لَعَلَّكُمْ تَعْقِلُوْنَ",
    "ثُمَّ قَسَتْ قُلُوْبُكُمْ مِّنْ بَعْدِ ذٰلِكَ فَهِیَ كَالْحِجَارَةِ اَوْ اَشَدُّ قَسْوَةً وَاِنَّ مِنَ الْحِجَارَةِ لَمَا یَتَفَجَّرُ مِنْهُ الْاَنْهٰرُ وَاِنَّ مِنْهَا لَمَا یَشَّقَّقُ فَیَخْرُجُ مِنْهُ الْمَآءُ وَاِنَّ مِنْهَا لَمَا یَهْبِطُ مِنْ خَشْیَةِ اللّٰهِ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ",
    "اَفَتَطْمَعُوْنَ اَنْ یُّؤْمِنُوْا لَكُمْ وَقَدْ كَانَ فَرِیْقٌ مِّنْهُمْ یَسْمَعُوْنَ كَلٰمَ اللّٰهِ ثُمَّ یُحَرِّفُوْنَهٗ مِنْ بَعْدِ مَا عَقَلُوْهُ وَهُمْ یَعْلَمُوْنَ",
    "وَاِذَا لَقُوا الَّذِیْنَ اٰمَنُوْا قَالُوْۤا اٰمَنَّا وَاِذَا خَلَا بَعْضُهُمْ اِلٰی بَعْضٍ قَالُوْۤا اَتُحَدِّثُوْنَهُمْ بِمَا فَتَحَ اللّٰهُ عَلَیْكُمْ لِیُحَآجُّوْكُمْ بِهٖ عِنْدَ رَبِّكُمْ اَفَلَا تَعْقِلُوْنَ",
    "اَوَلَا یَعْلَمُوْنَ اَنَّ اللّٰهَ یَعْلَمُ مَا یُسِرُّوْنَ وَمَا یُعْلِنُوْنَ",
    "وَمِنْهُمْ اُمِّیُّوْنَ لَا یَعْلَمُوْنَ الْكِتٰبَ اِلَّاۤ اَمَانِیَّ وَاِنْ هُمْ اِلَّا یَظُنُّوْنَ",
    "فَوَیْلٌ لِّلَّذِیْنَ یَكْتُبُوْنَ الْكِتٰبَ بِاَیْدِیْهِمْ ثُمَّ یَقُوْلُوْنَ هٰذَا مِنْ عِنْدِ اللّٰهِ لِیَشْتَرُوْا بِهٖ ثَمَنًا قَلِیْلًا فَوَیْلٌ لَّهُمْ مِّمَّا كَتَبَتْ اَیْدِیْهِمْ وَوَیْلٌ لَّهُمْ مِّمَّا یَكْسِبُوْنَ",
    "وَقَالُوْا لَنْ تَمَسَّنَا النَّارُ اِلَّاۤ اَیَّامًا مَّعْدُوْدَةً قُلْ اَتَّخَذْتُمْ عِنْدَ اللّٰهِ عَهْدًا فَلَنْ یُّخْلِفَ اللّٰهُ عَهْدَهٗۤ اَمْ تَقُوْلُوْنَ عَلَی اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "بَلٰی مَنْ كَسَبَ سَیِّئَةً وَّاَحَاطَتْ بِهٖ خَطِیْٓـَٔتُهٗ فَاُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "وَالَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ اُولٰٓىِٕكَ اَصْحٰبُ الْجَنَّةِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "وَاِذْ اَخَذْنَا مِیْثَاقَ بَنِیْۤ اِسْرَآءِیْلَ لَا تَعْبُدُوْنَ اِلَّا اللّٰهَ ۫ وَبِالْوَالِدَیْنِ اِحْسَانًا وَّذِی الْقُرْبٰی وَالْیَتٰمٰی وَالْمَسٰكِیْنِ وَقُوْلُوْا لِلنَّاسِ حُسْنًا وَّاَقِیْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ ثُمَّ تَوَلَّیْتُمْ اِلَّا قَلِیْلًا مِّنْكُمْ وَاَنْتُمْ مُّعْرِضُوْنَ",
    "وَاِذْ اَخَذْنَا مِیْثَاقَكُمْ لَا تَسْفِكُوْنَ دِمَآءَكُمْ وَلَا تُخْرِجُوْنَ اَنْفُسَكُمْ مِّنْ دِیَارِكُمْ ثُمَّ اَقْرَرْتُمْ وَاَنْتُمْ تَشْهَدُوْنَ",
    "ثُمَّ اَنْتُمْ هٰۤؤُلَآءِ تَقْتُلُوْنَ اَنْفُسَكُمْ وَتُخْرِجُوْنَ فَرِیْقًا مِّنْكُمْ مِّنْ دِیَارِهِمْ تَظٰهَرُوْنَ عَلَیْهِمْ بِالْاِثْمِ وَالْعُدْوَانِ وَاِنْ یَّاْتُوْكُمْ اُسٰرٰی تُفٰدُوْهُمْ وَهُوَ مُحَرَّمٌ عَلَیْكُمْ اِخْرَاجُهُمْ اَفَتُؤْمِنُوْنَ بِبَعْضِ الْكِتٰبِ وَتَكْفُرُوْنَ بِبَعْضٍ فَمَا جَزَآءُ مَنْ یَّفْعَلُ ذٰلِكَ مِنْكُمْ اِلَّا خِزْیٌ فِی الْحَیٰوةِ الدُّنْیَا وَیَوْمَ الْقِیٰمَةِ یُرَدُّوْنَ اِلٰۤی اَشَدِّ الْعَذَابِ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ",
    "اُولٰٓىِٕكَ الَّذِیْنَ اشْتَرَوُا الْحَیٰوةَ الدُّنْیَا بِالْاٰخِرَةِ فَلَا یُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ یُنْصَرُوْنَ",
    "وَلَقَدْ اٰتَیْنَا مُوْسَی الْكِتٰبَ وَقَفَّیْنَا مِنْ بَعْدِهٖ بِالرُّسُلِ وَاٰتَیْنَا عِیْسَی ابْنَ مَرْیَمَ الْبَیِّنٰتِ وَاَیَّدْنٰهُ بِرُوْحِ الْقُدُسِ اَفَكُلَّمَا جَآءَكُمْ رَسُوْلٌۢ بِمَا لَا تَهْوٰۤی اَنْفُسُكُمُ اسْتَكْبَرْتُمْ فَفَرِیْقًا كَذَّبْتُمْ وَفَرِیْقًا تَقْتُلُوْنَ",
    "وَقَالُوْا قُلُوْبُنَا غُلْفٌ بَلْ لَّعَنَهُمُ اللّٰهُ بِكُفْرِهِمْ فَقَلِیْلًا مَّا یُؤْمِنُوْنَ",
    "وَلَمَّا جَآءَهُمْ كِتٰبٌ مِّنْ عِنْدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمْ وَكَانُوْا مِنْ قَبْلُ یَسْتَفْتِحُوْنَ عَلَی الَّذِیْنَ كَفَرُوْا فَلَمَّا جَآءَهُمْ مَّا عَرَفُوْا كَفَرُوْا بِهٖ فَلَعْنَةُ اللّٰهِ عَلَی الْكٰفِرِیْنَ",
    "بِئْسَمَا اشْتَرَوْا بِهٖۤ اَنْفُسَهُمْ اَنْ یَّكْفُرُوْا بِمَاۤ اَنْزَلَ اللّٰهُ بَغْیًا اَنْ یُّنَزِّلَ اللّٰهُ مِنْ فَضْلِهٖ عَلٰی مَنْ یَّشَآءُ مِنْ عِبَادِهٖ فَبَآءُوْ بِغَضَبٍ عَلٰی غَضَبٍ وَلِلْكٰفِرِیْنَ عَذَابٌ مُّهِیْنٌ",
    "وَاِذَا قِیْلَ لَهُمْ اٰمِنُوْا بِمَاۤ اَنْزَلَ اللّٰهُ قَالُوْا نُؤْمِنُ بِمَاۤ اُنْزِلَ عَلَیْنَا وَیَكْفُرُوْنَ بِمَا وَرَآءَهٗ وَهُوَ الْحَقُّ مُصَدِّقًا لِّمَا مَعَهُمْ قُلْ فَلِمَ تَقْتُلُوْنَ اَنْۢبِیَآءَ اللّٰهِ مِنْ قَبْلُ اِنْ كُنْتُمْ مُّؤْمِنِیْنَ",
    "وَلَقَدْ جَآءَكُمْ مُّوْسٰی بِالْبَیِّنٰتِ ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِنْ بَعْدِهٖ وَاَنْتُمْ ظٰلِمُوْنَ",
    "وَاِذْ اَخَذْنَا مِیْثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّوْرَ خُذُوْا مَاۤ اٰتَیْنٰكُمْ بِقُوَّةٍ وَّاسْمَعُوْا قَالُوْا سَمِعْنَا وَعَصَیْنَا وَاُشْرِبُوْا فِیْ قُلُوْبِهِمُ الْعِجْلَ بِكُفْرِهِمْ قُلْ بِئْسَمَا یَاْمُرُكُمْ بِهٖۤ اِیْمَانُكُمْ اِنْ كُنْتُمْ مُّؤْمِنِیْنَ",
    "قُلْ اِنْ كَانَتْ لَكُمُ الدَّارُ الْاٰخِرَةُ عِنْدَ اللّٰهِ خَالِصَةً مِّنْ دُوْنِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "وَلَنْ یَّتَمَنَّوْهُ اَبَدًا بِمَا قَدَّمَتْ اَیْدِیْهِمْ وَاللّٰهُ عَلِیْمٌۢ بِالظّٰلِمِیْنَ",
    "وَلَتَجِدَنَّهُمْ اَحْرَصَ النَّاسِ عَلٰی حَیٰوةٍ وَمِنَ الَّذِیْنَ اَشْرَكُوْا یَوَدُّ اَحَدُهُمْ لَوْ یُعَمَّرُ اَلْفَ سَنَةٍ وَمَا هُوَ بِمُزَحْزِحِهٖ مِنَ الْعَذَابِ اَنْ یُّعَمَّرَ وَاللّٰهُ بَصِیْرٌ بِمَا یَعْمَلُوْنَ",
    "قُلْ مَنْ كَانَ عَدُوًّا لِّجِبْرِیْلَ فَاِنَّهٗ نَزَّلَهٗ عَلٰی قَلْبِكَ بِاِذْنِ اللّٰهِ مُصَدِّقًا لِّمَا بَیْنَ یَدَیْهِ وَهُدًی وَّبُشْرٰی لِلْمُؤْمِنِیْنَ",
    "مَنْ كَانَ عَدُوًّا لِّلّٰهِ وَمَلٰٓىِٕكَتِهٖ وَرُسُلِهٖ وَجِبْرِیْلَ وَمِیْكٰىلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلْكٰفِرِیْنَ",
    "وَلَقَدْ اَنْزَلْنَاۤ اِلَیْكَ اٰیٰتٍۢ بَیِّنٰتٍ وَمَا یَكْفُرُ بِهَاۤ اِلَّا الْفٰسِقُوْنَ",
    "اَوَكُلَّمَا عٰهَدُوْا عَهْدًا نَّبَذَهٗ فَرِیْقٌ مِّنْهُمْ بَلْ اَكْثَرُهُمْ لَا یُؤْمِنُوْنَ",
    "وَلَمَّا جَآءَهُمْ رَسُوْلٌ مِّنْ عِنْدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمْ نَبَذَ فَرِیْقٌ مِّنَ الَّذِیْنَ اُوْتُوا الْكِتٰبَ كِتٰبَ اللّٰهِ وَرَآءَ ظُهُوْرِهِمْ كَاَنَّهُمْ لَا یَعْلَمُوْنَ",
    "وَاتَّبَعُوْا مَا تَتْلُوا الشَّیٰطِیْنُ عَلٰی مُلْكِ سُلَیْمٰنَ وَمَا كَفَرَ سُلَیْمٰنُ وَلٰكِنَّ الشَّیٰطِیْنَ كَفَرُوْا یُعَلِّمُوْنَ النَّاسَ السِّحْرَ وَمَاۤ اُنْزِلَ عَلَی الْمَلَكَیْنِ بِبَابِلَ هَارُوْتَ وَمَارُوْتَ وَمَا یُعَلِّمٰنِ مِنْ اَحَدٍ حَتّٰی یَقُوْلَاۤ اِنَّمَا نَحْنُ فِتْنَةٌ فَلَا تَكْفُرْ فَیَتَعَلَّمُوْنَ مِنْهُمَا مَا یُفَرِّقُوْنَ بِهٖ بَیْنَ الْمَرْءِ وَزَوْجِهٖ وَمَا هُمْ بِضَآرِّیْنَ بِهٖ مِنْ اَحَدٍ اِلَّا بِاِذْنِ اللّٰهِ وَیَتَعَلَّمُوْنَ مَا یَضُرُّهُمْ وَلَا یَنْفَعُهُمْ وَلَقَدْ عَلِمُوْا لَمَنِ اشْتَرٰىهُ مَا لَهٗ فِی الْاٰخِرَةِ مِنْ خَلَاقٍ ۫ وَلَبِئْسَ مَا شَرَوْا بِهٖۤ اَنْفُسَهُمْ لَوْ كَانُوْا یَعْلَمُوْنَ",
    "وَلَوْ اَنَّهُمْ اٰمَنُوْا وَاتَّقَوْا لَمَثُوْبَةٌ مِّنْ عِنْدِ اللّٰهِ خَیْرٌ لَوْ كَانُوْا یَعْلَمُوْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا تَقُوْلُوْا رَاعِنَا وَقُوْلُوا انْظُرْنَا وَاسْمَعُوْا وَلِلْكٰفِرِیْنَ عَذَابٌ اَلِیْمٌ",
    "مَا یَوَدُّ الَّذِیْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ وَلَا الْمُشْرِكِیْنَ اَنْ یُّنَزَّلَ عَلَیْكُمْ مِّنْ خَیْرٍ مِّنْ رَّبِّكُمْ وَاللّٰهُ یَخْتَصُّ بِرَحْمَتِهٖ مَنْ یَّشَآءُ وَاللّٰهُ ذُو الْفَضْلِ الْعَظِیْمِ",
    "مَا نَنْسَخْ مِنْ اٰیَةٍ اَوْ نُنْسِهَا نَاْتِ بِخَیْرٍ مِّنْهَاۤ اَوْ مِثْلِهَا اَلَمْ تَعْلَمْ اَنَّ اللّٰهَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "اَلَمْ تَعْلَمْ اَنَّ اللّٰهَ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَمَا لَكُمْ مِّنْ دُوْنِ اللّٰهِ مِنْ وَّلِیٍّ وَّلَا نَصِیْرٍ",
    "اَمْ تُرِیْدُوْنَ اَنْ تَسْـَٔلُوْا رَسُوْلَكُمْ كَمَا سُىِٕلَ مُوْسٰی مِنْ قَبْلُ وَمَنْ یَّتَبَدَّلِ الْكُفْرَ بِالْاِیْمَانِ فَقَدْ ضَلَّ سَوَآءَ السَّبِیْلِ",
    "وَدَّ كَثِیْرٌ مِّنْ اَهْلِ الْكِتٰبِ لَوْ یَرُدُّوْنَكُمْ مِّنْ بَعْدِ اِیْمَانِكُمْ كُفَّارًا حَسَدًا مِّنْ عِنْدِ اَنْفُسِهِمْ مِّنْ بَعْدِ مَا تَبَیَّنَ لَهُمُ الْحَقُّ فَاعْفُوْا وَاصْفَحُوْا حَتّٰی یَاْتِیَ اللّٰهُ بِاَمْرِهٖ اِنَّ اللّٰهَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "وَاَقِیْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَمَا تُقَدِّمُوْا لِاَنْفُسِكُمْ مِّنْ خَیْرٍ تَجِدُوْهُ عِنْدَ اللّٰهِ اِنَّ اللّٰهَ بِمَا تَعْمَلُوْنَ بَصِیْرٌ",
    "وَقَالُوْا لَنْ یَّدْخُلَ الْجَنَّةَ اِلَّا مَنْ كَانَ هُوْدًا اَوْ نَصٰرٰی تِلْكَ اَمَانِیُّهُمْ قُلْ هَاتُوْا بُرْهَانَكُمْ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "بَلٰی مَنْ اَسْلَمَ وَجْهَهٗ لِلّٰهِ وَهُوَ مُحْسِنٌ فَلَهٗۤ اَجْرُهٗ عِنْدَ رَبِّهٖ وَلَا خَوْفٌ عَلَیْهِمْ وَلَا هُمْ یَحْزَنُوْنَ",
    "وَقَالَتِ الْیَهُوْدُ لَیْسَتِ النَّصٰرٰی عَلٰی شَیْءٍ وَّقَالَتِ النَّصٰرٰی لَیْسَتِ الْیَهُوْدُ عَلٰی شَیْءٍ وَّهُمْ یَتْلُوْنَ الْكِتٰبَ كَذٰلِكَ قَالَ الَّذِیْنَ لَا یَعْلَمُوْنَ مِثْلَ قَوْلِهِمْ فَاللّٰهُ یَحْكُمُ بَیْنَهُمْ یَوْمَ الْقِیٰمَةِ فِیْمَا كَانُوْا فِیْهِ یَخْتَلِفُوْنَ",
    "وَمَنْ اَظْلَمُ مِمَّنْ مَّنَعَ مَسٰجِدَ اللّٰهِ اَنْ یُّذْكَرَ فِیْهَا اسْمُهٗ وَسَعٰی فِیْ خَرَابِهَا اُولٰٓىِٕكَ مَا كَانَ لَهُمْ اَنْ یَّدْخُلُوْهَاۤ اِلَّا خَآىِٕفِیْنَ لَهُمْ فِی الدُّنْیَا خِزْیٌ وَّلَهُمْ فِی الْاٰخِرَةِ عَذَابٌ عَظِیْمٌ",
    "وَلِلّٰهِ الْمَشْرِقُ وَالْمَغْرِبُ فَاَیْنَمَا تُوَلُّوْا فَثَمَّ وَجْهُ اللّٰهِ اِنَّ اللّٰهَ وَاسِعٌ عَلِیْمٌ",
    "وَقَالُوا اتَّخَذَ اللّٰهُ وَلَدًا سُبْحٰنَهٗ بَلْ لَّهٗ مَا فِی السَّمٰوٰتِ وَالْاَرْضِ كُلٌّ لَّهٗ قٰنِتُوْنَ",
    "بَدِیْعُ السَّمٰوٰتِ وَالْاَرْضِ وَاِذَا قَضٰۤی اَمْرًا فَاِنَّمَا یَقُوْلُ لَهٗ كُنْ فَیَكُوْنُ",
    "وَقَالَ الَّذِیْنَ لَا یَعْلَمُوْنَ لَوْلَا یُكَلِّمُنَا اللّٰهُ اَوْ تَاْتِیْنَاۤ اٰیَةٌ كَذٰلِكَ قَالَ الَّذِیْنَ مِنْ قَبْلِهِمْ مِّثْلَ قَوْلِهِمْ تَشَابَهَتْ قُلُوْبُهُمْ قَدْ بَیَّنَّا الْاٰیٰتِ لِقَوْمٍ یُّوْقِنُوْنَ",
    "اِنَّاۤ اَرْسَلْنٰكَ بِالْحَقِّ بَشِیْرًا وَّنَذِیْرًا وَّلَا تُسْـَٔلُ عَنْ اَصْحٰبِ الْجَحِیْمِ",
    "وَلَنْ تَرْضٰی عَنْكَ الْیَهُوْدُ وَلَا النَّصٰرٰی حَتّٰی تَتَّبِعَ مِلَّتَهُمْ قُلْ اِنَّ هُدَی اللّٰهِ هُوَ الْهُدٰی وَلَىِٕنِ اتَّبَعْتَ اَهْوَآءَهُمْ بَعْدَ الَّذِیْ جَآءَكَ مِنَ الْعِلْمِ مَا لَكَ مِنَ اللّٰهِ مِنْ وَّلِیٍّ وَّلَا نَصِیْرٍ",
    "اَلَّذِیْنَ اٰتَیْنٰهُمُ الْكِتٰبَ یَتْلُوْنَهٗ حَقَّ تِلَاوَتِهٖ اُولٰٓىِٕكَ یُؤْمِنُوْنَ بِهٖ وَمَنْ یَّكْفُرْ بِهٖ فَاُولٰٓىِٕكَ هُمُ الْخٰسِرُوْنَ",
    "یٰبَنِیْۤ اِسْرَآءِیْلَ اذْكُرُوْا نِعْمَتِیَ الَّتِیْۤ اَنْعَمْتُ عَلَیْكُمْ وَاَنِّیْ فَضَّلْتُكُمْ عَلَی الْعٰلَمِیْنَ",
    "وَاتَّقُوْا یَوْمًا لَّا تَجْزِیْ نَفْسٌ عَنْ نَّفْسٍ شَیْـًٔا وَّلَا یُقْبَلُ مِنْهَا عَدْلٌ وَّلَا تَنْفَعُهَا شَفَاعَةٌ وَّلَا هُمْ یُنْصَرُوْنَ",
    "وَاِذِ ابْتَلٰۤی اِبْرٰهٖمَ رَبُّهٗ بِكَلِمٰتٍ فَاَتَمَّهُنَّ قَالَ اِنِّیْ جَاعِلُكَ لِلنَّاسِ اِمَامًا قَالَ وَمِنْ ذُرِّیَّتِیْ قَالَ لَا یَنَالُ عَهْدِی الظّٰلِمِیْنَ",
    "وَاِذْ جَعَلْنَا الْبَیْتَ مَثَابَةً لِّلنَّاسِ وَاَمْنًا وَاتَّخِذُوْا مِنْ مَّقَامِ اِبْرٰهٖمَ مُصَلًّی وَعَهِدْنَاۤ اِلٰۤی اِبْرٰهٖمَ وَاِسْمٰعِیْلَ اَنْ طَهِّرَا بَیْتِیَ لِلطَّآىِٕفِیْنَ وَالْعٰكِفِیْنَ وَالرُّكَّعِ السُّجُوْدِ",
    "وَاِذْ قَالَ اِبْرٰهٖمُ رَبِّ اجْعَلْ هٰذَا بَلَدًا اٰمِنًا وَّارْزُقْ اَهْلَهٗ مِنَ الثَّمَرٰتِ مَنْ اٰمَنَ مِنْهُمْ بِاللّٰهِ وَالْیَوْمِ الْاَخِرِ قَالَ وَمَنْ كَفَرَ فَاُمَتِّعُهٗ قَلِیْلًا ثُمَّ اَضْطَرُّهٗۤ اِلٰی عَذَابِ النَّارِ وَبِئْسَ الْمَصِیْرُ",
    "وَاِذْ یَرْفَعُ اِبْرٰهٖمُ الْقَوَاعِدَ مِنَ الْبَیْتِ وَاِسْمٰعِیْلُ رَبَّنَا تَقَبَّلْ مِنَّا اِنَّكَ اَنْتَ السَّمِیْعُ الْعَلِیْمُ",
    "رَبَّنَا وَاجْعَلْنَا مُسْلِمَیْنِ لَكَ وَمِنْ ذُرِّیَّتِنَاۤ اُمَّةً مُّسْلِمَةً لَّكَ وَاَرِنَا مَنَاسِكَنَا وَتُبْ عَلَیْنَا اِنَّكَ اَنْتَ التَّوَّابُ الرَّحِیْمُ",
    "رَبَّنَا وَابْعَثْ فِیْهِمْ رَسُوْلًا مِّنْهُمْ یَتْلُوْا عَلَیْهِمْ اٰیٰتِكَ وَیُعَلِّمُهُمُ الْكِتٰبَ وَالْحِكْمَةَ وَیُزَكِّیْهِمْ اِنَّكَ اَنْتَ الْعَزِیْزُ الْحَكِیْمُ",
    "وَمَنْ یَّرْغَبُ عَنْ مِّلَّةِ اِبْرٰهٖمَ اِلَّا مَنْ سَفِهَ نَفْسَهٗ وَلَقَدِ اصْطَفَیْنٰهُ فِی الدُّنْیَا وَاِنَّهٗ فِی الْاٰخِرَةِ لَمِنَ الصّٰلِحِیْنَ",
    "اِذْ قَالَ لَهٗ رَبُّهٗۤ اَسْلِمْ قَالَ اَسْلَمْتُ لِرَبِّ الْعٰلَمِیْنَ",
    "وَوَصّٰی بِهَاۤ اِبْرٰهٖمُ بَنِیْهِ وَیَعْقُوْبُ یٰبَنِیَّ اِنَّ اللّٰهَ اصْطَفٰی لَكُمُ الدِّیْنَ فَلَا تَمُوْتُنَّ اِلَّا وَاَنْتُمْ مُّسْلِمُوْنَ",
    "اَمْ كُنْتُمْ شُهَدَآءَ اِذْ حَضَرَ یَعْقُوْبَ الْمَوْتُ اِذْ قَالَ لِبَنِیْهِ مَا تَعْبُدُوْنَ مِنْ بَعْدِیْ قَالُوْا نَعْبُدُ اِلٰهَكَ وَاِلٰهَ اٰبَآىِٕكَ اِبْرٰهٖمَ وَاِسْمٰعِیْلَ وَاِسْحٰقَ اِلٰهًا وَّاحِدًا وَّنَحْنُ لَهٗ مُسْلِمُوْنَ",
    "تِلْكَ اُمَّةٌ قَدْ خَلَتْ لَهَا مَا كَسَبَتْ وَلَكُمْ مَّا كَسَبْتُمْ وَلَا تُسْـَٔلُوْنَ عَمَّا كَانُوْا یَعْمَلُوْنَ",
    "وَقَالُوْا كُوْنُوْا هُوْدًا اَوْ نَصٰرٰی تَهْتَدُوْا قُلْ بَلْ مِلَّةَ اِبْرٰهٖمَ حَنِیْفًا وَمَا كَانَ مِنَ الْمُشْرِكِیْنَ",
    "قُوْلُوْۤا اٰمَنَّا بِاللّٰهِ وَمَاۤ اُنْزِلَ اِلَیْنَا وَمَاۤ اُنْزِلَ اِلٰۤی اِبْرٰهٖمَ وَاِسْمٰعِیْلَ وَاِسْحٰقَ وَیَعْقُوْبَ وَالْاَسْبَاطِ وَمَاۤ اُوْتِیَ مُوْسٰی وَعِیْسٰی وَمَاۤ اُوْتِیَ النَّبِیُّوْنَ مِنْ رَّبِّهِمْ لَا نُفَرِّقُ بَیْنَ اَحَدٍ مِّنْهُمْ وَنَحْنُ لَهٗ مُسْلِمُوْنَ",
    "فَاِنْ اٰمَنُوْا بِمِثْلِ مَاۤ اٰمَنْتُمْ بِهٖ فَقَدِ اهْتَدَوْا وَاِنْ تَوَلَّوْا فَاِنَّمَا هُمْ فِیْ شِقَاقٍ فَسَیَكْفِیْكَهُمُ اللّٰهُ وَهُوَ السَّمِیْعُ الْعَلِیْمُ",
    "صِبْغَةَ اللّٰهِ وَمَنْ اَحْسَنُ مِنَ اللّٰهِ صِبْغَةً وَّنَحْنُ لَهٗ عٰبِدُوْنَ",
    "قُلْ اَتُحَآجُّوْنَنَا فِی اللّٰهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَاۤ اَعْمَالُنَا وَلَكُمْ اَعْمَالُكُمْ وَنَحْنُ لَهٗ مُخْلِصُوْنَ",
    "اَمْ تَقُوْلُوْنَ اِنَّ اِبْرٰهٖمَ وَاِسْمٰعِیْلَ وَاِسْحٰقَ وَیَعْقُوْبَ وَالْاَسْبَاطَ كَانُوْا هُوْدًا اَوْ نَصٰرٰی قُلْ ءَاَنْتُمْ اَعْلَمُ اَمِ اللّٰهُ وَمَنْ اَظْلَمُ مِمَّنْ كَتَمَ شَهَادَةً عِنْدَهٗ مِنَ اللّٰهِ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ",
    "تِلْكَ اُمَّةٌ قَدْ خَلَتْ لَهَا مَا كَسَبَتْ وَلَكُمْ مَّا كَسَبْتُمْ وَلَا تُسْـَٔلُوْنَ عَمَّا كَانُوْا یَعْمَلُوْنَ",
    "سَیَقُوْلُ السُّفَهَآءُ مِنَ النَّاسِ مَا وَلّٰىهُمْ عَنْ قِبْلَتِهِمُ الَّتِیْ كَانُوْا عَلَیْهَا قُلْ لِّلّٰهِ الْمَشْرِقُ وَالْمَغْرِبُ یَهْدِیْ مَنْ یَّشَآءُ اِلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "وَكَذٰلِكَ جَعَلْنٰكُمْ اُمَّةً وَّسَطًا لِّتَكُوْنُوْا شُهَدَآءَ عَلَی النَّاسِ وَیَكُوْنَ الرَّسُوْلُ عَلَیْكُمْ شَهِیْدًا وَمَا جَعَلْنَا الْقِبْلَةَ الَّتِیْ كُنْتَ عَلَیْهَاۤ اِلَّا لِنَعْلَمَ مَنْ یَّتَّبِعُ الرَّسُوْلَ مِمَّنْ یَّنْقَلِبُ عَلٰی عَقِبَیْهِ وَاِنْ كَانَتْ لَكَبِیْرَةً اِلَّا عَلَی الَّذِیْنَ هَدَی اللّٰهُ وَمَا كَانَ اللّٰهُ لِیُضِیْعَ اِیْمَانَكُمْ اِنَّ اللّٰهَ بِالنَّاسِ لَرَءُوْفٌ رَّحِیْمٌ",
    "قَدْ نَرٰی تَقَلُّبَ وَجْهِكَ فِی السَّمَآءِ فَلَنُوَلِّیَنَّكَ قِبْلَةً تَرْضٰىهَا فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ وَحَیْثُ مَا كُنْتُمْ فَوَلُّوْا وُجُوْهَكُمْ شَطْرَهٗ وَاِنَّ الَّذِیْنَ اُوْتُوا الْكِتٰبَ لَیَعْلَمُوْنَ اَنَّهُ الْحَقُّ مِنْ رَّبِّهِمْ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا یَعْمَلُوْنَ",
    "وَلَىِٕنْ اَتَیْتَ الَّذِیْنَ اُوْتُوا الْكِتٰبَ بِكُلِّ اٰیَةٍ مَّا تَبِعُوْا قِبْلَتَكَ وَمَاۤ اَنْتَ بِتَابِعٍ قِبْلَتَهُمْ وَمَا بَعْضُهُمْ بِتَابِعٍ قِبْلَةَ بَعْضٍ وَلَىِٕنِ اتَّبَعْتَ اَهْوَآءَهُمْ مِّنْ بَعْدِ مَا جَآءَكَ مِنَ الْعِلْمِ اِنَّكَ اِذًا لَّمِنَ الظّٰلِمِیْنَ",
    "اَلَّذِیْنَ اٰتَیْنٰهُمُ الْكِتٰبَ یَعْرِفُوْنَهٗ كَمَا یَعْرِفُوْنَ اَبْنَآءَهُمْ وَاِنَّ فَرِیْقًا مِّنْهُمْ لَیَكْتُمُوْنَ الْحَقَّ وَهُمْ یَعْلَمُوْنَ",
    "اَلْحَقُّ مِنْ رَّبِّكَ فَلَا تَكُوْنَنَّ مِنَ الْمُمْتَرِیْنَ",
    "وَلِكُلٍّ وِّجْهَةٌ هُوَ مُوَلِّیْهَا فَاسْتَبِقُوْا الْخَیْرٰتِ اَیْنَ مَا تَكُوْنُوْا یَاْتِ بِكُمُ اللّٰهُ جَمِیْعًا اِنَّ اللّٰهَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "وَمِنْ حَیْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ وَاِنَّهٗ لَلْحَقُّ مِنْ رَّبِّكَ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ",
    "وَمِنْ حَیْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ وَحَیْثُ مَا كُنْتُمْ فَوَلُّوْا وُجُوْهَكُمْ شَطْرَهٗ لِئَلَّا یَكُوْنَ لِلنَّاسِ عَلَیْكُمْ حُجَّةٌ اِلَّا الَّذِیْنَ ظَلَمُوْا مِنْهُمْ فَلَا تَخْشَوْهُمْ وَاخْشَوْنِیْ وَلِاُتِمَّ نِعْمَتِیْ عَلَیْكُمْ وَلَعَلَّكُمْ تَهْتَدُوْنَ",
    "كَمَاۤ اَرْسَلْنَا فِیْكُمْ رَسُوْلًا مِّنْكُمْ یَتْلُوْا عَلَیْكُمْ اٰیٰتِنَا وَیُزَكِّیْكُمْ وَیُعَلِّمُكُمُ الْكِتٰبَ وَالْحِكْمَةَ وَیُعَلِّمُكُمْ مَّا لَمْ تَكُوْنُوْا تَعْلَمُوْنَ",
    "فَاذْكُرُوْنِیْۤ اَذْكُرْكُمْ وَاشْكُرُوْا لِیْ وَلَا تَكْفُرُوْنِ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوا اسْتَعِیْنُوْا بِالصَّبْرِ وَالصَّلٰوةِ اِنَّ اللّٰهَ مَعَ الصّٰبِرِیْنَ",
    "وَلَا تَقُوْلُوْا لِمَنْ یُّقْتَلُ فِیْ سَبِیْلِ اللّٰهِ اَمْوَاتٌ بَلْ اَحْیَآءٌ وَّلٰكِنْ لَّا تَشْعُرُوْنَ",
    "وَلَنَبْلُوَنَّكُمْ بِشَیْءٍ مِّنَ الْخَوْفِ وَالْجُوْعِ وَنَقْصٍ مِّنَ الْاَمْوَالِ وَالْاَنْفُسِ وَالثَّمَرٰتِ وَبَشِّرِ الصّٰبِرِیْنَ",
    "الَّذِیْنَ اِذَاۤ اَصَابَتْهُمْ مُّصِیْبَةٌ قَالُوْۤا اِنَّا لِلّٰهِ وَاِنَّاۤ اِلَیْهِ رٰجِعُوْنَ",
    "اُولٰٓىِٕكَ عَلَیْهِمْ صَلَوٰتٌ مِّنْ رَّبِّهِمْ وَرَحْمَةٌ ۫ وَاُولٰٓىِٕكَ هُمُ الْمُهْتَدُوْنَ",
    "اِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَآىِٕرِ اللّٰهِ فَمَنْ حَجَّ الْبَیْتَ اَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَیْهِ اَنْ یَّطَّوَّفَ بِهِمَا وَمَنْ تَطَوَّعَ خَیْرًا فَاِنَّ اللّٰهَ شَاكِرٌ عَلِیْمٌ",
    "اِنَّ الَّذِیْنَ یَكْتُمُوْنَ مَاۤ اَنْزَلْنَا مِنَ الْبَیِّنٰتِ وَالْهُدٰی مِنْ بَعْدِ مَا بَیَّنّٰهُ لِلنَّاسِ فِی الْكِتٰبِ اُولٰٓىِٕكَ یَلْعَنُهُمُ اللّٰهُ وَیَلْعَنُهُمُ اللّٰعِنُوْنَ",
    "اِلَّا الَّذِیْنَ تَابُوْا وَاَصْلَحُوْا وَبَیَّنُوْا فَاُولٰٓىِٕكَ اَتُوْبُ عَلَیْهِمْ وَاَنَا التَّوَّابُ الرَّحِیْمُ",
    "اِنَّ الَّذِیْنَ كَفَرُوْا وَمَاتُوْا وَهُمْ كُفَّارٌ اُولٰٓىِٕكَ عَلَیْهِمْ لَعْنَةُ اللّٰهِ وَالْمَلٰٓىِٕكَةِ وَالنَّاسِ اَجْمَعِیْنَ",
    "خٰلِدِیْنَ فِیْهَا لَا یُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ یُنْظَرُوْنَ",
    "وَاِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ لَاۤ اِلٰهَ اِلَّا هُوَ الرَّحْمٰنُ الرَّحِیْمُ",
    "اِنَّ فِیْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِ وَاخْتِلَافِ الَّیْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِیْ تَجْرِیْ فِی الْبَحْرِ بِمَا یَنْفَعُ النَّاسَ وَمَاۤ اَنْزَلَ اللّٰهُ مِنَ السَّمَآءِ مِنْ مَّآءٍ فَاَحْیَا بِهِ الْاَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِیْهَا مِنْ كُلِّ دَآبَّةٍ وَّتَصْرِیْفِ الرِّیٰحِ وَالسَّحَابِ الْمُسَخَّرِ بَیْنَ السَّمَآءِ وَالْاَرْضِ لَاٰیٰتٍ لِّقَوْمٍ یَّعْقِلُوْنَ",
    "وَمِنَ النَّاسِ مَنْ یَّتَّخِذُ مِنْ دُوْنِ اللّٰهِ اَنْدَادًا یُّحِبُّوْنَهُمْ كَحُبِّ اللّٰهِ وَالَّذِیْنَ اٰمَنُوْۤا اَشَدُّ حُبًّا لِّلّٰهِ وَلَوْ یَرَی الَّذِیْنَ ظَلَمُوْۤا اِذْ یَرَوْنَ الْعَذَابَ اَنَّ الْقُوَّةَ لِلّٰهِ جَمِیْعًا وَّاَنَّ اللّٰهَ شَدِیْدُ الْعَذَابِ",
    "اِذْ تَبَرَّاَ الَّذِیْنَ اتُّبِعُوْا مِنَ الَّذِیْنَ اتَّبَعُوْا وَرَاَوُا الْعَذَابَ وَتَقَطَّعَتْ بِهِمُ الْاَسْبَابُ",
    "وَقَالَ الَّذِیْنَ اتَّبَعُوْا لَوْ اَنَّ لَنَا كَرَّةً فَنَتَبَرَّاَ مِنْهُمْ كَمَا تَبَرَّءُوْا مِنَّا كَذٰلِكَ یُرِیْهِمُ اللّٰهُ اَعْمَالَهُمْ حَسَرٰتٍ عَلَیْهِمْ وَمَا هُمْ بِخٰرِجِیْنَ مِنَ النَّارِ",
    "یٰۤاَیُّهَا النَّاسُ كُلُوْا مِمَّا فِی الْاَرْضِ حَلٰلًا طَیِّبًا وَّلَا تَتَّبِعُوْا خُطُوٰتِ الشَّیْطٰنِ اِنَّهٗ لَكُمْ عَدُوٌّ مُّبِیْنٌ",
    "اِنَّمَا یَاْمُرُكُمْ بِالسُّوْٓءِ وَالْفَحْشَآءِ وَاَنْ تَقُوْلُوْا عَلَی اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "وَاِذَا قِیْلَ لَهُمُ اتَّبِعُوْا مَاۤ اَنْزَلَ اللّٰهُ قَالُوْا بَلْ نَتَّبِعُ مَاۤ اَلْفَیْنَا عَلَیْهِ اٰبَآءَنَا اَوَلَوْ كَانَ اٰبَآؤُهُمْ لَا یَعْقِلُوْنَ شَیْـًٔا وَّلَا یَهْتَدُوْنَ",
    "وَمَثَلُ الَّذِیْنَ كَفَرُوْا كَمَثَلِ الَّذِیْ یَنْعِقُ بِمَا لَا یَسْمَعُ اِلَّا دُعَآءً وَّنِدَآءً صُمٌّۢ بُكْمٌ عُمْیٌ فَهُمْ لَا یَعْقِلُوْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا كُلُوْا مِنْ طَیِّبٰتِ مَا رَزَقْنٰكُمْ وَاشْكُرُوْا لِلّٰهِ اِنْ كُنْتُمْ اِیَّاهُ تَعْبُدُوْنَ",
    "اِنَّمَا حَرَّمَ عَلَیْكُمُ الْمَیْتَةَ وَالدَّمَ وَلَحْمَ الْخِنْزِیْرِ وَمَاۤ اُهِلَّ بِهٖ لِغَیْرِ اللّٰهِ فَمَنِ اضْطُرَّ غَیْرَ بَاغٍ وَّلَا عَادٍ فَلَاۤ اِثْمَ عَلَیْهِ اِنَّ اللّٰهَ غَفُوْرٌ رَّحِیْمٌ",
    "اِنَّ الَّذِیْنَ یَكْتُمُوْنَ مَاۤ اَنْزَلَ اللّٰهُ مِنَ الْكِتٰبِ وَیَشْتَرُوْنَ بِهٖ ثَمَنًا قَلِیْلًا اُولٰٓىِٕكَ مَا یَاْكُلُوْنَ فِیْ بُطُوْنِهِمْ اِلَّا النَّارَ وَلَا یُكَلِّمُهُمُ اللّٰهُ یَوْمَ الْقِیٰمَةِ وَلَا یُزَكِّیْهِمْ وَلَهُمْ عَذَابٌ اَلِیْمٌ",
    "اُولٰٓىِٕكَ الَّذِیْنَ اشْتَرَوُا الضَّلٰلَةَ بِالْهُدٰی وَالْعَذَابَ بِالْمَغْفِرَةِ فَمَاۤ اَصْبَرَهُمْ عَلَی النَّارِ",
    "ذٰلِكَ بِاَنَّ اللّٰهَ نَزَّلَ الْكِتٰبَ بِالْحَقِّ وَاِنَّ الَّذِیْنَ اخْتَلَفُوْا فِی الْكِتٰبِ لَفِیْ شِقَاقٍ بَعِیْدٍ",
    "لَیْسَ الْبِرَّ اَنْ تُوَلُّوْا وُجُوْهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلٰكِنَّ الْبِرَّ مَنْ اٰمَنَ بِاللّٰهِ وَالْیَوْمِ الْاٰخِرِ وَالْمَلٰٓىِٕكَةِ وَالْكِتٰبِ وَالنَّبِیّٖنَ وَاٰتَی الْمَالَ عَلٰی حُبِّهٖ ذَوِی الْقُرْبٰی وَالْیَتٰمٰی وَالْمَسٰكِیْنَ وَابْنَ السَّبِیْلِ وَالسَّآىِٕلِیْنَ وَفِی الرِّقَابِ وَاَقَامَ الصَّلٰوةَ وَاٰتَی الزَّكٰوةَ وَالْمُوْفُوْنَ بِعَهْدِهِمْ اِذَا عٰهَدُوْا وَالصّٰبِرِیْنَ فِی الْبَاْسَآءِ وَالضَّرَّآءِ وَحِیْنَ الْبَاْسِ اُولٰٓىِٕكَ الَّذِیْنَ صَدَقُوْا وَاُولٰٓىِٕكَ هُمُ الْمُتَّقُوْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا كُتِبَ عَلَیْكُمُ الْقِصَاصُ فِی الْقَتْلٰی اَلْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ وَالْاُ بِالْاُ فَمَنْ عُفِیَ لَهٗ مِنْ اَخِیْهِ شَیْءٌ فَاتِّبَاعٌ بِالْمَعْرُوْفِ وَاَدَآءٌ اِلَیْهِ بِاِحْسَانٍ ذٰلِكَ تَخْفِیْفٌ مِّنْ رَّبِّكُمْ وَرَحْمَةٌ فَمَنِ اعْتَدٰی بَعْدَ ذٰلِكَ فَلَهٗ عَذَابٌ اَلِیْمٌ",
    "وَلَكُمْ فِی الْقِصَاصِ حَیٰوةٌ یّٰۤاُولِی الْاَلْبَابِ لَعَلَّكُمْ تَتَّقُوْنَ",
    "كُتِبَ عَلَیْكُمْ اِذَا حَضَرَ اَحَدَكُمُ الْمَوْتُ اِنْ تَرَكَ خَیْرَا ١لْوَصِیَّةُ لِلْوَالِدَیْنِ وَالْاَقْرَبِیْنَ بِالْمَعْرُوْفِ حَقًّا عَلَی الْمُتَّقِیْنَ",
    "فَمَنْ بَدَّلَهٗ بَعْدَ مَا سَمِعَهٗ فَاِنَّمَاۤ اِثْمُهٗ عَلَی الَّذِیْنَ یُبَدِّلُوْنَهٗ اِنَّ اللّٰهَ سَمِیْعٌ عَلِیْمٌ",
    "فَمَنْ خَافَ مِنْ مُّوْصٍ جَنَفًا اَوْ اِثْمًا فَاَصْلَحَ بَیْنَهُمْ فَلَاۤ اِثْمَ عَلَیْهِ اِنَّ اللّٰهَ غَفُوْرٌ رَّحِیْمٌ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا كُتِبَ عَلَیْكُمُ الصِّیَامُ كَمَا كُتِبَ عَلَی الَّذِیْنَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُوْنَ",
    "اَیَّامًا مَّعْدُوْدٰتٍ فَمَنْ كَانَ مِنْكُمْ مَّرِیْضًا اَوْ عَلٰی سَفَرٍ فَعِدَّةٌ مِّنْ اَیَّامٍ اُخَرَ وَعَلَی الَّذِیْنَ یُطِیْقُوْنَهٗ فِدْیَةٌ طَعَامُ مِسْكِیْنٍ فَمَنْ تَطَوَّعَ خَیْرًا فَهُوَ خَیْرٌ لَّهٗ وَاَنْ تَصُوْمُوْا خَیْرٌ لَّكُمْ اِنْ كُنْتُمْ تَعْلَمُوْنَ",
    "شَهْرُ رَمَضَانَ الَّذِیْۤ اُنْزِلَ فِیْهِ الْقُرْاٰنُ هُدًی لِّلنَّاسِ وَبَیِّنٰتٍ مِّنَ الْهُدٰی وَالْفُرْقَانِ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْیَصُمْهُ وَمَنْ كَانَ مَرِیْضًا اَوْ عَلٰی سَفَرٍ فَعِدَّةٌ مِّنْ اَیَّامٍ اُخَرَ یُرِیْدُ اللّٰهُ بِكُمُ الْیُسْرَ وَلَا یُرِیْدُ بِكُمُ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللّٰهَ عَلٰی مَا هَدٰىكُمْ وَلَعَلَّكُمْ تَشْكُرُوْنَ",
    "وَاِذَا سَاَلَكَ عِبَادِیْ عَنِّیْ فَاِنِّیْ قَرِیْبٌ اُجِیْبُ دَعْوَةَ الدَّاعِ اِذَا دَعَانِ فَلْیَسْتَجِیْبُوْا لِیْ وَلْیُؤْمِنُوْا بِیْ لَعَلَّهُمْ یَرْشُدُوْنَ",
    "اُحِلَّ لَكُمْ لَیْلَةَ الصِّیَامِ الرَّفَثُ اِلٰی نِسَآىِٕكُمْ هُنَّ لِبَاسٌ لَّكُمْ وَاَنْتُمْ لِبَاسٌ لَّهُنَّ عَلِمَ اللّٰهُ اَنَّكُمْ كُنْتُمْ تَخْتَانُوْنَ اَنْفُسَكُمْ فَتَابَ عَلَیْكُمْ وَعَفَا عَنْكُمْ فَالْـٰٔنَ بَاشِرُوْهُنَّ وَابْتَغُوْا مَا كَتَبَ اللّٰهُ لَكُمْ وَكُلُوْا وَاشْرَبُوْا حَتّٰی یَتَبَیَّنَ لَكُمُ الْخَیْطُ الْاَبْیَضُ مِنَ الْخَیْطِ الْاَسْوَدِ مِنَ الْفَجْرِ ثُمَّ اَتِمُّوا الصِّیَامَ اِلَی الَّیْلِ وَلَا تُبَاشِرُوْهُنَّ وَاَنْتُمْ عٰكِفُوْنَ فِی الْمَسٰجِدِ تِلْكَ حُدُوْدُ اللّٰهِ فَلَا تَقْرَبُوْهَا كَذٰلِكَ یُبَیِّنُ اللّٰهُ اٰیٰتِهٖ لِلنَّاسِ لَعَلَّهُمْ یَتَّقُوْنَ",
    "وَلَا تَاْكُلُوْۤا اَمْوَالَكُمْ بَیْنَكُمْ بِالْبَاطِلِ وَتُدْلُوْا بِهَاۤ اِلَی الْحُكَّامِ لِتَاْكُلُوْا فَرِیْقًا مِّنْ اَمْوَالِ النَّاسِ بِالْاِثْمِ وَاَنْتُمْ تَعْلَمُوْنَ",
    "یَسْـَٔلُوْنَكَ عَنِ الْاَهِلَّةِ قُلْ هِیَ مَوَاقِیْتُ لِلنَّاسِ وَالْحَجِّ وَلَیْسَ الْبِرُّ بِاَنْ تَاْتُوا الْبُیُوْتَ مِنْ ظُهُوْرِهَا وَلٰكِنَّ الْبِرَّ مَنِ اتَّقٰی وَاْتُوا الْبُیُوْتَ مِنْ اَبْوَابِهَا وَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُفْلِحُوْنَ",
    "وَقَاتِلُوْا فِیْ سَبِیْلِ اللّٰهِ الَّذِیْنَ یُقَاتِلُوْنَكُمْ وَلَا تَعْتَدُوْا اِنَّ اللّٰهَ لَا یُحِبُّ الْمُعْتَدِیْنَ",
    "وَاقْتُلُوْهُمْ حَیْثُ ثَقِفْتُمُوْهُمْ وَاَخْرِجُوْهُمْ مِّنْ حَیْثُ اَخْرَجُوْكُمْ وَالْفِتْنَةُ اَشَدُّ مِنَ الْقَتْلِ وَلَا تُقٰتِلُوْهُمْ عِنْدَ الْمَسْجِدِ الْحَرَامِ حَتّٰی یُقٰتِلُوْكُمْ فِیْهِ فَاِنْ قٰتَلُوْكُمْ فَاقْتُلُوْهُمْ كَذٰلِكَ جَزَآءُ الْكٰفِرِیْنَ",
    "فَاِنِ انْتَهَوْا فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِیْمٌ",
    "وَقٰتِلُوْهُمْ حَتّٰی لَا تَكُوْنَ فِتْنَةٌ وَّیَكُوْنَ الدِّیْنُ لِلّٰهِ فَاِنِ انْتَهَوْا فَلَا عُدْوَانَ اِلَّا عَلَی الظّٰلِمِیْنَ",
    "اَلشَّهْرُ الْحَرَامُ بِالشَّهْرِ الْحَرَامِ وَالْحُرُمٰتُ قِصَاصٌ فَمَنِ اعْتَدٰی عَلَیْكُمْ فَاعْتَدُوْا عَلَیْهِ بِمِثْلِ مَا اعْتَدٰی عَلَیْكُمْ وَاتَّقُوا اللّٰهَ وَاعْلَمُوْۤا اَنَّ اللّٰهَ مَعَ الْمُتَّقِیْنَ",
    "وَاَنْفِقُوْا فِیْ سَبِیْلِ اللّٰهِ وَلَا تُلْقُوْا بِاَیْدِیْكُمْ اِلَی التَّهْلُكَةِ وَاَحْسِنُوْا اِنَّ اللّٰهَ یُحِبُّ الْمُحْسِنِیْنَ",
    "وَاَتِمُّوا الْحَجَّ وَالْعُمْرَةَ لِلّٰهِ فَاِنْ اُحْصِرْتُمْ فَمَا اسْتَیْسَرَ مِنَ الْهَدْیِ وَلَا تَحْلِقُوْا رُءُوْسَكُمْ حَتّٰی یَبْلُغَ الْهَدْیُ مَحِلَّهٗ فَمَنْ كَانَ مِنْكُمْ مَّرِیْضًا اَوْ بِهٖۤ اَذًی مِّنْ رَّاْسِهٖ فَفِدْیَةٌ مِّنْ صِیَامٍ اَوْ صَدَقَةٍ اَوْ نُسُكٍ فَاِذَاۤ اَمِنْتُمْ ۥ فَمَنْ تَمَتَّعَ بِالْعُمْرَةِ اِلَی الْحَجِّ فَمَا اسْتَیْسَرَ مِنَ الْهَدْیِ فَمَنْ لَّمْ یَجِدْ فَصِیَامُ ثَلٰثَةِ اَیَّامٍ فِی الْحَجِّ وَسَبْعَةٍ اِذَا رَجَعْتُمْ تِلْكَ عَشَرَةٌ كَامِلَةٌ ذٰلِكَ لِمَنْ لَّمْ یَكُنْ اَهْلُهٗ حَاضِرِی الْمَسْجِدِ الْحَرَامِ وَاتَّقُوا اللّٰهَ وَاعْلَمُوْۤا اَنَّ اللّٰهَ شَدِیْدُ الْعِقَابِ",
    "اَلْحَجُّ اَشْهُرٌ مَّعْلُوْمٰتٌ فَمَنْ فَرَضَ فِیْهِنَّ الْحَجَّ فَلَا رَفَثَ وَلَا فُسُوْقَ وَلَا جِدَالَ فِی الْحَجِّ وَمَا تَفْعَلُوْا مِنْ خَیْرٍ یَّعْلَمْهُ اللّٰهُ وَتَزَوَّدُوْا فَاِنَّ خَیْرَ الزَّادِ التَّقْوٰی وَاتَّقُوْنِ یٰۤاُولِی الْاَلْبَابِ",
    "لَیْسَ عَلَیْكُمْ جُنَاحٌ اَنْ تَبْتَغُوْا فَضْلًا مِّنْ رَّبِّكُمْ فَاِذَاۤ اَفَضْتُمْ مِّنْ عَرَفٰتٍ فَاذْكُرُوا اللّٰهَ عِنْدَ الْمَشْعَرِ الْحَرَامِ وَاذْكُرُوْهُ كَمَا هَدٰىكُمْ وَاِنْ كُنْتُمْ مِّنْ قَبْلِهٖ لَمِنَ الضَّآلِّیْنَ",
    "ثُمَّ اَفِیْضُوْا مِنْ حَیْثُ اَفَاضَ النَّاسُ وَاسْتَغْفِرُوا اللّٰهَ اِنَّ اللّٰهَ غَفُوْرٌ رَّحِیْمٌ",
    "فَاِذَا قَضَیْتُمْ مَّنَاسِكَكُمْ فَاذْكُرُوا اللّٰهَ كَذِكْرِكُمْ اٰبَآءَكُمْ اَوْ اَشَدَّ ذِكْرًا فَمِنَ النَّاسِ مَنْ یَّقُوْلُ رَبَّنَاۤ اٰتِنَا فِی الدُّنْیَا وَمَا لَهٗ فِی الْاٰخِرَةِ مِنْ خَلَاقٍ",
    "وَمِنْهُمْ مَّنْ یَّقُوْلُ رَبَّنَاۤ اٰتِنَا فِی الدُّنْیَا حَسَنَةً وَّفِی الْاٰخِرَةِ حَسَنَةً وَّقِنَا عَذَابَ النَّارِ",
    "اُولٰٓىِٕكَ لَهُمْ نَصِیْبٌ مِّمَّا كَسَبُوْا وَاللّٰهُ سَرِیْعُ الْحِسَابِ",
    "وَاذْكُرُوا اللّٰهَ فِیْۤ اَیَّامٍ مَّعْدُوْدٰتٍ فَمَنْ تَعَجَّلَ فِیْ یَوْمَیْنِ فَلَاۤ اِثْمَ عَلَیْهِ وَمَنْ تَاَخَّرَ فَلَاۤ اِثْمَ عَلَیْهِ لِمَنِ اتَّقٰی وَاتَّقُوا اللّٰهَ وَاعْلَمُوْۤا اَنَّكُمْ اِلَیْهِ تُحْشَرُوْنَ",
    "وَمِنَ النَّاسِ مَنْ یُّعْجِبُكَ قَوْلُهٗ فِی الْحَیٰوةِ الدُّنْیَا وَیُشْهِدُ اللّٰهَ عَلٰی مَا فِیْ قَلْبِهٖ وَهُوَ اَلَدُّ الْخِصَامِ",
    "وَاِذَا تَوَلّٰی سَعٰی فِی الْاَرْضِ لِیُفْسِدَ فِیْهَا وَیُهْلِكَ الْحَرْثَ وَالنَّسْلَ وَاللّٰهُ لَا یُحِبُّ الْفَسَادَ",
    "وَاِذَا قِیْلَ لَهُ اتَّقِ اللّٰهَ اَخَذَتْهُ الْعِزَّةُ بِالْاِثْمِ فَحَسْبُهٗ جَهَنَّمُ وَلَبِئْسَ الْمِهَادُ",
    "وَمِنَ النَّاسِ مَنْ یَّشْرِیْ نَفْسَهُ ابْتِغَآءَ مَرْضَاتِ اللّٰهِ وَاللّٰهُ رَءُوْفٌۢ بِالْعِبَادِ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوا ادْخُلُوْا فِی السِّلْمِ كَآفَّةً وَلَا تَتَّبِعُوْا خُطُوٰتِ الشَّیْطٰنِ اِنَّهٗ لَكُمْ عَدُوٌّ مُّبِیْنٌ",
    "فَاِنْ زَلَلْتُمْ مِّنْ بَعْدِ مَا جَآءَتْكُمُ الْبَیِّنٰتُ فَاعْلَمُوْۤا اَنَّ اللّٰهَ عَزِیْزٌ حَكِیْمٌ",
    "هَلْ یَنْظُرُوْنَ اِلَّاۤ اَنْ یَّاْتِیَهُمُ اللّٰهُ فِیْ ظُلَلٍ مِّنَ الْغَمَامِ وَالْمَلٰٓىِٕكَةُ وَقُضِیَ الْاَمْرُ وَاِلَی اللّٰهِ تُرْجَعُ الْاُمُوْرُ",
    "سَلْ بَنِیْۤ اِسْرَآءِیْلَ كَمْ اٰتَیْنٰهُمْ مِّنْ اٰیَةٍ بَیِّنَةٍ وَمَنْ یُّبَدِّلْ نِعْمَةَ اللّٰهِ مِنْ بَعْدِ مَا جَآءَتْهُ فَاِنَّ اللّٰهَ شَدِیْدُ الْعِقَابِ",
    "زُیِّنَ لِلَّذِیْنَ كَفَرُوا الْحَیٰوةُ الدُّنْیَا وَیَسْخَرُوْنَ مِنَ الَّذِیْنَ اٰمَنُوْا وَالَّذِیْنَ اتَّقَوْا فَوْقَهُمْ یَوْمَ الْقِیٰمَةِ وَاللّٰهُ یَرْزُقُ مَنْ یَّشَآءُ بِغَیْرِ حِسَابٍ",
    "كَانَ النَّاسُ اُمَّةً وَّاحِدَةً ۫ فَبَعَثَ اللّٰهُ النَّبِیّٖنَ مُبَشِّرِیْنَ وَمُنْذِرِیْنَ وَاَنْزَلَ مَعَهُمُ الْكِتٰبَ بِالْحَقِّ لِیَحْكُمَ بَیْنَ النَّاسِ فِیْمَا اخْتَلَفُوْا فِیْهِ وَمَا اخْتَلَفَ فِیْهِ اِلَّا الَّذِیْنَ اُوْتُوْهُ مِنْ بَعْدِ مَا جَآءَتْهُمُ الْبَیِّنٰتُ بَغْیًا بَیْنَهُمْ فَهَدَی اللّٰهُ الَّذِیْنَ اٰمَنُوْا لِمَا اخْتَلَفُوْا فِیْهِ مِنَ الْحَقِّ بِاِذْنِهٖ وَاللّٰهُ یَهْدِیْ مَنْ یَّشَآءُ اِلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "اَمْ حَسِبْتُمْ اَنْ تَدْخُلُوا الْجَنَّةَ وَلَمَّا یَاْتِكُمْ مَّثَلُ الَّذِیْنَ خَلَوْا مِنْ قَبْلِكُمْ مَسَّتْهُمُ الْبَاْسَآءُ وَالضَّرَّآءُ وَزُلْزِلُوْا حَتّٰی یَقُوْلَ الرَّسُوْلُ وَالَّذِیْنَ اٰمَنُوْا مَعَهٗ مَتٰی نَصْرُ اللّٰهِ اَلَاۤ اِنَّ نَصْرَ اللّٰهِ قَرِیْبٌ",
    "یَسْـَٔلُوْنَكَ مَاذَا یُنْفِقُوْنَ قُلْ مَاۤ اَنْفَقْتُمْ مِّنْ خَیْرٍ فَلِلْوَالِدَیْنِ وَالْاَقْرَبِیْنَ وَالْیَتٰمٰی وَالْمَسٰكِیْنِ وَابْنِ السَّبِیْلِ وَمَا تَفْعَلُوْا مِنْ خَیْرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِیْمٌ",
    "كُتِبَ عَلَیْكُمُ الْقِتَالُ وَهُوَ كُرْهٌ لَّكُمْ وَعَسٰۤی اَنْ تَكْرَهُوْا شَیْـًٔا وَّهُوَ خَیْرٌ لَّكُمْ وَعَسٰۤی اَنْ تُحِبُّوْا شَیْـًٔا وَّهُوَ شَرٌّ لَّكُمْ وَاللّٰهُ یَعْلَمُ وَاَنْتُمْ لَا تَعْلَمُوْنَ",
    "یَسْـَٔلُوْنَكَ عَنِ الشَّهْرِ الْحَرَامِ قِتَالٍ فِیْهِ قُلْ قِتَالٌ فِیْهِ كَبِیْرٌ وَصَدٌّ عَنْ سَبِیْلِ اللّٰهِ وَكُفْرٌ بِهٖ وَالْمَسْجِدِ الْحَرَامِ وَاِخْرَاجُ اَهْلِهٖ مِنْهُ اَكْبَرُ عِنْدَ اللّٰهِ وَالْفِتْنَةُ اَكْبَرُ مِنَ الْقَتْلِ وَلَا یَزَالُوْنَ یُقَاتِلُوْنَكُمْ حَتّٰی یَرُدُّوْكُمْ عَنْ دِیْنِكُمْ اِنِ اسْتَطَاعُوْا وَمَنْ یَّرْتَدِدْ مِنْكُمْ عَنْ دِیْنِهٖ فَیَمُتْ وَهُوَ كَافِرٌ فَاُولٰٓىِٕكَ حَبِطَتْ اَعْمَالُهُمْ فِی الدُّنْیَا وَالْاٰخِرَةِ وَاُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "اِنَّ الَّذِیْنَ اٰمَنُوْا وَالَّذِیْنَ هَاجَرُوْا وَجٰهَدُوْا فِیْ سَبِیْلِ اللّٰهِ اُولٰٓىِٕكَ یَرْجُوْنَ رَحْمَتَ اللّٰهِ وَاللّٰهُ غَفُوْرٌ رَّحِیْمٌ",
    "یَسْـَٔلُوْنَكَ عَنِ الْخَمْرِ وَالْمَیْسِرِ قُلْ فِیْهِمَاۤ اِثْمٌ كَبِیْرٌ وَّمَنَافِعُ لِلنَّاسِ وَاِثْمُهُمَاۤ اَكْبَرُ مِنْ نَّفْعِهِمَا وَیَسْـَٔلُوْنَكَ مَاذَا یُنْفِقُوْنَ قُلِ الْعَفْوَ كَذٰلِكَ یُبَیِّنُ اللّٰهُ لَكُمُ الْاٰیٰتِ لَعَلَّكُمْ تَتَفَكَّرُوْنَ",
    "فِی الدُّنْیَا وَالْاٰخِرَةِ وَیَسْـَٔلُوْنَكَ عَنِ الْیَتٰمٰی قُلْ اِصْلَاحٌ لَّهُمْ خَیْرٌ وَاِنْ تُخَالِطُوْهُمْ فَاِخْوَانُكُمْ وَاللّٰهُ یَعْلَمُ الْمُفْسِدَ مِنَ الْمُصْلِحِ وَلَوْ شَآءَ اللّٰهُ لَاَعْنَتَكُمْ اِنَّ اللّٰهَ عَزِیْزٌ حَكِیْمٌ",
    "وَلَا تَنْكِحُوا الْمُشْرِكٰتِ حَتّٰی یُؤْمِنَّ وَلَاَمَةٌ مُّؤْمِنَةٌ خَیْرٌ مِّنْ مُّشْرِكَةٍ وَّلَوْ اَعْجَبَتْكُمْ وَلَا تُنْكِحُوا الْمُشْرِكِیْنَ حَتّٰی یُؤْمِنُوْا وَلَعَبْدٌ مُّؤْمِنٌ خَیْرٌ مِّنْ مُّشْرِكٍ وَّلَوْ اَعْجَبَكُمْ اُولٰٓىِٕكَ یَدْعُوْنَ اِلَی النَّارِ وَاللّٰهُ یَدْعُوْۤا اِلَی الْجَنَّةِ وَالْمَغْفِرَةِ بِاِذْنِهٖ وَیُبَیِّنُ اٰیٰتِهٖ لِلنَّاسِ لَعَلَّهُمْ یَتَذَكَّرُوْنَ",
    "وَیَسْـَٔلُوْنَكَ عَنِ الْمَحِیْضِ قُلْ هُوَ اَذًی فَاعْتَزِلُوا النِّسَآءَ فِی الْمَحِیْضِ وَلَا تَقْرَبُوْهُنَّ حَتّٰی یَطْهُرْنَ فَاِذَا تَطَهَّرْنَ فَاْتُوْهُنَّ مِنْ حَیْثُ اَمَرَكُمُ اللّٰهُ اِنَّ اللّٰهَ یُحِبُّ التَّوَّابِیْنَ وَیُحِبُّ الْمُتَطَهِّرِیْنَ",
    "نِسَآؤُكُمْ حَرْثٌ لَّكُمْ فَاْتُوْا حَرْثَكُمْ اَنّٰی شِئْتُمْ وَقَدِّمُوْا لِاَنْفُسِكُمْ وَاتَّقُوا اللّٰهَ وَاعْلَمُوْۤا اَنَّكُمْ مُّلٰقُوْهُ وَبَشِّرِ الْمُؤْمِنِیْنَ",
    "وَلَا تَجْعَلُوا اللّٰهَ عُرْضَةً لِّاَیْمَانِكُمْ اَنْ تَبَرُّوْا وَتَتَّقُوْا وَتُصْلِحُوْا بَیْنَ النَّاسِ وَاللّٰهُ سَمِیْعٌ عَلِیْمٌ",
    "لَا یُؤَاخِذُكُمُ اللّٰهُ بِاللَّغْوِ فِیْۤ اَیْمَانِكُمْ وَلٰكِنْ یُّؤَاخِذُكُمْ بِمَا كَسَبَتْ قُلُوْبُكُمْ وَاللّٰهُ غَفُوْرٌ حَلِیْمٌ",
    "لِلَّذِیْنَ یُؤْلُوْنَ مِنْ نِّسَآىِٕهِمْ تَرَبُّصُ اَرْبَعَةِ اَشْهُرٍ فَاِنْ فَآءُوْ فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِیْمٌ",
    "وَاِنْ عَزَمُوا الطَّلَاقَ فَاِنَّ اللّٰهَ سَمِیْعٌ عَلِیْمٌ",
    "وَالْمُطَلَّقٰتُ یَتَرَبَّصْنَ بِاَنْفُسِهِنَّ ثَلٰثَةَ قُرُوْٓءٍ وَلَا یَحِلُّ لَهُنَّ اَنْ یَّكْتُمْنَ مَا خَلَقَ اللّٰهُ فِیْۤ اَرْحَامِهِنَّ اِنْ كُنَّ یُؤْمِنَّ بِاللّٰهِ وَالْیَوْمِ الْاٰخِرِ وَبُعُوْلَتُهُنَّ اَحَقُّ بِرَدِّهِنَّ فِیْ ذٰلِكَ اِنْ اَرَادُوْۤا اِصْلَاحًا وَلَهُنَّ مِثْلُ الَّذِیْ عَلَیْهِنَّ بِالْمَعْرُوْفِ وَلِلرِّجَالِ عَلَیْهِنَّ دَرَجَةٌ وَاللّٰهُ عَزِیْزٌ حَكِیْمٌ",
    "اَلطَّلَاقُ مَرَّتٰنِ فَاِمْسَاكٌ بِمَعْرُوْفٍ اَوْ تَسْرِیْحٌ بِاِحْسَانٍ وَلَا یَحِلُّ لَكُمْ اَنْ تَاْخُذُوْا مِمَّاۤ اٰتَیْتُمُوْهُنَّ شَیْـًٔا اِلَّاۤ اَنْ یَّخَافَاۤ اَلَّا یُقِیْمَا حُدُوْدَ اللّٰهِ فَاِنْ خِفْتُمْ اَلَّا یُقِیْمَا حُدُوْدَ اللّٰهِ فَلَا جُنَاحَ عَلَیْهِمَا فِیْمَا افْتَدَتْ بِهٖ تِلْكَ حُدُوْدُ اللّٰهِ فَلَا تَعْتَدُوْهَا وَمَنْ یَّتَعَدَّ حُدُوْدَ اللّٰهِ فَاُولٰٓىِٕكَ هُمُ الظّٰلِمُوْنَ",
    "فَاِنْ طَلَّقَهَا فَلَا تَحِلُّ لَهٗ مِنْ بَعْدُ حَتّٰی تَنْكِحَ زَوْجًا غَیْرَهٗ فَاِنْ طَلَّقَهَا فَلَا جُنَاحَ عَلَیْهِمَاۤ اَنْ یَّتَرَاجَعَاۤ اِنْ ظَنَّاۤ اَنْ یُّقِیْمَا حُدُوْدَ اللّٰهِ وَتِلْكَ حُدُوْدُ اللّٰهِ یُبَیِّنُهَا لِقَوْمٍ یَّعْلَمُوْنَ",
    "وَاِذَا طَلَّقْتُمُ النِّسَآءَ فَبَلَغْنَ اَجَلَهُنَّ فَاَمْسِكُوْهُنَّ بِمَعْرُوْفٍ اَوْ سَرِّحُوْهُنَّ بِمَعْرُوْفٍ وَلَا تُمْسِكُوْهُنَّ ضِرَارًا لِّتَعْتَدُوْا وَمَنْ یَّفْعَلْ ذٰلِكَ فَقَدْ ظَلَمَ نَفْسَهٗ وَلَا تَتَّخِذُوْۤا اٰیٰتِ اللّٰهِ هُزُوًا وَّاذْكُرُوْا نِعْمَتَ اللّٰهِ عَلَیْكُمْ وَمَاۤ اَنْزَلَ عَلَیْكُمْ مِّنَ الْكِتٰبِ وَالْحِكْمَةِ یَعِظُكُمْ بِهٖ وَاتَّقُوا اللّٰهَ وَاعْلَمُوْۤا اَنَّ اللّٰهَ بِكُلِّ شَیْءٍ عَلِیْمٌ",
    "وَاِذَا طَلَّقْتُمُ النِّسَآءَ فَبَلَغْنَ اَجَلَهُنَّ فَلَا تَعْضُلُوْهُنَّ اَنْ یَّنْكِحْنَ اَزْوَاجَهُنَّ اِذَا تَرَاضَوْا بَیْنَهُمْ بِالْمَعْرُوْفِ ذٰلِكَ یُوْعَظُ بِهٖ مَنْ كَانَ مِنْكُمْ یُؤْمِنُ بِاللّٰهِ وَالْیَوْمِ الْاٰخِرِ ذٰلِكُمْ اَزْكٰی لَكُمْ وَاَطْهَرُ وَاللّٰهُ یَعْلَمُ وَاَنْتُمْ لَا تَعْلَمُوْنَ",
    "وَالْوَالِدٰتُ یُرْضِعْنَ اَوْلَادَهُنَّ حَوْلَیْنِ كَامِلَیْنِ لِمَنْ اَرَادَ اَنْ یُّتِمَّ الرَّضَاعَةَ وَعَلَی الْمَوْلُوْدِ لَهٗ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوْفِ لَا تُكَلَّفُ نَفْسٌ اِلَّا وُسْعَهَا لَا تُضَآرَّ وَالِدَةٌ بِوَلَدِهَا وَلَا مَوْلُوْدٌ لَّهٗ بِوَلَدِهٖ وَعَلَی الْوَارِثِ مِثْلُ ذٰلِكَ فَاِنْ اَرَادَا فِصَالًا عَنْ تَرَاضٍ مِّنْهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَیْهِمَا وَاِنْ اَرَدْتُّمْ اَنْ تَسْتَرْضِعُوْۤا اَوْلَادَكُمْ فَلَا جُنَاحَ عَلَیْكُمْ اِذَا سَلَّمْتُمْ مَّاۤ اٰتَیْتُمْ بِالْمَعْرُوْفِ وَاتَّقُوا اللّٰهَ وَاعْلَمُوْۤا اَنَّ اللّٰهَ بِمَا تَعْمَلُوْنَ بَصِیْرٌ",
    "وَالَّذِیْنَ یُتَوَفَّوْنَ مِنْكُمْ وَیَذَرُوْنَ اَزْوَاجًا یَّتَرَبَّصْنَ بِاَنْفُسِهِنَّ اَرْبَعَةَ اَشْهُرٍ وَّعَشْرًا فَاِذَا بَلَغْنَ اَجَلَهُنَّ فَلَا جُنَاحَ عَلَیْكُمْ فِیْمَا فَعَلْنَ فِیْۤ اَنْفُسِهِنَّ بِالْمَعْرُوْفِ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِیْرٌ",
    "وَلَا جُنَاحَ عَلَیْكُمْ فِیْمَا عَرَّضْتُمْ بِهٖ مِنْ خِطْبَةِ النِّسَآءِ اَوْ اَكْنَنْتُمْ فِیْۤ اَنْفُسِكُمْ عَلِمَ اللّٰهُ اَنَّكُمْ سَتَذْكُرُوْنَهُنَّ وَلٰكِنْ لَّا تُوَاعِدُوْهُنَّ سِرًّا اِلَّاۤ اَنْ تَقُوْلُوْا قَوْلًا مَّعْرُوْفًا وَلَا تَعْزِمُوْا عُقْدَةَ النِّكَاحِ حَتّٰی یَبْلُغَ الْكِتٰبُ اَجَلَهٗ وَاعْلَمُوْۤا اَنَّ اللّٰهَ یَعْلَمُ مَا فِیْۤ اَنْفُسِكُمْ فَاحْذَرُوْهُ وَاعْلَمُوْۤا اَنَّ اللّٰهَ غَفُوْرٌ حَلِیْمٌ",
    "لَا جُنَاحَ عَلَیْكُمْ اِنْ طَلَّقْتُمُ النِّسَآءَ مَا لَمْ تَمَسُّوْهُنَّ اَوْ تَفْرِضُوْا لَهُنَّ فَرِیْضَةً وَّمَتِّعُوْهُنَّ عَلَی الْمُوْسِعِ قَدَرُهٗ وَعَلَی الْمُقْتِرِ قَدَرُهٗ مَتَاعًا بِالْمَعْرُوْفِ حَقًّا عَلَی الْمُحْسِنِیْنَ",
    "وَاِنْ طَلَّقْتُمُوْهُنَّ مِنْ قَبْلِ اَنْ تَمَسُّوْهُنَّ وَقَدْ فَرَضْتُمْ لَهُنَّ فَرِیْضَةً فَنِصْفُ مَا فَرَضْتُمْ اِلَّاۤ اَنْ یَّعْفُوْنَ اَوْ یَعْفُوَا الَّذِیْ بِیَدِهٖ عُقْدَةُ النِّكَاحِ وَاَنْ تَعْفُوْۤا اَقْرَبُ لِلتَّقْوٰی وَلَا تَنْسَوُا الْفَضْلَ بَیْنَكُمْ اِنَّ اللّٰهَ بِمَا تَعْمَلُوْنَ بَصِیْرٌ",
    "حٰفِظُوْا عَلَی الصَّلَوٰتِ وَالصَّلٰوةِ الْوُسْطٰی وَقُوْمُوْا لِلّٰهِ قٰنِتِیْنَ",
    "فَاِنْ خِفْتُمْ فَرِجَالًا اَوْ رُكْبَانًا فَاِذَاۤ اَمِنْتُمْ فَاذْكُرُوا اللّٰهَ كَمَا عَلَّمَكُمْ مَّا لَمْ تَكُوْنُوْا تَعْلَمُوْنَ",
    "وَالَّذِیْنَ یُتَوَفَّوْنَ مِنْكُمْ وَیَذَرُوْنَ اَزْوَاجًا وَّصِیَّةً لِّاَزْوَاجِهِمْ مَّتَاعًا اِلَی الْحَوْلِ غَیْرَ اِخْرَاجٍ فَاِنْ خَرَجْنَ فَلَا جُنَاحَ عَلَیْكُمْ فِیْ مَا فَعَلْنَ فِیْۤ اَنْفُسِهِنَّ مِنْ مَّعْرُوْفٍ وَاللّٰهُ عَزِیْزٌ حَكِیْمٌ",
    "وَلِلْمُطَلَّقٰتِ مَتَاعٌ بِالْمَعْرُوْفِ حَقًّا عَلَی الْمُتَّقِیْنَ",
    "كَذٰلِكَ یُبَیِّنُ اللّٰهُ لَكُمْ اٰیٰتِهٖ لَعَلَّكُمْ تَعْقِلُوْنَ",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ خَرَجُوْا مِنْ دِیَارِهِمْ وَهُمْ اُلُوْفٌ حَذَرَ الْمَوْتِ فَقَالَ لَهُمُ اللّٰهُ مُوْتُوْا ۫ ثُمَّ اَحْیَاهُمْ اِنَّ اللّٰهَ لَذُوْ فَضْلٍ عَلَی النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَشْكُرُوْنَ",
    "وَقَاتِلُوْا فِیْ سَبِیْلِ اللّٰهِ وَاعْلَمُوْۤا اَنَّ اللّٰهَ سَمِیْعٌ عَلِیْمٌ",
    "مَنْ ذَا الَّذِیْ یُقْرِضُ اللّٰهَ قَرْضًا حَسَنًا فَیُضٰعِفَهٗ لَهٗۤ اَضْعَافًا كَثِیْرَةً وَاللّٰهُ یَقْبِضُ وَیَبْصُطُ وَاِلَیْهِ تُرْجَعُوْنَ",
    "اَلَمْ تَرَ اِلَی الْمَلَاِ مِنْ بَنِیْۤ اِسْرَآءِیْلَ مِنْ بَعْدِ مُوْسٰی اِذْ قَالُوْا لِنَبِیٍّ لَّهُمُ ابْعَثْ لَنَا مَلِكًا نُّقَاتِلْ فِیْ سَبِیْلِ اللّٰهِ قَالَ هَلْ عَسَیْتُمْ اِنْ كُتِبَ عَلَیْكُمُ الْقِتَالُ اَلَّا تُقَاتِلُوْا قَالُوْا وَمَا لَنَاۤ اَلَّا نُقَاتِلَ فِیْ سَبِیْلِ اللّٰهِ وَقَدْ اُخْرِجْنَا مِنْ دِیَارِنَا وَاَبْنَآىِٕنَا فَلَمَّا كُتِبَ عَلَیْهِمُ الْقِتَالُ تَوَلَّوْا اِلَّا قَلِیْلًا مِّنْهُمْ وَاللّٰهُ عَلِیْمٌۢ بِالظّٰلِمِیْنَ",
    "وَقَالَ لَهُمْ نَبِیُّهُمْ اِنَّ اللّٰهَ قَدْ بَعَثَ لَكُمْ طَالُوْتَ مَلِكًا قَالُوْۤا اَنّٰی یَكُوْنُ لَهُ الْمُلْكُ عَلَیْنَا وَنَحْنُ اَحَقُّ بِالْمُلْكِ مِنْهُ وَلَمْ یُؤْتَ سَعَةً مِّنَ الْمَالِ قَالَ اِنَّ اللّٰهَ اصْطَفٰىهُ عَلَیْكُمْ وَزَادَهٗ بَسْطَةً فِی الْعِلْمِ وَالْجِسْمِ وَاللّٰهُ یُؤْتِیْ مُلْكَهٗ مَنْ یَّشَآءُ وَاللّٰهُ وَاسِعٌ عَلِیْمٌ",
    "وَقَالَ لَهُمْ نَبِیُّهُمْ اِنَّ اٰیَةَ مُلْكِهٖۤ اَنْ یَّاْتِیَكُمُ التَّابُوْتُ فِیْهِ سَكِیْنَةٌ مِّنْ رَّبِّكُمْ وَبَقِیَّةٌ مِّمَّا تَرَكَ اٰلُ مُوْسٰی وَاٰلُ هٰرُوْنَ تَحْمِلُهُ الْمَلٰٓىِٕكَةُ اِنَّ فِیْ ذٰلِكَ لَاٰیَةً لَّكُمْ اِنْ كُنْتُمْ مُّؤْمِنِیْنَ",
    "فَلَمَّا فَصَلَ طَالُوْتُ بِالْجُنُوْدِ قَالَ اِنَّ اللّٰهَ مُبْتَلِیْكُمْ بِنَهَرٍ فَمَنْ شَرِبَ مِنْهُ فَلَیْسَ مِنِّیْ وَمَنْ لَّمْ یَطْعَمْهُ فَاِنَّهٗ مِنِّیْۤ اِلَّا مَنِ اغْتَرَفَ غُرْفَةً بِیَدِهٖ فَشَرِبُوْا مِنْهُ اِلَّا قَلِیْلًا مِّنْهُمْ فَلَمَّا جَاوَزَهٗ هُوَ وَالَّذِیْنَ اٰمَنُوْا مَعَهٗ قَالُوْا لَا طَاقَةَ لَنَا الْیَوْمَ بِجَالُوْتَ وَجُنُوْدِهٖ قَالَ الَّذِیْنَ یَظُنُّوْنَ اَنَّهُمْ مُّلٰقُوا اللّٰهِ كَمْ مِّنْ فِئَةٍ قَلِیْلَةٍ غَلَبَتْ فِئَةً كَثِیْرَةً بِاِذْنِ اللّٰهِ وَاللّٰهُ مَعَ الصّٰبِرِیْنَ",
    "وَلَمَّا بَرَزُوْا لِجَالُوْتَ وَجُنُوْدِهٖ قَالُوْا رَبَّنَاۤ اَفْرِغْ عَلَیْنَا صَبْرًا وَّثَبِّتْ اَقْدَامَنَا وَانْصُرْنَا عَلَی الْقَوْمِ الْكٰفِرِیْنَ",
    "فَهَزَمُوْهُمْ بِاِذْنِ اللّٰهِ ۫ وَقَتَلَ دَاوٗدُ جَالُوْتَ وَاٰتٰىهُ اللّٰهُ الْمُلْكَ وَالْحِكْمَةَ وَعَلَّمَهٗ مِمَّا یَشَآءُ وَلَوْلَا دَفْعُ اللّٰهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَّفَسَدَتِ الْاَرْضُ وَلٰكِنَّ اللّٰهَ ذُوْ فَضْلٍ عَلَی الْعٰلَمِیْنَ",
    "تِلْكَ اٰیٰتُ اللّٰهِ نَتْلُوْهَا عَلَیْكَ بِالْحَقِّ وَاِنَّكَ لَمِنَ الْمُرْسَلِیْنَ",
    "تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلٰی بَعْضٍ مِنْهُمْ مَّنْ كَلَّمَ اللّٰهُ وَرَفَعَ بَعْضَهُمْ دَرَجٰتٍ وَاٰتَیْنَا عِیْسَی ابْنَ مَرْیَمَ الْبَیِّنٰتِ وَاَیَّدْنٰهُ بِرُوْحِ الْقُدُسِ وَلَوْ شَآءَ اللّٰهُ مَا اقْتَتَلَ الَّذِیْنَ مِنْ بَعْدِهِمْ مِّنْ بَعْدِ مَا جَآءَتْهُمُ الْبَیِّنٰتُ وَلٰكِنِ اخْتَلَفُوْا فَمِنْهُمْ مَّنْ اٰمَنَ وَمِنْهُمْ مَّنْ كَفَرَ وَلَوْ شَآءَ اللّٰهُ مَا اقْتَتَلُوْا ۫ وَلٰكِنَّ اللّٰهَ یَفْعَلُ مَا یُرِیْدُ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اَنْفِقُوْا مِمَّا رَزَقْنٰكُمْ مِّنْ قَبْلِ اَنْ یَّاْتِیَ یَوْمٌ لَّا بَیْعٌ فِیْهِ وَلَا خُلَّةٌ وَّلَا شَفَاعَةٌ وَالْكٰفِرُوْنَ هُمُ الظّٰلِمُوْنَ",
    "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ اَلْحَیُّ الْقَیُّوْمُ لَا تَاْخُذُهٗ سِنَةٌ وَّلَا نَوْمٌ لَهٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ مَنْ ذَا الَّذِیْ یَشْفَعُ عِنْدَهٗۤ اِلَّا بِاِذْنِهٖ یَعْلَمُ مَا بَیْنَ اَیْدِیْهِمْ وَمَا خَلْفَهُمْ وَلَا یُحِیْطُوْنَ بِشَیْءٍ مِّنْ عِلْمِهٖۤ اِلَّا بِمَا شَآءَ وَسِعَ كُرْسِیُّهُ السَّمٰوٰتِ وَالْاَرْضَ وَلَا یَـُٔوْدُهٗ حِفْظُهُمَا وَهُوَ الْعَلِیُّ الْعَظِیْمُ",
    "لَاۤ اِكْرَاهَ فِی الدِّیْنِ قَدْ تَّبَیَّنَ الرُّشْدُ مِنَ الْغَیِّ فَمَنْ یَّكْفُرْ بِالطَّاغُوْتِ وَیُؤْمِنْ بِاللّٰهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقٰی لَا انْفِصَامَ لَهَا وَاللّٰهُ سَمِیْعٌ عَلِیْمٌ",
    "اَللّٰهُ وَلِیُّ الَّذِیْنَ اٰمَنُوْا یُخْرِجُهُمْ مِّنَ الظُّلُمٰتِ اِلَی النُّوْرِ وَالَّذِیْنَ كَفَرُوْۤا اَوْلِیٰٓـُٔهُمُ الطَّاغُوْتُ یُخْرِجُوْنَهُمْ مِّنَ النُّوْرِ اِلَی الظُّلُمٰتِ اُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "اَلَمْ تَرَ اِلَی الَّذِیْ حَآجَّ اِبْرٰهٖمَ فِیْ رَبِّهٖۤ اَنْ اٰتٰىهُ اللّٰهُ الْمُلْكَ اِذْ قَالَ اِبْرٰهٖمُ رَبِّیَ الَّذِیْ یُحْیٖ وَیُمِیْتُ قَالَ اَنَا اُحْیٖ وَاُمِیْتُ قَالَ اِبْرٰهٖمُ فَاِنَّ اللّٰهَ یَاْتِیْ بِالشَّمْسِ مِنَ الْمَشْرِقِ فَاْتِ بِهَا مِنَ الْمَغْرِبِ فَبُهِتَ الَّذِیْ كَفَرَ وَاللّٰهُ لَا یَهْدِی الْقَوْمَ الظّٰلِمِیْنَ",
    "اَوْ كَالَّذِیْ مَرَّ عَلٰی قَرْیَةٍ وَّهِیَ خَاوِیَةٌ عَلٰی عُرُوْشِهَا قَالَ اَنّٰی یُحْیٖ هٰذِهِ اللّٰهُ بَعْدَ مَوْتِهَا فَاَمَاتَهُ اللّٰهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهٗ قَالَ كَمْ لَبِثْتَ قَالَ لَبِثْتُ یَوْمًا اَوْ بَعْضَ یَوْمٍ قَالَ بَلْ لَّبِثْتَ مِائَةَ عَامٍ فَانْظُرْ اِلٰی طَعَامِكَ وَشَرَابِكَ لَمْ یَتَسَنَّهْ وَانْظُرْ اِلٰی حِمَارِكَ۫ وَلِنَجْعَلَكَ اٰیَةً لِّلنَّاسِ وَانْظُرْ اِلَی الْعِظَامِ كَیْفَ نُنْشِزُهَا ثُمَّ نَكْسُوْهَا لَحْمًا فَلَمَّا تَبَیَّنَ لَهٗ قَالَ اَعْلَمُ اَنَّ اللّٰهَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "وَاِذْ قَالَ اِبْرٰهٖمُ رَبِّ اَرِنِیْ كَیْفَ تُحْیِ الْمَوْتٰی قَالَ اَوَلَمْ تُؤْمِنْ قَالَ بَلٰی وَلٰكِنْ لِّیَطْمَىِٕنَّ قَلْبِیْ قَالَ فَخُذْ اَرْبَعَةً مِّنَ الطَّیْرِ فَصُرْهُنَّ اِلَیْكَ ثُمَّ اجْعَلْ عَلٰی كُلِّ جَبَلٍ مِّنْهُنَّ جُزْءًا ثُمَّ ادْعُهُنَّ یَاْتِیْنَكَ سَعْیًا وَاعْلَمْ اَنَّ اللّٰهَ عَزِیْزٌ حَكِیْمٌ",
    "مَثَلُ الَّذِیْنَ یُنْفِقُوْنَ اَمْوَالَهُمْ فِیْ سَبِیْلِ اللّٰهِ كَمَثَلِ حَبَّةٍ اَنْۢبَتَتْ سَبْعَ سَنَابِلَ فِیْ كُلِّ سُنْۢبُلَةٍ مِّائَةُ حَبَّةٍ وَاللّٰهُ یُضٰعِفُ لِمَنْ یَّشَآءُ وَاللّٰهُ وَاسِعٌ عَلِیْمٌ",
    "اَلَّذِیْنَ یُنْفِقُوْنَ اَمْوَالَهُمْ فِیْ سَبِیْلِ اللّٰهِ ثُمَّ لَا یُتْبِعُوْنَ مَاۤ اَنْفَقُوْا مَنًّا وَّلَاۤ اَذًی لَّهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلَا خَوْفٌ عَلَیْهِمْ وَلَا هُمْ یَحْزَنُوْنَ",
    "قَوْلٌ مَّعْرُوْفٌ وَّمَغْفِرَةٌ خَیْرٌ مِّنْ صَدَقَةٍ یَّتْبَعُهَاۤ اَذًی وَاللّٰهُ غَنِیٌّ حَلِیْمٌ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا تُبْطِلُوْا صَدَقٰتِكُمْ بِالْمَنِّ وَالْاَذٰی كَالَّذِیْ یُنْفِقُ مَالَهٗ رِئَآءَ النَّاسِ وَلَا یُؤْمِنُ بِاللّٰهِ وَالْیَوْمِ الْاٰخِرِ فَمَثَلُهٗ كَمَثَلِ صَفْوَانٍ عَلَیْهِ تُرَابٌ فَاَصَابَهٗ وَابِلٌ فَتَرَكَهٗ صَلْدًا لَا یَقْدِرُوْنَ عَلٰی شَیْءٍ مِّمَّا كَسَبُوْا وَاللّٰهُ لَا یَهْدِی الْقَوْمَ الْكٰفِرِیْنَ",
    "وَمَثَلُ الَّذِیْنَ یُنْفِقُوْنَ اَمْوَالَهُمُ ابْتِغَآءَ مَرْضَاتِ اللّٰهِ وَتَثْبِیْتًا مِّنْ اَنْفُسِهِمْ كَمَثَلِ جَنَّةٍ بِرَبْوَةٍ اَصَابَهَا وَابِلٌ فَاٰتَتْ اُكُلَهَا ضِعْفَیْنِ فَاِنْ لَّمْ یُصِبْهَا وَابِلٌ فَطَلٌّ وَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِیْرٌ",
    "اَیَوَدُّ اَحَدُكُمْ اَنْ تَكُوْنَ لَهٗ جَنَّةٌ مِّنْ نَّخِیْلٍ وَّاَعْنَابٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ لَهٗ فِیْهَا مِنْ كُلِّ الثَّمَرٰتِ وَاَصَابَهُ الْكِبَرُ وَلَهٗ ذُرِّیَّةٌ ضُعَفَآءُ فَاَصَابَهَاۤ اِعْصَارٌ فِیْهِ نَارٌ فَاحْتَرَقَتْ كَذٰلِكَ یُبَیِّنُ اللّٰهُ لَكُمُ الْاٰیٰتِ لَعَلَّكُمْ تَتَفَكَّرُوْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اَنْفِقُوْا مِنْ طَیِّبٰتِ مَا كَسَبْتُمْ وَمِمَّاۤ اَخْرَجْنَا لَكُمْ مِّنَ الْاَرْضِ وَلَا تَیَمَّمُوا الْخَبِیْثَ مِنْهُ تُنْفِقُوْنَ وَلَسْتُمْ بِاٰخِذِیْهِ اِلَّاۤ اَنْ تُغْمِضُوْا فِیْهِ وَاعْلَمُوْۤا اَنَّ اللّٰهَ غَنِیٌّ حَمِیْدٌ",
    "اَلشَّیْطٰنُ یَعِدُكُمُ الْفَقْرَ وَیَاْمُرُكُمْ بِالْفَحْشَآءِ وَاللّٰهُ یَعِدُكُمْ مَّغْفِرَةً مِّنْهُ وَفَضْلًا وَاللّٰهُ وَاسِعٌ عَلِیْمٌ",
    "یُّؤْتِی الْحِكْمَةَ مَنْ یَّشَآءُ وَمَنْ یُّؤْتَ الْحِكْمَةَ فَقَدْ اُوْتِیَ خَیْرًا كَثِیْرًا وَمَا یَذَّكَّرُ اِلَّاۤ اُولُوا الْاَلْبَابِ",
    "وَمَاۤ اَنْفَقْتُمْ مِّنْ نَّفَقَةٍ اَوْ نَذَرْتُمْ مِّنْ نَّذْرٍ فَاِنَّ اللّٰهَ یَعْلَمُهٗ وَمَا لِلظّٰلِمِیْنَ مِنْ اَنْصَارٍ",
    "اِنْ تُبْدُوا الصَّدَقٰتِ فَنِعِمَّا هِیَ وَاِنْ تُخْفُوْهَا وَتُؤْتُوْهَا الْفُقَرَآءَ فَهُوَ خَیْرٌ لَّكُمْ وَیُكَفِّرُ عَنْكُمْ مِّنْ سَیِّاٰتِكُمْ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِیْرٌ",
    "لَیْسَ عَلَیْكَ هُدٰىهُمْ وَلٰكِنَّ اللّٰهَ یَهْدِیْ مَنْ یَّشَآءُ وَمَا تُنْفِقُوْا مِنْ خَیْرٍ فَلِاَنْفُسِكُمْ وَمَا تُنْفِقُوْنَ اِلَّا ابْتِغَآءَ وَجْهِ اللّٰهِ وَمَا تُنْفِقُوْا مِنْ خَیْرٍ یُّوَفَّ اِلَیْكُمْ وَاَنْتُمْ لَا تُظْلَمُوْنَ",
    "لِلْفُقَرَآءِ الَّذِیْنَ اُحْصِرُوْا فِیْ سَبِیْلِ اللّٰهِ لَا یَسْتَطِیْعُوْنَ ضَرْبًا فِی الْاَرْضِ یَحْسَبُهُمُ الْجَاهِلُ اَغْنِیَآءَ مِنَ التَّعَفُّفِ تَعْرِفُهُمْ بِسِیْمٰىهُمْ لَا یَسْـَٔلُوْنَ النَّاسَ اِلْحَافًا وَمَا تُنْفِقُوْا مِنْ خَیْرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِیْمٌ",
    "اَلَّذِیْنَ یُنْفِقُوْنَ اَمْوَالَهُمْ بِالَّیْلِ وَالنَّهَارِ سِرًّا وَّعَلَانِیَةً فَلَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلَا خَوْفٌ عَلَیْهِمْ وَلَا هُمْ یَحْزَنُوْنَ",
    "اَلَّذِیْنَ یَاْكُلُوْنَ الرِّبٰوا لَا یَقُوْمُوْنَ اِلَّا كَمَا یَقُوْمُ الَّذِیْ یَتَخَبَّطُهُ الشَّیْطٰنُ مِنَ الْمَسِّ ذٰلِكَ بِاَنَّهُمْ قَالُوْۤا اِنَّمَا الْبَیْعُ مِثْلُ الرِّبٰوا وَاَحَلَّ اللّٰهُ الْبَیْعَ وَحَرَّمَ الرِّبٰوا فَمَنْ جَآءَهٗ مَوْعِظَةٌ مِّنْ رَّبِّهٖ فَانْتَهٰی فَلَهٗ مَا سَلَفَ وَاَمْرُهٗۤ اِلَی اللّٰهِ وَمَنْ عَادَ فَاُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "یَمْحَقُ اللّٰهُ الرِّبٰوا وَیُرْبِی الصَّدَقٰتِ وَاللّٰهُ لَا یُحِبُّ كُلَّ كَفَّارٍ اَثِیْمٍ",
    "اِنَّ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَاَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلَا خَوْفٌ عَلَیْهِمْ وَلَا هُمْ یَحْزَنُوْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَذَرُوْا مَا بَقِیَ مِنَ الرِّبٰۤوا اِنْ كُنْتُمْ مُّؤْمِنِیْنَ",
    "فَاِنْ لَّمْ تَفْعَلُوْا فَاْذَنُوْا بِحَرْبٍ مِّنَ اللّٰهِ وَرَسُوْلِهٖ وَاِنْ تُبْتُمْ فَلَكُمْ رُءُوْسُ اَمْوَالِكُمْ لَا تَظْلِمُوْنَ وَلَا تُظْلَمُوْنَ",
    "وَاِنْ كَانَ ذُوْ عُسْرَةٍ فَنَظِرَةٌ اِلٰی مَیْسَرَةٍ وَاَنْ تَصَدَّقُوْا خَیْرٌ لَّكُمْ اِنْ كُنْتُمْ تَعْلَمُوْنَ",
    "وَاتَّقُوْا یَوْمًا تُرْجَعُوْنَ فِیْهِ اِلَی اللّٰهِ ۫ ثُمَّ تُوَفّٰی كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا یُظْلَمُوْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اِذَا تَدَایَنْتُمْ بِدَیْنٍ اِلٰۤی اَجَلٍ مُّسَمًّی فَاكْتُبُوْهُ وَلْیَكْتُبْ بَّیْنَكُمْ كَاتِبٌ بِالْعَدْلِ وَلَا یَاْبَ كَاتِبٌ اَنْ یَّكْتُبَ كَمَا عَلَّمَهُ اللّٰهُ فَلْیَكْتُبْ وَلْیُمْلِلِ الَّذِیْ عَلَیْهِ الْحَقُّ وَلْیَتَّقِ اللّٰهَ رَبَّهٗ وَلَا یَبْخَسْ مِنْهُ شَیْـًٔا فَاِنْ كَانَ الَّذِیْ عَلَیْهِ الْحَقُّ سَفِیْهًا اَوْ ضَعِیْفًا اَوْ لَا یَسْتَطِیْعُ اَنْ یُّمِلَّ هُوَ فَلْیُمْلِلْ وَلِیُّهٗ بِالْعَدْلِ وَاسْتَشْهِدُوْا شَهِیْدَیْنِ مِنْ رِّجَالِكُمْ فَاِنْ لَّمْ یَكُوْنَا رَجُلَیْنِ فَرَجُلٌ وَّامْرَاَتٰنِ مِمَّنْ تَرْضَوْنَ مِنَ الشُّهَدَآءِ اَنْ تَضِلَّ اِحْدٰىهُمَا فَتُذَكِّرَ اِحْدٰىهُمَا الْاُخْرٰی وَلَا یَاْبَ الشُّهَدَآءُ اِذَا مَا دُعُوْا وَلَا تَسْـَٔمُوْۤا اَنْ تَكْتُبُوْهُ صَغِیْرًا اَوْ كَبِیْرًا اِلٰۤی اَجَلِهٖ ذٰلِكُمْ اَقْسَطُ عِنْدَ اللّٰهِ وَاَقْوَمُ لِلشَّهَادَةِ وَاَدْنٰۤی اَلَّا تَرْتَابُوْۤا اِلَّاۤ اَنْ تَكُوْنَ تِجَارَةً حَاضِرَةً تُدِیْرُوْنَهَا بَیْنَكُمْ فَلَیْسَ عَلَیْكُمْ جُنَاحٌ اَلَّا تَكْتُبُوْهَا وَاَشْهِدُوْۤا اِذَا تَبَایَعْتُمْ وَلَا یُضَآرَّ كَاتِبٌ وَّلَا شَهِیْدٌ وَاِنْ تَفْعَلُوْا فَاِنَّهٗ فُسُوْقٌ بِكُمْ وَاتَّقُوا اللّٰهَ وَیُعَلِّمُكُمُ اللّٰهُ وَاللّٰهُ بِكُلِّ شَیْءٍ عَلِیْمٌ",
    "وَاِنْ كُنْتُمْ عَلٰی سَفَرٍ وَّلَمْ تَجِدُوْا كَاتِبًا فَرِهٰنٌ مَّقْبُوْضَةٌ فَاِنْ اَمِنَ بَعْضُكُمْ بَعْضًا فَلْیُؤَدِّ الَّذِی اؤْتُمِنَ اَمَانَتَهٗ وَلْیَتَّقِ اللّٰهَ رَبَّهٗ وَلَا تَكْتُمُوا الشَّهَادَةَ وَمَنْ یَّكْتُمْهَا فَاِنَّهٗۤ اٰثِمٌ قَلْبُهٗ وَاللّٰهُ بِمَا تَعْمَلُوْنَ عَلِیْمٌ",
    "لِلّٰهِ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَاِنْ تُبْدُوْا مَا فِیْۤ اَنْفُسِكُمْ اَوْ تُخْفُوْهُ یُحَاسِبْكُمْ بِهِ اللّٰهُ فَیَغْفِرُ لِمَنْ یَّشَآءُ وَیُعَذِّبُ مَنْ یَّشَآءُ وَاللّٰهُ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "اٰمَنَ الرَّسُوْلُ بِمَاۤ اُنْزِلَ اِلَیْهِ مِنْ رَّبِّهٖ وَالْمُؤْمِنُوْنَ كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰٓىِٕكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ ۫ لَا نُفَرِّقُ بَیْنَ اَحَدٍ مِّنْ رُّسُلِهٖ ۫ وَقَالُوْا سَمِعْنَا وَاَطَعْنَا غُفْرَانَكَ رَبَّنَا وَاِلَیْكَ الْمَصِیْرُ",
    "لَا یُكَلِّفُ اللّٰهُ نَفْسًا اِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَیْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَاۤ اِنْ نَّسِیْنَاۤ اَوْ اَخْطَاْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَیْنَاۤ اِصْرًا كَمَا حَمَلْتَهٗ عَلَی الَّذِیْنَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهٖ وَاعْفُ عَنَّا ۥ وَاغْفِرْ لَنَا ۥ وَارْحَمْنَا ۥ اَنْتَ مَوْلٰىنَا فَانْصُرْنَا عَلَی الْقَوْمِ الْكٰفِرِیْنَ"
  ],
  "bengali": [
    "আলিফ-লাম-মীম।* \n*এ অক্ষরগুলো কুরআনের একটি মু‘জিযা- যার প্রকৃত অর্থ একমাত্র আল্লাহই জানেন।",
    "এই সেই কিতাব, যাতে কোন সন্দেহ নেই, মুত্তাকীদের জন্য হিদায়াত।",
    "গায়েবের প্রতি ঈমান আনে, সালাত কায়েম করে এবং আমি তাদেরকে যে রিয্ক দিয়েছি তা থেকে ব্যয় করে।",
    "আর যারা ঈমান আনে তাতে, যা তোমার প্রতি নাযিল করা হয়েছে এবং যা তোমার পূর্বে নাযিল করা হয়েছে। আর আখিরাতের প্রতি তারা ইয়াকীন রাখে।",
    "তারা তাদের রবের পক্ষ থেকে হিদায়াতের উপর রয়েছে এবং তারাই সফলকাম।",
    "নিশ্চয় যারা কুফরী করেছে, তুমি তাদেরকে সতর্ক কর কিংবা না কর, উভয়ই তাদের জন্য বরাবর, তারা ঈমান আনবে না।",
    "আল্লাহ তাদের অন্তরে এবং তাদের কানে মোহর লাগিয়ে দিয়েছেন এবং তাদের চোখসমূহে রয়েছে পর্দা। আর তাদের জন্য রয়েছে মহাআযাব।",
    "আর মানুষের মধ্যে কিছু এমন আছে, যারা বলে, ‘আমরা ঈমান এনেছি আল্লাহর প্রতি এবং শেষ দিনের প্রতি’, অথচ তারা মুমিন নয়।",
    "তারা আল্লাহকে এবং যারা ঈমান এনেছে তাদেরকে ধোঁকা দিচ্ছে। অথচ তারা নিজদেরকেই ধোঁকা দিচ্ছে এবং তারা তা অনুধাবন করে না।",
    "তাদের অন্তরসমূহে রয়েছে ব্যাধি। সুতরাং আল্লাহ তাদের ব্যাধি বাড়িয়ে দিয়েছেন। আর তাদের জন্য রয়েছে যন্ত্রণাদায়ক আযাব। কারণ তারা মিথ্যা বলত।",
    "আর যখন তাদেরকে বলা হয়, ‘তোমরা যমীনে ফাসাদ করো না’, তারা বলে, ‘আমরা তো কেবল সংশোধনকারী’।",
    "জেনে রাখ, নিশ্চয় তারা ফাসাদকারী; কিন্তু তারা বুঝে না।",
    "আর যখন তাদেরকে বলা হয়, ‘তোমরা ঈমান আন যেমন লোকেরা ঈমান এনেছে’, তারা বলে, ‘আমরা কি ঈমান আনব যেমন নির্বোধরা ঈমান এনেছে’? জেনে রাখ, নিশ্চয় তারাই নির্বোধ; কিন্তু তারা জানে না।",
    "আর যখন তারা মুমিনদের সাথে মিলিত হয়, তখন বলে ‘আমরা ঈমান এনেছি’ এবং যখন তাদের শয়তানদের সাথে একান্তে মিলিত হয়, তখন বলে, ‘নিশ্চয় আমরা তোমাদের সাথে আছি। আমরা তো কেবল উপহাসকারী’।",
    "আল্লাহ তাদের প্রতি উপহাস করেন এবং তাদেরকে তাদের অবাধ্যতায় বিভ্রান্ত হয়ে ঘোরার অবকাশ দেন।",
    "এরাই তারা, যারা হিদায়াতের বিনিময়ে পথভ্রষ্টতা ক্রয় করেছে। কিন্তু তাদের ব্যবসা লাভজনক হয়নি এবং তারা হিদায়াতপ্রাপ্ত ছিল না।",
    "তাদের উপমা ঐ ব্যক্তির মত, যে আগুন জ্বালাল। এরপর যখন আগুন তার চারপাশ আলোকিত করল, আল্লাহ তাদের আলো কেড়ে নিলেন এবং তাদেরকে ছেড়ে দিলেন এমন অন্ধকারে যে, তারা দেখছে না।",
    "তারা বধির-মূক-অন্ধ। তাই তারা ফিরে আসবে না।",
    "কিংবা আকাশের বর্ষণমুখর মেঘের ন্যায়, যাতে রয়েছে ঘন অন্ধকার, বজ্রধ্বনি ও বিদ্যুৎচমক। বজ্রের গর্জনে তারা মৃত্যুর ভয়ে তাদের কানে আঙুল দিয়ে রাখে। আর আল্লাহ কাফিরদেরকে পরিবেষ্টন করে আছেন।",
    "বিদ্যুৎচমক তাদের দৃষ্টি কেড়ে নেয়ার উপক্রম হয়। যখনই তা তাদের জন্য আলো দেয়, তারা তাতে চলতে থাকে। আর যখন তা তাদের উপর অন্ধকার করে দেয়, তারা দাঁড়িয়ে পড়ে। আর আল্লাহ যদি চাইতেন, অবশ্যই তাদের শ্রবণ ও চোখসমূহ নিয়ে নিতেন। নিশ্চয় আল্লাহ সব কিছুর উপর ক্ষমতাবান।",
    "হে মানুষ, তোমরা তোমাদের রবের ইবাদাত কর, যিনি সৃষ্টি করেছেন তোমাদেরকে এবং তোমাদের পূর্বে যারা ছিল তাদেরকে, যাতে তোমরা তাকওয়া অবলম্বন কর।",
    "যিনি তোমাদের জন্য যমীনকে করেছেন বিছানা, আসমানকে ছাদ এবং আসমান থেকে নাযিল করেছেন বৃষ্টি। অতঃপর তাঁর মাধ্যমে উৎপন্ন করেছেন ফল-ফলাদি, তোমাদের জন্য রিয্কস্বরূপ। সুতরাং তোমরা জেনে-বুঝে আল্লাহর জন্য সমকক্ষ নির্ধারণ করো না।",
    "আর আমি আমার বান্দার উপর যা নাযিল করেছি, যদি তোমরা সে সম্পর্কে সন্দেহে থাক, তবে তোমরা তার মত একটি সূরা নিয়ে আস এবং আল্লাহ ছাড়া তোমাদের সাক্ষীসমূহকে ডাক; যদি তোমরা সত্যবাদী হও।",
    "অতএব যদি তোমরা তা না কর- আর কখনো তোমরা তা করবে না- তাহলে আগুনকে ভয় কর যার জ্বালানী হবে মানুষ ও পাথর, যা প্রস্তুত করা হয়েছে কাফিরদের জন্য।",
    "যারা ঈমান এনেছে এবং নেক কাজ করেছে তুমি তাদেরকে সুসংবাদ দাও যে, তাদের জন্য রয়েছে জান্নাতসমূহ, যার তলদেশ দিয়ে প্রবাহিত হবে নদীসমূহ। যখনই তাদেরকে জান্নাত থেকে কোন ফল খেতে দেয়া হবে, তারা বলবে, ‘এটাই তো পূর্বে আমাদেরকে খেতে দেয়া হয়েছিল’। আর তাদেরকে তা দেয়া হবে সাদৃশ্যপূর্ণ করে এবং তাদের জন্য তাতে থাকবে পবিত্র স্ত্রীগণ এবং তারা সেখানে হবে স্থায়ী।",
    "নিশ্চয় আল্লাহ মশা কিংবা তার চেয়েও ছোট কিছুর উপমা দিতে লজ্জা করেন না। সুতরাং যারা ঈমান এনেছে তারা জানে, নিশ্চয় তা তাদের রবের পক্ষ থেকে সত্য। আর যারা কুফরী করেছে তারা বলে, আল্লাহ এর মাধ্যমে উপমা দিয়ে কী চেয়েছেন? তিনি এ দিয়ে অনেককে পথভ্রষ্ট করেন এবং এ দিয়ে অনেককে হিদায়াত দেন। আর এর মাধ্যমে কেবল ফাসিকদেরকেই পথভ্রষ্ট করেন।",
    "যারা আল্লাহর দৃঢ়কৃত অঙ্গীকার ভঙ্গ করে এবং আল্লাহ যা জোড়া লাগানোর নির্দেশ দিয়েছেন তা ছিন্ন করে এবং যমীনে ফাসাদ করে। তারাই ক্ষতিগ্রস্ত।",
    "কীভাবে তোমরা আল্লাহর সাথে কুফরী করছ অথচ তোমরা ছিলে মৃত? অতঃপর তিনি তোমাদেরকে জীবিত করেছেন। এরপর তিনি তোমাদেরকে মৃত্যু দেবেন অতঃপর জীবিত করবেন। এরপর তাঁরই নিকট তোমাদেরকে ফিরিয়ে নেয়া হবে।",
    "তিনিই যমীনে যা আছে সব তোমাদের জন্য সৃষ্টি করেছেন। তারপর আসমানের প্রতি খেয়াল করলেন এবং তাকে সাত আসমানে সুবিন্যস্ত করলেন। আর সব কিছু সম্পর্কে তিনি সম্যক জ্ঞাত।",
    "আর স্মরণ কর, যখন তোমার রব ফেরেশতাদেরকে বললেন, ‘নিশ্চয় আমি যমীনে একজন খলীফা সৃষ্টি করছি’, তারা বলল, ‘আপনি কি সেখানে এমন কাউকে সৃষ্টি করবেন, যে তাতে ফাসাদ করবে এবং রক্ত প্রবাহিত করবে? আর আমরা তো আপনার প্রশংসায় তাসবীহ পাঠ করছি এবং আপনার পবিত্রতা ঘোষণা করছি। তিনি বললেন, নিশ্চয় আমি জানি যা তোমরা জান না।",
    "আর তিনি আদমকে নামসমূহ সব শিক্ষা দিলেন তারপর তা ফেরেশতাদের সামনে উপস্থাপন করলেন। সুতরাং বললেন, ‘তোমরা আমাকে এগুলোর নাম জানাও, যদি তোমরা সত্যবাদী হও’।",
    "তারা বলল, ‘আপনি পবিত্র মহান। আপনি আমাদেরকে যা শিখিয়েছেন, তা ছাড়া আমাদের কোন জ্ঞান নেই। নিশ্চয় আপনি সর্বজ্ঞ, প্রজ্ঞাময়’।",
    "তিনি বললেন, ‘হে আদম, এগুলোর নাম তাদেরকে জানাও’। অতঃপর যখন সে এগুলোর নাম তাদেরকে জানাল, তিনি বললেন, ‘আমি কি তোমাদেরকে বলিনি, নিশ্চয় আমি আসমানসমূহ ও যমীনের গায়েব জানি এবং জানি যা তোমরা প্রকাশ কর এবং যা তোমরা গোপন করতে’?",
    "আর যখন আমি ফেরেশতাদেরকে বললাম, ‘তোমরা আদমকে সিজদা কর’। তখন তারা সিজদা করল, ইবলীস ছাড়া। সে অস্বীকার করল এবং অহঙ্কার করল। আর সে হল কাফিরদের অন্তর্ভুক্ত।",
    "আর আমি বললাম, ‘হে আদম, তুমি ও তোমার স্ত্রী জান্নাতে বসবাস কর এবং তা থেকে আহার কর স্বাচ্ছন্দ্যে, তোমাদের ইচ্ছানুযায়ী এবং এই গাছটির নিকটবর্তী হয়ো না, তাহলে তোমরা যালিমদের অন্তর্ভুক্ত হয়ে যাবে।",
    "অতঃপর শয়তান তাদেরকে জান্নাত থেকে স্খলিত করল। এবং তারা যাতে ছিল তা থেকে তাদেরকে বের করে দিল, আর আমি বললাম, ‘তোমরা নেমে যাও। তোমরা একে অপরের শত্রু। আর তোমাদের জন্য যমীনে রয়েছে নির্দিষ্ট সময় পর্যন্ত আবাস ও ভোগ-উপকরণ’।",
    "অতঃপর আদম তার রবের পক্ষ থেকে কিছু বাণী পেল, ফলে আল্লাহ তার তাওবা কবূল করলেন। নিশ্চয় তিনি তাওবা কবূলকারী, অতি দয়ালু।",
    "আমি বললাম,‘তোমরা সবাই তা থেকে নেমে যাও। অতঃপর যখন আমার পক্ষ থেকে তোমাদের কাছে কোন হিদায়াত আসবে, তখন যারা আমার হিদায়াত অনুসরণ করবে, তাদের কোন ভয় নেই এবং তারা দুঃখিতও হবে না’।",
    "আর যারা কুফরী করেছে এবং আমার আয়াতসমূহকে অস্বীকার করেছে, তারাই আগুনের অধিবাসী। তারা সেখানে স্থায়ী হবে।",
    "হে বনী ইসরাঈল, তোমরা আমার নিআমতকে স্মরণ কর, যে নিআমত আমি তোমাদেরকে দিয়েছি এবং তোমরা আমার অঙ্গীকার পূর্ণ কর, তাহলে আমি তোমাদের অঙ্গীকার পূর্ণ করব। আর কেবল আমাকেই ভয় কর।",
    "আর তোমাদের সাথে যা আছে তার সত্যায়নকারীস্বরূপ আমি যা নাযিল করেছি তার প্রতি তোমরা ঈমান আন এবং তোমরা তা প্রথম অস্বীকারকারী হয়ো না। আর তোমরা আমার আয়াতসমূহ সামান্যমূল্যে বিক্রি করো না এবং কেবল আমাকেই ভয় কর।",
    "আর তোমরা হককে বাতিলের সাথে মিশ্রিত করো না এবং জেনে-বুঝে হককে গোপন করো না।",
    "আর তোমরা সালাত কায়েম কর, যাকাত প্রদান কর এবং রুকূকারীদের সাথে রুকূ কর।",
    "তোমরা কি মানুষকে ভাল কাজের আদেশ দিচ্ছ আর নিজদেরকে ভুলে যাচ্ছ? অথচ তোমরা কিতাব তিলাওয়াত কর। তোমরা কি বুঝ না?",
    "আর তোমরা ধৈর্য ও সালাতের মাধ্যমে সাহায্য চাও। নিশ্চয় তা বিনয়ী ছাড়া অন্যদের উপর কঠিন।",
    "যারা বিশ্বাস করে যে, তারা তাদের রবের সাথে সাক্ষাৎ করবে এবং তারা তাঁর দিকে ফিরে যাবে।",
    "হে বনী ইসরাঈল, তোমরা আমার নিআমতকে স্মরণ কর, যে নিআমত আমি তোমাদেরকে দিয়েছি এবং নিশ্চয় আমি তোমাদেরকে বিশ্ববাসীর উপর শ্রেষ্ঠত্ব দিয়েছি।",
    "আর তোমরা সে দিনকে ভয় কর, যেদিন কেউ কারো কোন কাজে আসবে না। আর কারো পক্ষ থেকে কোন সুপারিশ গ্রহণ করা হবে না এবং কারও কাছ থেকে কোন বিনিময় নেয়া হবে না। আর তারা সাহায্যপ্রাপ্তও হবে না।",
    "আর স্মরণ কর, যখন আমি তোমাদেরকে ফির‘আউনের দল থেকে রক্ষা করেছিলাম। তারা তোমাদেরকে কঠিন আযাব দিত। তোমাদের পুত্র সন্তানদেরকে যবেহ করত এবং তোমাদের নারীদেরকে বাঁচিয়ে রাখত। আর এতে তোমাদের রবের পক্ষ থেকে ছিল মহা পরীক্ষা।",
    "আর যখন তোমাদের জন্য আমি সমুদ্রকে বিভক্ত করেছিলাম, অতঃপর তোমাদেরকে নাজাত দিয়েছিলাম এবং ফির‘আউন দলকে ডুবিয়ে দিয়েছিলাম, আর তোমরা দেখছিলে।",
    "আর যখন আমি মূসাকে চল্লিশ রাতের ওয়াদা দিয়েছিলাম অতঃপর তোমরা তার যাওয়ার পর বাছুরকে (উপাস্যরূপে) গ্রহণ করেছিলে, আর তোমরা ছিলে যালিম।",
    "তারপর আমি তোমাদেরকে এ সবের পর ক্ষমা করেছি, যাতে তোমরা শোকর আদায় কর।",
    "আর যখন আমি মূসাকে দিয়েছিলাম কিতাব ও ফুরকান* যাতে তোমরা হিদায়াতপ্রাপ্ত হও। \n*- সত্য-মিথ্যার মধ্যে পার্থক্যকারী তাওরাতের বাণীসমগ্র।",
    "আর যখন মূসা তার কওমকে বলেছিল, ‘হে আমার কওম, নিশ্চয় তোমরা বাছুরকে (উপাস্যরূপে) গ্রহণ করে নিজদের উপর যুলম করেছ। সুতরাং তোমরা তোমাদের সৃষ্টিকর্তার কাছে তাওবা কর। অতঃপর তোমরা নিজদেরকে হত্যা কর। এটি তোমাদের জন্য তোমাদের সৃষ্টিকর্তার নিকট উত্তম। অতঃপর আল্লাহ তোমাদের তাওবা কবূল করলেন। নিশ্চয় তিনি তাওবা কবূলকারী, পরম দয়ালু।",
    "আর যখন তোমরা বললে, ‘হে মূসা, আমরা তোমার প্রতি ঈমান আনব না, যতক্ষণ না আমরা প্রকাশ্যে আল্লাহকে দেখি’। ফলে বজ্র তোমাদেরকে পাকড়াও করল আর তোমরা তা দেখছিলে।",
    "অতঃপর আমি তোমাদের মৃত্যুর পর তোমাদেরকে পুনঃজীবন দান করলাম, যাতে তোমরা শোকর আদায় কর।",
    "আর আমি তোমাদের উপর মেঘের ছায়া দিলাম এবং তোমাদের প্রতি নাযিল করলাম ‘মান্না’* ও ‘সালওয়া’**। তোমরা সে পবিত্র বস্ত্ত থেকে আহার কর, যা আমি তোমাদেরকে রিয্ক দিয়েছি। আর তারা আমার প্রতি যুলম করেনি, বরং তারা নিজদেরকেই যুলম করত। \n*‘মান্না’ এক ধরণের সুস্বাদু খাবার, যা শিশিরের মত গাছের পাতায় ও ঘাসের উপর জমে থাকত। আল্লাহ বিশেষভাবে তা বনী ইসরাঈলের জন্য প্রেরণ করেছিলেন।",
    "আর স্মরণ কর, যখন আমি বললাম, ‘তোমরা প্রবেশ কর এই জনপদে। আর তা থেকে আহার কর তোমাদের ইচ্ছানুযায়ী, স্বাচ্ছন্দ্যে এবং দরজায় প্রবেশ কর মাথা নীচু করে। আর বল ‘ক্ষমা’। তাহলে আমি তোমাদের পাপসমূহ ক্ষমা করে দেব এবং নিশ্চয় আমি সৎকর্মশীলদেরকে বাড়িয়ে দেব’।",
    "অতঃপর যালিমরা পবিবর্তন করে ফেলল সে কথা যা তাদেরকে বলা হয়েছিল, ভিন্ন অন্য কথা দিয়ে। ফলে আমি তাদের উপর আসমান থেকে আযাব নাযিল করলাম, কারণ তারা পাপাচার করত।",
    "আর স্মরণ কর, যখন মূসা তার কওমর জন্য পানি চাইল, তখন আমি বললাম, ‘তুমি তোমার লাঠি দ্বারা পাথরকে আঘাত কর’। ফলে তা থেকে উৎসারিত হল বারটি ঝরনা। প্রতিটি দল তাদের পানি পানের স্থান জেনে নিল। তোমরা আল্লাহর রিয্ক থেকে আহার কর ও পান কর এবং ফাসাদকারী হয়ে যমীনে ঘুরে বেড়িয়ো না।",
    "আর যখন তোমরা বললে, ‘হে মূসা, আমরা এক খাবারের উপর কখনো ধৈর্য ধরব না। সুতরাং তুমি আমাদের জন্য তোমার রবের নিকট দো‘আ কর, যেন তিনি আমাদের জন্য বের করেন, ভূমি যে সব্জি, কাঁকড়, রসুন, মসুর ও পেঁয়াজ উৎপন্ন করে, তা’। সে বলল, ‘তোমরা কি যা উত্তম তার পরিবর্তে এমন জিনিস গ্রহণ করছ যা নিম্নমানের? তোমরা কোন এক নগরীতে অবতরণ কর। তবে নিশ্চয় তোমাদের জন্য (সেখানে) থাকবে, যা তোমরা চেয়েছ’। আর তাদের উপর আরোপ করা হয়েছে লাঞ্ছনা ও দারিদ্র্য এবং তারা আল্লাহর ক্রোধের শিকার হল। তা এই কারণে যে, তারা আল্লাহর আয়াতসমূহকে অস্বীকার করত এবং অন্যায়ভাবে নবীদেরকে হত্যা করত। তা এই কারণে যে, তারা নাফরমানী করেছিল এবং তারা সীমালঙ্ঘন করত।",
    "নিশ্চয় যারা ঈমান এনেছে, যারা ইয়াহূদী হয়েছে এবং নাসারা ও সাবিঈরা* -(তাদের মধ্যে) যারা ঈমান এনেছে আল্লাহ ও শেষ দিনের প্রতি এবং নেক কাজ করেছে - তবে তাদের জন্য রয়েছে তাদের রবের নিকট তাদের প্রতিদান। আর তাদের কোন ভয় নেই এবং তারা দুঃখিতও হবে না। \n*সাবিঈ- বিভিন্ন গ্রহ-নক্ষত্রের পূজারী মতান্তরে ফেরেশতাদের উপাসনাকারী।",
    "আর স্মরণ কর, যখন আমি তোমাদের অঙ্গীকার গ্রহণ করলাম এবং তূর পাহাড়কে তোমাদের উপর উঠালাম আমি (বললাম) ‘তোমাদেরকে যা দিয়েছি, তা শক্তভাবে ধর এবং তাতে যা রয়েছে তা স্মরণ কর, যাতে তোমরা তাকওয়া অবলম্বন করতে পার’।",
    "অতঃপর তোমরা এ সবের পর বিমুখ হয়ে ফিরে গেলে। আর যদি তোমাদের উপর আল্লাহর অনুগ্রহ ও রহমত না হত, তোমরা অবশ্যই ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হতে।",
    "আর তোমাদের মধ্যে যারা শনিবারের ব্যাপারে সীমালঙ্ঘন করেছিল, তাদেরকে অবশ্যই তোমরা জান। অতঃপর আমি তাদেরকে বললাম, ‘তোমরা নিকৃষ্ট বানর হয়ে যাও’।",
    "আর আমি একে বানিয়েছি দৃষ্টান্ত, সে সময়ের এবং তৎপরবর্তী জনপদসমূহের জন্য এবং মুত্তাকীদের জন্য উপদেশ।",
    "আর স্মরণ কর, যখন মূসা তার কওমকে বলল, ‘নিশ্চয় আল্লাহ তোমাদেরকে নির্দেশ দিচ্ছেন যে, তোমরা একটি গাভী যবেহ করবে’। তারা বলল, ‘তুমি কি আমাদের সাথে উপহাস করছ’? সে বলল, ‘আমি মূর্খদের অন্তর্ভুক্ত হওয়া থেকে আল্লাহর আশ্রয় চাচ্ছি’।",
    "তারা বলল, ‘তুমি আমাদের জন্য তোমার রবের নিকট দো‘আ কর, তিনি যেন আমাদের জন্য স্পষ্ট করে দেন গাভীটি কেমন হবে’। সে বলল, ‘নিশ্চয় তিনি বলছেন, নিশ্চয় তা হবে গরু, বুড়ো নয় এবং বাচ্চাও নয়। এর মাঝামাঝি ধরনের। সুতরাং তোমরা কর যা তোমাদেরকে নির্দেশ দেয়া হচ্ছে’।",
    "তারা বলল, ‘তুমি আমাদের জন্য তোমার রবের নিকট দো‘আ কর, তিনি যেন আমাদের জন্য স্পষ্ট করে দেন, কেমন তার রঙ’? সে বলল, ‘নিশ্চয় তিনি বলছেন, নিশ্চয় তা হবে হলুদ রঙের গাভী, তার রঙ উজ্জ্বল, দর্শকদেরকে যা আনন্দ দেবে’।",
    "তারা বলল, ‘তুমি আমাদের জন্য তোমার রবের নিকট দো‘আ কর, তিনি যেন আমাদের জন্য স্পষ্ট করে দেন, তা কেমন? নিশ্চয় গরুটি আমাদের জন্য সন্দেহপূর্ণ হয়ে গিয়েছে। আর নিশ্চয় আমরা আল্লাহ চাহে তো পথপ্রাপ্ত হব’।",
    "সে বলল, ‘নিশ্চয় তিনি বলছেন, ‘নিশ্চয় তা এমন গাভী, যা ব্যবহৃত হয়নি জমি চাষ করায় আর না ক্ষেতে পানি দেয়ায়। সুস্থ যাতে কোন খুঁত নেই’। তারা বলল, ‘এখন তুমি সত্য নিয়ে এসেছ’। অতঃপর তারা তা যবেহ করল অথচ তারা তা করার ছিল না।",
    "আর স্মরণ কর, যখন তোমরা একজনকে হত্যা করলে অতঃপর সে ব্যাপারে একে অপরকে দোষারোপ করলে। আর আল্লাহ প্রকাশ করে দিলেন তোমরা যা গোপন করছিলে।",
    "অতঃপর আমি বললাম, ‘তোমরা তাকে আঘাত কর গাভীটির (গোশতের) কিছু অংশ দিয়ে। এভাবে আল্লাহ জীবিত করেন মৃতদেরকে। আর তিনি তোমাদেরকে তাঁর নিদর্শনসমূহ দেখান, যাতে তোমরা বুঝ।",
    "অতঃপর তোমাদের অন্তরসমূহ এর পরে কঠিন হয়ে গেল যেন তা পাথরের মত কিংবা তার চেয়েও শক্ত। আর নিশ্চয় পাথরের মধ্যে কিছু আছে, যা থেকে নহর উৎসারিত হয়। আর নিশ্চয় তার মধ্যে কিছু আছে যা চূর্ণ হয়। ফলে তা থেকে পানি বের হয়। আর নিশ্চয় তার মধ্যে কিছু আছে যা আল্লাহর ভয়ে ধ্বসে পড়ে। আর আল্লাহ তোমরা যা কর, সে সম্পর্কে গাফেল নন।",
    "তোমরা কি এই আশা করছ যে, তারা তোমাদের প্রতি ঈমান আনবে? অথচ তাদের একটি দল ছিল যারা আল্লাহর বাণী শুনত অতঃপর তা বুঝে নেয়ার পর তা তারা বিকৃত করত জেনে বুঝে।",
    "আর যখন তারা মুমিনদের সাথে সাক্ষাৎ করে তখন বলে, ‘আমরা ঈমান এনেছি’। আর যখন একে অপরের সাথে একান্তে মিলিত হয় তখন বলে, ‘তোমরা কি তাদের সাথে সে কথা আলোচনা কর, যা আল্লাহ তোমাদের উপর উম্মুক্ত করেছেন, যাতে তারা এর মাধ্যমে তোমাদের রবের নিকট তোমাদের বিরুদ্ধে দলীল পেশ করবে? তবে কি তোমরা বুঝ না’?",
    "তারা কি জানে না যে, তারা যা গোপন করে এবং যা প্রকাশ করে, তা আল্লাহ জানেন?",
    "আর তাদের মধ্যে আছে নিরক্ষর, তারা মিথ্যা আকাঙ্খা ছাড়া কিতাবের কোন জ্ঞান রাখে না এবং তারা শুধুই ধারণা করে থাকে।",
    "সুতরাং ধ্বংস তাদের জন্য যারা নিজ হাতে কিতাব লিখে। তারপর বলে, ‘এটি আল্লাহর পক্ষ থেকে’, যাতে তা তুচ্ছ মূল্যে বিক্রি করতে পারে। সুতরাং তাদের হাত যা লিখেছে তার পরিণামে তাদের জন্য ধ্বংস, আর তারা যা উপার্জন করেছে তার কারণেও তাদের জন্য ধ্বংস।",
    "আর তারা বলে, ‘গোনা-কয়েকদিন ছাড়া আগুন আমাদেরকে কখনো স্পর্শ করবে না’। বল, ‘তোমরা কি আল্লাহর নিকট ওয়াদা নিয়েছ, ফলে আল্লাহ তাঁর ওয়াদা ভঙ্গ করবেন না? নাকি আল্লাহর উপর এমন কিছু বলছ, যা তোমরা জান না’?",
    "হাঁ, যে মন্দ উপার্জন করবে এবং তার পাপ তাকে বেষ্টন করে নেবে, তারাই আগুনের অধিবাসী। তারা সেখানে হবে স্থায়ী।",
    "আর যারা ঈমান এনেছে এবং নেক আমল করেছে, তারা জান্নাতের অধিবাসী। তারা সেখানে হবে স্থায়ী।",
    "আর স্মরণ কর, যখন আমি বনী ইসরাঈলের অঙ্গীকার গ্রহণ করলাম যে, তোমরা আল্লাহ ছাড়া কারো ইবাদাত করবে না এবং সদাচার করবে পিতা-মাতা, আত্মীয়-স্বজন, ইয়াতীম ও মিসকীনদের সাথে। আর মানুষকে উত্তম কথা বল, সালাত কায়েম কর এবং যাকাত প্রদান কর। অতঃপর তোমাদের মধ্য থেকে স্বল্প সংখ্যক ছাড়া তোমরা সকলে উপেক্ষা করে মুখ ফিরিয়ে নিলে।",
    "আর যখন আমি তোমাদের অঙ্গীকার গ্রহণ করলাম যে, তোমরা নিজদের রক্ত প্রবাহিত করবে না এবং নিজদেরকে তোমাদের গৃহসমূহ থেকে বের করবে না। অতঃপর তোমরা স্বীকার করে নিলে। আর তোমরা তার সাক্ষী।",
    "অতঃপর তোমরাই তো তারা, যারা নিজদেরকে হত্যা করছ এবং তোমাদের মধ্য থেকে একটি দলকে তাদের গৃহ থেকে বের করে দিচ্ছ; পাপ ও সমীলঙ্ঘনের মাধ্যমে তাদের বিরুদ্ধে সহায়তা করছ। আর তারা যদি বন্দী হয়ে তোমাদের নিকট আসে, তোমরা মুক্তিপণ দিয়ে তাদেরকে মুক্ত কর। অথচ তাদেরকে বের করা তোমাদের জন্য হারাম ছিল। তোমরা কি কিতাবের কিছু অংশে ঈমান রাখ আর কিছু অংশ অস্বীকার কর? সুতরাং তোমাদের মধ্যে যারা তা করে দুনিয়ার জীবনে লাঞ্ছনা ছাড়া তাদের কী প্রতিদান হতে পারে? আর কিয়ামতের দিনে তাদেরকে কঠিনতম আযাবে নিক্ষেপ করা হবে। আর তোমরা যা কর, আল্লাহ সে সম্পর্কে গাফিল নন।",
    "তারা আখিরাতের বিনিময়ে দুনিয়ার জীবনকে খরিদ করেছে। সুতরাং তাদের থেকে আযাব হালকা করা হবে না এবং তারা সাহায্যপ্রাপ্তও হবে না।",
    "আর আমি নিশ্চয় মূসাকে কিতাব দিয়েছি এবং তার পরে একের পর এক রাসূল প্রেরণ করেছি এবং মারইয়াম পুত্র ঈসাকে দিয়েছি সুস্পষ্ট নিদর্শনসমূহ। আর তাকে শক্তিশালী করেছি ‘পবিত্র আত্মা’র* মাধ্যমে। তবে কি তোমাদের নিকট যখনই কোন রাসূল এমন কিছু নিয়ে এসেছে, যা তোমাদের মনঃপূত নয়, তখন তোমরা অহঙ্কার করেছ, অতঃপর (নবীদের) একদলকে তোমরা মিথ্যাবাদী বলেছ আর একদলকে হত্যা করেছ। \n*পবিত্র আত্মা অর্থ জিবরীল(আ.)",
    "আর তারা বলল, আমাদের অন্তরসমূহ আচ্ছাদিত; বরং তাদের কুফরীর কারণে আল্লাহ তাদেরকে লা‘নত করেছেন। অতঃপর তারা খুব কমই ঈমান আনে।",
    "আর যখন তাদের কাছে, তাদের সাথে যা আছে, আল্লাহর পক্ষ থেকে তার সত্যায়নকারী কিতাব এল, অথচ তারা পূর্বে কাফিরদের উপর বিজয় কামনা করত। সুতরাং যখন তাদের নিকট এল যা তারা চিনত, তখন তারা তা অস্বীকার করল। অতএব কাফিরদের উপর আল্লাহর লা‘নত।",
    "যার বিনিময়ে তারা নিজদেরকে বিক্রয় করেছে তা কত জঘন্য (তা এই) যে, আল্লাহ যা নাযিল করেছেন তা তারা অস্বীকার করেছে এই জিদের বশবর্তী হয়ে যে, আল্লাহ তাঁর বান্দাদের মধ্য থেকে যাকে ইচ্ছা তার উপর তাঁর অনুগ্রহ নাযিল করেছেন। সুতরাং তারা ক্রোধের উপর ক্রোধের অধিকারী হল। আর কাফিরদের জন্য রয়েছে লাঞ্ছনাকর আযাব।",
    "আর যখন তাদেরকে বলা হয়, ‘আল্লাহ যা নাযিল করেছেন তোমরা তার প্রতি ঈমান আন’। তারা বলে, ‘আমাদের প্রতি যা নাযিল হয়েছে আমরা তা বিশ্বাস করি’। আর এর বাইরে যা আছে তারা তা অস্বীকার করে। অথচ তা সত্য, তাদের সাথে যা আছে তার সত্যায়নকারী। বল, ‘তবে কেন তোমরা আল্লাহর নবীদেরকে পূর্বে হত্যা করতে, যদি তোমরা মুমিন হয়ে থাক’?",
    "আর অবশ্যই মূসা তোমাদের নিকট সুস্পষ্ট নিদর্শনসমূহ নিয়ে এসেছে। অতঃপর তোমরা তার পরে বাছুরকে (উপাস্যরূপে) গ্রহণ করলে। আর তোমরা তো যালিম।",
    "আর স্মরণ কর, যখন আমি তোমাদের প্রতিশ্রুতি গ্রহণ করেছিলাম এবং তোমাদের উপর তূরকে উঠিয়েছিলাম- (বলেছিলাম) ‘আমি তোমাদেরকে যা দিয়েছি তা শক্তভাবে ধর এবং শোন’। তারা বলেছিল, ‘আমরা শুনলাম এবং অমান্য করলাম। আর তাদের কুফরীর কারণে তাদের অন্তরে গো-বাছুর প্রীতি সিঞ্চিত করা হয়েছিল। বল, ‘তোমাদের ঈমান যার নির্দেশ দেয় কত মন্দ তা! যদি তোমরা মুমিন হয়ে থাক’।",
    "বল, ‘যদি অন্যান্য মানুষ ছাড়া আল্লাহর নিকট আখিরাতের আবাস শুধু তোমাদের জন্যই নির্দিষ্ট থাকে, তবে তোমরা মৃত্যু কামনা কর, যদি তোমরা সত্যবাদী হয়ে থাক’।",
    "আর তারা কখনো তা কামনা করবে না, তাদের হাত যা পাঠিয়েছে তার কারণে। আর আল্লাহ যালিমদের সম্পর্কে অধিক জ্ঞাত।",
    "আর তুমি তাদেরকে পাবে জীবনের প্রতি সর্বাধিক লোভী মানুষরূপে। এমনকি তাদের থেকেও যারা শিরক করেছে। তাদের একজন কামনা করে, যদি হাজার বছর তাকে জীবন দেয়া হত! অথচ দীর্ঘজীবী হলেই তা তাকে আযাব থেকে নিষ্কৃতি দিতে পারবে না। আর তারা যা করে আল্লাহ সে সম্পর্কে সম্যক দ্রষ্টা।",
    "বল, ‘যে জিবরীলের শত্রু হবে (সে অনুশোচনায় মরুক) কেননা নিশ্চয় জিবরীল তা আল্লাহর অনুমতিতে তোমার অন্তরে নাযিল করেছে, তার সামনে থাকা কিতাবের সমর্থক, হিদায়াত ও মুমিনদের জন্য সুসংবাদরূপে’।",
    "‘যে শত্রু হবে আল্লাহর, তাঁর ফেরেশতাদের, তাঁর রাসূলগণের, জিবরীলের ও মীকাঈলের তবে নিশ্চয় আল্লাহ কাফিরদের শত্রু’।",
    "আর আমি অবশ্যই তোমার প্রতি সুস্পষ্ট নিদর্শনসমূহ নাযিল করেছি, ফাসিকরা ছাড়া অন্য কেউ তা অস্বীকার করে না।",
    "তবে কি যখনই তারা কোন ওয়াদা করেছে, তখনই তাদের মধ্য থেকে কোন এক দল তা ছুড়ে মেরেছে? বরং তাদের অধিকাংশ ঈমান রাখে না।",
    "আর যখন তাদের নিকট আল্লাহর কাছ থেকে একজন রাসূল এল, তাদের সাথে যা আছে তা সমর্থন করে, তখন আহলে কিতাবের একটি দল আল্লাহর কিতাবকে তাদের পেছনে ফেলে দিল, (এভাবে যে) মনে হয় যেন তারা জানে না।",
    "আর তারা অনুসরণ করেছে, যা শয়তানরা সুলাইমানের রাজত্বে পাঠ করত। আর সুলাইমান কুফরী করেনি; বরং শয়তানরা কুফরী করেছে। তারা মানুষকে যাদু শেখাত এবং (তারা অনুসরণ করেছে) যা নাযিল করা হয়েছিল বাবেলের দুই ফেরেশতা হারূত ও মারূতের উপর। আর তারা কাউকে শেখাত না যে পর্যন্ত না বলত যে, ‘আমরা তো পরীক্ষা, সুতরাং তোমরা কুফরী করো না। এরপরও তারা এদের কাছ থেকে শিখত, যার মাধ্যমে তারা পুরুষ ও তার স্ত্রীর মধ্যে বিচ্ছেদ ঘটাত। অথচ তারা তার মাধ্যমে কারো কোন ক্ষতি করতে পারত না আল্লাহর অনুমতি ছাড়া। আর তারা শিখত যা তাদের ক্ষতি করত, তাদের উপকার করত না এবং তারা অবশ্যই জানত যে, যে ব্যক্তি তা ক্রয় করবে, আখিরাতে তার কোন অংশ থাকবে না। আর তা নিশ্চিতরূপে কতই-না মন্দ, যার বিনিময়ে তারা নিজদেরকে বিক্রয় করেছে। যদি তারা জানত।",
    "আর যদি তারা ঈমান আনত এবং তাকওয়া অবলম্বন করত, তবে অবশ্যই আল্লাহর পক্ষ থেকে (তাদের জন্য) প্রতিদান উত্তম হত। যদি তারা জানত।",
    "হে মুমিনগণ, তোমরা ‘রা‘ইনা’* বলো না; বরং বল, ‘উনজুরনা’ আর শোন, কাফিরদের জন্য রয়েছে যন্ত্রণাদায়ক আযাব। \n*- راعنا রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে কথোপকথন বা তাঁর কাছ থেকে শিক্ষা গ্রহণের সময় মুমিনগণের বুঝতে সমস্যা হলে তারা বলতেন ‘রা‘ইনা’ অর্থাৎ আমাদের প্রতি লক্ষ্য করুন এবং ধীরে বলুন। শব্দটির আর একটি অর্থ ‘বোকা’। ইয়াহূদিরা তা শোনে সে অর্থে ব্যবহার শুরু করল এবং নিজেরা হাসি-ঠাট্টা করতে লাগল। তখন আল্লাহ তাআলা উক্ত দ্ব্যর্থবোধক শব্দটির পরিবর্তে পরিষ্কার অর্থবোধক শব্দ ‘উনজুরনা’ অর্থাৎ আমাদের প্রতি নজর দিন- শব্দটি ব্যবহার করার নির্দেশ দিলেন।",
    "আহলে কিতাব ও মুশরিকদের মধ্য থেকে যারা কুফরী করেছে, তারা চায় না যে, তোমাদের রবের পক্ষ থেকে তোমাদের উপর কোন কল্যাণ নাযিল হোক। আর আল্লাহ যাকে ইচ্ছা তাকে তাঁর রহমত দ্বারা খাস করেন এবং আল্লাহ মহান অনুগ্রহের অধিকারী।",
    "আমি যে আয়াত রহিত করি কিংবা ভুলিয়ে দেই, তার চেয়ে উত্তম কিংবা তার মত আনয়ন করি। তুমি কি জান না যে, আল্লাহ সব কিছুর উপর ক্ষমতাবান।",
    "তুমি কি জান না যে, নিশ্চয় আসমানসমূহ ও যমীনের রাজত্ব আল্লাহর? আর আল্লাহ ছাড়া তোমাদের কোন অভিভাবক ও সাহায্যকারী নেই।",
    "নাকি তোমরা চাও তোমাদের রাসূলকে প্রশ্ন করতে, যেমন পূর্বে মূসাকে প্রশ্ন করা হয়েছিল? আর যে ঈমানকে কুফরে পরিবর্তন করবে, সে নিশ্চয় সোজা পথবিচ্যুত হল।",
    "আহলে কিতাবের অনেকেই চায়, যদি তারা তোমাদেরকে ঈমান আনার পর কাফির অবস্থায় ফিরিয়ে নিতে পারত! সত্য স্পষ্ট হওয়ার পর তাদের পক্ষ থেকে হিংসাবশত (তারা এরূপ করে থাকে)। সুতরাং তোমরা ক্ষমা কর এবং এড়িয়ে চল, যতক্ষণ না আল্লাহ তাঁর নির্দেশ দেন। নিশ্চয় আল্লাহ সব কিছুর উপর ক্ষমতাবান।",
    "আর তোমরা সালাত কায়েম কর ও যাকাত দাও এবং যে নেক আমল তোমরা নিজদের জন্য আগে পাঠাবে, তা আল্লাহর নিকট পাবে। তোমরা যা করছ নিশ্চয় আল্লাহ তার সম্যক দ্রষ্টা।",
    "আর তারা বলে, ইয়াহূদী কিংবা নাসারা ছাড়া অন্য কেউ জান্নাতে প্রবেশ করবে না। এটা তাদের মিথ্যা আশা। বল, ‘তোমরা তোমাদের প্রমাণ নিয়ে আস, যদি তোমরা সত্যবাদী হয়ে থাক’।",
    "হ্যাঁ, যে নিজকে আল্লাহর কাছে সোপর্দ করেছে এবং সে সৎকর্মশীলও, তবে তার জন্য রয়েছে তার রবের নিকট প্রতিদান। আর তাদের কোন ভয় নেই এবং তারা দুঃখিতও হবে না।",
    "আর ইয়াহূদীরা বলে, ‘নাসারাদের কোন ভিত্তি নেই’ এবং নাসারারা বলে ‘ইয়াহূদীদের কোন ভিত্তি নেই’। অথচ তারা কিতাব পাঠ করে। এভাবেই, যারা কিছু জানে না, তারা তাদের কথার মত কথা বলে। সুতরাং যে বিষয়ে তারা মতবিরোধ করত আল্লাহ কিয়ামতের দিন সে বিষয়ে তাদের মধ্যে ফয়সালা করবেন।",
    "আর তার চেয়ে অধিক যালেম কে, যে আল্লাহর মাসজিদসমূহে তাঁর নাম স্মরণ করা থেকে বাধা প্রদান করে এবং তা বিরাণ করতে চেষ্টা করে? তাদের তো উচিৎ ছিল ভীত হয়ে তাতে প্রবেশ করা। তাদের জন্য দুনিয়ায় রয়েছে লাঞ্ছনা আর আখিরাতে তাদের জন্য রয়েছে মহাআযাব।",
    "আর পূর্ব ও পশ্চিম আল্লাহরই। সুতরাং তোমরা যে দিকেই মুখ ফিরাও, সে দিকেই আল্লাহর চেহারা। নিশ্চয় আল্লাহ প্রাচুর্যময়, সর্বজ্ঞ।",
    "আর তারা বলে, আল্লাহ সন্তান গ্রহণ করেছেন। তিনি পবিত্র মহান; বরং আসমানসমূহ ও যমীনে যা কিছু আছে তা তাঁরই । সব তাঁরই অনুগত।",
    "তিনি আসমানসমূহ ও যমীনের স্রষ্টা। আর যখন তিনি কোন বিষয়ের সিদ্ধান্ত নেন, তখন কেবল বলেন ‘হও’ ফলে তা হয়ে যায়।",
    "আর যারা জানে না, তারা বলে, ‘কেন আল্লাহ আমাদের সাথে কথা বলেন না কিংবা আমাদের কাছে কোন নিদর্শন আসে না’? এভাবেই, যারা তাদের পূর্বে ছিল তারা তাদের কথার মত কথা বলেছে। তাদের অন্তরসমূহ একই রকম হয়ে গিয়েছে। আমি তো আয়াতসমূহ সুস্পষ্ট করে দিয়েছি এমন কওমের জন্য, যারা দৃঢ় বিশ্বাস রাখে।",
    "নিশ্চয় আমি তোমাকে প্রেরণ করেছি সত্যসহ, সুসংবাদদাতা ও সতর্ককারীরূপে এবং তোমাকে আগুনের অধিবাসীদের সম্পর্কে প্রশ্ন করা হবে না।",
    "আর ইয়াহূদী ও নাসারারা কখনো তোমার প্রতি সন্তুষ্ট হবে না, যতক্ষণ না তুমি তাদের মিল্লাতের অনুসরণ কর। বল, ‘নিশ্চয় আল্লাহর হিদায়াতই হিদায়াত’ আর যদি তুমি তাদের প্রবৃত্তির অনুসরণ কর তোমার কাছে যে জ্ঞান এসেছে তার পর, তাহলে আল্লাহর বিপরীতে তোমার কোন অভিভাবক ও সাহায্যকারী থাকবে না।",
    "যাদেরকে আমি কিতাব দিয়েছি, তারা তা পাঠ করে যথার্থভাবে। তারাই তার প্রতি ঈমান আনে। আর যে তা অস্বীকার করে, তারাই ক্ষতিগ্রস্ত।",
    "হে বনী ইসরাঈল, তোমরা আমার নিআমতকে স্মরণ কর, যা আমি তোমাদেরকে দিয়েছি। আর নিশ্চয় আমি তোমাদেরকে শ্রেষ্ঠত্ব দিয়েছি সৃষ্টিকুলের উপর।",
    "আর তোমরা ভয় কর সেদিনকে, যেদিন কেউ কারো কোন কাজে আসবে না এবং কোন ব্যক্তি থেকে বিনিময় গ্রহণ করা হবে না আর কোন সুপারিশ তার উপকারে আসবে না এবং তারা সাহায্যপ্রাপ্তও হবে না।",
    "আর স্মরণ কর, যখন ইবরাহীমকে তার রব কয়েকটি বাণী দিয়ে পরীক্ষা করলেন, অতঃপর সে তা পূর্ণ করল। তিনি বললেন, ‘আমি তোমাকে মানুষের জন্য নেতা বানাব’। সে বলল, ‘আমার বংশধরদের থেকেও’? তিনি বললেন, ‘যালিমরা আমার ওয়াদাপ্রাপ্ত হয় না’।",
    "আর স্মরণ কর, যখন আমি কাবাকে মানুষের জন্য মিলনকেন্দ্র ও নিরাপদ স্থান বানালাম এবং (আদেশ দিলাম যে,) ‘তোমরা মাকামে ইবরাহীমকে সালাতের স্থানরূপে গ্রহণ কর’। আর আমি ইবরাহীম ও ইসমাঈলকে দায়িত্ব দিয়েছিলাম যে, ‘তোমরা আমার গৃহকে তাওয়াফকারী, ‘ইতিকাফকারী ও রুকূকারী-সিজদাকারীদের জন্য পবিত্র কর’।",
    "আর স্মরণ কর, যখন ইবরাহীম বলল, ‘হে আমার রব, আপনি একে নিরাপদ নগরী বানান এবং এর অধিবাসীদেরকে ফল-মুলের রিয্ক দিন যারা আল্লাহ ও শেষ দিনের প্রতি ঈমান এনেছে’। তিনি বললেন, ‘যে কুফরী করবে, তাকে আমি স্বল্প ভোগোপকরণ দিব। অতঃপর তাকে আগুনের আযাবে প্রবেশ করতে বাধ্য করব। আর তা কত মন্দ পরিণতি’।",
    "আর স্মরণ কর, যখন ইবরাহীম ও ইসমাঈল কাবার ভিত্গুলো উঠাচ্ছিল (এবং বলছিল,) ‘হে আমাদের রব, আমাদের পক্ষ থেকে কবূল করুন। নিশ্চয় আপনি সর্বশ্রোতা, সর্বজ্ঞানী’।",
    "‘হে আমাদের রব, আমাদেরকে আপনার অনুগত করুন এবং আমাদের বংশধরের মধ্য থেকে আপনার অনুগত জাতি বানান। আর আমাদেরকে আমাদের ইবাদাতের বিধি-বিধান দেখিয়ে দিন এবং আমাদেরকে ক্ষমা করুন। নিশ্চয় আপনি ক্ষমাশীল, পরম দয়ালু’।",
    "‘হে আমাদের রব, তাদের মধ্যে তাদের থেকে একজন রাসূল প্রেরণ করুন, যে তাদের প্রতি আপনার আয়াতসমূহ তিলাওয়াত করবে এবং তাদেরকে কিতাব ও হিকমত শিক্ষা দিবে আর তাদেরকে পবিত্র করবে। নিশ্চয় আপনি পরাক্রমশালী, প্রজ্ঞাময়’।",
    "আর যে নিজকে নির্বোধ বানিয়েছে, সে ছাড়া কে ইবরাহীমের আদর্শ থেকে বিমুখ হতে পারে? আর অবশ্যই আমি তাকে দুনিয়াতে বেছে নিয়েছি এবং নিশ্চয় সে আখিরাতে নেককারদের অন্তর্ভুক্ত থাকবে।",
    "যখন তার রব তাকে বললেন, ‘তুমি আত্মসমর্পণ কর’। সে বলল, ‘আমি সকল সৃষ্টির রবের কাছে নিজকে সমর্পণ করলাম’।",
    "আর এরই উপদেশ দিয়েছে ইবরাহীম তার সন্তানদেরকে এবং ইয়াকূবও (যে,) ‘হে আমার সন্তানেরা, নিশ্চয় আল্লাহ তোমাদের জন্য এই দীনকে চয়ন করেছেন। সুতরাং তোমরা মুসলিম হওয়া ছাড়া মারা যেয়ো না।",
    "নাকি তোমরা সাক্ষী ছিলে, যখন ইয়াকূবের নিকট মৃত্যু উপস্থিত হয়েছিল? যখন সে তার সন্তানদেরকে বলল, ‘আমার পর তোমরা কার ইবাদাত করবে’? তারা বলল, ‘আমরা ইবাদাত করব আপনার ইলাহের, আপনার পিতৃপুরুষ ইবরাহীম, ইসমাঈল ও ইসহাকের ইলাহের, যিনি এক ইলাহ। আর আমরা তাঁরই অনুগত’।",
    "সেটা এমন এক উম্মত যা বিগত হয়েছে। তারা যা অর্জন করেছে তা তাদের জন্যই, আর তোমরা যা অর্জন করেছ তা তোমাদের জন্যই। আর তারা যা করত সে সম্পর্কে তোমাদেরকে জিজ্ঞাসা করা হবে না।",
    "আর তারা বলে, ‘তোমরা ইয়াহূদী কিংবা নাসারা হয়ে যাও, হিদায়াত পেয়ে যাবে’। বল, ‘বরং আমরা ইবরাহীমের মিল্লাতের অনুসরণ করি, যে একনিষ্ঠ ছিল এবং যে মুশরিকদের অন্তর্ভুক্ত ছিল না’।",
    "তোমরা বল, ‘আমরা ঈমান এনেছি আল্লাহর উপর এবং যা নাযিল করা হয়েছে আমাদের উপর ও যা নাযিল করা হয়েছে ইবরাহীম, ইসমাঈল, ইসহাক, ইয়াকূব ও তাদের সন্তানদের উপর আর যা প্রদান করা হয়েছে মূসা ও ঈসাকে এবং যা প্রদান করা হয়েছে তাদের রবের পক্ষ হতে নবীগণকে। আমরা তাদের কারো মধ্যে তারতম্য করি না। আর আমরা তাঁরই অনুগত’।",
    "অতএব যদি তারা ঈমান আনে, তোমরা যেরূপে তার প্রতি ঈমান এনেছ, তবে অবশ্যই তারা হিদায়াতপ্রাপ্ত হবে। আর যদি তারা বিমুখ হয় তাহলে তারা রয়েছে কেবল বিরোধিতায়, তাই তাদের বিপক্ষে তোমার জন্য আল্লাহ যথেষ্ট। আর তিনি সর্বশ্রোতা, সর্বজ্ঞ।",
    "(বল,) আমরা আল্লাহর রং গ্রহণ করলাম। আর রং এর দিক দিয়ে আল্লাহর চেয়ে কে অধিক সুন্দর? আর আমরা তাঁরই ইবাদাতকারী।",
    "বল, ‘তোমরা কি আমাদের সাথে আল্লাহর ব্যাপারে বিতর্ক করছ অথচ তিনি আমাদের রব ও তোমাদের রব? আর আমাদের জন্য রয়েছে আমাদের আমলসমূহ এবং তোমাদের জন্য রয়েছে তোমাদের আমলসমূহ এবং আমরা তাঁর জন্যই একনিষ্ঠ।",
    "নাকি তোমরা বলছ, ‘নিশ্চয় ইবরাহীম, ইসমাঈল, ইসহাক, ইয়াকূব ও তাদের সন্তানেরা ছিল ইয়াহূদী কিংবা নাসারা? বল, ‘তোমরা অধিক জ্ঞাত নাকি আল্লাহ’? আর তার চেয়ে অধিক যালিম কে, যে আল্লাহর পক্ষ থেকে তার কাছে যে সাক্ষ্য রয়েছে তা গোপন করে? আর তোমরা যা কর, আল্লাহ সে সম্পর্কে গাফিল নন।",
    "সেটা ছিল একটি উম্মত, যারা বিগত হয়েছে। তারা যা অর্জন করেছে, তা তাদের জন্য আর তোমরা যা অর্জন করেছ তা তোমাদের জন্য। আর তারা যা করত, সে সম্পর্কে তোমাদেরকে জিজ্ঞাসা করা হবে না।",
    "অচিরেই নির্বোধ লোকেরা বলবে, 'কীসে তাদেরকে তাদের কিবলা থেকে ফিরাল, যার উপর তারা ছিল?' বল, 'পূর্ব ও পশ্চিম আল্লাহরই। তিনি যাকে চান সোজা পথ দেখান'।",
    "আর এভাবেই আমি তোমাদেরকে মধ্যপন্থী উম্মত বানিয়েছি, যাতে তোমরা মানুষের উপর সাক্ষী হও এবং রাসূল সাক্ষী হন তোমাদের উপর। আর যে কিবলার উপর তুমি ছিলে, তাকে কেবল এ জন্যই নির্ধারণ করেছিলাম, যাতে আমি জেনে নেই যে, কে রাসূলকে অনুসরণ করে এবং কে তার পেছনে ফিরে যায়। যদিও তা অতি কঠিন (অন্যদের কাছে) তাদের ছাড়া যাদেরকে আল্লাহ হিদায়াত করেছেন এবং আল্লাহ এমন নন যে, তিনি তোমাদের ঈমানকে বিনষ্ট করবেন। নিশ্চয় আল্লাহ মানুষের প্রতি অত্যন্ত স্নেহশীল, পরম দয়ালু।",
    "আকাশের দিকে বার বার তোমার মুখ ফিরানো আমি অবশ্যই দেখছি। অতএব আমি অবশ্যই তোমাকে এমন কিবলার দিকে ফিরাব, যা তুমি পছন্দ কর। সুতরাং তোমার চেহারা মাসজিদুল হারামের দিকে ফিরাও এবং তোমরা যেখানেই থাক, তার দিকেই তোমাদের চেহারা ফিরাও। আর নিশ্চয় যারা কিতাবপ্রাপ্ত হয়েছে, তারা অবশ্যই জানে যে, তা তাদের রবের পক্ষ থেকে সত্য এবং তারা যা করে, সে ব্যাপারে আল্লাহ গাফিল নন।",
    "আর যাদেরকে কিতাব দেয়া হয়েছে তুমি যদি তাদের নিকট সব নিদর্শন নিয়ে আস, তারা তোমার কিবলার অনুসরণ করবে না আর তুমিও তাদের কিবলার অনুসরণকারী নও এবং তারা একে অপরের কিবলার অনুসরণকারী নয়। আর যদি তুমি তাদের প্রবৃত্তির অনুসরণ কর তোমার নিকট জ্ঞান আসার পর, তবে নিশ্চয় তুমি তখন যালিমদের অন্তর্ভুক্ত।",
    "যাদেরকে আমি কিতাব দিয়েছি, তারা তাকে চিনে, যেমন চিনে তাদের সন্তানদেরকে। আর নিশ্চয় তাদের মধ্য থেকে একটি দল সত্যকে অবশ্যই গোপন করে, অথচ তারা জানে।",
    "সত্য তোমার রবের পক্ষ থেকে। সুতরাং তুমি কখনো সন্দেহ পোষণকারীদের অন্তর্ভুক্ত হয়ো না।",
    "আর প্রত্যেকের রয়েছে একটি দিক, যেদিকে সে চেহারা ফিরায়। সুতরাং তোমরা কল্যাণকর্মে প্রতিযোগিতা কর। তোমরা যেখানেই থাক না কেন, আল্লাহ তোমাদের সবাইকে নিয়ে আসবেন। নিশ্চয় আল্লাহ সব কিছুর উপর ক্ষমতাবান।",
    "আর তুমি যেখান থেকেই বের হও, তোমার চেহারা মাসজিদুল হারামের দিকে ফিরাও। আর নিশ্চয় তা সত্য তোমার রবের পক্ষ থেকে এবং তোমরা যা কর, আল্লাহ তা থেকে গাফিল নন।",
    "আর তুমি যেখান থেকেই বের হও, তোমার চেহারা মাসজিদুল হারামের দিকে ফিরাও এবং তোমরা যেখানেই থাক, তার দিকে তোমাদের চেহারা ফিরাও, যাতে তোমাদের বিপক্ষে মানুষের বিতর্ক করার কিছু না থাকে। তবে তাদের মধ্য থেকে যারা যুলম করেছে, তারা ছাড়া। সুতরাং তোমরা তাদেরকে ভয় করো না, আমাকে ভয় কর। আর যাতে আমি আমার নিআমত তোমাদের উপর পূর্ণ করতে পারি এবং যাতে তোমরা হিদায়াতপ্রাপ্ত হও।",
    "যেভাবে আমি তোমাদের মধ্যে একজন রাসূল প্রেরণ করেছি তোমাদের মধ্য থেকে, যে তোমাদের কাছে আমার আয়াতসমূহ তিলাওয়াত করে, তোমাদেরকে পবিত্র করে এবং কিতাব ও হিকমত শিক্ষা দেয়। আর তোমাদেরকে শিক্ষা দেয় এমন কিছু যা তোমরা জানতে না।",
    "অতএব, তোমরা আমাকে স্মরণ কর, আমি তোমাদেরকে স্মরণ করব। আর আমার শোকর আদায় কর, আমার সাথে কুফরী করো না।",
    "হে মুমিনগণ, ধৈর্য ও সালাতের মাধ্যমে সাহায্য চাও। নিশ্চয় আল্লাহ ধৈর্যশীলদের সাথে আছেন।* \n*পবিত্র কুরআনের অনেক স্থানে আল্লাহ নেককারদের সাথে আছেন, ধৈর্যশীলদের সাথে আছেন ইত্যাদি বলা হয়েছে। তিনি আরশের উপর থেকেও বান্দাকে সাহায্য সহযোগিতা করার মাধ্যমে তার সাথে রয়েছেন বলে বুঝে নিতে হবে।",
    "যারা আল্লাহর রাস্তায় নিহত হয়, তাদেরকে মৃত বলো না। বরং তারা জীবিত; কিন্তু তোমরা অনুভব করতে পার না।",
    "আর আমি অবশ্যই তোমাদেরকে পরীক্ষা করব কিছু ভয়, ক্ষুধা এবং জান-মাল ও ফল-ফলাদির স্বল্পতার মাধ্যমে। আর তুমি ধৈর্যশীলদের সুসংবাদ দাও।",
    "যারা, তাদেরকে যখন বিপদ আক্রান্ত করে তখন বলে, নিশ্চয় আমরা আল্লাহর জন্য এবং নিশ্চয় আমরা তাঁর দিকে প্রত্যাবর্তনকারী।",
    "তাদের উপরই রয়েছে তাদের রবের পক্ষ থেকে মাগফিরাত ও রহমত এবং তারাই হিদায়াতপ্রাপ্ত।",
    "নিশ্চয় সাফা ও মারওয়া আল্লাহর নিদর্শনসমূহের অন্তর্ভুক্ত। সুতরাং যে বাইতুল্লাহর হজ্জ করবে কিংবা উমরা করবে তার কোন অপরাধ হবে না যে, সে এগুলোর তাওয়াফ করবে। আর যে স্বতঃস্ফূর্তভাবে কল্যাণ করবে, তবে নিশ্চয় শোকরকারী, সর্বজ্ঞ।",
    "নিশ্চয় যারা গোপন করে সু-স্পষ্ট নিদর্শনসমূহ ও হিদায়াত যা আমি নাযিল করেছি, কিতাবে মানুষের জন্য তা স্পষ্টভাবে বর্ণনা করার পর, তাদেরকে আল্লাহ লা‘নত করেন এবং লা‘নতকারীগণও তাদেরকে লা‘নত করে।",
    "তারা ছাড়া, যারা তাওবা করেছে, শুধরে নিয়েছে এবং স্পষ্টভাবে বর্ণনা করেছে। অতএব, আমি তাদের তাওবা কবূল করব। আর আমি তাওবা কবূলকারী, পরম দয়ালু।",
    "নিশ্চয় যারা কুফরী করেছে এবং কাফির অবস্থায় মৃত্যুবরণ করেছে, তাদের উপর আল্লাহ, ফেরেশতাগণ ও সকল মানুষের লা’নত।",
    "তারা সেখানে স্থায়ী হবে। তাদের থেকে আযাব হালকা করা হবে না এবং তাদেরকে অবকাশও দেয়া হবে না।",
    "আর তোমাদের ইলাহ এক ইলাহ। তিনি ছাড়া কোন (সত্য) ইলাহ নেই। তিনি অতি দয়াময়, পরম দয়ালু।",
    "নিশ্চয় আসমানসমূহ ও যমীনের সৃষ্টিতে, রাত ও দিনের বিবর্তনে, সে নৌকায় যা সমুদ্রে মানুষের জন্য কল্যাণকর বস্ত্ত নিয়ে চলে এবং আসমান থেকে আল্লাহ যে বৃষ্টি বর্ষণ করেছেন অতঃপর তার মাধ্যমে মরে যাওয়ার পর যমীনকে জীবিত করেছেন এবং তাতে ছড়িয়ে দিয়েছেন সকল প্রকার বিচরণশীল প্রাণী ও বাতাসের পরিবর্তনে এবং আসমান ও যমীনের মধ্যবর্তী স্থানে নিয়োজিত মেঘমালায় রয়েছে নিদর্শনসমূহ এমন কওমের জন্য, যারা বিবেকবান।",
    "আর মানুষের মধ্যে এমনও আছে, যারা আল্লাহ ছাড়া অন্যকে আল্লাহর সমকক্ষরূপে গ্রহণ করে, তাদেরকে আল্লাহকে ভালবাসার মত ভালবাসে। আর যারা ঈমান এনেছে, তারা আল্লাহর জন্য ভালবাসায় দৃঢ়তর। আর যদি যালিমগণ দেখে- যখন তারা আযাব দেখবে যে, নিশ্চয় সকল শক্তি আল্লাহর জন্য এবং নিশ্চয় আল্লাহ আযাব দানে কঠোর।",
    "যখন, যাদেরকে অনুসরণ করা হয়েছে, তারা অনুসারীদের থেকে আলাদা হয়ে যাবে এবং তারা আযাব দেখতে পাবে। আর তাদের সব সম্পর্ক ছিন্ন হয়ে যাবে।",
    "আর যারা অনুসরণ করেছে, তারা বলবে, ‘যদি আমাদের ফিরে যাওয়ার সুযোগ হত, তাহলে আমরা তাদের থেকে আলাদা হয়ে যেতাম, যেভাবে তারা আলাদা হয়ে গিয়েছে’। এভাবে আল্লাহ তাদেরকে তাদের আমলসমূহ দেখাবেন, তাদের জন্য আক্ষেপস্বরূপ। আর তারা আগুন থেকে বের হতে পারবে না।",
    "হে মানুষ, যমীনে যা রয়েছে, তা থেকে হালাল পবিত্র বস্তু আহার কর এবং শয়তানের পদাঙ্ক অনুসরণ করো না। নিশ্চয় সে তোমাদের জন্য সুস্পষ্ট শত্রু।",
    "নিশ্চয় সে তোমাদেরকে আদেশ দেয় মন্দ ও অশ্লীল কাজের এবং আল্লাহর ব্যাপারে এমন কিছু বলতে, যা তোমরা জান না।",
    "আর যখন তাদেরকে বলা হয়, ‘তোমরা অনুসরণ কর, যা আল্লাহ নাযিল করেছেন’, তারা বলে, ‘বরং আমরা অনুসরণ করব আমাদের পিতৃ-পুরুষদেরকে যার উপর পেয়েছি’। যদি তাদের পিতৃ-পুরুষরা কিছু না বুঝে এবং হিদায়াতপ্রাপ্ত না হয়, তাহলেও কি?",
    "আর যারা কুফরী করেছে তাদের উদাহরণ তার মত, যে এমন কিছুর জন্য চিৎকার করছে, হাঁক-ডাক ছাড়া যে কিছু শোনে না। তারা বধির, বোবা, অন্ধ। তাই তারা বুঝে না।",
    "হে মুমিনগণ, আহার কর আমি তোমাদেরকে যে হালাল রিযক দিয়েছি তা থেকে এবং আল্লাহর জন্য শোকর কর, যদি তোমরা তাঁরই ইবাদাত কর।",
    "নিশ্চয় তিনি তোমাদের উপর হারাম করেছেন মৃত জন্তু, রক্ত, শূকরের গোশ্ত এবং যা গায়রুল্লাহর নামে যবেহ করা হয়েছে। সুতরাং যে বাধ্য হবে, অবাধ্য বা সীমালঙ্ঘনকারী না হয়ে, তাহলে তার কোন পাপ নেই। নিশ্চয় আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "নিশ্চয় যারা গোপন করে যে কিতাব আল্লাহ নাযিল করেছেন এবং এর বিনিময়ে সামান্য মূল্য গ্রহণ করে, তারা শুধু আগুনই তাদের উদরে পুরে। আর আল্লাহ কিয়ামতের দিনে তাদের সাথে কথা বলবেন না, তাদেরকে পরিশুদ্ধ করবেন না। আর তাদের জন্য রয়েছে যন্ত্রণাদায়ক আযাব।",
    "তারাই হিদায়াতের পরিবর্তে পথভ্রষ্টতা এবং মাগফিরাতের পরিবর্তে আযাব ক্রয় করেছে। আগুনের উপর তারা কতই না ধৈর্যশীল।",
    "তা এই কারণে যে, আল্লাহ যথার্থরূপে কিতাব নাযিল করেছেন। আর নিশ্চয় যারা কিতাবে মতবিরোধ করেছে, তারা অবশ্যই সুদূর মতানৈক্যে রয়েছে।",
    "ভালো কাজ এটা নয় যে, তোমরা তোমাদের চেহারা পূর্ব ও পশ্চিম দিকে ফিরাবে; বরং ভালো কাজ হল যে ঈমান আনে আল্লাহ, শেষ দিবস, ফেরেশতাগণ, কিতাব ও নবীগণের প্রতি এবং যে সম্পদ প্রদান করে তার প্রতি আসক্তি সত্ত্বেও নিকটাত্মীয়গণকে, ইয়াতীম, অসহায়, মুসাফির ও প্রার্থনাকারীকে এবং বন্দিমুক্তিতে এবং যে সালাত কায়েম করে, যাকাত দেয় এবং যারা অঙ্গীকার করে তা পূর্ণ করে, যারা ধৈর্যধারণ করে কষ্ট ও দুর্দশায় ও যুদ্ধের সময়ে। তারাই সত্যবাদী এবং তারাই মুত্তাকী।",
    "হে মুমিনগণ, নিহতদের ব্যাপারে তোমাদের উপর ‘কিসাস’ ফরয করা হয়েছে। স্বাধীনের বদলে স্বাধীন, দাসের বদলে দাস, নারীর বদলে নারী। তবে যাকে কিছুটা ক্ষমা করা হবে তার ভাইয়ের পক্ষ থেকে, তাহলে সততার অনুসরণ করবে এবং সুন্দরভাবে তাকে আদায় করে দেবে। এটি তোমাদের রবের পক্ষ থেকে হালকাকরণ ও রহমত। সুতরাং এরপর যে সীমালঙ্ঘন করবে, তার জন্য রয়েছে যন্ত্রণাদায়ক আযাব।",
    "আর হে বিবেকসম্পন্নগণ, কিসাসে রয়েছে তোমাদের জন্য জীবন, আশা করা যায় তোমরা তাকওয়া অবলম্বন করবে।",
    "তোমাদের উপর ফরয করা হয়েছে যে, যখন তোমাদের কারো মৃত্যু উপস্থিত হবে, যদি সে কোন সম্পদ রেখে যায়, তবে পিতা-মাতা ও নিকটাত্মীয়দের জন্য ন্যায়ভিত্তিক অসিয়ত করবে। এটি মুত্তাকীদের দায়িত্ব।",
    "অতএব যে তা শ্রবণ করার পর পরিবর্তন করবে, তবে এর পাপ তাদের হবে, যারা তা পরিবর্তন করে। নিশ্চয় আল্লাহ সর্বশ্রোতা, সর্বজ্ঞানী।",
    "তবে কেউ যদি অসিয়তকারীর পক্ষ থেকে পক্ষপাতিত্ব ও পাপের আশঙ্কা করে, অতঃপর তাদের মধ্যে মীমাংসা করে দেয়, তাহলে তার কোন পাপ নেই। নিশ্চয় আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "হে মুমিনগণ, তোমাদের উপর সিয়াম ফরয করা হয়েছে, যেভাবে ফরয করা হয়েছিল তোমাদের পূর্ববর্তীদের উপর। যাতে তোমরা তাকওয়া অবলম্বন কর।",
    "নির্দিষ্ট কয়েক দিন। তবে তোমাদের মধ্যে যে অসুস্থ হবে, কিংবা সফরে থাকবে, তাহলে অন্যান্য দিনে সংখ্যা পূরণ করে নেবে। আর যাদের জন্য তা কষ্টকর হবে, তাদের কর্তব্য ফিদয়া- একজন দরিদ্রকে খাবার প্রদান করা। অতএব যে স্বেচ্ছায় অতিরিক্ত সৎকাজ করবে, তা তার জন্য কল্যাণকর হবে। আর সিয়াম পালন তোমাদের জন্য কল্যাণকর, যদি তোমরা জান।",
    "রমযান মাস, যাতে কুরআন নাযিল করা হয়েছে মানুষের জন্য হিদায়াতস্বরূপ এবং হিদায়াতের সুস্পষ্ট নিদর্শনাবলী ও সত্য-মিথ্যার পার্থক্যকারীরূপে। সুতরাং তোমাদের মধ্যে যে মাসটিতে উপস্থিত হবে, সে যেন তাতে সিয়াম পালন করে। আর যে অসুস্থ হবে অথবা সফরে থাকবে তবে অন্যান্য দিবসে সংখ্যা পূরণ করে নেবে। আল্লাহ তোমাদের সহজ চান এবং কঠিন চান না। আর যাতে তোমরা সংখ্যা পূরণ কর এবং তিনি তোমাদেরকে যে হিদায়াত দিয়েছেন, তার জন্য আল্লাহর বড়ত্ব ঘোষণা কর এবং যাতে তোমরা শোকর কর।",
    "আর যখন আমার বান্দাগণ তোমাকে আমার সম্পর্কে জিজ্ঞাসা করবে, আমি তো নিশ্চয় নিকটবর্তী। আমি আহবানকারীর ডাকে সাড়া দেই, যখন সে আমাকে ডাকে। সুতরাং তারা যেন আমার ডাকে সাড়া দেয় এবং আমার প্রতি ঈমান আনে। আশা করা যায় তারা সঠিক পথে চলবে।",
    "সিয়ামের রাতে তোমাদের জন্য তোমাদের স্ত্রীদের নিকট গমন হালাল করা হয়েছে। তারা তোমাদের জন্য পরিচ্ছদ এবং তোমরা তাদের জন্য পরিচ্ছদ। আল্লাহ জেনেছেন যে, তোমরা নিজদের সাথে খিয়ানত করছিলে। অতঃপর তিনি তোমাদের তাওবা কবূল করেছেন এবং তোমাদেরকে ক্ষমা করেছেন। অতএব, এখন তোমরা তাদের সাথে মিলিত হও এবং আল্লাহ তোমাদের জন্য যা লিখে দিয়েছেন, তা অনুসন্ধান কর। আর আহার কর ও পান কর যতক্ষণ না ফজরের সাদা রেখা কাল রেখা থেকে স্পষ্ট হয়। অতঃপর রাত পর্যন্ত সিয়াম পূর্ণ কর। আর তোমরা মাসজিদে ইতিকাফরত অবস্থায় স্ত্রীদের সাথে মিলিত হয়ো না। এটা আল্লাহর সীমারেখা, সুতরাং তোমরা তার নিকটবর্তী হয়ো না। এভাবেই আল্লাহ তাঁর আয়াতসমূহ মানুষের জন্য স্পষ্ট করেন যাতে তারা তাকওয়া অবলম্বন করে।",
    "আর তোমরা নিজদের মধ্যে তোমাদের সম্পদ অন্যায়ভাবে খেয়ো না এবং তা বিচারকদেরকে (ঘুষ হিসেবে) প্রদান করো না। যাতে মানুষের সম্পদের কোন অংশ পাপের মাধ্যমে জেনে বুঝে খেয়ে ফেলতে পার।",
    "তারা তোমাকে নতুন চাঁদসমূহ সম্পর্কে প্রশ্ন করে। বল, ‘তা মানুষের ও হজ্জের জন্য সময় নির্ধারক’। আর ভালো কাজ এটা নয় যে, তোমরা পেছন দিক দিয়ে গৃহে প্রবেশ করবে। কিন্তু ভাল কাজ হল, যে তাকওয়া অবলম্বন করে। আর তোমরা গৃহসমূহে তার দরজা দিয়ে প্রবেশ কর এবং আল্লাহকে ভয় কর, যাতে তোমরা সফল হও।",
    "আর তোমরা আল্লাহর রাস্তায় তাদের বিরুদ্ধে লড়াই কর, যারা তোমাদের বিরুদ্ধে লড়াই করে এবং সীমালঙ্ঘন করো না। নিশ্চয় আল্লাহ সীমালঙ্ঘনকারীদেরকে পছন্দ করেন না।",
    "আর তাদেরকে হত্যা কর যেখানে তাদেরকে পাও এবং তাদেরকে বের করে দাও যেখান থেকে তারা তোমাদেরকে বের করেছিল। আর ফিতনা হত্যার চেয়ে কঠিনতর এবং তোমরা মাসজিদুল হারামের নিকট তাদের বিরুদ্ধে লড়াই করো না, যতক্ষণ না তারা তোমাদের বিরুদ্ধে সেখানে লড়াই করে। অতঃপর তারা যদি তোমাদের বিরুদ্ধে লড়াই করে, তবে তাদেরকে হত্যা কর। এটাই কাফিরদের প্রতিদান।",
    "তবে যদি তারা বিরত হয়, তবে নিশ্চয় আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "আর তাদের বিরুদ্ধে লড়াই কর যে পর্যন্ত না ফিতনা খতম হয়ে যায় এবং দীন আল্লাহর জন্য হয়ে যায়। সুতরাং তারা যদি বিরত হয়, তাহলে যালিমরা ছাড়া (কারো উপর) কোন কঠোরতা নেই।",
    "হারাম মাস হারাম মাসের বদলে এবং পবিত্র বিষয়সমূহ কিসাসের অন্তর্ভুক্ত। সুতরাং যে তোমাদের উপর আক্রমণ করেছে, তোমরা তার উপর আক্রমণ কর, যেরূপ সে তোমাদের উপর আক্রমণ করেছে। আর আল্লাহকে ভয় কর এবং জেনে রাখ, নিশ্চয় আল্লাহ মুত্তাকীদের সাথে আছেন।",
    "আর তোমরা আল্লাহর রাস্তায় ব্যয় কর এবং নিজ হাতে নিজদেরকে ধ্বংসে নিক্ষেপ করো না। আর সুকর্ম কর। নিশ্চয় আল্লাহ সুকর্মশীলদেরকে ভালবাসেন।",
    "আর হজ ও উমরা আল্লাহর জন্য পূর্ণ কর। অতঃপর যদি তোমরা আটকে পড় তবে যে পশু সহজ হবে (তা যবেহ কর)। আর তোমরা তোমাদের মাথা মুন্ডন করো না, যতক্ষণ না পশু তার যথাস্থানে পৌঁছে। আর তোমাদের মধ্যে যে অসুস্থ কিংবা তার মাথায় যদি কোন কষ্ট থাকে তবে সিয়াম কিংবা সদাকা অথবা পশু যবেহ এর মাধ্যমে ফিদয়া দেবে। আর যখন তোমরা নিরাপদ হবে তখন যে ব্যক্তি উমরার পর হজ সম্পাদনপূর্বক তামাত্তু করবে, তবে যে পশু সহজ হবে, তা যবেহ করবে। কিন্তু যে তা পাবে না তাকে হজে তিন দিন এবং যখন তোমরা ফিরে যাবে, তখন সাত দিন সিয়াম পালন করবে। এই হল পূর্ণ দশ। এই বিধান তার জন্য, যার পরিবার মাসজিদুল হারামের অধিবাসী নয়। আর তোমরা আল্লাহকে ভয় কর এবং জেনে রাখ, নিশ্চয় আল্লাহ আযাবদানে কঠোর।",
    "হজের সময় নির্দিষ্ট মাসসমূহ। অতএব এই মাসসমূহে যে নিজের উপর হজ আরোপ করে নিল, তার জন্য হজে অশ্লীল ও পাপ কাজ এবং ঝগড়া-বিবাদ বৈধ নয়। আর তোমরা ভাল কাজের যা কর, আল্লাহ তা জানেন এবং পাথেয় গ্রহণ কর। নিশ্চয় উত্তম পাথেয় তাকওয়া। আর হে বিবেক সম্পন্নগণ, তোমরা আমাকে ভয় কর।",
    "তোমাদের উপর কোন পাপ নেই যে, তোমরা তোমাদের রবের পক্ষ থেকে অনুগ্রহ অনুসন্ধান করবে। সুতরাং যখন তোমরা আরাফা থেকে বের হয়ে আসবে, তখন মাশআরে হারামের নিকট আল্লাহকে স্মরণ কর এবং তাকে স্মরণ কর যেভাবে তিনি তোমাদেরকে দিকনির্দেশনা দিয়েছেন। যদিও তোমরা এর পূর্বে অবশ্যই পথভ্রষ্টদের অন্তর্ভুক্ত ছিলে।",
    "অতঃপর তোমরা প্রত্যাবর্তন কর, যেখান থেকে মানুষেরা প্রত্যাবর্তন করে এবং আল্লাহর কাছে ক্ষমা চাও। নিশ্চয় আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "তারপর যখন তোমরা তোমাদের হজের কাজসমূহ শেষ করবে, তখন আল্লাহকে স্মরণ কর, যেভাবে তোমরা স্মরণ করতে তোমাদের বাপ-দাদাদেরকে, এমনকি তার চেয়ে অধিক স্মরণ। আর মানুষের মধ্যে এমনও আছে যে বলে, হে আমাদের রব, আমাদেরকে দুনিয়াতেই দিয়ে দিন। বস্তুত আখিরাতে তার জন্য কোন অংশ নেই।",
    "আর তাদের মধ্যে এমনও আছে, যারা বলে, হে আমাদের রব, আমাদেরকে দুনিয়াতে কল্যাণ দিন। আর আখিরাতেও কল্যাণ দিন এবং আমাদেরকে আগুনের আযাব থেকে রক্ষা করুন।",
    "তারা যা অর্জন করেছে তার হিস্যা তাদের রয়েছে। আর আল্লাহ হিসাব গ্রহণে দ্রুত।",
    "আর আল্লাহকে স্মরণ কর নির্দিষ্ট দিনসমূহে। অতঃপর যে তাড়াহুড়া করে দু’দিনে চলে আসবে। তার কোন পাপ নেই। আর যে বিলম্ব করবে, তারও কোন অপরাধ নেই। (এ বিধান) তার জন্য, যে তাকওয়া অবলম্বন করেছে। আর তোমরা আল্লাহর তাকওয়া অবলম্বন কর এবং জেনে রাখ, নিশ্চয় তোমাদেরকে তাঁরই কাছে সমবেত করা হবে।",
    "আর মানুষের মধ্যে এমনও আছে, যার কথা দুনিয়ার জীবনে তোমাকে অবাক করে এবং সে তার অন্তরে যা রয়েছে, তার উপর আল্লাহকে সাক্ষী রাখে। আর সে কঠিন ঝগড়াকারী।",
    "আর যখন সে ফিরে যায়, তখন যমীনে প্রচেষ্টা চালায় তাতে ফাসাদ করতে এবং ধ্বংস করতে শস্য ও প্রাণী। আর আল্লাহ ফাসাদ ভালবাসেন না।",
    "আর যখন তাকে বলা হয়, ‘আল্লাহকে ভয় কর’ তখন আত্মাভিমান তাকে পাপ করতে উৎসাহ দেয়। সুতরাং জাহান্নাম তার জন্য যথেষ্ট এবং তা কতই না মন্দ ঠিকানা।",
    "আর মানুষের মধ্যে এমন লোকও আছে যে আল্লাহর সন্তুষ্টির উদ্দেশ্যে নিজকে বিকিয়ে দেয়। আর আল্লাহ (তাঁর) বান্দাদের প্রতি স্নেহশীল।",
    "হে মুমিনগণ, তোমরা ইসলামে পূর্ণরূপে প্রবেশ কর এবং শয়তানের পদাঙ্ক অনুসরণ করো না । নিশ্চয় সে তোমাদের জন্য স্পষ্ট শত্রু।",
    "অতএব তোমরা যদি পদস্খলিত হও, তোমাদের নিকট সুস্পষ্ট নিদর্শনসমূহ আসার পর, তবে জেনে রাখ যে, আল্লাহ পরাক্রমশালী, প্রজ্ঞাময়।",
    "তারা কি এরই অপেক্ষা করছে যে, মেঘের ছায়ায় আল্লাহ ও ফেরেশতাগণ তাদের নিকট আগমন করবেন এবং সব বিষয়ের ফয়সালা করে দেয়া হবে। আর আল্লাহর নিকটই সব বিষয় প্রত্যাবর্তিত হবে।",
    "বনী ইসরাইলকে জিজ্ঞাসা কর, আমি তাদেরকে কত সুস্পষ্ট নিদর্শন দিয়েছি। আর যে আল্লাহর নি‘আমত তার কাছে আসার পর তা বদলে দেবে তাহলে নিশ্চয় আল্লাহ আযাব দানে কঠোর।",
    "যারা কুফরী করেছে, দুনিয়ার জীবনকে তাদের জন্য সুশোভিত করা হয়েছে। আর তারা মুমিনদের নিয়ে উপহাস করে। আর যারা তাকওয়া অবলম্বন করেছে, তারা কিয়ামত দিবসে তাদের উপরে থাকবে। আর আল্লাহ যাকে চান, বেহিসাব রিয্ক দান করেন।",
    "মানুষ ছিল এক উম্মত। অতঃপর আল্লাহ সুসংবাদদাতা ও সতর্ককারীরূপে নবীদেরকে প্রেরণ করলেন এবং সত্যসহ তাদের সাথে কিতাব নাযিল করলেন, যাতে মানুষের মধ্যে ফয়সালা করেন, যে বিষয়ে তারা মতবিরোধ করত। আর তারাই তাতে মতবিরোধ করেছিল, যাদেরকে তা দেয়া হয়েছিল, তাদের নিকট স্পষ্ট নিদর্শন আসার পরও পরস্পরের মধ্যে বিদ্বেষবশত। অতঃপর আল্লাহ নিজ অনুমতিতে মুমিনদেরকে হিদায়াত দিলেন যে বিষয়ে তারা মতবিরোধ করছিল। আর আল্লাহ যাকে ইচ্ছা করেন সরল পথের দিকে হিদায়াত দেন।",
    "নাকি তোমরা ভেবেছ যে, তোমরা জান্নাতে প্রবেশ করবে অথচ এখনো তোমাদের নিকট তাদের মত কিছু আসেনি, যারা তোমাদের পূর্বে বিগত হয়েছে। তাদেরকে স্পর্শ করেছিল কষ্ট ও দুর্দশা এবং তারা কম্পিত হয়েছিল। এমনকি রাসূল ও তার সাথি মুমিনগণ বলছিল, ‘কখন আল্লাহর সাহায্য (আসবে)’? জেনে রাখ, নিশ্চয় আল্লাহর সাহায্য নিকটবর্তী।",
    "তারা তোমাকে জিজ্ঞাসা করে, তারা কী ব্যয় করবে? বল, ‘তোমরা যে সম্পদ ব্যয় করবে, তা পিতা-মাতা, আত্মীয়, ইয়াতীম, মিসকীন ও মুসাফিরদের জন্য। আর যে কোন ভাল কাজ তোমরা কর, নিশ্চয় সে ব্যাপারে আল্লাহ সুপরিজ্ঞাত’।",
    "তোমাদের উপর লড়াইয়ের বিধান দেয়া হয়েছে, অথচ তা তোমাদের কাছে অপছন্দনীয় এবং হতে পারে কোন বিষয় তোমরা অপছন্দ করছ অথচ তা তোমাদের জন্য কল্যাণকর। আর হতে পারে কোন বিষয় তোমরা পছন্দ করছ অথচ তা তোমাদের জন্য অকল্যাণকর। আর আল্লাহ জানেন এবং তোমরা জান না।",
    "তারা তোমাকে হারাম মাস সম্পর্কে, তাতে লড়াই করা বিষয়ে জিজ্ঞাসা করে। বল, ‘তাতে লড়াই করা বড় পাপ; কিন্তু আল্লাহর পথে বাধা প্রদান, তাঁর সাথে কুফরী করা, মাসজিদুল হারাম থেকে বাধা দেয়া এবং তার অধিবাসীদেরকে তা থেকে বের করে দেয়া আল্লাহর নিকট অধিক বড় পাপ। আর ফিতনা হত্যার চেয়েও বড়’। আর তারা তোমাদের সাথে লড়াই করতে থাকবে, যতক্ষণ না তোমাদেরকে তোমাদের দীন থেকে ফিরিয়ে দেয়, তারা যদি পারে। আর যে তোমাদের মধ্য থেকে তাঁর দীন থেকে ফিরে যাবে, অতঃপর কাফির অবস্থায় মৃত্যু বরণ করবে, বস্তুত এদের আমলসমূহ দুনিয়া ও আখিরাতে বিনষ্ট হয়ে যাবে এবং তারাই আগুনের অধিবাসী। তারা সেখানে স্থায়ী হবে।",
    "নিশ্চয় যারা ঈমান এনেছে ও যারা হিজরত করেছে এবং আল্লাহর রাস্তায় জিহাদ করেছে, তারা আল্লাহর রহমতের আশা করে। আর আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "তারা তোমাকে মদ ও জুয়া সম্পর্কে জিজ্ঞাসা করে। বল, এ দু’টোয় রয়েছে বড় পাপ ও মানুষের জন্য উপকার। আর তার পাপ তার উপকারিতার চেয়ে অধিক বড়। আর তারা তোমাকে জিজ্ঞাসা করে, তারা কী ব্যয় করবে। বল, ‘যা প্রয়োজনের অতিরিক্ত’। এভাবে আল্লাহ তোমাদের জন্য আয়াতসমূহ স্পষ্টভাবে বর্ণনা করেন, যাতে তোমরা চিন্তা কর।",
    "দুনিয়া ও আখিরাতের ব্যাপারে। আর তারা তোমাকে জিজ্ঞাসা করে ইয়াতীমদের সম্পর্কে। বল, সংশোধন করা তাদের জন্য উত্তম। আর যদি তাদেরকে নিজদের সাথে মিশিয়ে নাও, তবে তারা তোমাদেরই ভাই। আর আল্লাহ জানেন কে ফাসাদকারী, কে সংশোধনকারী এবং আল্লাহ যদি চাইতেন, অবশ্যই তোমাদের জন্য (বিষয়টি) কঠিন করে দিতেন। নিশ্চয় আল্লাহ পরাক্রমশালী, প্রজ্ঞাময়।",
    "আর তোমরা মুশরিক নারীদের বিয়ে করো না, যতক্ষণ না তারা ঈমান আনে এবং মুমিন দাসী মুশরিক নারীর চেয়ে নিশ্চয় উত্তম, যদিও সে তোমাদেরকে মুগ্ধ করে। আর মুশরিক পুরুষদের সাথে বিয়ে দিয়ো না, যতক্ষণ না তারা ঈমান আনে। আর একজন মুমিন দাস একজন মুশরিক পুরুষের চেয়ে উত্তম, যদিও সে তোমাদেরকে মুগ্ধ করে। তারা তোমাদেরকে আগুনের দিকে আহবান করে, আর আল্লাহ তাঁর অনুমতিতে তোমাদেরকে জান্নাত ও ক্ষমার দিকে আহবান করেন এবং মানুষের জন্য তাঁর আয়াতসমূহ স্পষ্টরূপে বর্ণনা করেন, যাতে তারা উপদেশ গ্রহণ করতে পারে।",
    "আর তারা তোমাকে হায়েয সম্পর্কে প্রশ্ন করে। বল, তা কষ্ট। সুতরাং তোমরা হায়েযকালে স্ত্রীদের থেকে দূরে থাক এবং তারা পবিত্র না হওয়া পর্যন্ত তাদের নিকটবর্তী হয়ো না। অতঃপর যখন তারা পবিত্র হবে তখন তাদের নিকট আস, যেভাবে আল্লাহ তোমাদেরকে নির্দেশ দিয়েছেন। নিশ্চয় আল্লাহ তাওবাকারীদেরকে ভালবাসেন এবং ভালবাসেন অধিক পবিত্রতা অর্জনকারীদেরকে।",
    "তোমাদের স্ত্রী তোমাদের ফসলক্ষেত্র। সুতরাং তোমরা তোমাদের ফসলক্ষেত্রে গমন কর, যেভাবে চাও। আর তোমরা নিজদের কল্যাণে উত্তম কাজ সামনে পাঠাও। আর আল্লাহর তাকওয়া অবলম্বন কর এবং জেনে রাখ, নিশ্চয় তোমরা তাঁর সাথে সাক্ষাৎ করবে । আর মুমিনদেরকে সুসংবাদ দাও।",
    "আর আল্লাহকে তোমরা তোমাদের শপথ পূরণে প্রতিবন্ধক বানিয়ো না যে, তোমরা (আল্লাহর নামে এই বলে শপথ করবে যে) ভালো কাজ করবে না, তাকওয়া অবলম্বন করবে না এবং মানুষের মধ্যে সংশোধন করবে না। আর আল্লাহ সর্বশ্রোতা, সর্বজ্ঞ।",
    "আল্লাহ তোমাদেরকে তোমাদের অর্থহীন শপথের জন্য পাকড়াও করবেন না। কিন্তু পাকড়াও করবেন যা তোমাদের অন্তরসমূহ অর্জন করেছে। আর আল্লাহ ক্ষমাশীল, সহনশীল।",
    "যারা তাদের স্ত্রীদের সাথে মিলিত না হওয়ার শপথ করবে তারা চার মাস অপেক্ষা করবে। অতঃপর তারা যদি ফিরিয়ে নেয়, তবে নিশ্চয় আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "আর যদি তারা তালাকের দৃঢ় ইচ্ছা করে নেয় তবে নিশ্চয় আল্লাহ সর্বশ্রোতা, সর্বজ্ঞ।",
    "আর তালাকপ্রাপ্তা নারীরা তিন কুরূ* পর্যন্ত অপেক্ষায় থাকবে এবং তাদের জন্য হালাল হবে না যে, আল্লাহ তাদের গর্ভে যা সৃষ্টি করেছেন, তা তারা গোপন করবে, যদি তারা আল্লাহ ও শেষ দিনের প্রতি বিশ্বাস রাখে। আর এর মধ্যে তাদের স্বামীরা তাদেরকে ফিরিয়ে নেয়ার ব্যাপারে অধিক হকদার, যদি তারা সংশোধন চায়। আর নারীদের রয়েছে বিধি মোতাবেক অধিকার। যেমন আছে তাদের উপর (পুরুষদের) অধিকার। আর পুরুষদের রয়েছে তাদের উপর মর্যাদা এবং আল্লাহ পরাক্রমশালী, প্রজ্ঞাময়। \n*‘কুরূ’ দ্বারা হয়েয মতান্তরে তুহূর বা পবিত্রাবস্থাকে বুঝানো হয়েছে।",
    "তালাক দু’বার। অতঃপর বিধি মোতাবেক রেখে দেবে কিংবা সুন্দরভাবে ছেড়ে দেবে। আর তোমাদের জন্য হালাল নয় যে, তোমরা তাদেরকে যা দিয়েছ, তা থেকে কিছু নিয়ে নেবে। তবে উভয়ে যদি আশঙ্কা করে যে, আল্লাহর সীমারেখায় তারা অবস্থান করতে পারবে না। সুতরাং তোমরা যদি আশঙ্কা কর যে, তারা আল্লাহর সীমারেখা কায়েম রাখতে পারবে না তাহলে স্ত্রী যা দিয়ে নিজকে মুক্ত করে নেবে তাতে কোন সমস্যা নেই। এটা আল্লাহর সীমারেখা। সুতরাং তোমরা তা লঙ্ঘন করো না। আর যে আল্লাহর সীমারেখাসমূহ লঙ্ঘন করে, বস্তুত তারাই যালিম।",
    "অতএব যদি সে তাকে তালাক দেয় তাহলে সে পুরুষের জন্য হালাল হবে না যতক্ষণ পর্যন্ত ভিন্ন একজন স্বামী সে গ্রহণ না করে। অতঃপর সে (স্বামী) যদি তাকে তালাক দেয়, তাহলে তাদের উভয়ের অপরাধ হবে না যে, তারা একে অপরের নিকট ফিরে আসবে, যদি দৃঢ় ধারণা রাখে যে, তারা আল্লাহর সীমারেখা কায়েম রাখতে পারবে। আর এটা আল্লাহর সীমারেখা, তিনি তা এমন সম্প্রদায়ের জন্য স্পষ্ট করে দেন, যারা জানে।",
    "আর যখন তোমরা স্ত্রীদেরকে তালাক দেবে অতঃপর তারা তাদের ইদ্দতে পৌঁছে যাবে তখন হয়তো বিধি মোতাবেক তাদেরকে রেখে দেবে অথবা বিধি মোতাবেক তাদেরকে ছেড়ে দেবে। তবে তাদেরকে কষ্ট দিয়ে সীমালঙ্ঘনের উদ্দেশ্যে তাদেরকে আটকে রেখো না। আর যে তা করবে সে তো নিজের প্রতি যুলম করবে। আর তোমরা আল্লাহর আয়াতসমূহকে উপহাসরূপে গ্রহণ করো না। আর তোমরা স্মরণ কর তোমাদের উপর আল্লাহর নিআমত এবং তোমাদের উপর কিতাব ও হিকমত যা নাযিল করেছেন, যার মাধ্যমে তিনি তোমাদেরকে উপদেশ দেন। আর আল্লাহকে ভয় কর এবং জেনে রাখ যে, নিশ্চয় আল্লাহ সব বিষয় সম্পর্কে সুপরিজ্ঞাত।",
    "আর যখন তোমরা স্ত্রীদেরকে তালাক দেবে অতঃপর তারা তাদের ইদ্দতে পৌঁছবে তখন তোমরা তাদেরকে বাধা দিয়ো না যে, তারা তাদের স্বামীদেরকে বিয়ে করবে যদি তারা পরস্পরে তাদের মধ্যে বিধি মোতাবেক সম্মত হয়। এটা উপদেশ তাকে দেয়া হচ্ছে, যে তোমাদের মধ্যে আল্লাহ ও শেষ দিবসের প্রতি বিশ্বাস রাখে। এটি তোমাদের জন্য অধিক শুদ্ধ ও অধিক পবিত্র। আর আল্লাহ জানেন এবং তোমরা জান না।",
    "আর মায়েরা তাদের সন্তানদেরকে পূর্ণ দু’বছর দুধ পান করাবে, (এটা) তার জন্য যে দুধ পান করাবার সময় পূর্ণ করতে চায়। আর পিতার উপর কর্তব্য, বিধি মোতাবেক মাদেরকে খাবার ও পোশাক প্রদান করা। সাধ্যের অতিরিক্ত কোন ব্যক্তিকে দায়িত্ব প্রদান করা হয় না। কষ্ট দেয়া যাবে না কোন মাকে তার সন্তানের জন্য, কিংবা কোন বাবাকে তার সন্তানের জন্য। আর ওয়ারিশের উপর রয়েছে অনুরূপ দায়িত্ব। অতঃপর তারা যদি পরস্পর সম্মতি ও পরামর্শের মাধ্যমে দুধ ছাড়াতে চায়, তাহলে তাদের কোন পাপ হবে না। আর যদি তোমরা তোমাদের সন্তানদেরকে অন্য কারো থেকে দুধ পান করাতে চাও, তাহলেও তোমাদের উপর কোন পাপ নেই, যদি তোমরা বিধি মোতাবেক তাদেরকে যা দেবার তা দিয়ে দাও। আর তোমরা আল্লাহকে ভয় কর এবং জেনে রাখ, নিশ্চয় আল্লাহ তোমরা যা কর, সে সম্পর্কে সম্যক দ্রষ্টা।",
    "আর তোমাদের মধ্য থেকে যারা মারা যাবে এবং স্ত্রীদেরকে রেখে যাবে, তাদের স্ত্রীগণ চার মাস দশ দিন অপেক্ষায় থাকবে। অতঃপর যখন তারা ইদ্দতকাল পূর্ণ করবে, তখন তারা নিজদের ব্যাপারে বিধি মোতাবেক যা করবে, সে ব্যাপারে তোমাদের কোন পাপ নেই। আর তোমরা যা কর, সে ব্যাপারে আল্লাহ সম্যক অবগত।",
    "আর এতে তোমাদের কোন পাপ নেই যে, তোমরা নারীদেরকে ইশারায় যে প্রস্তাব করবে কিংবা মনে গোপন করে রাখবে। আল্লাহ জেনেছেন যে, তোমরা অবশ্যই তাদেরকে স্মরণ করবে। কিন্তু বিধি মোতাবেক কোন কথা বলা ছাড়া গোপনে তাদেরকে (কোন) প্রতিশ্রুতি দিয়ো না। আর আল্লাহর নির্দেশ (ইদ্দত) তার সময় পূর্ণ করার পূর্বে বিবাহ বন্ধনের সংকল্প করো না। আর জেনে রাখ, নিশ্চয় আল্লাহ তোমাদের অন্তরে যা রয়েছে তা জানেন। সুতরাং তোমরা তাকে ভয় কর এবং জেনে রাখ, নিশ্চয় আল্লাহ ক্ষমাশীল, সহনশীল।",
    "তোমাদের কোন অপরাধ নেই যদি তোমরা স্ত্রীদেরকে তালাক দাও এমন অবস্থায় যে, তোমরা তাদেরকে স্পর্শ করনি কিংবা তাদের জন্য কোন মোহর নির্ধারণ করনি। আর উত্তমভাবে তাদেরকে ভোগ-উপকরণ দিয়ে দাও, ধনীর উপর তার সাধ্যানুসারে এবং সংকটাপন্নের উপর তার সাধ্যানুসারে। সুকর্মশীলদের উপর এটি আবশ্যক।",
    "আর যদি তোমরা তাদেরকে তালাক দাও, তাদেরকে স্পর্শ করার পূর্বে এবং তাদের জন্য কিছু মোহর নির্ধারণ করে থাক, তাহলে যা নির্ধারণ করেছ, তার অর্ধেক (দিয়ে দাও)। তবে স্ত্রীরা যদি মাফ করে দেয়, কিংবা যার হাতে বিবাহের বন্ধন সে যদি মাফ করে দেয়। আর তোমাদের মাফ করে দেয়া তাকওয়ার অধিক নিকটতর। আর তোমরা পরস্পরের মধ্যে অনুগ্রহ ভুলে যেয়ো না। তোমরা যা কর, নিশ্চয় আল্লাহ সে সম্পর্কে সম্যক দ্রষ্টা।",
    "তোমরা সালাতসমূহ ও মধ্যবর্তী সালাতের হিফাযত কর এবং আল্লাহর জন্য দাঁড়াও বিনীত হয়ে।",
    "কিন্তু যদি তোমরা ভয় কর, তবে হেঁটে কিংবা আরোহণ করে (আদায় করে নাও)। এরপর যখন নিরাপদ হবে তখন আল্লাহকে স্মরণ কর, যেভাবে তিনি তোমাদেরকে শিখিয়েছেন, যা তোমরা জানতে না।",
    "আর তোমাদের মধ্য থেকে যারা মারা যাবে এবং স্ত্রীদেরকে রেখে যাবে, তারা তাদের স্ত্রীদের জন্য এক বছরের ভরণ-পোষণের ওসিয়ত করবে বের না করে দিয়ে; কিন্তু যদি তারা (স্বেচ্ছায়) বের হয়ে যায়, তাহলে তারা নিজদের ব্যাপারে বিধি মোতাবেক যা করেছে, সে ব্যাপারে তোমাদের কোন পাপ নেই। আর আল্লাহ পরাক্রমশালী, প্রজ্ঞাময়।",
    "আর তালাকপ্রাপ্তা নারীদের জন্য থাকবে বিধি মোতাবেক ভরণ-পোষণ। (এটি) মুত্তাকীদের উপর আবশ্যক।",
    "এভাবে আল্লাহ তোমাদের জন্য তাঁর আয়াতসমূহ স্পষ্টভাবে বর্ণনা করে দেন, যাতে তোমরা উপলব্ধি কর ।",
    "তুমি কি তাদেরকে দেখনি, যারা তাদের গৃহসমূহ থেকে বের হয়েছে মৃত্যুর ভয়ে এবং তারা ছিল হাজার-হাজার? অতঃপর আল্লাহ তাদেরকে বললেন, ‘তোমরা মরে যাও’! তারপর তিনি তাদেরকে জীবিত করলেন। নিশ্চয় আল্লাহ তো মানুষের উপর অনুগ্রহশীল। কিন্তু অধিকাংশ মানুষ শুকরিয়া আদায় করে না।",
    "আর তোমরা আল্লাহর রাস্তায় লড়াই কর এবং জেনে রাখ নিশ্চয় আল্লাহ সর্বশ্রোতা, সর্বজ্ঞ।",
    "কে আছে, যে আল্লাহকে উত্তম ঋণ দেবে, ফলে তিনি তার জন্য বহু গুণে বাড়িয়ে দেবেন? আর আল্লাহ সংকীর্ণ করেন ও প্রসারিত করেন এবং তাঁরই নিকট তোমাদেরকে ফিরানো হবে।",
    "তুমি কি মূসার পর বনী ইসরাঈলের প্রধানদেরকে দেখনি? যখন তারা তাদের নবীকে বলেছিল, ‘আমাদের জন্য একজন রাজা পাঠান, তাহলে আমরা আল্লাহর রাস্তায় লড়াই করব’। সে বলল, ‘এমন কি হবে যে, যদি তোমাদের উপর লড়াই আবশ্যক করা হয়, তোমরা লড়াই করবে না’? তারা বলল, আমাদের কী হয়েছে যে, আমরা আল্লাহর রাস্তায় লড়াই করব না, অথচ আমাদেরকে আমাদের গৃহসমূহ থেকে বের করা হয়েছে এবং আমাদের সন্তানদের থেকে (বিচ্ছিন্ন করা হয়েছে)’? অতঃপর যখন তাদের উপর লড়াই আবশ্যক করা হল, তখন তাদের মধ্য থেকে স্বল্প সংখ্যক ছাড়া তারা বিমুখ হল। আর আল্লাহ যালিমদের সম্পর্কে সম্যক অবগত।",
    "আর তাদেরকে তাদের নবী বলল, নিশ্চয় আল্লাহ তোমাদের জন্য তালূতকে রাজারূপে পাঠিয়েছেন। তারা বলল, ‘আমাদের উপর কীভাবে তার রাজত্ব হবে, অথচ আমরা তার চেয়ে রাজত্বের অধিক হকদার? আর তাকে সম্পদের প্রাচুর্যও দেয়া হয়নি’। সে বলল, ‘নিশ্চয় আল্লাহ তাকে তোমাদের উপর মনোনীত করেছেন এবং তাকে জ্ঞানে ও দেহে অনেক বাড়িয়ে দিয়েছেন। আর আল্লাহ যাকে চান, তাকে তাঁর রাজত্ব দেন। আর আল্লাহ প্রাচুর্যময়, সর্বজ্ঞ’।",
    "আর তাদেরকে তাদের নবী বলল, নিশ্চয় তার রাজত্বের নিদর্শন এই যে, তোমাদের নিকট তাবূত* আসবে, যাতে থাকবে তোমাদের রবের পক্ষ থেকে প্রশান্তি এবং মূসার পরিবার ও হারূনের পরিবার যা রেখে গিয়েছে তার অবশিষ্ট, যা বহন করে আনবে ফেরেশতাগণ। নিশ্চয় তাতে রয়েছে তোমাদের জন্য নিদর্শন, যদি তোমরা মুমিন হও। \n*অর্থ সিন্দুক। এতে বনী ইসরাঈলের কিছু নিদর্শন ছিল। তাই তারা এটিকে পবিত্র মনে করত এবং যুদ্ধের সময় সামনে রাখত।",
    "অতঃপর যখন তালূত সৈন্যবাহিনী নিয়ে বের হল, তখন সে বলল, ‘নিশ্চয় আল্লাহ তোমাদেরকে একটি নদী দ্বারা পরীক্ষা করবেন। অতএব, যে তা হতে পান করবে, সে আমার দলভুক্ত নয়। আর যে তা খাবে না, তাহলে নিশ্চয় সে আমার দলভুক্ত। তবে যে তার হাত দিয়ে এক আজলা পরিমাণ খাবে, সে ছাড়া; কিন্তু তাদের মধ্য থেকে স্বল্পসংখ্যক ছাড়া তা থেকে তারা পান করল। অতঃপর যখন সে ও তার সাথি মুমিনগণ তা অতিক্রম করল, তারা বলল, ‘আজ আমাদের জালূত ও তার সৈন্যবাহিনীর সাথে লড়াই করার ক্ষমতা নেই’। যারা দৃঢ় ধারণা রাখত যে, তারা আল্লাহর সাথে মিলিত হবে, তারা বলল, ‘কত ছোট দল আল্লাহর হুকুমে বড় দলকে পরাজিত করেছে’! আর আল্লাহ ধৈর্যশীলদের সাথে আছেন।",
    "আর যখন তারা জালূত ও তার সৈন্যবাহিনীর মুখোমুখি হল, তখন তারা বলল, ‘হে আমাদের রব, আমাদের উপর ধৈর্য ঢেলে দিন, আমাদের পা স্থির রাখুন এবং আমাদেরকে কাফের জাতির বিরুদ্ধে সাহায্য করুন’।",
    "অতঃপর তারা আল্লাহর হুকুমে তাদেরকে পরাজিত করল এবং দাঊদ জালূতকে হত্যা করল। আর আল্লাহ দাঊদকে রাজত্ব ও প্রজ্ঞা দান করলেন এবং তাকে যা ইচ্ছা শিক্ষা দিলেন। আর আল্লাহ যদি মানুষের কতককে কতকের দ্বারা প্রতিহত না করতেন, তবে অবশ্যই যমীন ফাসাদপূর্ণ হয়ে যেত। কিন্তু আল্লাহ বিশ্ববাসীর উপর অনুগ্রহশীল।",
    "এগুলো আল্লাহর আয়াত, যা আমি তোমার উপর যথাযথভাবে তিলাওয়াত করি। আর নিশ্চয় তুমি রাসূলগণের অন্তর্ভুক্ত।",
    "ঐ রাসূলগণ, আমি তাদের কাউকে কারো উপর শ্রেষ্ঠত্ব দিয়েছি, তাদের মধ্যে কারো সাথে আল্লাহ কথা বলেছেন এবং কারো কারো মর্যাদা উঁচু করেছেন। আর আমি ঈসা ইবনে মারয়ামকে দিয়েছি সুস্পষ্ট প্রমাণাদি এবং আমি তাকে শক্তিশালী করেছি রূহুল কুদুস এর মাধ্যমে। আর যদি আল্লাহ ইচ্ছা করতেন, তাদের পরবর্তীরা লড়াই করত না, তাদের নিকট সুস্পষ্ট প্রমাণসমূহ আসার পর। কিন্তু তারা মতবিরোধ করেছে। ফলে তাদের মধ্যে কেউ ঈমান এনেছে, আর তাদের কেউ কুফরী করেছে। আর আল্লাহ যদি চাইতেন, তাহলে তারা লড়াই করত না। কিন্তু আল্লাহ যা চান, তা করেন।",
    "হে মুমিনগণ, আমি তোমাদেরকে যে রিয্ক দিয়েছি তা হতে ব্যয় কর, সে দিন আসার পূর্বে, যে দিন থাকবে না কোন-বেচাকেনা, না কোন বন্ধুত্ব এবং না কোন সুপারিশ। আর কাফিররাই যালিম।",
    "আল্লাহ! তিনি ব্যতীত কোন উপাস্য নেই। তিনি স্বাধীন ও নিত্য নতুন ধারক, সব কিছুর ধারক। তন্দ্রা ও নিদ্রা তাঁকে স্পর্শ করেনা। নভোমন্ডল ও ভূমন্ডলে যা কিছু রয়েছে সবই তাঁর। কে আছে এমন, যে তাঁর অনুমতি ব্যতীত তাঁর নিকট সুপারিশ করতে পারে? সম্মুখের অথবা পশ্চাতের সবই তিনি অবগত আছেন। একমাত্র তিনি যতটুকু ইচ্ছা করেন তা ব্যতীত, তাঁর জ্ঞানের কিছুই তারা আয়ত্ত করতে পারেনা। তাঁর আসন আসমান ও যমীন ব্যাপী হয়ে আছে এবং এতদুভয়ের সংরক্ষণে তাঁকে বিব্রত হতে হয়না। তিনিই সর্বোচ্চ, মহীয়ান। (আয়াতুল কুরসী)",
    "দীন গ্রহণের ব্যাপারে কোন জবরদস্তি নেই। নিশ্চয় হিদায়াত স্পষ্ট হয়েছে ভ্রষ্টতা থেকে। অতএব, যে ব্যক্তি তাগূতকে অস্বীকার করে এবং আল্লাহর প্রতি ঈমান আনে, অবশ্যই সে মজবুত রশি আঁকড়ে ধরে, যা ছিন্ন হবার নয়। আর আল্লাহ সর্বশ্রোতা, সর্বজ্ঞ।",
    "যারা ঈমান এনেছে আল্লাহ তাদের অভিভাবক, তিনি তাদেরকে অন্ধকার থেকে আলোর দিকে বের করে আনেন। আর যারা কুফরী করে, তাদের অভিভাবক হল তাগূত। তারা তাদেরকে আলো থেকে বের করে অন্ধকারে নিয়ে যায়। তারা আগুনের অধিবাসী, সেখানে তারা স্থায়ী হবে।",
    "তুমি কি সে ব্যক্তিকে দেখনি, যে ইবরাহীমের সাথে তার রবের ব্যাপারে বিতর্ক করেছে যে, আল্লাহ তাকে রাজত্ব দিয়েছেন? যখন ইবরাহীম বলল, ‘আমার রব তিনিই’ যিনি জীবন দান করেন এবং মৃত্যু ঘটান। সে বলল, আমিই জীবন দান করি এবং মৃত্যু ঘটাই। ইবরাহীম বলল, নিশ্চয় আল্লাহ পূর্বদিক থেকে সূর্য আনেন। অতএব তুমি তা পশ্চিম দিক থেকে আন। ফলে কাফির ব্যক্তি হতভম্ব হয়ে গেল। আর আল্লাহ যালিম সম্প্রদায়কে হিদায়াত দেন না।",
    "অথবা সে ব্যক্তির মত, যে কোন জনপদ অতিক্রম করছিল, যা তার ছাদের উপর বিধ্বস্ত ছিল। সে বলল, ‘আল্লাহ একে কিভাবে জীবিত করবেন মরে যাওয়ার পর’? অতঃপর আল্লাহ তাকে এক’শ বছর মৃত রাখলেন। এরপর তাকে পুনর্জীবিত করলেন। বললেন, ‘তুমি কতকাল অবস্থান করেছ’? সে বলল, ‘আমি একদিন অথবা দিনের কিছু সময় অবস্থান করেছি’। তিনি বললেন, ‘বরং তুমি এক’শ বছর অবস্থান করেছ। সুতরাং তুমি তোমার খাবার ও পানীয়ের দিকে তাকাও, সেটি পরিবর্তিত হয়নি এবং তুমি তাকাও তোমরা গাধার দিকে, আর যাতে আমি তোমাকে মানুষের জন্য দৃষ্টান্ত বানাতে পারি এবং তুমি তাকাও হাড়গুলোর দিকে, কিভাবে আমি তা সংযুক্ত করি, অতঃপর তাকে আবৃত করি গোশ্ত দ্বারা’। পরে যখন তার নিকট স্পষ্ট হল, তখন সে বলল, ‘আমি জানি, নিশ্চয় আল্লাহ সব কিছুর উপর ক্ষমতাবান’।",
    "আর যখন ইবরাহীম বলল ‘হে, আমার রব, আমাকে দেখান, কিভাবে আপনি মৃতদেরকে জীবিত করেন। তিনি বললেন, তুমি কি বিশ্বাস করনি’? সে বলল, ‘অবশ্যই হ্যাঁ, কিন্তু আমার অন্তর যাতে প্রশান্ত হয়’। তিনি বললেন, ‘তাহলে তুমি চারটি পাখি নাও। তারপর সেগুলোকে তোমার প্রতি পোষ মানাও। অতঃপর প্রতিটি পাহাড়ে সেগুলোর টুকরো অংশ রেখে আস। তারপর সেগুলোকে ডাক, সেগুলো দৌড়ে আসবে তোমার নিকট। আর জেনে রাখ, নিশ্চয় আল্লাহ পরাক্রমশালী, প্রজ্ঞাময়’।",
    "যারা আল্লাহর পথে তাদের সম্পদ ব্যয় করে, তাদের উপমা একটি বীজের মত, যা উৎপন্ন করল সাতটি শীষ, প্রতিটি শীষে রয়েছে একশ’ দানা। আর আল্লাহ যাকে চান তার জন্য বাড়িয়ে দেন। আর আল্লাহ প্রাচুর্যময়, সর্বজ্ঞ।",
    "যারা আল্লাহর রাস্তায় তাদের সম্পদ ব্যয় করে, অতঃপর তারা যা ব্যয় করেছে, তার পেছনে খোঁটা দেয় না এবং কোন কষ্টও দেয় না, তাদের জন্য তাদের রবের নিকট তাদের প্রতিদান রয়েছে এবং তাদের কোন ভয় নেই, আর তারা চিন্তিত হবে না।",
    "উত্তম কথা ও ক্ষমা প্রদর্শন শ্রেয়, যে দানের পর কষ্ট দেয়া হয় তার চেয়ে। আর আল্লাহ অভাবমুক্ত, সহনশীল।",
    "হে মুমিনগণ, তোমরা খোঁটা ও কষ্ট দেয়ার মাধ্যমে তোমাদের সদাকা বাতিল করো না। সে ব্যক্তির মত, যে তার সম্পদ ব্যয় করে লোক দেখানোর উদ্দেশ্যে এবং বিশ্বাস করে না আল্লাহ ও শেষ দিনের প্রতি। অতএব তার উপমা এমন একটি মসৃণ পাথর, যার উপর রয়েছে মাটি। অতঃপর তাতে প্রবল বৃষ্টি পড়ল, ফলে তাকে একেবারে পরিষ্কার করে ফেলল। তারা যা অর্জন করেছে তার মাধ্যমে তারা কোন কিছু করার ক্ষমতা রাখে না। আর আল্লাহ কাফির জাতিকে হিদায়াত দেন না।",
    "আর যারা আল্লাহর সন্তুষ্টি লাভ ও নিজদেরকে সুদৃঢ় রাখার লক্ষ্যে সম্পদ ব্যয় করে, তাদের উপমা উঁচু ভূমিতে অবস্থিত বাগানের মত, যাতে পড়েছে প্রবল বৃষ্টি। ফলে তা দ্বিগুণ ফল-ফলাদি উৎপন্ন করেছে। আর যদি তাতে প্রবল বৃষ্টি নাও পড়ে, তবে হালকা বৃষ্টি (যথেষ্ট)। আর আল্লাহ তোমরা যা আমল কর, সে ব্যাপারে সম্যক দ্রষ্টা।",
    "তোমাদের কেউ কি কামনা করে, তার জন্য আঙ্গুর ও খেজুরের এমন একটি বাগান থাকবে, যার তলদেশ দিয়ে প্রবাহিত হবে নদ-নদী, সেখানে তার জন্য থাকবে সব ধরনের ফল-ফলাদি, আর বার্ধক্য তাকে আক্রান্ত করবে এবং তার জন্য থাকবে দুর্বল সন্তান-সন্ততি। অতঃপর বাগানটিতে আঘাত হানল ঘূর্ণিঝড়, যাতে রয়েছে আগুন, ফলে সেটি জ্বলে গেল? এভাবেই আল্লাহ তোমাদের জন্য আয়াতসমূহ বিশদভাবে বর্ণনা করেন, যাতে তোমরা চিন্তা কর।",
    "হে মুমিনগণ, তোমরা ব্যয় কর উত্তম বস্ত্ত, তোমরা যা অর্জন করেছ এবং আমি যমীন থেকে তোমাদের জন্য যা উৎপন্ন করেছি তা থেকে এবং নিকৃষ্ট বস্ত্তর ইচ্ছা করো না যে, তা থেকে তোমরা ব্যয় করবে। অথচ চোখ বন্ধ করা ছাড়া যা তোমরা গ্রহণ করো না। আর জেনে রাখ, নিশ্চয় আল্লাহ অভাবমুক্ত, সপ্রশংসিত।",
    "শয়তান তোমাদেরকে দরিদ্রতার প্রতিশ্রুতি দেয় এবং অশ্লীল কাজের আদেশ করে। আর আল্লাহ তোমাদেরকে তার পক্ষ থেকে ক্ষমা ও অনুগ্রহের প্রতিশ্রুতি দেন। আর আল্লাহ প্রাচুর্যময়, সর্বজ্ঞ।",
    "তিনি যাকে চান প্রজ্ঞা দান করেন। আর যাকে প্রজ্ঞা দেয়া হয়, তাকে অনেক কল্যাণ দেয়া হয়। আর বিবেক সম্পন্নগণই উপদেশ গ্রহণ করে।",
    "তোমরা যা কিছু ব্যয় কর অথবা যে কোন মান্নত কর তা অবশ্যই আল্লাহ জানেন। আর যালিমদের জন্য কোন সাহায্যকারী নেই।",
    "তোমরা যদি সদাকা প্রকাশ কর, তবে তা উত্তম। আর যদি তা গোপন কর এবং ফকীরদেরকে তা দাও, তাহলে তাও তোমাদের জন্য উত্তম এবং তিনি তোমাদের গুনাহসমূহ মুছে দেবেন। আর তোমরা যে আমল কর, আল্লাহ সে সম্পর্কে সম্যক অবহিত।",
    "তাদেরকে হিদায়াত করার দায়িত্ব তোমার নয়, কিন্তু আল্লাহ যাকে চান হিদায়াত করেন এবং তোমরা যে সম্পদ ব্যয় কর, তা তোমাদের নিজদের জন্যই। আর তোমরা তো আল্লাহর সন্তুষ্টির উদ্দেশ্যে ব্যয় কর এবং তোমরা কোন উত্তম ব্যয় করলে তা তোমাদেরকে পরিপূর্ণভাবে দেয়া হবে। আর তোমাদের প্রতি যুলম করা হবে না।",
    "(সদাকা) সেসব দরিদ্রের জন্য যারা আল্লাহর রাস্তায় আটকে গিয়েছে, তারা যমীনে চলতে পারে না। না চাওয়ার কারণে অনবগত ব্যক্তি তাদেরকে অভাবমুক্ত মনে করে। তুমি তাদেরকে চিনতে পারবে তাদের চি‎হ্ন দ্বারা। তারা মানুষের কাছে নাছোড় হয়ে চায় না। আর তোমরা যে সম্পদ ব্যয় কর, অবশ্যই আল্লাহ সে সম্পর্কে পূর্ণ জ্ঞানী।",
    "যারা তাদের সম্পদ ব্যয় করে রাতে ও দিনে, গোপনে ও প্রকাশ্যে। অতএব, তাদের জন্যই রয়েছে তাদের রবের নিকট তাদের প্রতিদান। আর তাদের কোন ভয় নেই এবং তারা চিন্তিতও হবে না।",
    "যারা সুদ খায়, তারা তার ন্যায় (কবর থেকে) উঠবে, যাকে শয়তান স্পর্শ করে পাগল বানিয়ে দেয়। এটা এ জন্য যে, তারা বলে, বেচা-কেনা সুদের মতই। অথচ আল্লাহ বেচা-কেনা হালাল করেছেন এবং সুদ হারাম করেছেন। অতএব, যার কাছে তার রবের পক্ষ থেকে উপদেশ আসার পর সে বিরত হল, যা গত হয়েছে তা তার জন্যই ইচ্ছাধীন। আর তার ব্যাপারটি আল্লাহর হাওলায়। আর যারা ফিরে গেল, তারা আগুনের অধিবাসী। তারা সেখানে স্থায়ী হবে।",
    "আল্লাহ সুদকে মিটিয়ে দেন এবং সদাকাকে বাড়িয়ে দেন। আর আল্লাহ কোন অতি কুফরকারী পাপীকে ভালবাসেন না।",
    "নিশ্চয় যারা ঈমান আনে ও নেক আমল করে এবং সালাত কায়েম করে, আর যাকাত প্রদান করে, তাদের জন্য রয়েছে তাদের রবের নিকট প্রতিদান। আর তাদের কোন ভয় নেই এবং তারা চিন্তিতও হবে না।",
    "হে মুমিনগণ, তোমরা আল্লাহকে ভয় কর এবং সুদের যা অবশিষ্ট আছে, তা পরিত্যাগ কর, যদি তোমরা মুমিন হও।",
    "কিন্তু যদি তোমরা তা না কর তাহলে আল্লাহ ও তাঁর রাসূলের পক্ষ থেকে যুদ্ধের ঘোষণা নাও, আর যদি তোমরা তাওবা কর, তবে তোমাদের মূলধন তোমাদেরই থাকবে। তোমরা যুলম করবে না এবং তোমাদের যুলম করা হবে না।",
    "আর যদি সে অসচ্ছল হয়, তাহলে সচ্ছলতা আসা পর্যন্ত তার অবকাশ রয়েছে। আর সদাকা করে দেয়া তোমাদের জন্য উত্তম, যদি তোমরা জানতে।",
    "আর তোমরা সে দিনের ভয় কর, যে দিন তোমাদেরকে আল্লাহর দিকে ফিরিয়ে নেয়া হবে। অতঃপর প্রত্যেক ব্যক্তিকে সে যা উপার্জন করেছে, তা পুরোপুরি দেয়া হবে। আর তাদের যুলম করা হবে না।",
    "হে মুমিনগণ, যখন তোমরা নির্দিষ্ট সময়ের জন্য পরস্পর ঋণের লেন-দেন করবে, তখন তা লিখে রাখবে। আর তোমাদের মধ্যে একজন লেখক যেন ইনসাফের সাথে লিখে রাখে এবং কোন লেখক আল্লাহ তাকে যেরূপ শিক্ষা দিয়েছেন, তা লিখতে অস্বীকার করবে না। সুতরাং সে যেন লিখে রাখে এবং যার উপর পাওনা সে (ঋণ গ্রহীতা) যেন তা লিখিয়ে রাখে। আর সে যেন তার রব আল্লাহর তাকওয়া অবলম্বন করে এবং পাওনা থেকে যেন সামান্যও কম না দেয়। অতঃপর যার উপর পাওনা রয়েছে সে (ঋণ গ্রহীতা) যদি নির্বোধ বা দুর্বল হয়, অথবা সে লেখার বিষয়বস্ত্ত বলতে না পারে, তাহলে যেন তার অভিভাবক ন্যায়ের সাথে লেখার বিষয়বস্ত্ত বলে দেয়। আর তোমরা তোমাদের পুরুষদের মধ্য হতে দু’জন সাক্ষী রাখ। অতঃপর যদি তারা উভয়ে পুরুষ না হয়, তাহলে একজন পুরুষ ও দু’জন নারী- যাদেরকে তোমরা সাক্ষী হিসেবে পছন্দ কর। যাতে তাদের (নারীদের) একজন ভুল করলে অপরজন স্মরণ করিয়ে দেয়। সাক্ষীরা যেন অস্বীকার না করে, যখন তাদেরকে ডাকা হয়। আর তা ছোট হোক কিংবা বড় তা নির্ধারিত সময় পর্যন্ত লিপিবদ্ধ করতে তোমরা বিরক্ত হয়ো না। এটি আল্লাহর নিকট অধিক ইনসাফপূর্ণ এবং সাক্ষ্য দানের জন্য যথাযথ। আর তোমরা সন্দিহান না হওয়ার অধিক নিকটবর্তী। তবে যদি নগদ ব্যবসা হয় যা তোমরা হাতে হাতে লেনদেন কর, তাহলে তা না লিখলে তোমাদের কোন দোষ নেই। আর তোমরা সাক্ষী রাখ, যখন তোমরা বেচা-কেনা করবে এবং কোন লেখক ও সাক্ষীকে ক্ষতিগ্রস্ত করা হবে না। আর যদি তোমরা কর, তাহলে নিশ্চয় তা হবে তোমাদের সাথে অনাচার। আর তোমরা আল্লাহর তাকওয়া অবলম্বন কর এবং আল্লাহ তোমাদেরকে শিক্ষা দেবেন। আর আল্লাহ সব বিষয়ে সম্যক জ্ঞানী।",
    "আর যদি তোমরা সফরে থাক এবং কোন লেখক না পাও, তাহলে হস্তান্তরিত বন্ধক রাখবে। আর যদি তোমরা একে অপরকে বিশ্বস্ত মনে কর, তবে যাকে বিশ্বস্ত মনে করা হয়, সে যেন স্বীয় আমানত আদায় করে এবং নিজ রব আল্লাহর তাকওয়া অবলম্বন করে। আর তোমরা সাক্ষ্য গোপন করো না এবং যে কেউ তা গোপন করে, অবশ্যই তার অন্তর পাপী। আর তোমরা যা আমল কর, আল্লাহ সে ব্যাপারে সবিশেষ অবহিত।",
    "আল্লাহর জন্যই যা রয়েছে আসমানসমূহে এবং যা রয়েছে যমীনে। আর তোমরা যদি প্রকাশ কর যা তোমাদের অন্তরে রয়েছে অথবা গোপন কর, আল্লাহ সে বিষয়ে তোমাদের হিসাব নেবেন। অতঃপর তিনি যাকে চান ক্ষমা করবেন, আর যাকে চান আযাব দেবেন। আর আল্লাহ সবকিছুর উপর ক্ষমতাবান।",
    "রাসূল তার নিকট তার রবের পক্ষ থেকে নাযিলকৃত বিষয়ের প্রতি ঈমান এনেছে, আর মুমিনগণও। প্রত্যেকে ঈমান এনেছে আল্লাহর উপর, তাঁর ফেরেশতাকুল, কিতাবসমূহ ও তাঁর রাসূলগণের উপর, আমরা তাঁর রাসূলগণের কারও মধ্যে তারতম্য করি না। আর তারা বলে, আমরা শুনলাম এবং মানলাম। হে আমাদের রব! আমরা আপনারই ক্ষমা প্রার্থনা করি, আর আপনার দিকেই প্রত্যাবর্তনস্থল।",
    "আল্লাহ কোন ব্যক্তিকে তার সামর্থ্যের বাইরে দায়িত্ব দেন না। সে যা অর্জন করে তা তার জন্যই এবং সে যা কামাই করে তা তার উপরই বর্তাবে। হে আমাদের রব! আমরা যদি ভুলে যাই, অথবা ভুল করি তাহলে আপনি আমাদেরকে পাকড়াও করবেন না। হে আমাদের রব, আমাদের উপর বোঝা চাপিয়ে দেবেন না, যেমন আমাদের পূর্ববর্তীদের উপর চাপিয়ে দিয়েছেন। হে আমাদের রব, আপনি আমাদেরকে এমন কিছু বহন করাবেন না, যার সামর্থ্য আমাদের নেই। আর আপনি আমাদেরকে মার্জনা করুন এবং আমাদেরকে ক্ষমা করুন, আর আমাদের উপর দয়া করুন। আপনি আমাদের অভিভাবক। অতএব আপনি কাফির সম্প্রদায়ের বিরুদ্ধে আমাদেরকে সাহায্য করুন।"
  ]
}