{
  "surahName": "Ash-Shura",
  "surahNameArabic": "الشورى",
  "surahNameArabicLong": "سورة الشورى",
  "surahNameTranslation": "Consultation",
  "revelationPlace": "Mecca",
  "totalAyah": 53,
  "surahNo": 42,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/42.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/042.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/42.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/042.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/42.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/042.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/42.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/042.mp3"
    }
  },
  "english": [
    "Ḥâ-Mĩm.",
    "’Aĩn-Sĩn-Qãf.",
    "And so you ˹O Prophet˺ are sent revelation, just like those before you, by Allah—the Almighty, All-Wise.",
    "To Him belongs whatever is in the heavens and whatever is on the earth. And He is the Most High, the Greatest.",
    "The heavens nearly burst, one above the other, ˹in awe of Him˺. And the angels glorify the praises of their Lord, and seek forgiveness for those on earth. Surely Allah alone is the All-Forgiving, Most Merciful.",
    "As for those who take other protectors besides Him, Allah is Watchful over them. And you ˹O Prophet˺ are not a keeper over them.",
    "And so We have revealed to you a Quran in Arabic, so you may warn the Mother of Cities and everyone around it, and warn of the Day of Gathering—about which there is no doubt—˹when˺ a group will be in Paradise and another in the Blaze.",
    "Had Allah willed, He could have easily made all ˹humanity˺ into a single community ˹of believers˺. But He admits into His mercy whoever He wills. And the wrongdoers will have no protector or helper.",
    "How can they take protectors besides Him? Allah alone is the Protector. He ˹alone˺ gives life to the dead. And He ˹alone˺ is Most Capable of everything.",
    "˹Say to the believers, O  Prophet,˺ “Whatever you may differ about, its judgment rests with Allah. That is Allah—my Lord. In Him I put my trust, and to Him I ˹always˺ turn.”",
    "˹He is˺ the Originator of the heavens and the earth. He has made for you spouses from among yourselves, and ˹made˺ mates for cattle ˹as well˺—multiplying you ˹both˺. There is nothing like Him, for He ˹alone˺ is the All-Hearing, All-Seeing.",
    "To Him belong the keys ˹of the treasuries˺ of the heavens and the earth. He gives abundant or limited provisions to whoever He wills. Indeed, He has ˹perfect˺ knowledge of all things.",
    "He has ordained for you ˹believers˺ the Way which He decreed for Noah, and what We have revealed to you ˹O Prophet˺ and what We decreed for Abraham, Moses, and Jesus, ˹commanding:˺ “Uphold the faith, and make no divisions in it.” What you call the polytheists to is unbearable for them. Allah chooses for Himself whoever He wills, and guides to Himself whoever turns ˹to Him˺.",
    "They did not split ˹into sects˺ out of mutual envy until knowledge came to them. Had it not been for a prior decree from your Lord for an appointed term, the matter would have certainly been settled between them ˹at once˺. And surely those who were made to inherit the Scripture after them are truly in alarming doubt about this ˹Quran˺.",
    "Because of that, you ˹O Prophet˺ will invite ˹all˺. Be steadfast as you are commanded, and do not follow their desires. And say, “I believe in every Scripture Allah has revealed. And I am commanded to judge fairly among you. Allah is our Lord and your Lord. We will be accountable for our deeds and you for yours. There is no ˹need for˺ contention between us. Allah will gather us together ˹for judgment˺. And to Him is the final return.”",
    "As for those who dispute about Allah after He is ˹already˺ acknowledged ˹by many˺, their argument is futile in the sight of their Lord. Upon them is wrath, and they will suffer a severe punishment.",
    "It is Allah Who has revealed the Book with the truth and the balance ˹of justice˺. You never know, perhaps the Hour is near.",
    "Those who disbelieve in it ˹ask to˺ hasten it ˹mockingly˺. But the believers are fearful of it, knowing that it is the truth. Surely those who dispute about the Hour have gone far astray.",
    "Allah is Ever Kind to His servants. He provides ˹abundantly˺ to whoever He wills. And He is the All-Powerful, Almighty.",
    "Whoever desires the harvest of the Hereafter, We will increase their harvest. And whoever desires ˹only˺ the harvest of this world, We will give them some of it, but they will have no share in the Hereafter.",
    "Or do they have associate-gods who have ordained for them some ˹polytheistic˺ beliefs, which Allah has not authorized? Had it not been for ˹prior˺ decree on Judgment, the matter would have certainly been settled between them ˹at once˺. And surely the wrongdoers will suffer a painful punishment.",
    "You will see the wrongdoers fearful ˹of the punishment˺ for what they committed but it will be inevitable for them, whereas those who believe and do good will be in the lush Gardens of Paradise. They will have whatever they desire from their Lord. That is ˹truly˺ the greatest bounty.",
    "That ˹reward˺ is the good news which Allah gives to His servants who believe and do good. Say, ˹O Prophet,˺ “I do not ask you for a reward for this ˹message˺—only honour for ˹our˺ kinship.” Whoever earns a good deed, We will increase it in goodness for them. Surely Allah is All-Forgiving, Most Appreciative.",
    "Or do they say, “He has fabricated a lie about Allah!”? ˹If you had,˺ Allah would have sealed your heart, if He willed. And Allah wipes out falsehood and establishes the truth by His Words. He certainly knows best what is ˹hidden˺ in the heart.",
    "He is the One Who accepts repentance from His servants and pardons ˹their˺ sins. And He knows whatever you do.",
    "He responds to those who believe and do good, and increases their reward out of His grace. As for the disbelievers, they will suffer a severe punishment.",
    "Had Allah given abundant provisions to ˹all˺ His servants, they would have certainly transgressed throughout the land. But He sends down whatever He wills in perfect measure. He is truly All-Aware, All-Seeing of His servants.",
    "He is the One Who sends down rain after people have given up hope, spreading out His mercy. He is the Guardian, the Praiseworthy.",
    "And among His signs is the creation of the heavens and the earth, and all living beings He dispersed throughout both. And He is Most Capable of bringing all together whenever He wills.",
    "Whatever affliction befalls you is because of what your own hands have committed. And He pardons much.",
    "You can never escape ˹Him˺ on earth, nor do you have any protector or helper besides Allah.",
    "And among His signs are the ships like mountains ˹sailing˺ in the sea.",
    "If He wills, He can calm the wind, leaving the ships motionless on the water. Surely in this are signs for whoever is steadfast, grateful.",
    "Or He can wreck the ships for what the people have committed—though He forgives much—",
    "so those who dispute about Our signs may know that they have no refuge.",
    "Whatever ˹pleasure˺ you have been given is ˹no more than a fleeting˺ enjoyment of this worldly life. But what is with Allah is far better and more lasting for those who believe and put their trust in their Lord;",
    "who avoid major sins and shameful deeds, and forgive when angered;",
    "who respond to their Lord, establish prayer, conduct their affairs by mutual consultation, and donate from what We have provided for them;",
    "and who enforce justice when wronged.",
    "The reward of an evil deed is its equivalent. But whoever pardons and seeks reconciliation, then their reward is with Allah. He certainly does not like the wrongdoers.",
    "There is no blame on those who enforce justice after being wronged.",
    "Blame is only on those who wrong people and transgress in the land unjustly. It is they who will suffer a painful punishment.",
    "And whoever endures patiently and forgives—surely this is a resolve to aspire to.",
    "And whoever Allah leaves to stray will have no guide after Him. You will see the wrongdoers, when they face the torment, pleading, “Is there any way back ˹to the world˺?”",
    "And you will see them exposed to the Fire, fully humbled out of disgrace, stealing glances ˹at it˺. And the believers will say, “The ˹true˺ losers are those who have lost themselves and their families on Judgment Day.” The wrongdoers will certainly be in everlasting torment.",
    "They will have no protectors to help them against Allah. And whoever Allah leaves to stray, for them there is no way.",
    "Respond to your Lord before the coming of a Day from Allah that cannot be averted. There will be no refuge for you then, nor ˹grounds for˺ denial ˹of sins˺.",
    "But if they turn away, We have not sent you ˹O Prophet˺ as a keeper over them. Your duty is only to deliver ˹the message˺. And indeed, when We let someone taste a mercy from Us, they become prideful ˹because˺ of it. But when afflicted with evil because of what their hands have done, then one becomes totally ungrateful.",
    "To Allah ˹alone˺ belongs the kingdom of the heavens and the earth. He creates whatever He wills. He blesses whoever He wills with daughters, and blesses whoever He wills with sons",
    "or grants both, sons and daughters, ˹to whoever He wills˺, and leaves whoever He wills infertile. He is indeed All-Knowing, Most Capable.",
    "It is not ˹possible˺ for a human being to have Allah communicate with them, except through inspiration, or from behind a veil, or by sending a messenger-angel to reveal whatever He wills by His permission. He is surely Most High, All-Wise.",
    "And so We have sent to you ˹O Prophet˺ a revelation by Our command. You did not know of ˹this˺ Book and faith ˹before˺. But We have made it a light, by which We guide whoever We will of Our servants. And you are truly leading ˹all˺ to the Straight Path—",
    "the Path of Allah, to Whom belongs whatever is in the heavens and whatever is on the earth. Surely to Allah all matters will return ˹for judgment˺."
  ],
  "arabic1": [
    "حٰمٓ",
    "عٓسٓقٓ",
    "كَذٰلِكَ یُوْحِیْۤ اِلَیْكَ وَاِلَی الَّذِیْنَ مِنْ قَبْلِكَ اللّٰهُ الْعَزِیْزُ الْحَكِیْمُ",
    "لَهٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَهُوَ الْعَلِیُّ الْعَظِیْمُ",
    "تَكَادُ السَّمٰوٰتُ یَتَفَطَّرْنَ مِنْ فَوْقِهِنَّ وَالْمَلٰٓىِٕكَةُ یُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْ وَیَسْتَغْفِرُوْنَ لِمَنْ فِی الْاَرْضِ اَلَاۤ اِنَّ اللّٰهَ هُوَ الْغَفُوْرُ الرَّحِیْمُ",
    "وَالَّذِیْنَ اتَّخَذُوْا مِنْ دُوْنِهٖۤ اَوْلِیَآءَ اللّٰهُ حَفِیْظٌ عَلَیْهِمْ ۖ وَمَاۤ اَنْتَ عَلَیْهِمْ بِوَكِیْلٍ",
    "وَكَذٰلِكَ اَوْحَیْنَاۤ اِلَیْكَ قُرْاٰنًا عَرَبِیًّا لِّتُنْذِرَ اُمَّ الْقُرٰی وَمَنْ حَوْلَهَا وَتُنْذِرَ یَوْمَ الْجَمْعِ لَا رَیْبَ فِیْهِ فَرِیْقٌ فِی الْجَنَّةِ وَفَرِیْقٌ فِی السَّعِیْرِ",
    "وَلَوْ شَآءَ اللّٰهُ لَجَعَلَهُمْ اُمَّةً وَّاحِدَةً وَّلٰكِنْ یُّدْخِلُ مَنْ یَّشَآءُ فِیْ رَحْمَتِهٖ وَالظّٰلِمُوْنَ مَا لَهُمْ مِّنْ وَّلِیٍّ وَّلَا نَصِیْرٍ",
    "اَمِ اتَّخَذُوْا مِنْ دُوْنِهٖۤ اَوْلِیَآءَ فَاللّٰهُ هُوَ الْوَلِیُّ وَهُوَ یُحْیِ الْمَوْتٰی وَهُوَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "وَمَا اخْتَلَفْتُمْ فِیْهِ مِنْ شَیْءٍ فَحُكْمُهٗۤ اِلَی اللّٰهِ ذٰلِكُمُ اللّٰهُ رَبِّیْ عَلَیْهِ تَوَكَّلْتُ ۖ وَاِلَیْهِ اُنِیْبُ",
    "فَاطِرُ السَّمٰوٰتِ وَالْاَرْضِ جَعَلَ لَكُمْ مِّنْ اَنْفُسِكُمْ اَزْوَاجًا وَّمِنَ الْاَنْعَامِ اَزْوَاجًا یَذْرَؤُكُمْ فِیْهِ لَیْسَ كَمِثْلِهٖ شَیْءٌ وَهُوَ السَّمِیْعُ الْبَصِیْرُ",
    "لَهٗ مَقَالِیْدُ السَّمٰوٰتِ وَالْاَرْضِ یَبْسُطُ الرِّزْقَ لِمَنْ یَّشَآءُ وَیَقْدِرُ اِنَّهٗ بِكُلِّ شَیْءٍ عَلِیْمٌ",
    "شَرَعَ لَكُمْ مِّنَ الدِّیْنِ مَا وَصّٰی بِهٖ نُوْحًا وَّالَّذِیْۤ اَوْحَیْنَاۤ اِلَیْكَ وَمَا وَصَّیْنَا بِهٖۤ اِبْرٰهِیْمَ وَمُوْسٰی وَعِیْسٰۤی اَنْ اَقِیْمُوا الدِّیْنَ وَلَا تَتَفَرَّقُوْا فِیْهِ كَبُرَ عَلَی الْمُشْرِكِیْنَ مَا تَدْعُوْهُمْ اِلَیْهِ اَللّٰهُ یَجْتَبِیْۤ اِلَیْهِ مَنْ یَّشَآءُ وَیَهْدِیْۤ اِلَیْهِ مَنْ یُّنِیْبُ",
    "وَمَا تَفَرَّقُوْۤا اِلَّا مِنْ بَعْدِ مَا جَآءَهُمُ الْعِلْمُ بَغْیًا بَیْنَهُمْ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ اِلٰۤی اَجَلٍ مُّسَمًّی لَّقُضِیَ بَیْنَهُمْ وَاِنَّ الَّذِیْنَ اُوْرِثُوا الْكِتٰبَ مِنْ بَعْدِهِمْ لَفِیْ شَكٍّ مِّنْهُ مُرِیْبٍ",
    "فَلِذٰلِكَ فَادْعُ وَاسْتَقِمْ كَمَاۤ اُمِرْتَ وَلَا تَتَّبِعْ اَهْوَآءَهُمْ وَقُلْ اٰمَنْتُ بِمَاۤ اَنْزَلَ اللّٰهُ مِنْ كِتٰبٍ وَاُمِرْتُ لِاَعْدِلَ بَیْنَكُمْ اَللّٰهُ رَبُّنَا وَرَبُّكُمْ لَنَاۤ اَعْمَالُنَا وَلَكُمْ اَعْمَالُكُمْ لَا حُجَّةَ بَیْنَنَا وَبَیْنَكُمْ اَللّٰهُ یَجْمَعُ بَیْنَنَا وَاِلَیْهِ الْمَصِیْرُ",
    "وَالَّذِیْنَ یُحَآجُّوْنَ فِی اللّٰهِ مِنْ بَعْدِ مَا اسْتُجِیْبَ لَهٗ حُجَّتُهُمْ دَاحِضَةٌ عِنْدَ رَبِّهِمْ وَعَلَیْهِمْ غَضَبٌ وَّلَهُمْ عَذَابٌ شَدِیْدٌ",
    "اَللّٰهُ الَّذِیْۤ اَنْزَلَ الْكِتٰبَ بِالْحَقِّ وَالْمِیْزَانَ وَمَا یُدْرِیْكَ لَعَلَّ السَّاعَةَ قَرِیْبٌ",
    "یَسْتَعْجِلُ بِهَا الَّذِیْنَ لَا یُؤْمِنُوْنَ بِهَا وَالَّذِیْنَ اٰمَنُوْا مُشْفِقُوْنَ مِنْهَا وَیَعْلَمُوْنَ اَنَّهَا الْحَقُّ اَلَاۤ اِنَّ الَّذِیْنَ یُمَارُوْنَ فِی السَّاعَةِ لَفِیْ ضَلٰلٍۢ بَعِیْدٍ",
    "اَللّٰهُ لَطِیْفٌ بِعِبَادِهٖ یَرْزُقُ مَنْ یَّشَآءُ وَهُوَ الْقَوِیُّ الْعَزِیْزُ",
    "مَنْ كَانَ یُرِیْدُ حَرْثَ الْاٰخِرَةِ نَزِدْ لَهٗ فِیْ حَرْثِهٖ وَمَنْ كَانَ یُرِیْدُ حَرْثَ الدُّنْیَا نُؤْتِهٖ مِنْهَا وَمَا لَهٗ فِی الْاٰخِرَةِ مِنْ نَّصِیْبٍ",
    "اَمْ لَهُمْ شُرَكٰٓؤُا شَرَعُوْا لَهُمْ مِّنَ الدِّیْنِ مَا لَمْ یَاْذَنْ بِهِ اللّٰهُ وَلَوْلَا كَلِمَةُ الْفَصْلِ لَقُضِیَ بَیْنَهُمْ وَاِنَّ الظّٰلِمِیْنَ لَهُمْ عَذَابٌ اَلِیْمٌ",
    "تَرَی الظّٰلِمِیْنَ مُشْفِقِیْنَ مِمَّا كَسَبُوْا وَهُوَ وَاقِعٌ بِهِمْ وَالَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فِیْ رَوْضٰتِ الْجَنّٰتِ لَهُمْ مَّا یَشَآءُوْنَ عِنْدَ رَبِّهِمْ ذٰلِكَ هُوَ الْفَضْلُ الْكَبِیْرُ",
    "ذٰلِكَ الَّذِیْ یُبَشِّرُ اللّٰهُ عِبَادَهُ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ قُلْ لَّاۤ اَسْـَٔلُكُمْ عَلَیْهِ اَجْرًا اِلَّا الْمَوَدَّةَ فِی الْقُرْبٰی وَمَنْ یَّقْتَرِفْ حَسَنَةً نَّزِدْ لَهٗ فِیْهَا حُسْنًا اِنَّ اللّٰهَ غَفُوْرٌ شَكُوْرٌ",
    "اَمْ یَقُوْلُوْنَ افْتَرٰی عَلَی اللّٰهِ كَذِبًا فَاِنْ یَّشَاِ اللّٰهُ یَخْتِمْ عَلٰی قَلْبِكَ وَیَمْحُ اللّٰهُ الْبَاطِلَ وَیُحِقُّ الْحَقَّ بِكَلِمٰتِهٖ اِنَّهٗ عَلِیْمٌۢ بِذَاتِ الصُّدُوْرِ",
    "وَهُوَ الَّذِیْ یَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهٖ وَیَعْفُوْا عَنِ السَّیِّاٰتِ وَیَعْلَمُ مَا تَفْعَلُوْنَ",
    "وَیَسْتَجِیْبُ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَیَزِیْدُهُمْ مِّنْ فَضْلِهٖ وَالْكٰفِرُوْنَ لَهُمْ عَذَابٌ شَدِیْدٌ",
    "وَلَوْ بَسَطَ اللّٰهُ الرِّزْقَ لِعِبَادِهٖ لَبَغَوْا فِی الْاَرْضِ وَلٰكِنْ یُّنَزِّلُ بِقَدَرٍ مَّا یَشَآءُ اِنَّهٗ بِعِبَادِهٖ خَبِیْرٌ بَصِیْرٌ",
    "وَهُوَ الَّذِیْ یُنَزِّلُ الْغَیْثَ مِنْ بَعْدِ مَا قَنَطُوْا وَیَنْشُرُ رَحْمَتَهٗ وَهُوَ الْوَلِیُّ الْحَمِیْدُ",
    "وَمِنْ اٰیٰتِهٖ خَلْقُ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَثَّ فِیْهِمَا مِنْ دَآبَّةٍ وَهُوَ عَلٰی جَمْعِهِمْ اِذَا یَشَآءُ قَدِیْرٌ",
    "وَمَاۤ اَصَابَكُمْ مِّنْ مُّصِیْبَةٍ فَبِمَا كَسَبَتْ اَیْدِیْكُمْ وَیَعْفُوْا عَنْ كَثِیْرٍ",
    "وَمَاۤ اَنْتُمْ بِمُعْجِزِیْنَ فِی الْاَرْضِ وَمَا لَكُمْ مِّنْ دُوْنِ اللّٰهِ مِنْ وَّلِیٍّ وَّلَا نَصِیْرٍ",
    "وَمِنْ اٰیٰتِهِ الْجَوَارِ فِی الْبَحْرِ كَالْاَعْلَامِ",
    "اِنْ یَّشَاْ یُسْكِنِ الرِّیْحَ فَیَظْلَلْنَ رَوَاكِدَ عَلٰی ظَهْرِهٖ اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّكُلِّ صَبَّارٍ شَكُوْرٍ",
    "اَوْ یُوْبِقْهُنَّ بِمَا كَسَبُوْا وَیَعْفُ عَنْ كَثِیْرٍ",
    "وَّیَعْلَمَ الَّذِیْنَ یُجَادِلُوْنَ فِیْۤ اٰیٰتِنَا مَا لَهُمْ مِّنْ مَّحِیْصٍ",
    "فَمَاۤ اُوْتِیْتُمْ مِّنْ شَیْءٍ فَمَتَاعُ الْحَیٰوةِ الدُّنْیَا وَمَا عِنْدَ اللّٰهِ خَیْرٌ وَّاَبْقٰی لِلَّذِیْنَ اٰمَنُوْا وَعَلٰی رَبِّهِمْ یَتَوَكَّلُوْنَ",
    "وَالَّذِیْنَ یَجْتَنِبُوْنَ كَبٰٓىِٕرَ الْاِثْمِ وَالْفَوَاحِشَ وَاِذَا مَا غَضِبُوْا هُمْ یَغْفِرُوْنَ",
    "وَالَّذِیْنَ اسْتَجَابُوْا لِرَبِّهِمْ وَاَقَامُوا الصَّلٰوةَ وَاَمْرُهُمْ شُوْرٰی بَیْنَهُمْ وَمِمَّا رَزَقْنٰهُمْ یُنْفِقُوْنَ",
    "وَالَّذِیْنَ اِذَاۤ اَصَابَهُمُ الْبَغْیُ هُمْ یَنْتَصِرُوْنَ",
    "وَجَزٰٓؤُا سَیِّئَةٍ سَیِّئَةٌ مِّثْلُهَا فَمَنْ عَفَا وَاَصْلَحَ فَاَجْرُهٗ عَلَی اللّٰهِ اِنَّهٗ لَا یُحِبُّ الظّٰلِمِیْنَ",
    "وَلَمَنِ انْتَصَرَ بَعْدَ ظُلْمِهٖ فَاُولٰٓىِٕكَ مَا عَلَیْهِمْ مِّنْ سَبِیْلٍ",
    "اِنَّمَا السَّبِیْلُ عَلَی الَّذِیْنَ یَظْلِمُوْنَ النَّاسَ وَیَبْغُوْنَ فِی الْاَرْضِ بِغَیْرِ الْحَقِّ اُولٰٓىِٕكَ لَهُمْ عَذَابٌ اَلِیْمٌ",
    "وَلَمَنْ صَبَرَ وَغَفَرَ اِنَّ ذٰلِكَ لَمِنْ عَزْمِ الْاُمُوْرِ",
    "وَمَنْ یُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ وَّلِیٍّ مِّنْ بَعْدِهٖ وَتَرَی الظّٰلِمِیْنَ لَمَّا رَاَوُا الْعَذَابَ یَقُوْلُوْنَ هَلْ اِلٰی مَرَدٍّ مِّنْ سَبِیْلٍ",
    "وَتَرٰىهُمْ یُعْرَضُوْنَ عَلَیْهَا خٰشِعِیْنَ مِنَ الذُّلِّ یَنْظُرُوْنَ مِنْ طَرْفٍ خَفِیٍّ وَقَالَ الَّذِیْنَ اٰمَنُوْۤا اِنَّ الْخٰسِرِیْنَ الَّذِیْنَ خَسِرُوْۤا اَنْفُسَهُمْ وَاَهْلِیْهِمْ یَوْمَ الْقِیٰمَةِ اَلَاۤ اِنَّ الظّٰلِمِیْنَ فِیْ عَذَابٍ مُّقِیْمٍ",
    "وَمَا كَانَ لَهُمْ مِّنْ اَوْلِیَآءَ یَنْصُرُوْنَهُمْ مِّنْ دُوْنِ اللّٰهِ وَمَنْ یُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ سَبِیْلٍ",
    "اِسْتَجِیْبُوْا لِرَبِّكُمْ مِّنْ قَبْلِ اَنْ یَّاْتِیَ یَوْمٌ لَّا مَرَدَّ لَهٗ مِنَ اللّٰهِ مَا لَكُمْ مِّنْ مَّلْجَاٍ یَّوْمَىِٕذٍ وَّمَا لَكُمْ مِّنْ نَّكِیْرٍ",
    "فَاِنْ اَعْرَضُوْا فَمَاۤ اَرْسَلْنٰكَ عَلَیْهِمْ حَفِیْظًا اِنْ عَلَیْكَ اِلَّا الْبَلٰغُ وَاِنَّاۤ اِذَاۤ اَذَقْنَا الْاِنْسَانَ مِنَّا رَحْمَةً فَرِحَ بِهَا وَاِنْ تُصِبْهُمْ سَیِّئَةٌ بِمَا قَدَّمَتْ اَیْدِیْهِمْ فَاِنَّ الْاِنْسَانَ كَفُوْرٌ",
    "لِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ یَخْلُقُ مَا یَشَآءُ یَهَبُ لِمَنْ یَّشَآءُ اِنَاثًا وَّیَهَبُ لِمَنْ یَّشَآءُ الذُّكُوْرَ",
    "اَوْ یُزَوِّجُهُمْ ذُكْرَانًا وَّاِنَاثًا وَیَجْعَلُ مَنْ یَّشَآءُ عَقِیْمًا اِنَّهٗ عَلِیْمٌ قَدِیْرٌ",
    "وَمَا كَانَ لِبَشَرٍ اَنْ یُّكَلِّمَهُ اللّٰهُ اِلَّا وَحْیًا اَوْ مِنْ وَّرَآئِ حِجَابٍ اَوْ یُرْسِلَ رَسُوْلًا فَیُوْحِیَ بِاِذْنِهٖ مَا یَشَآءُ اِنَّهٗ عَلِیٌّ حَكِیْمٌ",
    "وَكَذٰلِكَ اَوْحَیْنَاۤ اِلَیْكَ رُوْحًا مِّنْ اَمْرِنَا مَا كُنْتَ تَدْرِیْ مَا الْكِتٰبُ وَلَا الْاِیْمَانُ وَلٰكِنْ جَعَلْنٰهُ نُوْرًا نَّهْدِیْ بِهٖ مَنْ نَّشَآءُ مِنْ عِبَادِنَا وَاِنَّكَ لَتَهْدِیْۤ اِلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "صِرَاطِ اللّٰهِ الَّذِیْ لَهٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ اَلَاۤ اِلَی اللّٰهِ تَصِیْرُ الْاُمُوْرُ"
  ],
  "bengali": [
    "হা-মীম।",
    "‘আইন-সীন-কাফ।",
    "এমনিভাবে মহাপরাক্রমশালী ও প্রজ্ঞাময় আল্লাহ তোমার কাছে ওহী প্রেরণ করেন এবং তোমার পূর্ববর্তীদের কাছেও।",
    "আসমানসমূহে যা কিছু আছে এবং যমীনে যা কিছু আছে সব তাঁরই। তিনিই সমুন্নত, সুমহান।",
    "উপর থেকে আসমান ফেটে পড়ার উপক্রম হয়; আর ফেরেশতারা তাদের রবের প্রশংসায় তাসবীহ পাঠ করে এবং পৃথিবীতে যারা আছে তাদের জন্য ক্ষমা প্রার্থনা করে; জেনে রেখ, আল্লাহ, তিনি তো অতি ক্ষমাশীল, পরম দয়ালু।",
    "আর যারা তাঁর পরিবর্তে অন্যদেরকে অভিভাবকরূপে গ্রহণ করে, আল্লাহ তাদের প্রতি সম্যক দৃষ্টিদাতা এবং তুমি তাদের কর্মবিধায়ক নও।",
    "আর এভাবেই আমি তোমার ওপর আরবী ভাষায় কুরআন নাযিল করেছি যাতে তুমি মূল জনপদ ও তার আশপাশের বাসিন্দাদেরকে সতর্ক করতে পার, আর যাতে ‘একত্রিত হওয়ার দিন’ এর ব্যাপারে সতর্ক করতে পার, যাতে কোন সন্দেহ নেই, একদল থাকবে জান্নাতে আরেক দল জ্বলন্ত আগুনে।",
    "আল্লাহ ইচ্ছা করলে তাদেরকে এক জাতিভুক্ত করতে পারতেন; কিন্তু তিনি যাকে চান তাঁর রহমতে প্রবেশ করান আর যালিমদের জন্য কোন অভিভাবক নেই, সাহায্যকারীও নেই।",
    "তারা কি তাঁকে বাদ দিয়ে বহু অভিভাবক গ্রহণ করেছে? কিন্তু আল্লাহ, তিনিই হলেন প্রকৃত অভিভাবক; তিনিই মৃতকে জীবিত করেন আর তিনি সকল বিষয়ে সর্বক্ষমতাবান।",
    "আর যে কোন বিষয়েই তোমরা মতবিরোধ কর, তার ফয়সালা আল্লাহর কাছে; তিনিই আল্লাহ, আমার রব; তাঁরই উপর আমি তাওয়াক্কুল করেছি এবং আমি তাঁরই অভিমুখী হই।",
    "তিনি আসমানসমূহ ও যমীনের স্রষ্টা; তোমাদের জন্য তোমাদের মধ্য থেকে জোড়া বানিয়েছেন এবং চতুষ্পদ জন্তু থেকেও জোড়া বানিয়েছেন, (এভাবেই) তিনি তোমাদেরকে ছড়িয়ে দিয়েছেন। তাঁর মত কিছু নেই আর তিনি সর্বশ্রোতা ও সর্বদ্রষ্টা।",
    "আসমানসমূহ ও যমীনের চাবি তাঁর কাছে; যার জন্য ইচ্ছা তিনি রিয্ক প্রশস্ত করেন এবং নিয়ন্ত্রিত করেন; নিশ্চয় তিনি সকল বিষয়ে সর্বজ্ঞাত।",
    "তিনি তোমাদের জন্য দীন বিধিবদ্ধ করে দিয়েছেন; যে বিষয়ে তিনি নূহকে নির্দেশ দিয়েছিলেন, আর আমি তোমার কাছে যে ওহী পাঠিয়েছি এবং ইবরাহীম, মূসা ও ঈসাকে যে নির্দেশ দিয়েছিলাম তা হল, তোমরা দীন কায়েম করবে এবং এতে বিচ্ছিন্ন হবে না। তুমি মুশরিকদেরকে যেদিকে আহবান করছ তা তাদের কাছে কঠিন মনে হয়; আল্লাহ যাকে চান তার দিকে নিয়ে আসেন। আর যে তাঁর অভিমুখী হয় তাকে তিনি হিদায়াত দান করেন।",
    "আর তাদের কাছে জ্ঞান আসার পরও তারা কেবল নিজদের মধ্যকার বিদ্বেষের কারণে মতভেদ করেছে; একটি নির্দিষ্ট কাল পর্যন্ত অবকাশ সম্পর্কে তোমার রবের পূর্ব সিদ্ধান্ত না থাকলে তাদের বিষয়ে ফয়সালা হয়ে যেত। আর তাদের পরে যারা কিতাবের উত্তরাধিকারী হয়েছিল, তারা সে সম্পর্কে বিভ্রান্তিকর সন্দেহে রয়েছে।",
    "এ কারণে তুমি আহবান কর এবং দৃঢ় থাক যেমন তুমি আদিষ্ট হয়েছ। আর তুমি তাদের খেয়াল-খুশির অনুসরণ করো না এবং বল, ‘আল্লাহ যে কিতাব নাযিল করেছেন আমি তাতে ঈমান এনেছি এবং তোমাদের মধ্যে ন্যায়বিচার করতে আমি আদিষ্ট হয়েছি। আল্লাহ আমাদের রব এবং তোমাদের রব। আমাদের কর্ম আমাদের এবং তোমাদের কর্ম তোমাদের; আমাদের ও তোমাদের মধ্যে কোন বিবাদ-বিসম্বাদ নেই; আল্লাহ আমাদেরকে একত্র করবেন এবং প্রত্যাবর্তন তাঁরই কাছে’।",
    "আর আল্লাহর আহবানে সাড়া দেয়ার পর আল্লাহ সম্পর্কে যারা বিতর্ক করে, তাদের দলীল-প্রমাণ তাদের রবের নিকট অসার। তাদের উপর (আল্লাহর) গযব এবং তাদের জন্য রয়েছে কঠিন শাস্তি।",
    "আল্লাহ, যিনি সত্যসহ কিতাব ও মীযান* নাযিল করেছেন। আর কিসে তোমাকে জানাবে, হয়ত কিয়ামত খুবই নিকটবর্তী? \n* সনদ, ন্যায় বিচার, ইনসাফ, ইত্যাদি।",
    "যারা এতে ঈমান আনে না, তারাই তা ত্বরান্বিত করতে চায়। আর যারা ঈমান এনেছে, তারা একে ভয় করে এবং তারা জানে যে, এটা অবশ্যই সত্য। জেনে রেখ, নিশ্চয় যারা কিয়ামত সম্পর্কে বাক-বিতন্ডা করে তারা সুদূর পথভ্রষ্টতায় নিপতিত।",
    "আল্লাহ তাঁর বান্দাদের প্রতি অতি দয়ালু। তিনি যাকে ইচ্ছা রিয্ক দান করেন। আর তিনি মহাশক্তিধর, মহাপরাক্রমশালী।",
    "যে আখিরাতের ফসল কামনা করে, আমি তার জন্য তার ফসলে প্রবৃদ্ধি দান করি, আর যে দুনিয়ার ফসল কামনা করে আমি তাকে তা থেকে কিছু দেই এবং আখিরাতে তার জন্য কোন অংশই থাকবে না।",
    "তাদের জন্য কি এমন কিছু শরীক আছে, যারা তাদের জন্য দীনের বিধান দিয়েছে, যার অনুমতি আল্লাহ দেননি? আর ফয়সালার ঘোষণা না থাকলে তাদের ব্যাপারে সিদ্ধান্ত হয়েই যেত। আর নিশ্চয় যালিমদের জন্য রয়েছে যন্ত্রণাদায়ক আযাব।",
    "তুমি যালিমদেরকে তাদের কৃত কর্মের জন্য ভীত-সন্ত্রস্ত দেখতে পাবে। অথচ তা (তাদের কর্মের শাস্তি) তাদের উপর পতিত হবেই। আর যারা ঈমান আনে ও সৎকর্ম করে তারা জান্নাতের উদ্যানসমূহে থাকবে। তারা যা চাইবে, তাদের রবের নিকট তাদের জন্য তাই থাকবে। এটাই তো মহাঅনুগ্রহ।",
    "এটা তাই, যার সুসংবাদ আল্লাহ তার বান্দাদেরকে দেন- যারা ঈমান আনে ও সৎকর্ম করে। বল, ‘আমি এর জন্য তোমাদের কাছে আত্মীয়তার সৌহার্দ ছাড়া অন্য কোন প্রতিদান চাই না’। যে উত্তম কাজ করে, আমি তার জন্য তাতে কল্যাণ বাড়িয়ে দেই। নিশ্চয় আল্লাহ অতি ক্ষমাশীল, বড়ই গুণগ্রাহী।",
    "তারা কি একথা বলে যে, সে আল্লাহ সম্পর্কে মিথ্যা উদ্ভাবন করেছে? অথচ যদি আল্লাহ চাইতেন তোমার হৃদয়ে মোহর মেরে দিতেন। আর আল্লাহ মিথ্যাকে মুছে দেন এবং নিজ বাণী দ্বারা সত্যকে প্রতিষ্ঠিত করেন। নিশ্চয় তিনি অন্তরসমূহে যা আছে, সে সম্পর্কে সবিশেষ অবহিত।",
    "আর তিনিই তাঁর বান্দাদের তাওবা কবূল করেন এবং পাপসমূহ ক্ষমা করে দেন। আর তোমরা যা কর, তা তিনি জানেন।",
    "আর যারা ঈমান আনে ও সৎকর্ম করে তাদের আহবানে তিনি সাড়া দেন এবং তাদের প্রতি তাঁর অনুগ্রহ বৃদ্ধি করেন। আর কাফিরদের জন্য রয়েছে কঠিন আযাব।",
    "আর আল্লাহ যদি তার বান্দাদের জন্য রিয্ক প্রশস্ত করে দিতেন, তাহলে তারা যমীনে অবশ্যই বিদ্রোহ করত। কিন্তু তিনি নির্দিষ্ট পরিমাণে যা ইচ্ছা নাযিল করেন। নিশ্চয় তিনি তাঁর বান্দাদের ব্যাপারে পূর্ণ অবগত, সম্যক দ্রষ্টা।",
    "আর তারা নিরাশ হয়ে পড়লে তিনিই বৃষ্টি বর্ষণ করেন এবং তাঁর রহমত ছড়িয়ে দেন। আর তিনিই তো অভিভাবক, প্রশংসিত।",
    "আর তাঁর নিদর্শনাবলীর মধ্যে রয়েছে আসমানসমূহ ও যমীনের সৃষ্টি এবং এতদোভয়ের মধ্যে তিনি যে সব জীব-জন্তু ছড়িয়ে দিয়েছেন সেগুলো। তিনি যখন ইচ্ছা তখনই এগুলোকে একত্র করতে সক্ষম।",
    "আর তোমাদের প্রতি যে মুসীবত আপতিত হয়, তা তোমাদের কৃতকর্মেরই ফল। আর অনেক কিছুই তিনি ক্ষমা করে দেন।",
    "তোমরা যমীনে (আল্লাহর কর্ম পরিকল্পনাকে) ব্যর্থ করতে পারবে না। আর আল্লাহ ছাড়া তোমাদের কোন অভিভাবক নেই এবং কোন সাহায্যকারীও নেই।",
    "তাঁর নিদর্শনাবলীর মধ্যে আরো রয়েছে সমুদ্রে চলাচলকারী পর্বতমালার মত জাহাজসমূহ।",
    "তিনি যদি চান বাতাসকে থামিয়ে দিতে পারেন। ফলে জাহাজগুলো সমুদ্রপৃষ্ঠে গতিহীন হয়ে পড়বে। নিশ্চয় এতে পরম ধৈর্যশীল ও কৃতজ্ঞ ব্যক্তির জন্য অনেক নিদর্শন রয়েছে।",
    "অথবা তাদের কৃতকর্মের জন্য সেগুলোকে তিনি ধ্বংস করে দিতে পারেন, আবার অনেককে তিনি ক্ষমাও করেন।",
    "আর যারা আমার নিদর্শনসমূহ সম্পর্কে বাক বিতন্ডা করে তারা যেন জানতে পারে যে, তাদের কোন আশ্রয়স্থল নেই।",
    "আর তোমাদেরকে যা কিছু দেয়া হয়েছে তা দুনিয়ার জীবনের ভোগ্য সামগ্রী মাত্র। আর আল্লাহর নিকট যা আছে তা উৎকৃষ্ট ও স্থায়ী তাদের জন্য যারা ঈমান আনে এবং তাদের রবের উপর তাওয়াক্কুল করে।",
    "আর যারা গুরুতর পাপ ও অশ্লীল কার্যকলাপ থেকে বেঁচে থাকে এবং যখন রাগান্বিত হয় তখন তারা ক্ষমা করে দেয়।",
    "আর যারা তাদের রবের আহবানে সাড়া দেয়, সালাত কায়েম করে, তাদের কার্যাবলী তাদের পারস্পরিক পরামর্শের ভিত্তিতে সম্পন্ন করে এবং আমি তাদেরকে যে রিয্ক দিয়েছি তা থেকে তারা ব্যয় করে।",
    "আর তাদের উপর অতিরিক্ত বাড়াবাড়ি করা হলে তারা তার প্রতিবিধান করে।",
    "আর মন্দের প্রতিফল অনুরূপ মন্দ। অতঃপর যে ক্ষমা করে দেয় এবং আপোস নিস্পত্তি করে, তার পুরস্কার আল্লাহর নিকট রয়েছে। নিশ্চয় আল্লাহ যালিমদের পছন্দ করেন না।",
    "তবে অত্যাচারিত হবার পর যারা প্রতিবিধান করে, তাদের বিরুদ্ধে কোন ব্যবস্থা গ্রহণ করা হবে না।",
    "কেবল তাদের বিরুদ্ধেই ব্যবস্থা গ্রহণ করা হবে, যারা মানুষের উপর যুলম করে এবং যমীনে অন্যায়ভাবে সীমালঙ্ঘন করে বেড়ায়। তাদের জন্য রয়েছে যন্ত্রণাদায়ক আযাব।",
    "আর যে ধৈর্যধারণ করে এবং ক্ষমা করে, তা নিশ্চয় দৃঢ়সংকল্পেরই কাজ।",
    "আর আল্লাহ যাকে পথভ্রষ্ট করেন, তারপর তার জন্য কোন অভিভাবক নেই। আর তুমি যালিমদেরকে দেখবে, যখন তারা আযাব প্রত্যক্ষ করবে তখন বলবে, ‘ফিরে যাওয়ার কোন পথ আছে কি’?",
    "তুমি তাদেরকে আরো দেখবে যে, তাদেরকে অপমানে অবনত অবস্থায় জাহান্নামে উপস্থিত করা হচ্ছে, তারা আড় চোখে তাকাচ্ছে। আর কিয়ামতের দিন মুমিনগণ বলবে, তারাই তো ক্ষতিগ্রস্ত যারা নিজদের ও পরিবার-পরিজনের ক্ষতি সাধন করেছে। সাবধান! যালিমরাই থাকবে স্থায়ী আযাবে।",
    "আর আল্লাহ ছাড়া তাদেরকে সাহায্য করার জন্য তাদের কোন অভিভাবক থাকবে না। আর আল্লাহ যাকে পথভ্রষ্ট করেন তার কোন পথ নেই।",
    "তোমরা তোমাদের রবের ডাকে সাড়া দাও, আল্লাহর পক্ষ থেকে সেদিন আসার পূর্বের্ই, যাকে ফিরিয়ে দেয়ার কোনো উপায় নেই। সেদিন তোমাদের জন্য কোন আশ্রয়স্থল থাকবে না এবং তোমাদের জন্য প্রতিরোধকারীও থাকবে না।",
    "আর যদি তারা বিমুখ হয়, তবে আমি তো তোমাকে তাদের রক্ষক হিসেবে পাঠাইনি। বাণী পৌঁছে দেয়াই তোমার দায়িত্ব। আর আমি যখন মানুষকে আমার রহমত আস্বাদন করাই তখন সে খুশি হয়। আর যখন তাদের কৃতকর্মের জন্য তাদের উপর কোন বিপদ আসে তখন মানুষ বড়ই অকৃতজ্ঞ হয়।",
    "আসমানসমূহ ও যমীনের রাজত্ব আল্লাহরই। তিনি যা চান সৃষ্টি করেন। তিনি যাকে ইচ্ছা কন্যা সন্তান দান করেন এবং যাকে ইচ্ছা পুত্র সন্তান দান করেন।",
    "অথবা তাদেরকে পুত্র ও কন্যা উভয়ই দান করেন এবং যাকে ইচ্ছা বন্ধ্যা করেন। তিনি তো সর্বজ্ঞ, সর্বশক্তিমান।",
    "কোন মানুষের এ মর্যাদা নেই যে, আল্লাহ তার সাথে সরাসরি কথা বলবেন, ওহীর মাধ্যম, পর্দার আড়াল অথবা কোন দূত পাঠানো ছাড়া। তারপর আল্লাহর অনুমতি সাপেক্ষে তিনি যা চান তাই ওহী প্রেরণ করেন। তিনি তো মহীয়ান, প্রজ্ঞাময়।",
    "অনুরূপভাবে (উপরোক্ত তিনটি পদ্ধতিতে) আমি তোমার কাছে আমার নির্দেশ থেকে ‘রূহ’কে ওহী যোগে প্রেরণ করেছি। তুমি জানতে না কিতাব কী এবং ঈমান কী? কিন্তু আমি একে আলো বানিয়েছি, যার মাধ্যমে আমি আমার বান্দাদের মধ্যে যাকে ইচ্ছা হিদায়াত দান করি। আর নিশ্চয় তুমি সরল পথের দিক নির্দেশনা দাও।",
    "সেই আল্লাহর পথ, যিনি আসমানসমূহ ও যমীনে যা কিছু আছে তার মালিক। সাবধান! সব বিষয়ই আল্লাহর কাছে ফিরে যাবে।"
  ]
}