{
  "surahName": "Al-Bayyina",
  "surahNameArabic": "البينة",
  "surahNameArabicLong": "سورة البينة",
  "surahNameTranslation": "The Evidence",
  "revelationPlace": "Madina",
  "totalAyah": 8,
  "surahNo": 98,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/98.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/098.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/98.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/098.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/98.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/098.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/98.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/098.mp3"
    }
  },
  "english": [
    "The disbelievers from the People of the Book and the polytheists were not going to desist ˹from disbelief˺ until the clear proof came to them:",
    "a messenger from Allah, reciting scrolls of ˹utmost˺ purity",
    "containing upright commandments.",
    "It was not until this clear proof came to the People of the Book that they became divided ˹about his prophethood˺—",
    "even though they were only commanded to worship Allah ˹alone˺ with sincere devotion to Him in all uprightness, establish prayer, and pay alms-tax. That is the upright Way.",
    "Indeed, those who disbelieve from the People of the Book and the polytheists will be in the Fire of Hell, to stay there forever. They are the worst of ˹all˺ beings.",
    "Indeed, those who believe and do good—they are the best of ˹all˺ beings.",
    "Their reward with their Lord will be Gardens of Eternity, under which rivers flow, to stay there for ever and ever. Allah is pleased with them and they are pleased with Him. This is ˹only˺ for those in awe of their Lord."
  ],
  "arabic1": [
    "لَمْ یَكُنِ الَّذِیْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ وَالْمُشْرِكِیْنَ مُنْفَكِّیْنَ حَتّٰی تَاْتِیَهُمُ الْبَیِّنَةُ",
    "رَسُوْلٌ مِّنَ اللّٰهِ یَتْلُوْا صُحُفًا مُّطَهَّرَةً",
    "فِیْهَا كُتُبٌ قَیِّمَةٌ",
    "وَمَا تَفَرَّقَ الَّذِیْنَ اُوْتُوا الْكِتٰبَ اِلَّا مِنْ بَعْدِ مَا جَآءَتْهُمُ الْبَیِّنَةُ",
    "وَمَاۤ اُمِرُوْۤا اِلَّا لِیَعْبُدُوا اللّٰهَ مُخْلِصِیْنَ لَهُ الدِّیْنَ حُنَفَآءَ وَیُقِیْمُوا الصَّلٰوةَ وَیُؤْتُوا الزَّكٰوةَ وَذٰلِكَ دِیْنُ الْقَیِّمَةِ",
    "اِنَّ الَّذِیْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ وَالْمُشْرِكِیْنَ فِیْ نَارِ جَهَنَّمَ خٰلِدِیْنَ فِیْهَا اُولٰٓىِٕكَ هُمْ شَرُّ الْبَرِیَّةِ",
    "اِنَّ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ اُولٰٓىِٕكَ هُمْ خَیْرُ الْبَرِیَّةِ",
    "جَزَآؤُهُمْ عِنْدَ رَبِّهِمْ جَنّٰتُ عَدْنٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِیْنَ فِیْهَاۤ اَبَدًا رَضِیَ اللّٰهُ عَنْهُمْ وَرَضُوْا عَنْهُ ذٰلِكَ لِمَنْ خَشِیَ رَبَّهٗ"
  ],
  "bengali": [
    "কিতাবীদের মধ্যে যারা কুফরী করে তারা ও মুশরিকরা, তাদের কাছে সুস্পষ্ট প্রমাণ না আসা পর্যন্ত (নিজদের অবিশ্বাসে) অটল থাকবে।",
    "আল্লাহর পক্ষ থেকে এক রাসূল পবিত্র কিতাবসমূহ তিলাওয়াত করে।",
    "তাতে রয়েছে সঠিক বিধিবদ্ধ বিধান।",
    "আর কিতাবীরা তাদের কাছে সুস্পষ্ট প্রমাণ আসার পরই কেবল মতভেদ করেছে।",
    "আর তাদেরকে কেবল এই নির্দেশ দেয়া হয়েছিল যে, তারা যেন আল্লাহর ‘ইবাদাত করে তাঁরই জন্য দীনকে একনিষ্ঠ করে, সালাত কায়েম করে এবং যাকাত দেয়; আর এটিই হল সঠিক দীন।",
    "নিশ্চয় কিতাবীদের মধ্যে যারা কুফরী করেছে ও মুশরিকরা, জাহান্নামের আগুনে থাকবে স্থায়ীভাবে। ওরাই হল নিকৃষ্ট সৃষ্টি।",
    "নিশ্চয় যারা ঈমান এনেছে ও সৎকাজ করেছে তারাই সৃষ্টির সর্বোৎকৃষ্ট।",
    "তাদের রবের কাছে তাদের পুরস্কার হবে স্থায়ী জান্নাত, যার পাদদেশে নহরসমূহ প্রবাহিত, সেখানে তারা থাকবে স্থায়ীভাবে। আল্লাহ তাদের উপর সন্তুষ্ট হয়েছেন তারাও আল্লাহর উপর সন্তুষ্ট হয়েছে। এটি তার জন্য, যে স্বীয় রবকে ভয় করে।"
  ]
}