{
  "surahName": "Adh-Dhaariyat",
  "surahNameArabic": "الذاريات",
  "surahNameArabicLong": "سورة الذاريات",
  "surahNameTranslation": "The Winnowing Winds",
  "revelationPlace": "Mecca",
  "totalAyah": 60,
  "surahNo": 51,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/51.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/051.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/51.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/051.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/51.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/051.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/51.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/051.mp3"
    }
  },
  "english": [
    "By the winds scattering ˹dust˺",
    "and ˹the clouds˺ loaded with rain",
    "and ˹the ships˺ gliding with ease",
    "and ˹the angels˺ administering affairs by ˹Allah’s˺ command!",
    "Indeed, what you are promised is true.",
    "And the Judgment will certainly come to pass.",
    "˹And˺ by the heavens in their marvellous design!",
    "Surely you are ˹lost˺ in conflicting views ˹regarding the truth˺.",
    "Only those ˹destined to be˺ deluded are turned away from it.",
    "Condemned are the liars—",
    "those who are ˹steeped˺ in ignorance, totally heedless.",
    "They ask ˹mockingly˺, “When is this Day of Judgment?”",
    "˹It is˺ the Day they will be tormented over the Fire.",
    "˹They will be told,˺ “Taste your torment! This is what you sought to hasten.”",
    "Indeed, the righteous will be amid Gardens and springs",
    "˹joyfully˺ receiving what their Lord will grant them. Before this ˹reward˺ they were truly good-doers ˹in the world˺:",
    "they used to sleep only little in the night",
    "and pray for forgiveness before dawn.",
    "And in their wealth there was a rightful share ˹fulfilled˺ for the beggar and the poor.",
    "There are ˹countless˺ signs on earth for those with sure faith",
    "as there are within yourselves. Can you not see?",
    "In heaven is your sustenance and whatever you are promised.",
    "Then by the Lord of heaven and earth! ˹All˺ this is certainly as true as ˹the fact that˺ you can speak!",
    "Has the story of Abraham’s honoured guests reached you ˹O Prophet˺?",
    "˹Remember˺ when they entered his presence and greeted ˹him with˺, “Peace!” He replied, “Peace ˹be upon you˺!” ˹Then he said to himself,˺ “˹These are˺ an unfamiliar people.”",
    "Then he slipped off to his family and brought a fat ˹roasted˺ calf",
    "and placed it before them, asking, “Will you not eat?”",
    "˹They did not eat,˺ so he grew fearful of them. They reassured ˹him˺, “Do not be afraid,” and gave him good news of a knowledgeable son.",
    "Then his wife came forward with a cry, clasping her forehead ˹in astonishment˺, exclaiming, “˹A baby from˺ a barren, old woman!”",
    "They replied, “Such has your Lord decreed. He is truly the All-Wise, All-Knowing.”",
    "˹Later,˺ Abraham asked, “What is your mission, O  messengers?”",
    "They replied, “We have actually been sent to a wicked people",
    "to send upon them stones of ˹baked˺ clay",
    "marked by your Lord for the transgressors.”",
    "Then ˹before the torment˺ We evacuated the believers from the city.",
    "But We only found one family that had submitted ˹to Allah˺.",
    "And We have left a sign there ˹as a lesson˺ for those who fear the painful punishment.",
    "And in ˹the story of˺ Moses ˹was another lesson,˺ when We sent him to Pharaoh with compelling proof",
    "but Pharaoh was carried away by his power, saying ˹of Moses˺, “A magician or a madman!”",
    "So We seized him and his soldiers, casting them into the sea while he was blameworthy.",
    "And in ˹the story of˺ ’Âd ˹was another lesson,˺ when We sent against them the devastating wind.",
    "There was nothing it came upon that it did not reduce to ashes.",
    "And in ˹the story of˺ Thamûd ˹was another lesson,˺ when they were told, “Enjoy yourselves ˹only˺ for a ˹short˺ while.”",
    "Still they persisted in defying the commands of their Lord, so they were overtaken by a ˹mighty˺ blast while they were looking on.",
    "Then they were not able to rise up, nor were they helped.",
    "And the people of Noah ˹had also been destroyed˺ earlier. They were truly a rebellious people.",
    "We built the universe with ˹great˺ might, and We are certainly expanding ˹it˺.",
    "As for the earth, We spread it out. How superbly did We smooth it out!",
    "And We created pairs of all things so perhaps you would be mindful.",
    "So ˹proclaim, O  Prophet˺: “Flee to Allah! I am truly sent by Him with a clear warning to you.",
    "And do not set up another god with Allah. I am truly sent by Him with a clear warning to you.”",
    "Similarly, no messenger came to those before them without being told: “A magician or a madman!”",
    "Have they passed this ˹cliché˺ down to one another? In fact, they have ˹all˺ been a transgressing people.",
    "So ˹now˺ turn away from them ˹O Prophet˺, for you will not be blamed.",
    "But ˹continue to˺ remind. For certainly reminders benefit the believers.",
    "I did not create jinn and humans except to worship Me.",
    "I seek no provision from them, nor do I need them to feed Me.",
    "Indeed, Allah ˹alone˺ is the Supreme Provider—Lord of all Power, Ever Mighty.",
    "The wrongdoers will certainly have a share ˹of the torment˺ like that of their predecessors. So do not let them ask Me to hasten ˹it˺.",
    "Woe then to the disbelievers when they face their Day which they are warned of!"
  ],
  "arabic1": [
    "وَالذّٰرِیٰتِ ذَرْوًا",
    "فَالْحٰمِلٰتِ وِقْرًا",
    "فَالْجٰرِیٰتِ یُسْرًا",
    "فَالْمُقَسِّمٰتِ اَمْرًا",
    "اِنَّمَا تُوْعَدُوْنَ لَصَادِقٌ",
    "وَّاِنَّ الدِّیْنَ لَوَاقِعٌ",
    "وَالسَّمَآءِ ذَاتِ الْحُبُكِ",
    "اِنَّكُمْ لَفِیْ قَوْلٍ مُّخْتَلِفٍ",
    "یُّؤْفَكُ عَنْهُ مَنْ اُفِكَ",
    "قُتِلَ الْخَرّٰصُوْنَ",
    "الَّذِیْنَ هُمْ فِیْ غَمْرَةٍ سَاهُوْنَ",
    "یَسْـَٔلُوْنَ اَیَّانَ یَوْمُ الدِّیْنِ",
    "یَوْمَ هُمْ عَلَی النَّارِ یُفْتَنُوْنَ",
    "ذُوْقُوْا فِتْنَتَكُمْ هٰذَا الَّذِیْ كُنْتُمْ بِهٖ تَسْتَعْجِلُوْنَ",
    "اِنَّ الْمُتَّقِیْنَ فِیْ جَنّٰتٍ وَّعُیُوْنٍ",
    "اٰخِذِیْنَ مَاۤ اٰتٰىهُمْ رَبُّهُمْ اِنَّهُمْ كَانُوْا قَبْلَ ذٰلِكَ مُحْسِنِیْنَ",
    "كَانُوْا قَلِیْلًا مِّنَ الَّیْلِ مَا یَهْجَعُوْنَ",
    "وَبِالْاَسْحَارِ هُمْ یَسْتَغْفِرُوْنَ",
    "وَفِیْۤ اَمْوَالِهِمْ حَقٌّ لِّلسَّآىِٕلِ وَالْمَحْرُوْمِ",
    "وَفِی الْاَرْضِ اٰیٰتٌ لِّلْمُوْقِنِیْنَ",
    "وَفِیْۤ اَنْفُسِكُمْ اَفَلَا تُبْصِرُوْنَ",
    "وَفِی السَّمَآءِ رِزْقُكُمْ وَمَا تُوْعَدُوْنَ",
    "فَوَرَبِّ السَّمَآءِ وَالْاَرْضِ اِنَّهٗ لَحَقٌّ مِّثْلَ مَاۤ اَنَّكُمْ تَنْطِقُوْنَ",
    "هَلْ اَتٰىكَ حَدِیْثُ ضَیْفِ اِبْرٰهِیْمَ الْمُكْرَمِیْنَ",
    "اِذْ دَخَلُوْا عَلَیْهِ فَقَالُوْا سَلٰمًا قَالَ سَلٰمٌ قَوْمٌ مُّنْكَرُوْنَ",
    "فَرَاغَ اِلٰۤی اَهْلِهٖ فَجَآءَ بِعِجْلٍ سَمِیْنٍ",
    "فَقَرَّبَهٗۤ اِلَیْهِمْ قَالَ اَلَا تَاْكُلُوْنَ",
    "فَاَوْجَسَ مِنْهُمْ خِیْفَةً قَالُوْا لَا تَخَفْ وَبَشَّرُوْهُ بِغُلٰمٍ عَلِیْمٍ",
    "فَاَقْبَلَتِ امْرَاَتُهٗ فِیْ صَرَّةٍ فَصَكَّتْ وَجْهَهَا وَقَالَتْ عَجُوْزٌ عَقِیْمٌ",
    "قَالُوْا كَذٰلِكِ قَالَ رَبُّكِ اِنَّهٗ هُوَ الْحَكِیْمُ الْعَلِیْمُ",
    "قَالَ فَمَا خَطْبُكُمْ اَیُّهَا الْمُرْسَلُوْنَ",
    "قَالُوْۤا اِنَّاۤ اُرْسِلْنَاۤ اِلٰی قَوْمٍ مُّجْرِمِیْنَ",
    "لِنُرْسِلَ عَلَیْهِمْ حِجَارَةً مِّنْ طِیْنٍ",
    "مُّسَوَّمَةً عِنْدَ رَبِّكَ لِلْمُسْرِفِیْنَ",
    "فَاَخْرَجْنَا مَنْ كَانَ فِیْهَا مِنَ الْمُؤْمِنِیْنَ",
    "فَمَا وَجَدْنَا فِیْهَا غَیْرَ بَیْتٍ مِّنَ الْمُسْلِمِیْنَ",
    "وَتَرَكْنَا فِیْهَاۤ اٰیَةً لِّلَّذِیْنَ یَخَافُوْنَ الْعَذَابَ الْاَلِیْمَ",
    "وَفِیْ مُوْسٰۤی اِذْ اَرْسَلْنٰهُ اِلٰی فِرْعَوْنَ بِسُلْطٰنٍ مُّبِیْنٍ",
    "فَتَوَلّٰی بِرُكْنِهٖ وَقَالَ سٰحِرٌ اَوْ مَجْنُوْنٌ",
    "فَاَخَذْنٰهُ وَجُنُوْدَهٗ فَنَبَذْنٰهُمْ فِی الْیَمِّ وَهُوَ مُلِیْمٌ",
    "وَفِیْ عَادٍ اِذْ اَرْسَلْنَا عَلَیْهِمُ الرِّیْحَ الْعَقِیْمَ",
    "مَا تَذَرُ مِنْ شَیْءٍ اَتَتْ عَلَیْهِ اِلَّا جَعَلَتْهُ كَالرَّمِیْمِ",
    "وَفِیْ ثَمُوْدَ اِذْ قِیْلَ لَهُمْ تَمَتَّعُوْا حَتّٰی حِیْنٍ",
    "فَعَتَوْا عَنْ اَمْرِ رَبِّهِمْ فَاَخَذَتْهُمُ الصّٰعِقَةُ وَهُمْ یَنْظُرُوْنَ",
    "فَمَا اسْتَطَاعُوْا مِنْ قِیَامٍ وَّمَا كَانُوْا مُنْتَصِرِیْنَ",
    "وَقَوْمَ نُوْحٍ مِّنْ قَبْلُ اِنَّهُمْ كَانُوْا قَوْمًا فٰسِقِیْنَ",
    "وَالسَّمَآءَ بَنَیْنٰهَا بِاَیْىدٍ وَّاِنَّا لَمُوْسِعُوْنَ",
    "وَالْاَرْضَ فَرَشْنٰهَا فَنِعْمَ الْمٰهِدُوْنَ",
    "وَمِنْ كُلِّ شَیْءٍ خَلَقْنَا زَوْجَیْنِ لَعَلَّكُمْ تَذَكَّرُوْنَ",
    "فَفِرُّوْۤا اِلَی اللّٰهِ اِنِّیْ لَكُمْ مِّنْهُ نَذِیْرٌ مُّبِیْنٌ",
    "وَلَا تَجْعَلُوْا مَعَ اللّٰهِ اِلٰهًا اٰخَرَ اِنِّیْ لَكُمْ مِّنْهُ نَذِیْرٌ مُّبِیْنٌ",
    "كَذٰلِكَ مَاۤ اَتَی الَّذِیْنَ مِنْ قَبْلِهِمْ مِّنْ رَّسُوْلٍ اِلَّا قَالُوْا سَاحِرٌ اَوْ مَجْنُوْنٌ ۫",
    "اَتَوَاصَوْا بِهٖ بَلْ هُمْ قَوْمٌ طَاغُوْنَ",
    "فَتَوَلَّ عَنْهُمْ فَمَاۤ اَنْتَ بِمَلُوْمٍ",
    "وَّذَكِّرْ فَاِنَّ الذِّكْرٰی تَنْفَعُ الْمُؤْمِنِیْنَ",
    "وَمَا خَلَقْتُ الْجِنَّ وَالْاِنْسَ اِلَّا لِیَعْبُدُوْنِ",
    "مَاۤ اُرِیْدُ مِنْهُمْ مِّنْ رِّزْقٍ وَّمَاۤ اُرِیْدُ اَنْ یُّطْعِمُوْنِ",
    "اِنَّ اللّٰهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِیْنُ",
    "فَاِنَّ لِلَّذِیْنَ ظَلَمُوْا ذَنُوْبًا مِّثْلَ ذَنُوْبِ اَصْحٰبِهِمْ فَلَا یَسْتَعْجِلُوْنِ",
    "فَوَیْلٌ لِّلَّذِیْنَ كَفَرُوْا مِنْ یَّوْمِهِمُ الَّذِیْ یُوْعَدُوْنَ"
  ],
  "bengali": [
    "কসম ধূলিঝড়ের,",
    "অতঃপর, পানির বোঝা বহনকারী মেঘমালার,",
    "অতঃপর মৃদুগতিতে চলমান নৌযানসমূহের,",
    "অতঃপর [আল্লাহর] নির্দেশ বণ্টনকারী ফেরেশতাগণের।",
    "তোমরা যে ওয়াদাপ্রাপ্ত হয়েছ তা অবশ্যই সত্য।",
    "নিশ্চয় প্রতিদান অবশ্যম্ভাবী।",
    "কসম সৌন্দর্যমন্ডিত আকাশের",
    "নিশ্চয় তোমরা মতবিরোধপূর্ণ কথায় লিপ্ত।",
    "যে পথভ্রষ্ট হয়েছে তাকেই তা থেকে ফিরিয়ে নেয়া হয়েছে।",
    "মিথ্যাচারীরা ধ্বংস হোক!",
    "যারা সন্দেহ-সংশয়ে নিপতিত, উদাসীন।",
    "তারা জিজ্ঞাসা করে, ‘প্রতিদান দিবস’ কবে’?",
    "‘যে দিন তারা অগ্নিতে সাজাপ্রাপ্ত হবে’।",
    "বলা হবে, ‘তোমাদের আযাব আস্বাদন কর, এটিতো ‘তোমরা ত্বরান্বিত করতে চেয়েছিলে।’",
    "নিশ্চয় মুত্তাকীরা থাকবে জান্নাতসমূহে ও ঝর্ণাধারায়,",
    "তাদের রব তাদের যা দিবেন তা তারা খুশীতে গ্রহণকারী হবে। ইতঃপূর্বে এরাই ছিল সৎকর্মশীল।",
    "রাতের সামান্য অংশই এরা ঘুমিয়ে কাটাতো।",
    "আর রাতের শেষ প্রহরে এরা ক্ষমা চাওয়ায় রত থাকত।",
    "আর তাদের ধনসম্পদে রয়েছে প্রার্থী ও বঞ্চিতের হক।",
    "সুনিশ্চিত বিশ্বাসীদের জন্য যমীনে অনেক নিদর্শন রয়েছে।",
    "তোমাদের নিজদের মধ্যেও। তোমরা কি চক্ষুষ্মান হবে না?",
    "আকাশে রয়েছে তোমাদের রিয্ক ও প্রতিশ্রুত সব কিছু।",
    "অতএব আসমান ও যমীনের রবের কসম, তোমরা যে কথা বলে থাক তার মতই এটি সত্য।",
    "তোমার কাছে কি ইবরাহীমের সম্মানিত মেহমানদের বৃত্তান্ত এসেছে?",
    "যখন তারা তার কাছে আসল এবং বলল, ‘সালাম’, উত্তরে সেও বলল, ‘সালাম’। এরা তো অপরিচিত লোক।",
    "অতঃপর সে দ্রুত চুপিসারে নিজ পরিবারবর্গের কাছে গেল এবং একটি মোটা-তাজা গো-বাছুর (ভাজা) নিয়ে আসল।",
    "অতঃপর সে তা তাদের সামনে পেশ করল এবং বলল, ‘তোমরা কি খাবে না?’",
    "এতে তাদের সম্পর্কে সে মনে মনে ভীত হল। তারা বলল, ‘ভয় পেয়োনা, তারা তাকে এক বিদ্বান পুত্র সন্তানের সুসংবাদ দিল’।",
    "তখন তার স্ত্রী চিৎকার করতে করতে এগিয়ে আসল এবং নিজ মুখ চাপড়িয়ে বলল, ‘বৃদ্ধা-বন্ধ্যা’।",
    "তারা বলল, ‘তোমার রব এরূপই বলেছেন। নিশ্চয়ই তিনি প্রজ্ঞাময়, সর্বজ্ঞ’।",
    "ইবরাহীম বলল, ‘হে প্রেরিত ফেরেশতাগণ, তোমাদের উদ্দেশ্য কী?",
    "তারা বলল, ‘আমরা এক অপরাধী কওমের প্রতি প্রেরিত হয়েছি’।",
    "‘যাতে তাদের উপর মাটির শক্ত ঢেলা নিক্ষেপ করি’।",
    "‘যা তোমার রবের পক্ষ থেকে চি‎‎‎হ্নিত সীমালংঘনকারীদের জন্য’।",
    "অতঃপর সেখানে যেসব মুমিন ছিল আমি তাদেরকে বের করে নিয়ে আসলাম।",
    "তবে আমি সেখানে একটি বাড়ী ছাড়া কোন মুসলমান পাইনি।",
    "আর আমি তাদের জন্য সেখানে একটি নিদর্শন রেখেছি যারা যন্ত্রণাদায়ক আযাবকে ভয় করে ।",
    "আর মূসার কাহিনীতেও নিদর্শন রয়েছে, যখন আমি তাকে সুস্পষ্ট প্রমাণসহ ফির‘আউনের কাছে পাঠিয়েছিলাম।",
    "কিন্তু সে তার দলবলসহ মুখ ফিরিয়ে নিল এবং বলল, ‘এ ব্যক্তি যাদুকর অথবা উম্মাদ।’",
    "ফলে আমি তাকে ও তার সৈন্য-সামন্তকে পাকড়াও করলাম। অতঃপর তাদেরকে সমুদ্রে নিক্ষেপ করলাম। সে তো ছিল তিরস্কৃত।",
    "আর ‘আদ জাতির ঘটনায়ও (নিদর্শন রয়েছে), যখন আমি তাদের উপর প্রেরণ করেছিলাম অমঙ্গলজনক বায়ু।",
    "ঐ বায়ু যার উপরে এসেছিল তাকে রেখে যায়নি, বরং সবকিছুকে চূর্ণ-বিচূর্ণ করে দিয়েছিল।",
    "আর সামূদ জাতির ঘটনায়ও (নিদর্শন রয়েছে)। যখন তাদেরকে বলা হয়েছিল, ‘একটি নির্দিষ্ট কাল পর্যন্ত ভোগ করে নাও’।",
    "অতঃপর তারা তাদের রবের আদেশ সম্পর্কে ঔদ্ধত্য প্রকাশ করল। ফলে বজ্রাঘাত তাদেরকে পাকড়াও করল, আর তারা তা দেখছিল।",
    "অতঃপর তারা উঠে দাঁড়াতে পারল না এবং প্রতিরোধও করতে পারল না।",
    "আর ইতঃপূর্বে নূহের কওমকেও (আমি ধ্বংস করে দিয়েছিলাম)। নিশ্চয় তারা ছিল ফাসিক কওম।",
    "আর আমি হাতসমূহ দ্বারা আকাশ নির্মাণ করেছি এবং নিশ্চয় আমি শক্তিশালী।",
    "আর আমি যমীনকে বিছিয়ে দিয়েছি। আমি কতইনা সুন্দর বিছানা প্রস্তুতকারী!",
    "আর প্রত্যেক বস্তু থেকে আমি জোড়ায় জোড়ায় সৃষ্টি করেছি। আশা করা যায়, তোমরা উপদেশ গ্রহণ করবে।",
    "অতএব তোমরা আল্লাহর দিকে ধাবিত হও। আমি তো তাঁর পক্ষ থেকে তোমাদের জন্য এক স্পষ্ট সতর্ককারী।",
    "আর তোমরা আল্লাহর সাথে কোন ইলাহ নির্ধারণ করো না; আমি তাঁর পক্ষ থেকে তোমাদের জন্য এক স্পষ্ট সতর্ককারী।",
    "এভাবে তাদের পূর্ববর্তীদের মধ্য থেকে যে রাসূলই এসেছে, তারা বলেছে, ‘এ তো একজন যাদুকর অথবা উন্মাদ।’",
    "তারা কি একে অন্যকে এ বিষয়ে ওসিয়াত করেছে? বরং তারা সীমালংঘনকারী কওম।",
    "অতএব, তুমি ওদের থেকে মুখ ফিরিয়ে নাও, এতে তুমি তিরস্কৃত হবে না।",
    "এবং উপদেশ দিতে থাক, কারণ উপদেশ মুমিনদের উপকারে আসে।",
    "আর জিন ও মানুষকে কেবল এজন্যই সৃষ্টি করেছি যে তারা আমার ইবাদাত করবে।",
    "আমি তাদের কাছে কোন রিয্ক চাই না; আর আমি চাই না যে, তারা আমাকে খাবার দিবে।",
    "নিশ্চয় আল্লাহই রিয্কদাতা, তিনি শক্তিধর, পরাক্রমশালী।",
    "যারা যুলম করেছে তাদের জন্য রয়েছে তাদের সমমনাদের অনুরূপ আযাব; সুতরাং তারা যেন আমার কাছে (আযাবের) তাড়াহুড়া না করে।",
    "অতএব, যারা কুফরী করে তাদের জন্য ধ্বংস সেদিনের যেদিনের ওয়াদা তাদেরকে দেয়া হয়েছে।"
  ]
}