{
  "surahName": "Yaseen",
  "surahNameArabic": "يس",
  "surahNameArabicLong": "سورة يس",
  "surahNameTranslation": "Yaseen",
  "revelationPlace": "Mecca",
  "totalAyah": 83,
  "surahNo": 36,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/36.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/036.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/36.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/036.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/36.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/036.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/36.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/036.mp3"
    }
  },
  "english": [
    "Yâ-Sĩn.",
    "By the Quran, rich in wisdom!",
    "You ˹O Prophet˺ are truly one of the messengers",
    "upon the Straight Path.",
    "˹This is˺ a revelation from the Almighty, Most Merciful",
    "so that you may warn a people whose forefathers were not warned, and so are heedless.",
    "The decree ˹of torment˺ has already been justified against most of them, for they will never believe.",
    "˹It is as if˺ We have put shackles around their necks up to their chins, so their heads are forced up",
    "and have placed a barrier before them and a barrier behind them and covered them ˹all˺ up, so they fail to see ˹the truth˺.",
    "It is the same whether you warn them or not—they will never believe.",
    "You can only warn those who follow the Reminder and are in awe of the Most Compassionate without seeing Him. So give them good news of forgiveness and an honourable reward.",
    "It is certainly We Who resurrect the dead, and write what they send forth and what they leave behind. Everything is listed by Us in a perfect Record.",
    "Give them an example ˹O Prophet˺ of the residents of a town, when the messengers came to them.",
    "We sent them two messengers, but they rejected both. So We reinforced ˹the two˺ with a third, and they declared, “We have indeed been sent to you ˹as messengers˺.”",
    "The people replied, “You are only humans like us, and the Most Compassionate has not revealed anything. You are simply lying!”",
    "The messengers responded, “Our Lord knows that we have truly been sent to you.",
    "And our duty is only to deliver ˹the message˺ clearly.”",
    "The people replied, “We definitely see you as a bad omen for us. If you do not desist, we will certainly stone you ˹to death˺ and you will be touched with a painful punishment from us.”",
    "The messengers said, “Your bad omen lies within yourselves. Are you saying this because you are reminded ˹of the truth˺? In fact, you are a transgressing people.”",
    "Then from the farthest end of the city a man came, rushing. He advised, “O my people! Follow the messengers.",
    "Follow those who ask no reward of you, and are ˹rightly˺ guided.",
    "And why should I not worship the One Who has originated me, and to Whom you will be returned.",
    "How could I take besides Him other gods whose intercession would not be of any benefit to me, nor could they save me if the Most Compassionate intended to harm me?",
    "Indeed, I would then be clearly astray.",
    "I do believe in your Lord, so listen to me.”",
    "˹But they killed him, then˺ he was told ˹by the angels˺, “Enter Paradise!” He said, “If only my people knew",
    "of how my Lord has forgiven me, and made me one of the honourable.”",
    "We did not send any soldiers from the heavens against his people after his death, nor did We need to.",
    "All it took was one ˹mighty˺ blast, and they were extinguished at once.",
    "Oh pity, such beings! No messenger ever came to them without being mocked.",
    "Have the deniers not considered how many peoples We destroyed before them who never came back to life again?",
    "Yet they will all be brought before Us.",
    "There is a sign for them in the dead earth: We give it life, producing grain from it for them to eat.",
    "And We have placed in it gardens of palm trees and grapevines, and caused springs to gush forth in it",
    "so that they may eat from its fruit, which they had no hand in making. Will they not then give thanks?",
    "Glory be to the One Who created all ˹things in˺ pairs—˹be it˺ what the earth produces, their genders, or what they do not know!",
    "There is also a sign for them in the night: We strip from it daylight, then—behold!—they are in darkness.",
    "The sun travels for its fixed term. That is the design of the Almighty, All-Knowing.",
    "As for the moon, We have ordained ˹precise˺ phases for it, until it ends up like an old, curved palm stalk.",
    "It is not for the sun to catch up with the moon, nor does the night outrun the day. Each is travelling in an orbit of their own.",
    "Another sign for them is that We carried their ancestors ˹with Noah˺ in the fully loaded Ark",
    "and created for them similar things to ride in.",
    "If We willed, We could drown them: then no one would respond to their cries, nor would they be rescued—",
    "except by mercy from Us, allowing them enjoyment for a ˹little˺ while.",
    "˹Still they turn away˺ when it is said to them, “Beware of what is ahead of you ˹in the Hereafter˺ and what is behind you ˹of destroyed nations˺ so you may be shown mercy.”",
    "Whenever a sign comes to them from their Lord, they turn away from it.",
    "And when it is said to them, “Donate from what Allah has provided for you,” the disbelievers say to the believers, “Why should we feed those whom Allah could have fed if He wanted to? You are clearly astray!”",
    "And they ask ˹the believers˺, “When will this threat come to pass, if what you say is true?”",
    "They must be awaiting a single Blast, which will seize them while they are ˹entrenched˺ in ˹worldly˺ disputes.",
    "Then they will not be able to make a ˹last˺ will, nor can they return to their own people.",
    "The Trumpet will be blown ˹a second time˺, then—behold!—they will rush from the graves to their Lord.",
    "They will cry, “Woe to us! Who has raised us up from our place of rest? This must be what the Most Compassionate warned us of; the messengers told the truth!”",
    "It will only take one Blast, then at once they will all be brought before Us.",
    "On that Day no soul will be wronged in the least, nor will you be rewarded except for what you used to do.",
    "Indeed, on that Day the residents of Paradise will be busy enjoying themselves.",
    "They and their spouses will be in ˹cool˺ shade, reclining on ˹canopied˺ couches.",
    "There they will have fruits and whatever they desire.",
    "And “Peace!” will be ˹their˺ greeting from the Merciful Lord.",
    "˹Then the disbelievers will be told,˺ “Step away ˹from the believers˺ this Day, O  wicked ones!",
    "Did I not command you, O  Children of Adam, not to follow Satan, for he is truly your sworn enemy",
    "but to worship Me ˹alone˺? This is the Straight Path.",
    "Yet he already misled great multitudes of you. Did you not have any sense?",
    "This is the Hell you were warned of.",
    "Burn in it Today for your disbelief.”",
    "On this Day We will seal their mouths, their hands will speak to Us, and their feet will testify to what they used to commit.",
    "Had We willed, We could have easily blinded their eyes, so they would struggle to find their way. How then could they see?",
    "And had We willed, We could have transfigured them on the spot, so they could neither progress forward nor turn back.",
    "And whoever We grant a long life, We reverse them in development. Will they not then understand?",
    "We have not taught him poetry, nor is it fitting for him. This ˹Book˺ is only a Reminder and a clear Quran",
    "to warn whoever is ˹truly˺ alive and fulfil the decree ˹of torment˺ against the disbelievers.",
    "Do they not see that We singlehandedly created for them, among other things, cattle which are under their control?",
    "And We have subjected these ˹animals˺ to them, so they may ride some and eat others.",
    "And they derive from them other benefits and drinks. Will they not then give thanks?",
    "Still they have taken other gods besides Allah, hoping to be helped ˹by them˺.",
    "They cannot help the pagans, even though they serve the idols as dedicated guards.",
    "So do not let their words grieve you ˹O Prophet˺. Indeed, We ˹fully˺ know what they conceal and what they reveal.",
    "Do people not see that We have created them from a sperm-drop, then—behold!—they openly challenge ˹Us˺?",
    "And they argue with Us—forgetting they were created—saying, “Who will give life to decayed bones?”",
    "Say, ˹O Prophet,˺ “They will be revived by the One Who produced them the first time, for He has ˹perfect˺ knowledge of every created being.",
    "˹He is the One˺ Who gives you fire from green trees, and—behold!—you kindle ˹fire˺ from them.",
    "Can the One Who created the heavens and the earth not ˹easily˺ resurrect these ˹deniers˺?” Yes ˹He can˺! For He is the Master Creator, All-Knowing.",
    "All it takes, when He wills something ˹to be˺, is simply to say to it: “Be!” And it is!",
    "So glory be to the One in Whose Hands is the authority over all things, and to Whom ˹alone˺ you will ˹all˺ be returned."
  ],
  "arabic1": [
    "یٰسٓ",
    "وَالْقُرْاٰنِ الْحَكِیْمِ",
    "اِنَّكَ لَمِنَ الْمُرْسَلِیْنَ",
    "عَلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "تَنْزِیْلَ الْعَزِیْزِ الرَّحِیْمِ",
    "لِتُنْذِرَ قَوْمًا مَّاۤ اُنْذِرَ اٰبَآؤُهُمْ فَهُمْ غٰفِلُوْنَ",
    "لَقَدْ حَقَّ الْقَوْلُ عَلٰۤی اَكْثَرِهِمْ فَهُمْ لَا یُؤْمِنُوْنَ",
    "اِنَّا جَعَلْنَا فِیْۤ اَعْنَاقِهِمْ اَغْلٰلًا فَهِیَ اِلَی الْاَذْقَانِ فَهُمْ مُّقْمَحُوْنَ",
    "وَجَعَلْنَا مِنْ بَیْنِ اَیْدِیْهِمْ سَدًّا وَّمِنْ خَلْفِهِمْ سَدًّا فَاَغْشَیْنٰهُمْ فَهُمْ لَا یُبْصِرُوْنَ",
    "وَسَوَآءٌ عَلَیْهِمْ ءَاَنْذَرْتَهُمْ اَمْ لَمْ تُنْذِرْهُمْ لَا یُؤْمِنُوْنَ",
    "اِنَّمَا تُنْذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَخَشِیَ الرَّحْمٰنَ بِالْغَیْبِ فَبَشِّرْهُ بِمَغْفِرَةٍ وَّاَجْرٍ كَرِیْمٍ",
    "اِنَّا نَحْنُ نُحْیِ الْمَوْتٰی وَنَكْتُبُ مَا قَدَّمُوْا وَاٰثَارَهُمْ وَكُلَّ شَیْءٍ اَحْصَیْنٰهُ فِیْۤ اِمَامٍ مُّبِیْنٍ",
    "وَاضْرِبْ لَهُمْ مَّثَلًا اَصْحٰبَ الْقَرْیَةِ اِذْ جَآءَهَا الْمُرْسَلُوْنَ",
    "اِذْ اَرْسَلْنَاۤ اِلَیْهِمُ اثْنَیْنِ فَكَذَّبُوْهُمَا فَعَزَّزْنَا بِثَالِثٍ فَقَالُوْۤا اِنَّاۤ اِلَیْكُمْ مُّرْسَلُوْنَ",
    "قَالُوْا مَاۤ اَنْتُمْ اِلَّا بَشَرٌ مِّثْلُنَا وَمَاۤ اَنْزَلَ الرَّحْمٰنُ مِنْ شَیْءٍ اِنْ اَنْتُمْ اِلَّا تَكْذِبُوْنَ",
    "قَالُوْا رَبُّنَا یَعْلَمُ اِنَّاۤ اِلَیْكُمْ لَمُرْسَلُوْنَ",
    "وَمَا عَلَیْنَاۤ اِلَّا الْبَلٰغُ الْمُبِیْنُ",
    "قَالُوْۤا اِنَّا تَطَیَّرْنَا بِكُمْ لَىِٕنْ لَّمْ تَنْتَهُوْا لَنَرْجُمَنَّكُمْ وَلَیَمَسَّنَّكُمْ مِّنَّا عَذَابٌ اَلِیْمٌ",
    "قَالُوْا طَآىِٕرُكُمْ مَّعَكُمْ اَىِٕنْ ذُكِّرْتُمْ بَلْ اَنْتُمْ قَوْمٌ مُّسْرِفُوْنَ",
    "وَجَآءَ مِنْ اَقْصَا الْمَدِیْنَةِ رَجُلٌ یَّسْعٰی قَالَ یٰقَوْمِ اتَّبِعُوا الْمُرْسَلِیْنَ",
    "اتَّبِعُوْا مَنْ لَّا یَسْـَٔلُكُمْ اَجْرًا وَّهُمْ مُّهْتَدُوْنَ",
    "وَمَا لِیَ لَاۤ اَعْبُدُ الَّذِیْ فَطَرَنِیْ وَاِلَیْهِ تُرْجَعُوْنَ",
    "ءَاَتَّخِذُ مِنْ دُوْنِهٖۤ اٰلِهَةً اِنْ یُّرِدْنِ الرَّحْمٰنُ بِضُرٍّ لَّا تُغْنِ عَنِّیْ شَفَاعَتُهُمْ شَیْـًٔا وَّلَا یُنْقِذُوْنِ",
    "اِنِّیْۤ اِذًا لَّفِیْ ضَلٰلٍ مُّبِیْنٍ",
    "اِنِّیْۤ اٰمَنْتُ بِرَبِّكُمْ فَاسْمَعُوْنِ",
    "قِیْلَ ادْخُلِ الْجَنَّةَ قَالَ یٰلَیْتَ قَوْمِیْ یَعْلَمُوْنَ",
    "بِمَا غَفَرَ لِیْ رَبِّیْ وَجَعَلَنِیْ مِنَ الْمُكْرَمِیْنَ",
    "وَمَاۤ اَنْزَلْنَا عَلٰی قَوْمِهٖ مِنْ بَعْدِهٖ مِنْ جُنْدٍ مِّنَ السَّمَآءِ وَمَا كُنَّا مُنْزِلِیْنَ",
    "اِنْ كَانَتْ اِلَّا صَیْحَةً وَّاحِدَةً فَاِذَا هُمْ خٰمِدُوْنَ",
    "یٰحَسْرَةً عَلَی الْعِبَادِ ۣ مَا یَاْتِیْهِمْ مِّنْ رَّسُوْلٍ اِلَّا كَانُوْا بِهٖ یَسْتَهْزِءُوْنَ",
    "اَلَمْ یَرَوْا كَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنَ الْقُرُوْنِ اَنَّهُمْ اِلَیْهِمْ لَا یَرْجِعُوْنَ",
    "وَاِنْ كُلٌّ لَّمَّا جَمِیْعٌ لَّدَیْنَا مُحْضَرُوْنَ",
    "وَاٰیَةٌ لَّهُمُ الْاَرْضُ الْمَیْتَةُ اَحْیَیْنٰهَا وَاَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ یَاْكُلُوْنَ",
    "وَجَعَلْنَا فِیْهَا جَنّٰتٍ مِّنْ نَّخِیْلٍ وَّاَعْنَابٍ وَّفَجَّرْنَا فِیْهَا مِنَ الْعُیُوْنِ",
    "لِیَاْكُلُوْا مِنْ ثَمَرِهٖ وَمَا عَمِلَتْهُ اَیْدِیْهِمْ اَفَلَا یَشْكُرُوْنَ",
    "سُبْحٰنَ الَّذِیْ خَلَقَ الْاَزْوَاجَ كُلَّهَا مِمَّا تُنْۢبِتُ الْاَرْضُ وَمِنْ اَنْفُسِهِمْ وَمِمَّا لَا یَعْلَمُوْنَ",
    "وَاٰیَةٌ لَّهُمُ الَّیْلُ نَسْلَخُ مِنْهُ النَّهَارَ فَاِذَا هُمْ مُّظْلِمُوْنَ",
    "وَالشَّمْسُ تَجْرِیْ لِمُسْتَقَرٍّ لَّهَا ذٰلِكَ تَقْدِیْرُ الْعَزِیْزِ الْعَلِیْمِ",
    "وَالْقَمَرَ قَدَّرْنٰهُ مَنَازِلَ حَتّٰی عَادَ كَالْعُرْجُوْنِ الْقَدِیْمِ",
    "لَا الشَّمْسُ یَنْۢبَغِیْ لَهَاۤ اَنْ تُدْرِكَ الْقَمَرَ وَلَا الَّیْلُ سَابِقُ النَّهَارِ وَكُلٌّ فِیْ فَلَكٍ یَّسْبَحُوْنَ",
    "وَاٰیَةٌ لَّهُمْ اَنَّا حَمَلْنَا ذُرِّیَّتَهُمْ فِی الْفُلْكِ الْمَشْحُوْنِ",
    "وَخَلَقْنَا لَهُمْ مِّنْ مِّثْلِهٖ مَا یَرْكَبُوْنَ",
    "وَاِنْ نَّشَاْ نُغْرِقْهُمْ فَلَا صَرِیْخَ لَهُمْ وَلَا هُمْ یُنْقَذُوْنَ",
    "اِلَّا رَحْمَةً مِّنَّا وَمَتَاعًا اِلٰی حِیْنٍ",
    "وَاِذَا قِیْلَ لَهُمُ اتَّقُوْا مَا بَیْنَ اَیْدِیْكُمْ وَمَا خَلْفَكُمْ لَعَلَّكُمْ تُرْحَمُوْنَ",
    "وَمَا تَاْتِیْهِمْ مِّنْ اٰیَةٍ مِّنْ اٰیٰتِ رَبِّهِمْ اِلَّا كَانُوْا عَنْهَا مُعْرِضِیْنَ",
    "وَاِذَا قِیْلَ لَهُمْ اَنْفِقُوْا مِمَّا رَزَقَكُمُ اللّٰهُ قَالَ الَّذِیْنَ كَفَرُوْا لِلَّذِیْنَ اٰمَنُوْۤا اَنُطْعِمُ مَنْ لَّوْ یَشَآءُ اللّٰهُ اَطْعَمَهٗۤ ۖ اِنْ اَنْتُمْ اِلَّا فِیْ ضَلٰلٍ مُّبِیْنٍ",
    "وَیَقُوْلُوْنَ مَتٰی هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "مَا یَنْظُرُوْنَ اِلَّا صَیْحَةً وَّاحِدَةً تَاْخُذُهُمْ وَهُمْ یَخِصِّمُوْنَ",
    "فَلَا یَسْتَطِیْعُوْنَ تَوْصِیَةً وَّلَاۤ اِلٰۤی اَهْلِهِمْ یَرْجِعُوْنَ",
    "وَنُفِخَ فِی الصُّوْرِ فَاِذَا هُمْ مِّنَ الْاَجْدَاثِ اِلٰی رَبِّهِمْ یَنْسِلُوْنَ",
    "قَالُوْا یٰوَیْلَنَا مَنْ بَعَثَنَا مِنْ مَّرْقَدِنَا ۣٚ هٰذَا مَا وَعَدَ الرَّحْمٰنُ وَصَدَقَ الْمُرْسَلُوْنَ",
    "اِنْ كَانَتْ اِلَّا صَیْحَةً وَّاحِدَةً فَاِذَا هُمْ جَمِیْعٌ لَّدَیْنَا مُحْضَرُوْنَ",
    "فَالْیَوْمَ لَا تُظْلَمُ نَفْسٌ شَیْـًٔا وَّلَا تُجْزَوْنَ اِلَّا مَا كُنْتُمْ تَعْمَلُوْنَ",
    "اِنَّ اَصْحٰبَ الْجَنَّةِ الْیَوْمَ فِیْ شُغُلٍ فٰكِهُوْنَ",
    "هُمْ وَاَزْوَاجُهُمْ فِیْ ظِلٰلٍ عَلَی الْاَرَآىِٕكِ مُتَّكِـُٔوْنَ",
    "لَهُمْ فِیْهَا فَاكِهَةٌ وَّلَهُمْ مَّا یَدَّعُوْنَ",
    "سَلٰمٌ ۫ قَوْلًا مِّنْ رَّبٍّ رَّحِیْمٍ",
    "وَامْتَازُوا الْیَوْمَ اَیُّهَا الْمُجْرِمُوْنَ",
    "اَلَمْ اَعْهَدْ اِلَیْكُمْ یٰبَنِیْۤ اٰدَمَ اَنْ لَّا تَعْبُدُوا الشَّیْطٰنَ اِنَّهٗ لَكُمْ عَدُوٌّ مُّبِیْنٌ",
    "وَّاَنِ اعْبُدُوْنِیْ هٰذَا صِرَاطٌ مُّسْتَقِیْمٌ",
    "وَلَقَدْ اَضَلَّ مِنْكُمْ جِبِلًّا كَثِیْرًا اَفَلَمْ تَكُوْنُوْا تَعْقِلُوْنَ",
    "هٰذِهٖ جَهَنَّمُ الَّتِیْ كُنْتُمْ تُوْعَدُوْنَ",
    "اِصْلَوْهَا الْیَوْمَ بِمَا كُنْتُمْ تَكْفُرُوْنَ",
    "اَلْیَوْمَ نَخْتِمُ عَلٰۤی اَفْوَاهِهِمْ وَتُكَلِّمُنَاۤ اَیْدِیْهِمْ وَتَشْهَدُ اَرْجُلُهُمْ بِمَا كَانُوْا یَكْسِبُوْنَ",
    "وَلَوْ نَشَآءُ لَطَمَسْنَا عَلٰۤی اَعْیُنِهِمْ فَاسْتَبَقُوا الصِّرَاطَ فَاَنّٰی یُبْصِرُوْنَ",
    "وَلَوْ نَشَآءُ لَمَسَخْنٰهُمْ عَلٰی مَكَانَتِهِمْ فَمَا اسْتَطَاعُوْا مُضِیًّا وَّلَا یَرْجِعُوْنَ",
    "وَمَنْ نُّعَمِّرْهُ نُنَكِّسْهُ فِی الْخَلْقِ اَفَلَا یَعْقِلُوْنَ",
    "وَمَا عَلَّمْنٰهُ الشِّعْرَ وَمَا یَنْۢبَغِیْ لَهٗ اِنْ هُوَ اِلَّا ذِكْرٌ وَّقُرْاٰنٌ مُّبِیْنٌ",
    "لِّیُنْذِرَ مَنْ كَانَ حَیًّا وَّیَحِقَّ الْقَوْلُ عَلَی الْكٰفِرِیْنَ",
    "اَوَلَمْ یَرَوْا اَنَّا خَلَقْنَا لَهُمْ مِّمَّا عَمِلَتْ اَیْدِیْنَاۤ اَنْعَامًا فَهُمْ لَهَا مٰلِكُوْنَ",
    "وَذَلَّلْنٰهَا لَهُمْ فَمِنْهَا رَكُوْبُهُمْ وَمِنْهَا یَاْكُلُوْنَ",
    "وَلَهُمْ فِیْهَا مَنَافِعُ وَمَشَارِبُ اَفَلَا یَشْكُرُوْنَ",
    "وَاتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ اٰلِهَةً لَّعَلَّهُمْ یُنْصَرُوْنَ",
    "لَا یَسْتَطِیْعُوْنَ نَصْرَهُمْ وَهُمْ لَهُمْ جُنْدٌ مُّحْضَرُوْنَ",
    "فَلَا یَحْزُنْكَ قَوْلُهُمْ اِنَّا نَعْلَمُ مَا یُسِرُّوْنَ وَمَا یُعْلِنُوْنَ",
    "اَوَلَمْ یَرَ الْاِنْسَانُ اَنَّا خَلَقْنٰهُ مِنْ نُّطْفَةٍ فَاِذَا هُوَ خَصِیْمٌ مُّبِیْنٌ",
    "وَضَرَبَ لَنَا مَثَلًا وَّنَسِیَ خَلْقَهٗ قَالَ مَنْ یُّحْیِ الْعِظَامَ وَهِیَ رَمِیْمٌ",
    "قُلْ یُحْیِیْهَا الَّذِیْۤ اَنْشَاَهَاۤ اَوَّلَ مَرَّةٍ وَهُوَ بِكُلِّ خَلْقٍ عَلِیْمُ",
    "١لَّذِیْ جَعَلَ لَكُمْ مِّنَ الشَّجَرِ الْاَخْضَرِ نَارًا فَاِذَاۤ اَنْتُمْ مِّنْهُ تُوْقِدُوْنَ",
    "اَوَلَیْسَ الَّذِیْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِقٰدِرٍ عَلٰۤی اَنْ یَّخْلُقَ مِثْلَهُمْ بَلٰی وَهُوَ الْخَلّٰقُ الْعَلِیْمُ",
    "اِنَّمَاۤ اَمْرُهٗۤ اِذَاۤ اَرَادَ شَیْـًٔا اَنْ یَّقُوْلَ لَهٗ كُنْ فَیَكُوْنُ",
    "فَسُبْحٰنَ الَّذِیْ بِیَدِهٖ مَلَكُوْتُ كُلِّ شَیْءٍ وَّاِلَیْهِ تُرْجَعُوْنَ"
  ],
  "bengali": [
    "ইয়া-সীন।",
    "বিজ্ঞানময় কুরআনের শপথ।",
    "নিশ্চয় তুমি রাসূলদের অন্তর্ভুক্ত।",
    "সরল পথের উপর প্রতিষ্ঠিত।",
    "(এ কুরআন) মহাপরাক্রমশালী, পরম দয়াময় (আল্লাহ) কর্তৃক নাযিলকৃত।",
    "যাতে তুমি এমন এক কওমকে সতর্ক কর, যাদের পিতৃপুরুষদেরকে সতর্ক করা হয়নি, কাজেই তারা উদাসীন।",
    "অবশ্যই তাদের অধিকাংশের উপর (আল্লাহর) বাণী অবধারিত হয়েছে, ফলে তারা ঈমান আনবে না।",
    "নিশ্চয় আমি তাদের গলায় বেড়ি পরিয়ে দিয়েছি এবং তা চিবুক পর্যন্ত। ফলে তারা ঊর্ধ্বমুখী হয়ে আছে।",
    "আর আমি তাদের সামনে একটি প্রাচীর ও তাদের পিছনে একটি প্রাচীর স্থাপন করেছি, অতঃপর আমি তাদেরকে ঢেকে দিয়েছি, ফলে তারা দেখতে পায় না।",
    "আর তুমি তাদেরকে সতর্ক কর অথবা না কর তাদের কাছে দু’টোই সমান, তারা ঈমান আনবে না।",
    "তুমি তো কেবল তাকেই সতর্ক করবে যে উপদেশ মেনে চলে এবং না দেখেও পরম করুণাময় আল্লাহকে ভয় করে। অতএব তাকে তুমি ক্ষমা ও সম্মানজনক পুরস্কারের সুসংবাদ দাও।",
    "আমিই তো মৃতকে জীবিত করি আর লিখে রাখি যা তারা অগ্রে প্রেরণ করে এবং যা পিছনে রেখে যায়। আর প্রতিটি বস্তুকেই আমি সুস্পষ্ট কিতাবে সংরক্ষণ করে রেখেছি।",
    "আর এক জনপদের অধিবাসীদের উপমা তাদের কাছে বর্ণনা কর, যখন তাদের কাছে রাসূলগণ এসেছিল।",
    "যখন আমি তাদের কাছে দু’জন রাসূল পাঠিয়েছিলাম, তখন তারা তাদেরকে মিথ্যাবাদী বলেছিল। তারপর আমি তাদেরকে তৃতীয় একজনের মাধ্যমে শক্তিশালী করেছিলাম। অতঃপর তারা বলেছিল, ‘নিশ্চয় আমরা তোমাদের প্রতি প্রেরিত রাসূল’।",
    "তারা বলল, ‘তোমরা তো আমাদের মতই মানুষ। আর পরম করুণাময় তো কিছুই নাযিল করেননি। তোমরা শুধু মিথ্যাই বলছ।",
    "তারা বলল, ‘আমাদের রব জানেন, অবশ্যই আমরা তোমাদের কাছে প্রেরিত রাসূল’।",
    "‘আর সুস্পষ্টভাবে পৌঁছিয়ে দেয়াই আমাদের দায়িত্ব’।",
    "তারা বলল, ‘আমরা তো তোমাদেরকে অমঙ্গলের কারণ মনে করি। তোমরা যদি বিরত না হও তাহলে আমরা অবশ্যই তোমাদেরকে পাথর মেরে হত্যা করব এবং আমাদের পক্ষ থেকে তোমাদেরকে যন্ত্রণাদায়ক আযাব স্পর্শ করবে’।",
    "তারা বলল, তোমাদের অমঙ্গলের কারণ তোমাদের সাথেই। তোমাদেরকে উপদেশ দেয়া হয়েছে বলেই কি এরূপ বলছ? বরং তোমরা সীমালঙ্ঘনকারী কওম’।",
    "আর শহরের দূরপ্রান্ত থেকে এক ব্যক্তি দৌড়ে এসে বলল, ‘হে আমার কওম! তোমরা রাসূলদের অনুসরণ কর।",
    "‘তোমরা তাদের অনুসরণ কর যারা তোমাদের কাছে কোন প্রতিদান চায় না আর তারা সৎপথপ্রাপ্ত’।",
    "‘আর আমি কেন তাঁর ইবাদাত করব না যিনি আমাকে সৃষ্টি করেছেন? আর তাঁর কাছেই তোমাদেরকে ফিরিয়ে নেয়া হবে’।",
    "আমি কি তাঁর পরিবর্তে অন্য ইলাহ গ্রহণ করব? যদি পরম করুণাময় আমার কোন ক্ষতি করার ইচ্ছা করেন, তাহলে তাদের সুপারিশ আমার কোন কাজে আসবে না এবং তারা আমাকে উদ্ধারও করতে পারবে না’।",
    "‘এরূপ করলে নিশ্চয় আমি স্পষ্ট বিভ্রান্তিতে পতিত হব’।",
    "‘নিশ্চয় আমি তোমাদের রবের প্রতি ঈমান এনেছি, অতএব তোমরা আমার কথা শোন’।",
    "তাকে বলা হল, ‘জান্নাতে প্রবেশ কর’। সে বলল, ‘হায়! আমার কওম যদি জানতে পারত’,",
    "‘আমার রব আমাকে কিসের বিনিময়ে ক্ষমা করে দিয়েছেন এবং আমাকে সম্মানিতদের অন্তর্ভুক্ত করেছেন’।",
    "আর আমি তার (মৃত্যুর) পর তার কওমের বিরুদ্ধে আসমান থেকে কোন সৈন্য পাঠাইনি। আর তা পাঠানোর কোন দরকারও আমার ছিল না।",
    "তা ছিল শুধুই একটি বিকট আওয়াজ, ফলে তারা নিথর-নিস্তব্ধ হয়ে পড়ল।",
    "আফসোস, বান্দাদের জন্য! যখনই তাদের কাছে কোন রাসূল এসেছে তখনই তারা তাকে নিয়ে ঠাট্টা-বিদ্রূপ করেছে।",
    "তারা কি লক্ষ্য করেনি যে, আমি তাদের পূর্বে কত প্রজন্মকে ধ্বংস করেছি, নিশ্চয় তারা তাদের কাছে ফিরে আসবে না।",
    "আর তাদের সকলকে একত্রে আমার কাছে হাযির করা হবে।",
    "আর মৃত যমীন তাদের জন্য একটি নিদর্শন, আমি তাকে জীবিত করেছি এবং তা থেকে শস্যদানা উৎপন্ন করেছি। অতঃপর তা থেকেই তারা খায়।",
    "আর আমি তাতে খেজুর ও আঙ্গুরের বাগান তৈরী করেছি এবং তাতে কিছু ঝর্নাধারা প্রবাহিত করি।",
    "যাতে তারা তার ফল খেতে পারে, অথচ তাদের হাত তা বানায়নি। তবুও কি তারা কৃতজ্ঞতা প্রকাশ করবে না?",
    "পবিত্র ও মহান সে সত্তা যিনি সকল জোড়া জোড়া সৃষ্টি করেছেন, যমীন যা উৎপন্ন করেছে তা থেকে, মানুষের নিজদের মধ্য থেকে এবং সে সব কিছু থেকেও যা তারা জানে না ।",
    "আর রাত তাদের জন্য একটি নিদর্শন; আমি তা থেকে দিনকে সরিয়ে নেই, ফলে তখনই তারা অন্ধকারাচ্ছন্ন হয়ে যায়।",
    "আর সূর্য ভ্রমণ করে তার নির্দিষ্ট পথে, এটা মহাপরাক্রমশালী সর্বজ্ঞ (আল্লাহ)-র নির্ধারণ।",
    "আর চাঁদের জন্য আমি নির্ধারণ করেছি মানযিলসমূহ, অবশেষে সেটি খেজুরের শুষ্ক পুরাতন শাখার মত হয়ে যায়।",
    "সূর্যের জন্য সম্ভব নয় চাঁদের নাগাল পাওয়া, আর রাতের জন্য সম্ভব নয় দিনকে অতিক্রম করা, আর প্রত্যেকেই কক্ষ পথে ভেসে বেড়ায়।",
    "আর তাদের জন্য একটি নিদর্শন হল, অবশ্যই আমি তাদের বংশধরদেরকে ভরা নৌকায় আরোহণ করিয়েছিলাম।",
    "আর তাদের জন্য তার অনুরূপ (যানবাহন) সৃষ্টি করেছি, যাতে তারা আরোহণ করে।",
    "আর যদি আমি চাই তাদেরকে নিমজ্জিত করে দেই, তখন তাদের জন্য কোন সাহায্যকারী থাকে না এবং তাদেরকে উদ্ধারও করা হয় না।",
    "যদি না আমার পক্ষ থেকে রহমত হয় এবং কিছু সময়ের জন্য উপভোগের সুযোগ দেয়া হয়।",
    "আর যখন তাদেরকে বলা হয়, যা তোমাদের সামনে আছে এবং যা তোমাদের পিছনে আছে সে বিষয়ে সতর্ক হও, যাতে তোমাদের প্রতি অনুগ্রহ করা যায়।",
    "আর তাদের রবের নিদর্শনসমূহ থেকে তাদের কাছে কোন নিদর্শন আসলেই তারা তা থেকে মুখ ফিরিয়ে নেয়।",
    "আর যখন তাদেরকে বলা হয়, ‘আল্লাহ তোমাদেরকে যে রিয্ক দিয়েছেন তা থেকে তোমরা ব্যয় কর’, তখন কাফিররা মুমিনদেরকে বলে, ‘আমরা কি তাকে খাদ্য দান করব, আল্লাহ চাইলে যাকে খাদ্য দান করতেন? তোমরা তো স্পষ্ট পথভ্রষ্টতায় রয়েছ’।",
    "আর তারা বলে, ‘এ ওয়াদা কখন বাস্তবায়িত হবে’? (তা বল) ‘যদি তোমরা সত্যবাদী হও’।",
    "তারা তো কেবল এক বিকট আওয়াজের অপেক্ষা করছে যা তাদেরকে বাক-বিতন্ডায় লিপ্ত অবস্থায় পাকড়াও করবে।",
    "সুতরাং না পারবে তারা ওসিয়াত করতে এবং না পারবে তাদের পরিবার-পরিজনের কাছে ফিরে যেতে।",
    "আর শিঙ্গায় ফুঁক দেয়া হবে, তৎক্ষণাৎ তারা কবর থেকে তাদের রবের দিকে ছুটে আসবে।",
    "তারা বলবে, ‘হায় আমাদের দুর্ভোগ! কে আমাদেরকে আমাদের নিদ্রাস্থল থেকে উঠালো’? (তাদেরকে বলা হবে) ‘এটা তো তা যার ওয়াদা পরম করুনাময় করেছিলেন এবং রাসূলগণ সত্য বলেছিলেন’।",
    "তা ছিল শুধুই একটি বিকট আওয়াজ, ফলে তৎক্ষণাৎ তাদের সকলকে আমার সামনে উপস্থিত করা হবে।",
    "সুতরাং আজ কাউকেই কোন যুলম করা হবে না এবং তোমরা যা আমল করছিলে শুধু তারই প্রতিদান তোমাদের দেয়া হবে।",
    "নিশ্চয় জান্নাতবাসীরা আজ আনন্দে মশগুল থাকবে।",
    "তারা ও তাদের স্ত্রীরা ছায়ার মধ্যে সুসজ্জিত আসনে হেলান দিয়ে উপবিষ্ট থাকবে।",
    "সেখানে তাদের জন্য থাকবে ফল-ফলাদি এবং থাকবে তারা যা চাইবে তাও।",
    "অসীম দয়ালু রবের পক্ষ থেকে বলা হবে, ‘সালাম’।",
    "আর [বলা হবে] ‘হে অপরাধীরা, আজ তোমরা পৃথক হয়ে যাও’।",
    "হে বনী আদম, আমি কি তোমাদেরকে এ মর্মে নির্দেশ দেইনি যে, ‘তোমরা শয়তানের উপাসনা করো না। নিঃসন্দেহে সে তোমাদের প্রকাশ্য শত্রু’?",
    "আর আমারই ইবাদাত কর। এটিই সরল পথ।",
    "আর অবশ্যই শয়তান তোমাদের বহু দলকে পথভ্রষ্ট করেছে। তবুও কি তোমরা অনুধাবন করনি?",
    "এটি সেই জাহান্নাম যার সম্পর্কে তোমরা ওয়াদাপ্রাপ্ত হয়েছিলে।",
    "তোমরা যে কুফরী করতে সে কারণে আজ তোমরা এতে প্রবেশ কর।",
    "আজ আমি তাদের মুখে মোহর মেরে দেব এবং তাদের হাত আমার সাথে কথা বলবে ও তাদের পা সে সম্পর্কে সাক্ষ্য দেবে যা তারা অর্জন করত।",
    "আর যদি আমি চাইতাম তবে তাদের চোখসমূহ অন্ধ করে দিতাম। তখন এরা পথের অন্বেষণে দৌড়ালে কী করে দেখতে পেত?",
    "আর আমি যদি চাইতাম তবে তাদের স্ব স্ব স্থানে তাদেরকে বিকৃত করে দিতাম। ফলে তারা সামনেও এগিয়ে যেতে পারত না এবং পিছনেও ফিরে আসতে পারত না।",
    "আর আমি যাকে দীর্ঘ জীবন দান করি, সৃষ্টি-অবয়বে আমি তার পরিবর্তন ঘটাই। তবুও কি তারা বুঝবে না?",
    "আমি রাসূলকে কাব্য শিখাইনি এবং এটি তার জন্য শোভনীয়ও নয়। এ তো কেবল এক উপদেশ ও স্পষ্ট কুরআন মাত্র।",
    "যাতে তা সতর্ক করতে পারে ঐ ব্যক্তিকে যে জীবিত এবং যাতে কাফিরদের বিরুদ্ধে অভিযোগবাণী প্রমাণিত হয়।",
    "তারা কি দেখেনি, আমার হাতের তৈরী বস্তুসমূহের মধ্যে আমি তাদের জন্য চতুষ্পদ জন্তু সৃষ্টি করেছি। অতঃপর তারা হল এগুলোর মালিক।",
    "আর আমি এগুলোকে তাদের বশীভূত করে দিয়েছি। ফলে এদের কতক তাদের বাহন এবং কতক তারা ভক্ষণ করে।",
    "আর তাদের জন্য এগুলোতে রয়েছে আরও বহু উপকারিতা ও পানীয় উপাদান। তবুও কি তারা শোকর আদায় করবে না?",
    "অথচ তারা আল্লাহর পরিবর্তে অন্য সব ইলাহ গ্রহণ করেছে, এই প্রত্যাশায় যে, তারা সাহায্যপ্রাপ্ত হবে।",
    "এরা তাদের কোন সাহায্য করতে সক্ষম হবে না, বরং এগুলোকে তাদের বিরুদ্ধে বাহিনীরূপে হাযির করা হবে।",
    "সুতরাং তাদের কথা তোমাকে যেন চিন্তিত না করে, নিশ্চয় আমি জানি তারা যা গোপন করে এবং যা প্রকাশ করে।",
    "মানুষ কি দেখেনি যে, আমি তাকে সৃষ্টি করেছি শুক্রবিন্দু থেকে? অথচ সে (বনে যায়) একজন প্রকাশ্য কুটতর্ককারী।",
    "আর সে আমার উদ্দেশ্যে উপমা পেশ করে, অথচ সে তার নিজের সৃষ্টি ভুলে যায়। সে বলে, ‘হাড়গুলো জরাজীর্ণ হওয়া অবস্থায় কে সেগুলো জীবিত করবে’?",
    "বল, ‘যিনি প্রথমবার এগুলোকে সৃষ্টি করেছেন তিনিই সেগুলো পুনরায় জীবিত করবেন। আর তিনি সকল সৃষ্টি সম্পর্কেই সর্বজ্ঞাত।",
    "যিনি সবুজ বৃক্ষ থেকে তোমাদের জন্য আগুন তৈরী করেছেন। ফলে তা থেকে তোমরা আগুন জ্বালাও।",
    "যিনি আসমানসমূহ ও যমীন সৃষ্টি করেছেন তিনি কি তাদের অনুরূপ সৃষ্টি করতে সক্ষম নন? হ্যাঁ, তিনিই মহাস্রষ্টা, সর্বজ্ঞানী।",
    "তাঁর ব্যাপার শুধু এই যে, কোন কিছুকে তিনি যদি ‘হও’ বলতে চান, তখনই তা হয়ে যায়।",
    "অতএব পবিত্র মহান তিনি, যার হাতে রয়েছে সকল কিছুর রাজত্ব এবং তাঁরই দিকে তোমরা প্রত্যাবর্তিত হবে।"
  ]
}