{
  "surahName": "An-Nisaa",
  "surahNameArabic": "النساء",
  "surahNameArabicLong": "سورة النساء",
  "surahNameTranslation": "The Women",
  "revelationPlace": "Madina",
  "totalAyah": 176,
  "surahNo": 4,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/4.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/004.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/4.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/004.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/4.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/004.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/4.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/004.mp3"
    }
  },
  "english": [
    "O humanity! Be mindful of your Lord Who created you from a single soul, and from it He created its mate, and through both He spread countless men and women. And be mindful of Allah—in Whose Name you appeal to one another—and ˹honour˺ family ties. Surely Allah is ever Watchful over you.",
    "Give orphans their wealth ˹when they reach maturity˺, and do not exchange your worthless possessions for their valuables, nor cheat them by mixing their wealth with your own. For this would indeed be a great sin.",
    "If you fear you might fail to give orphan women their ˹due˺ rights ˹if you were to marry them˺, then marry other women of your choice—two, three, or four. But if you are afraid you will fail to maintain justice, then ˹content yourselves with˺ one or those ˹bondwomen˺ in your possession. This way you are less likely to commit injustice.",
    "Give women ˹you wed˺ their due dowries graciously. But if they waive some of it willingly, then you may enjoy it freely with a clear conscience.",
    "Do not entrust the incapable ˹among your dependants˺ with your wealth which Allah has made a means of support for you—but feed and clothe them from it, and speak to them kindly.",
    "Test ˹the competence of˺ the orphans until they reach a marriageable age. Then if you feel they are capable of sound judgment, return their wealth to them. And do not consume it wastefully and hastily before they grow up ˹to demand it˺. If the guardian is well-off, they should not take compensation; but if the guardian is poor, let them take a reasonable provision. When you give orphans back their property, call in witnesses. And sufficient is Allah as a ˹vigilant˺ Reckoner.",
    "For men there is a share in what their parents and close relatives leave, and for women there is a share in what their parents and close relatives leave—whether it is little or much. ˹These are˺ obligatory shares.",
    "If ˹non-inheriting˺ relatives, orphans, or the needy are present at the time of distribution, offer them a ˹small˺ provision from it and speak to them kindly.",
    "Let the guardians be as concerned ˹for the orphans˺ as they would if they were to ˹die and˺ leave ˹their own˺ helpless children behind. So let them be mindful of Allah and speak equitably.",
    "Indeed, those who unjustly consume orphans’ wealth ˹in fact˺ consume nothing but fire into their bellies. And they will be burned in a blazing Hell!",
    "Allah commands you regarding your children: the share of the male will be twice that of the female. If you leave only two ˹or more˺ females, their share is two-thirds of the estate. But if there is only one female, her share will be one-half. Each parent is entitled to one-sixth if you leave offspring. But if you are childless and your parents are the only heirs, then your mother will receive one-third. But if you leave siblings, then your mother will receive one-sixth—after the fulfilment of bequests and debts. ˹Be fair to˺ your parents and children, as you do not ˹fully˺ know who is more beneficial to you. ˹This is˺ an obligation from Allah. Surely Allah is All-Knowing, All-Wise.",
    "You will inherit half of what your wives leave if they are childless. But if they have children, then ˹your share is˺ one-fourth of the estate—after the fulfilment of bequests and debts. And your wives will inherit one-fourth of what you leave if you are childless. But if you have children, then your wives will receive one-eighth of your estate—after the fulfilment of bequests and debts. And if a man or a woman leaves neither parents nor children but only a brother or a sister ˹from their mother’s side˺, they will each inherit one-sixth, but if they are more than one, they ˹all˺ will share one-third of the estate—after the fulfilment of bequests and debts without harm ˹to the heirs˺. ˹This is˺ a commandment from Allah. And Allah is All-Knowing, Most Forbearing.",
    "These ˹entitlements˺ are the limits set by Allah. Whoever obeys Allah and His Messenger will be admitted into Gardens under which rivers flow, to stay there forever. That is the ultimate triumph!",
    "But whoever disobeys Allah and His Messenger and exceeds their limits will be cast into Hell, to stay there forever. And they will suffer a humiliating punishment.",
    "˹As for˺ those of your women who commit illegal intercourse—call four witnesses from among yourselves. If they testify, confine the offenders to their homes until they die or Allah ordains a ˹different˺ way for them.",
    "And the two among you who commit this sin—discipline them. If they repent and mend their ways, relieve them. Surely Allah is ever Accepting of Repentance, Most Merciful.",
    "Allah only accepts the repentance of those who commit evil ignorantly ˹or recklessly˺ then repent soon after—Allah will pardon them. And Allah is All-Knowing, All-Wise.",
    "However, repentance is not accepted from those who knowingly persist in sin until they start dying, and then cry, “Now I repent!” nor those who die as disbelievers. For them We have prepared a painful punishment.",
    "O believers! It is not permissible for you to inherit women against their will or mistreat them to make them return some of the dowry ˹as a ransom for divorce˺—unless they are found guilty of adultery. Treat them fairly. If you happen to dislike them, you may hate something which Allah turns into a great blessing.",
    "If you desire to replace a wife with another and you have given the former ˹even˺ a stack of gold ˹as a dowry˺, do not take any of it back. Would you ˹still˺ take it unjustly and very sinfully?",
    "And how could you take it back after having enjoyed each other intimately and she has taken from you a firm commitment?",
    "Do not marry former wives of your fathers—except what was done previously. It was indeed a shameful, despicable, and evil practice.",
    "˹Also˺ forbidden to you for marriage are your mothers, your daughters, your sisters, your paternal and maternal aunts, your brother’s daughters, your sister’s daughters, your foster-mothers, your foster-sisters, your mothers-in-law, your stepdaughters under your guardianship if you have consummated marriage with their mothers—but if you have not, then you can marry them—nor the wives of your own sons, nor two sisters together at the same time—except what was done previously. Surely Allah is All-Forgiving, Most Merciful.",
    "Also ˹forbidden are˺ married women—except ˹female˺ captives in your possession. This is Allah’s commandment to you. Lawful to you are all beyond these—as long as you seek them with your wealth in a legal marriage, not in fornication. Give those you have consummated marriage with their due dowries. It is permissible to be mutually gracious regarding the set dowry. Surely Allah is All-Knowing, All-Wise.",
    "But if any of you cannot afford to marry a free believing woman, then ˹let him marry˺ a believing bondwoman possessed by one of you. Allah knows best ˹the state of˺ your faith ˹and theirs˺. You are from one another. So marry them with the permission of their owners, giving them their dowry in fairness, if they are chaste, neither promiscuous nor having secret affairs. If they commit indecency after marriage, they receive half the punishment of free women. This is for those of you who fear falling into sin. But if you are patient, it is better for you. And Allah is All-Forgiving, Most Merciful.",
    "It is Allah’s Will to make things clear to you, guide you to the ˹noble˺ ways of those before you, and turn to you in mercy. For Allah is All-Knowing, All-Wise.",
    "And it is Allah’s Will to turn to you in grace, but those who follow their desires wish to see you deviate entirely ˹from Allah’s Way˺.",
    "And it is Allah’s Will to lighten your burdens, for humankind was created weak.",
    "O believers! Do not devour one another’s wealth illegally, but rather trade by mutual consent. And do not kill ˹each other or˺ yourselves. Surely Allah is ever Merciful to you.",
    "And whoever does this sinfully and unjustly, We will burn them in the Fire. That is easy for Allah.",
    "If you avoid the major sins forbidden to you, We will absolve you of your ˹lesser˺ misdeeds and admit you into a place of honour.",
    "And do not crave what Allah has given some of you over others. Men will be rewarded according to their deeds and women ˹equally˺ according to theirs. Rather, ask Allah for His bounties. Surely Allah has ˹perfect˺ knowledge of all things.",
    "And We have appointed heirs to what has been left by parents and next of kin. As for those you have made a pledge to, give them their share. Surely Allah is a Witness over all things.",
    "Men are the caretakers of women, as men have been provisioned by Allah over women and tasked with supporting them financially. And righteous women are devoutly obedient and, when alone, protective of what Allah has entrusted them with. And if you sense ill-conduct from your women, advise them ˹first˺, ˹if they persist,˺ do not share their beds, ˹but if they still persist,˺ then discipline them ˹gently˺. But if they change their ways, do not be unjust to them. Surely Allah is Most High, All-Great.",
    "If you anticipate a split between them, appoint a mediator from his family and another from hers. If they desire reconciliation, Allah will restore harmony between them. Surely Allah is All-Knowing, All-Aware.",
    "Worship Allah ˹alone˺ and associate none with Him. And be kind to parents, relatives, orphans, the poor, near and distant neighbours, close friends, ˹needy˺ travellers, and those ˹bondspeople˺ in your possession. Surely Allah does not like whoever is arrogant, boastful—",
    "those who are stingy, promote stinginess among people, and withhold Allah’s bounties. We have prepared for the disbelievers a humiliating punishment.",
    "Likewise for those who spend their wealth to show off and do not believe in Allah or the Last Day. And whoever takes Satan as an associate—what an evil associate they have!",
    "What harm could have come to them if they had believed in Allah and the Last Day and donated from what Allah has provided for them? And Allah has ˹perfect˺ knowledge of them.",
    "Indeed, Allah never wrongs ˹anyone˺—even by an atom’s weight. And if it is a good deed, He will multiply it many times over and will give a great reward out of His grace.",
    "So how will it be when We bring a witness from every faith-community and bring you ˹O Prophet˺ as a witness against yours?",
    "On that Day, those who denied ˹Allah˺ and disobeyed the Messenger will wish they were reduced to dust. And they will never be able to hide anything from Allah.",
    "O believers! Do not approach prayer while intoxicated until you are aware of what you say, nor in a state of ˹full˺ impurity—unless you merely pass through ˹the mosque˺—until you have bathed. But if you are ill, on a journey, or have relieved yourselves, or been intimate with your wives and cannot find water, then purify yourselves with clean earth, wiping your faces and hands. And Allah is Ever-Pardoning, All-Forgiving.",
    "Have you ˹O Prophet˺ not seen those who were given a portion of the Scriptures yet trade it for misguidance and wish to see you deviate from the ˹Right˺ Path?",
    "Allah knows best who your enemies are! And Allah is sufficient as a Guardian, and He is sufficient as a Helper.",
    "Some Jews take words out of context and say, “We listen and we disobey,” “Hear! May you never hear,” and “Râ’ina!” [Herd us!]—playing with words and discrediting the faith. Had they said ˹courteously˺, “We hear and obey,” “Listen to us,” and “Unẓurna,” [Tend to us!] it would have been better for them and more proper. Allah has condemned them for their disbelief, so they do not believe except for a few.",
    "O you who were given the Book! Believe in what We have revealed—confirming your own Scriptures—before We wipe out ˹your˺ faces, turning them backwards, or We condemn the defiant as We did to the Sabbath-breakers. And Allah’s command is always executed!",
    "Indeed, Allah does not forgive associating others with Him ˹in worship˺, but forgives anything else of whoever He wills. And whoever associates others with Allah has indeed committed a grave sin.",
    "Have you ˹O Prophet˺ not seen those who ˹falsely˺ elevate themselves? It is Allah who elevates whoever He wills. And none will be wronged ˹even by the width of˺ the thread of a date stone.",
    "See how they fabricate lies against Allah—this alone is a blatant sin.",
    "Have you ˹O Prophet˺ not seen those who were given a portion of the Scriptures yet believe in idols and false gods and reassure the disbelievers that they are better guided than the believers?",
    "It is they who have been condemned by Allah. And whoever is condemned by Allah will have no helper.",
    "Do they have control over shares of the kingdom? If so, they would not have given anyone so much as the speck on a date stone.",
    "Or do they envy the people for Allah’s bounties? Indeed, We have given the descendants of Abraham the Book and wisdom, along with great authority.",
    "Yet some believed in him while others turned away from him. Hell is sufficient as a torment!",
    "Surely those who reject Our signs, We will cast them into the Fire. Whenever their skin is burnt completely, We will replace it so they will ˹constantly˺ taste the punishment. Indeed, Allah is Almighty, All-Wise.",
    "As for those who believe and do good, We will admit them into Gardens under which rivers flow, to stay there for ever and ever. There they will have pure spouses, and We will place them under a vast shade.",
    "Indeed, Allah commands you to return trusts to their rightful owners; and when you judge between people, judge with fairness. What a noble commandment from Allah to you! Surely Allah is All-Hearing, All-Seeing.",
    "O believers! Obey Allah and obey the Messenger and those in authority among you. Should you disagree on anything, then refer it to Allah and His Messenger, if you ˹truly˺ believe in Allah and the Last Day. This is the best and fairest resolution.",
    "Have you ˹O Prophet˺ not seen those who claim they believe in what has been revealed to you and what was revealed before you? They seek the judgment of false judges, which they were commanded to reject. And Satan ˹only˺ desires to lead them farther away.",
    "When it is said to them, “Come to Allah’s revelations and to the Messenger,” you see the hypocrites turn away from you stubbornly.",
    "How ˹horrible˺ will it be if a disaster strikes them because of what their hands have done, then they come to you swearing by Allah, “We intended nothing but goodwill and reconciliation.”",
    "˹Only˺ Allah knows what is in their hearts. So turn away from them, caution them, and give them advice that will shake their very souls.",
    "We only sent messengers to be obeyed by Allah’s Will. If only those ˹hypocrites˺ came to you ˹O Prophet˺—after wronging themselves—seeking Allah’s forgiveness and the Messenger prayed for their forgiveness, they would have certainly found Allah ever Accepting of Repentance, Most Merciful.",
    "But no! By your Lord, they will never be ˹true˺ believers until they accept you ˹O Prophet˺ as the judge in their disputes, and find no resistance within themselves against your decision and submit wholeheartedly.",
    "If We had commanded them to sacrifice themselves or abandon their homes, none would have obeyed except for a few. Had they done what they were advised to do, it would have certainly been far better for them and more reassuring",
    "and We would have granted them a great reward by Our grace",
    "and guided them to the Straight Path.",
    "And whoever obeys Allah and the Messenger will be in the company of those blessed by Allah: the prophets, the people of truth, the martyrs, and the righteous—what honourable company!",
    "This is Allah’s favour, and Allah fully knows ˹who deserves it˺.",
    "O believers! Take your precautions and go forth either in groups or together.",
    "There will be some among you who will lag behind so that if you face a disaster, they will say, “Allah has blessed us for not being there among them.”",
    "But if you return with Allah’s bounties, they will say—as if there had been no bond between you—“We wish we had been there with them to share the great gain!”",
    "Let those who would sacrifice this life for the Hereafter fight in the cause of Allah. And whoever fights in Allah’s cause—whether they achieve martyrdom or victory—We will honour them with a great reward.",
    "And what is it with you? You do not fight in the cause of Allah and for oppressed men, women, and children who cry out, “Our Lord! Deliver us from this land of oppressors! Appoint for us a saviour; appoint for us a helper—all by Your grace.”",
    "Believers fight for the cause of Allah, whereas disbelievers fight for the cause of the Devil. So fight against Satan’s ˹evil˺ forces. Indeed, Satan’s schemes are ever weak.",
    "Have you ˹O Prophet˺ not seen those who had been told, “Do not fight! Rather, establish prayer and pay alms-tax.”? Then once the order came to fight, a group of them feared those ˹hostile˺ people as Allah should be feared—or even more. They said, “Our Lord! Why have You ordered us to fight? If only You had delayed ˹the order for˺ us for a little while!” Say, ˹O Prophet,˺ “The enjoyment of this world is so little, whereas the Hereafter is far better for those mindful ˹of Allah˺. And none of you will be wronged ˹even by the width of˺ the thread of a date stone.",
    "Wherever you may be, death will overcome you—even if you were in fortified towers.” When something good befalls them, they say, “This is from Allah,” but when something evil befalls them, they say, “This is from you.” Say, ˹O Prophet,˺ “Both have been destined by Allah.” So what is the matter with these people? They can hardly comprehend anything!",
    "Whatever good befalls you is from Allah and whatever evil befalls you is from yourself. We have sent you ˹O Prophet˺ as a messenger to ˹all˺ people. And Allah is sufficient as a Witness.",
    "Whoever obeys the Messenger has truly obeyed Allah. But whoever turns away, then ˹know that˺ We have not sent you ˹O Prophet˺ as a keeper over them.",
    "And they say, “We obey,” but when they leave you, a group of them would spend the night contradicting what they said. Allah records all their schemes. So turn away from them, and put your trust in Allah. And Allah is sufficient as a Trustee of Affairs.",
    "Do they not then reflect on the Quran? Had it been from anyone other than Allah, they would have certainly found in it many inconsistencies.",
    "And when they hear news of security or fear, they publicize it. Had they referred it to the Messenger or their authorities, those with sound judgment among them would have validated it. Had it not been for Allah’s grace and mercy, you would have followed Satan—except for a few.",
    "So fight in the cause of Allah ˹O Prophet˺. You are accountable for none but yourself. And motivate the believers ˹to fight˺, so perhaps Allah will curb the disbelievers’ might. And Allah is far superior in might and in punishment.",
    "Whoever intercedes for a good cause will have a share in the reward, and whoever intercedes for an evil cause will have a share in the burden. And Allah is Watchful over all things.",
    "And when you are greeted, respond with a better greeting or at least similarly. Surely Allah is a ˹vigilant˺ Reckoner of all things.",
    "Allah, there is no god ˹worthy of worship˺ except Him. He will certainly gather ˹all of˺ you together on the Day of Judgment—about which there is no doubt. And whose word is more truthful than Allah’s?",
    "Why are you ˹believers˺ divided into two groups regarding the hypocrites while Allah allowed them to regress ˹to disbelief˺ because of their misdeeds? Do you wish to guide those left by Allah to stray? And whoever Allah leaves to stray, you will never find for them a way.",
    "They wish you would disbelieve as they have disbelieved, so you may all be alike. So do not take them as allies unless they emigrate in the cause of Allah. But if they turn away, then seize them and kill them wherever you find them, and do not take any of them as allies or helpers",
    "except those who are allies of a people you are bound with in a treaty or those wholeheartedly opposed to fighting either you or their own people. If Allah had willed, He would have empowered them to fight you. So if they refrain from fighting you and offer you peace, then Allah does not permit you to harm them.",
    "You will find others who wish to be safe from you and their own people. Yet they cannot resist the temptation ˹of disbelief or hostility˺. If they do not keep away, offer you peace, or refrain from attacking you, then seize them and kill them wherever you find them. We have given you full permission over such people.",
    "It is not lawful for a believer to kill another except by mistake. And whoever kills a believer unintentionally must free a believing slave and pay blood-money to the victim’s family—unless they waive it charitably. But if the victim is a believer from a hostile people, then a believing slave must be freed. And if the victim is from a people bound with you in a treaty, then blood-money must be paid to the family along with freeing a believing slave. Those who are unable, let them fast two consecutive months—as a means of repentance to Allah. And Allah is All-Knowing, All-Wise.",
    "And whoever kills a believer intentionally, their reward will be Hell—where they will stay indefinitely. Allah will be displeased with them, condemn them, and will prepare for them a tremendous punishment.",
    "O believers! When you struggle in the cause of Allah, be sure of who you fight. And do not say to those who offer you ˹greetings of˺ peace, “You are no believer!”—seeking a fleeting worldly gain. Instead, Allah has infinite bounties ˹in store˺. You were initially like them then Allah blessed you ˹with Islam˺. So be sure! Indeed, Allah is All-Aware of what you do.",
    "Those who stay at home—except those with valid excuses—are not equal to those who strive in the cause of Allah with their wealth and their lives. Allah has elevated in rank those who strive with their wealth and their lives above those who stay behind ˹with valid excuses˺. Allah has promised each a fine reward, but those who strive will receive a far better reward than others—",
    "far superior ranks, forgiveness, and mercy from Him. And Allah is All-Forgiving, Most Merciful.",
    "When the angels seize the souls of those who have wronged themselves—scolding them, “What do you think you were doing?” they will reply, “We were oppressed in the land.” The angels will respond, “Was Allah’s earth not spacious enough for you to emigrate?” It is they who will have Hell as their home—what an evil destination!",
    "Except helpless men, women, and children who cannot afford a way out—",
    "it is right to hope that Allah will pardon them. For Allah is Ever-Pardoning, All-Forgiving.",
    "Whoever emigrates in the cause of Allah will find many safe havens and bountiful resources throughout the earth. Those who leave their homes and die while emigrating to Allah and His Messenger—their reward has already been secured with Allah. And Allah is All-Forgiving, Most Merciful.",
    "When you travel through the land, it is permissible for you to shorten the prayer—˹especially˺ if you fear an attack by the disbelievers. Indeed, the disbelievers are your sworn enemies.",
    "When you ˹O Prophet˺ are ˹campaigning˺ with them and you lead them in prayer, let one group of them pray with you—while armed. When they prostrate themselves, let the other group stand guard behind them. Then the group that has not yet prayed will then join you in prayer—and let them be vigilant and armed. The disbelievers would wish to see you neglect your weapons and belongings, so they could launch a sweeping assault on you. But there is no blame if you lay aside your weapons when overcome by heavy rain or illness—but take precaution. Indeed, Allah has prepared a humiliating punishment for the disbelievers.",
    "When the prayers are over, remember Allah—whether you are standing, sitting, or lying down. But when you are secure, establish regular prayers. Indeed, performing prayers is a duty on the believers at the appointed times.",
    "Do not falter in pursuit of the enemy—if you are suffering, they too are suffering. But you can hope to receive from Allah what they can never hope for. And Allah is All-Knowing, All-Wise.",
    "Indeed, We have sent down the Book to you ˹O Prophet˺ in truth to judge between people by means of what Allah has shown you. So do not be an advocate for the deceitful.",
    "And seek Allah’s forgiveness—indeed, Allah is All-Forgiving, Most Merciful.",
    "Do not advocate for those who wrong themselves. Surely Allah does not like those who are deceitful, sinful.",
    "They try to hide ˹their deception˺ from people, but they can never hide it from Allah—in Whose presence they plot by night what is displeasing to Him. And Allah is Fully Aware of what they do.",
    "Here you are! You ˹believers˺ are advocating for them in this life, but who will ˹dare to˺ advocate for them before Allah on the Day of Judgment? Or who will come to their defence?",
    "Whoever commits evil or wrongs themselves then seeks Allah’s forgiveness will certainly find Allah All-Forgiving, Most Merciful.",
    "And whoever commits a sin—it is only to their own loss. Allah is All-Knowing, All-Wise.",
    "And whoever commits an evil or sinful deed then blames it on an innocent person, they will definitely bear the guilt of slander and blatant sin.",
    "Had it not been for Allah’s grace and mercy, a group of them would have sought to deceive you ˹O Prophet˺. Yet they would deceive none but themselves, nor can they harm you in the least. Allah has revealed to you the Book and wisdom and taught you what you never knew. Great ˹indeed˺ is Allah’s favour upon you!",
    "There is no good in most of their secret talks—except those encouraging charity, kindness, or reconciliation between people. And whoever does this seeking Allah’s pleasure, We will grant them a great reward.",
    "And whoever defies the Messenger after guidance has become clear to them and follows a path other than that of the believers, We will let them pursue what they have chosen, then burn them in Hell—what an evil end!",
    "Surely Allah does not forgive associating ˹others˺ with Him ˹in worship˺, but forgives anything else of whoever He wills. Indeed, whoever associates ˹others˺ with Allah has clearly gone far astray.",
    "Instead of Allah, they only invoke female gods and they ˹actually˺ invoke none but a rebellious Satan—",
    "cursed by Allah—who said, “I will surely take hold of a certain number of Your servants.",
    "I will certainly mislead them and delude them with empty hopes. Also, I will order them and they will slit the ears of cattle and alter Allah’s creation.” And whoever takes Satan as a guardian instead of Allah has certainly suffered a tremendous loss.",
    "Satan only makes them ˹false˺ promises and deludes them with ˹empty˺ hopes. Truly Satan promises them nothing but delusion.",
    "It is they who will have Hell as their home, and they will find no escape from it!",
    "And those who believe and do good, We will soon admit them into Gardens under which rivers flow, to stay there for ever and ever. Allah’s promise is ˹always˺ true. And whose word is more truthful than Allah’s?",
    "˹Divine grace is˺ neither by your wishes nor those of the People of the Book! Whoever commits evil will be rewarded accordingly, and they will find no protector or helper besides Allah.",
    "But those who do good—whether male or female—and have faith will enter Paradise and will never be wronged ˹even as much as˺ the speck on a date stone.",
    "And who is better in faith than those who ˹fully˺ submit themselves to Allah, do good, and follow the Way of Abraham, the upright? Allah chose Abraham as a close friend.",
    "To Allah ˹alone˺ belongs whatever is in the heavens and whatever is on the earth. And Allah is Fully Aware of everything.",
    "They ask you ˹O Prophet˺ regarding women. Say, “It is Allah Who instructs you regarding them. Instruction has ˹already˺ been revealed in the Book concerning the orphan women you deprive of their due rights but still wish to marry, also helpless children, as well as standing up for orphans’ rights. And whatever good you do is certainly well known to Allah.”",
    "If a woman fears indifference or neglect from her husband, there is no blame on either of them if they seek ˹fair˺ settlement, which is best. Humans are ever inclined to selfishness. But if you are gracious and mindful ˹of Allah˺, surely Allah is All-Aware of what you do.",
    "You will never be able to maintain ˹emotional˺ justice between your wives—no matter how keen you are. So do not totally incline towards one leaving the other in suspense. And if you do what is right and are mindful ˹of Allah˺, surely Allah is All-Forgiving, Most Merciful.",
    "But if they choose to separate, Allah will enrich both of them from His bounties. And Allah is Ever-Bountiful, All-Wise.",
    "To Allah ˹alone˺ belongs whatever is in the heavens and whatever is on the earth. Indeed, We have commanded those given the Scripture before you, as well as you, to be mindful of Allah. But if you disobey, then ˹know that˺ to Allah belongs whatever is in the heavens and the earth. And Allah is Self-Sufficient, Praiseworthy.",
    "To Allah ˹alone˺ belongs whatever is in the heavens and whatever is on the earth. And Allah is sufficient as a Trustee of Affairs.",
    "If it is His Will, He can remove you altogether, O  humanity, and replace you with others. And Allah is Most Capable to do so.",
    "Whoever desires the reward of this world, then ˹let them know that˺ with Allah are the rewards of this world and the Hereafter. And Allah is All-Hearing, All-Seeing.",
    "O believers! Stand firm for justice as witnesses for Allah even if it is against yourselves, your parents, or close relatives. Be they rich or poor, Allah is best to ensure their interests. So do not let your desires cause you to deviate ˹from justice˺. If you distort the testimony or refuse to give it, then ˹know that˺ Allah is certainly All-Aware of what you do.",
    "O believers! Have faith in Allah, His Messenger, the Book He has revealed to His Messenger, and the Scriptures He revealed before. Indeed, whoever denies Allah, His angels, His Books, His messengers, and the Last Day has clearly gone far astray.",
    "Indeed, those who believed then disbelieved, then believed and again disbelieved—˹only˺ increasing in disbelief—Allah will neither forgive them nor guide them to the ˹Right˺ Way.",
    "Give good news of a painful punishment to hypocrites",
    "who choose disbelievers as allies instead of the believers. Do they seek honour and power through that company? Surely all honour and power belongs to Allah.",
    "He has already revealed to you in the Book that when you hear Allah’s revelations being denied or ridiculed, then do not sit in that company unless they engage in a different topic, or else you will be like them. Surely Allah will gather the hypocrites and disbelievers all together in Hell.",
    "˹The hypocrites are˺ those who wait to see what happens to you. So if Allah grants you victory, they say ˹to you˺, “Were we not on your side?” But if the disbelievers have a share ˹of victory˺, they say ˹to them˺, “Did we not have the advantage over you, yet we protected you from the believers?” Allah will judge between ˹all of˺ you on the Day of Judgment. And Allah will never grant the disbelievers a way over the believers.",
    "Surely the hypocrites seek to deceive Allah, but He outwits them. When they stand up for prayer, they do it half-heartedly only to be seen by people—hardly remembering Allah at all.",
    "Torn between belief and disbelief—belonging neither to these ˹believers˺ nor those ˹disbelievers˺. And whoever Allah leaves to stray, you will never find for them a way.",
    "O believers! Do not take disbelievers as allies instead of the believers. Would you like to give Allah solid proof against yourselves?",
    "Surely the hypocrites will be in the lowest depths of the Fire—and you will never find for them any helper—",
    "except those who repent, mend their ways, hold fast to Allah, and are sincere in their devotion to Allah; they will be with the believers. And Allah will grant the believers a great reward.",
    "Why should Allah punish you if you are grateful and faithful? Allah is ever Appreciative, All-Knowing.",
    "Allah does not like negative thoughts to be voiced—except by those who have been wronged. Allah is All-Hearing, All-Knowing.",
    "Whether you reveal or conceal a good or pardon an evil—surely Allah is Ever-Pardoning, Most Capable.",
    "Surely those who deny Allah and His messengers and wish to make a distinction between Allah and His messengers, saying, “We believe in some and disbelieve in others,” desiring to forge a compromise",
    "they are indeed the true disbelievers. And We have prepared for the disbelievers a humiliating punishment.",
    "As for those who believe in Allah and His messengers—accepting all; rejecting none—He will surely give them their rewards. And Allah is All-Forgiving, Most Merciful.",
    "The People of the Book demand that you ˹O Prophet˺ bring down for them a revelation in writing from heaven. They demanded what is even greater than this from Moses, saying, “Make Allah visible to us!” So a thunderbolt struck them for their wrongdoing. Then they took the calf for worship after receiving clear signs. Still We forgave them for that ˹after their repentance˺ and gave Moses compelling proof.",
    "We raised the Mount over them ˹as a warning˺ for ˹breaking˺ their covenant and said, “Enter the gate ˹of Jerusalem˺ with humility.” We also warned them, “Do not break the Sabbath,” and took from them a firm covenant.",
    "˹They were condemned˺ for breaking their covenant, rejecting Allah’s signs, killing the prophets unjustly, and for saying, “Our hearts are unreceptive!”—it is Allah Who has sealed their hearts for their disbelief, so they do not believe except for a few—",
    "and for their denial and outrageous accusation against Mary",
    "and for boasting, “We killed the Messiah, Jesus, son of Mary, the messenger of Allah.” But they neither killed nor crucified him—it was only made to appear so. Even those who argue for this ˹crucifixion˺ are in doubt. They have no knowledge whatsoever—only making assumptions. They certainly did not kill him.",
    "Rather, Allah raised him up to Himself. And Allah is Almighty, All-Wise.",
    "Every one of the People of the Book will definitely believe in him before his death. And on the Day of Judgment Jesus will be a witness against them.",
    "We forbade the Jews certain foods that had been lawful to them for their wrongdoing, and for hindering many from the Way of Allah",
    "taking interest despite its prohibition, and consuming people’s wealth unjustly. We have prepared for the disbelievers among them a painful punishment.",
    "But those of them well-grounded in knowledge, the faithful ˹who˺ believe in what has been revealed to you ˹O Prophet˺ and what was revealed before you—˹especially˺ those who establish prayer—and those who pay alms-tax and believe in Allah and the Last Day, to these ˹people˺ We will grant a great reward.",
    "Indeed, We have sent revelation to you ˹O Prophet˺ as We sent revelation to Noah and the prophets after him. We also sent revelation to Abraham, Ishmael, Isaac, Jacob, and his descendants, ˹as well as˺ Jesus, Job, Jonah, Aaron, and Solomon. And to David We gave the Psalms.",
    "There are messengers whose stories We have told you already and others We have not. And to Moses Allah spoke directly.",
    "˹All were˺ messengers delivering good news and warnings so humanity should have no excuse before Allah after ˹the coming of˺ the messengers. And Allah is Almighty, All-Wise.",
    "Yet ˹if you are denied, O  Prophet,˺ Allah bears witness to what He has sent down to you—He has sent it with His knowledge. The angels too bear witness. And Allah ˹alone˺ is sufficient as a Witness.",
    "Those who disbelieve and hinder ˹others˺ from the Way of Allah have certainly strayed far away.",
    "Those who disbelieve and wrong themselves—surely Allah will neither forgive them nor guide them to any path",
    "except that of Hell, to stay there for ever and ever. And that is easy for Allah.",
    "O humanity! The Messenger has certainly come to you with the truth from your Lord, so believe for your own good. But if you disbelieve, then ˹know that˺ to Allah belongs whatever is in the heavens and the earth. And Allah is All-Knowing, All-Wise.",
    "O People of the Book! Do not go to extremes regarding your faith; say nothing about Allah except the truth. The Messiah, Jesus, son of Mary, was no more than a messenger of Allah and the fulfilment of His Word through Mary and a spirit ˹created by a command˺ from Him. So believe in Allah and His messengers and do not say, “Trinity.” Stop!—for your own good. Allah is only One God. Glory be to Him! He is far above having a son! To Him belongs whatever is in the heavens and whatever is on the earth. And Allah is sufficient as a Trustee of Affairs.",
    "The Messiah would never be too proud to be a servant of Allah, nor would the angels nearest to Allah. Those who are too proud and arrogant to worship Him will be brought before Him all together.",
    "As for those who believe and do good, He will reward them in full and increase them out of His grace. But those who are too proud and arrogant, He will subject them to a painful punishment. And besides Allah they will find no protector or helper.",
    "O humanity! There has come to you conclusive evidence from your Lord. And We have sent down to you a brilliant light.",
    "As for those who believe in Allah and hold fast to Him, He will admit them into His mercy and grace and guide them to Himself through the Straight Path.",
    "They ask you ˹for a ruling, O  Prophet˺. Say, “Allah gives you a ruling regarding those who die without children or parents.” If a man dies childless and leaves behind a sister, she will inherit one-half of his estate, whereas her brother will inherit all of her estate if she dies childless. If this person leaves behind two sisters, they together will inherit two-thirds of the estate. But if the deceased leaves male and female siblings, a male’s share will be equal to that of two females. Allah makes ˹this˺ clear to you so you do not go astray. And Allah has ˹perfect˺ knowledge of all things."
  ],
  "arabic1": [
    "یٰۤاَیُّهَا النَّاسُ اتَّقُوْا رَبَّكُمُ الَّذِیْ خَلَقَكُمْ مِّنْ نَّفْسٍ وَّاحِدَةٍ وَّخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِیْرًا وَّنِسَآءً وَاتَّقُوا اللّٰهَ الَّذِیْ تَسَآءَلُوْنَ بِهٖ وَالْاَرْحَامَ اِنَّ اللّٰهَ كَانَ عَلَیْكُمْ رَقِیْبًا",
    "وَاٰتُوا الْیَتٰمٰۤی اَمْوَالَهُمْ وَلَا تَتَبَدَّلُوا الْخَبِیْثَ بِالطَّیِّبِ وَلَا تَاْكُلُوْۤا اَمْوَالَهُمْ اِلٰۤی اَمْوَالِكُمْ اِنَّهٗ كَانَ حُوْبًا كَبِیْرًا",
    "وَاِنْ خِفْتُمْ اَلَّا تُقْسِطُوْا فِی الْیَتٰمٰی فَانْكِحُوْا مَا طَابَ لَكُمْ مِّنَ النِّسَآءِ مَثْنٰی وَثُلٰثَ وَرُبٰعَ فَاِنْ خِفْتُمْ اَلَّا تَعْدِلُوْا فَوَاحِدَةً اَوْ مَا مَلَكَتْ اَیْمَانُكُمْ ذٰلِكَ اَدْنٰۤی اَلَّا تَعُوْلُوْا",
    "وَاٰتُوا النِّسَآءَ صَدُقٰتِهِنَّ نِحْلَةً فَاِنْ طِبْنَ لَكُمْ عَنْ شَیْءٍ مِّنْهُ نَفْسًا فَكُلُوْهُ هَنِیْٓـًٔا مَّرِیْٓـًٔا",
    "وَلَا تُؤْتُوا السُّفَهَآءَ اَمْوَالَكُمُ الَّتِیْ جَعَلَ اللّٰهُ لَكُمْ قِیٰمًا وَّارْزُقُوْهُمْ فِیْهَا وَاكْسُوْهُمْ وَقُوْلُوْا لَهُمْ قَوْلًا مَّعْرُوْفًا",
    "وَابْتَلُوا الْیَتٰمٰی حَتّٰۤی اِذَا بَلَغُوا النِّكَاحَ فَاِنْ اٰنَسْتُمْ مِّنْهُمْ رُشْدًا فَادْفَعُوْۤا اِلَیْهِمْ اَمْوَالَهُمْ وَلَا تَاْكُلُوْهَاۤ اِسْرَافًا وَّبِدَارًا اَنْ یَّكْبَرُوْا وَمَنْ كَانَ غَنِیًّا فَلْیَسْتَعْفِفْ وَمَنْ كَانَ فَقِیْرًا فَلْیَاْكُلْ بِالْمَعْرُوْفِ فَاِذَا دَفَعْتُمْ اِلَیْهِمْ اَمْوَالَهُمْ فَاَشْهِدُوْا عَلَیْهِمْ وَكَفٰی بِاللّٰهِ حَسِیْبًا",
    "لِلرِّجَالِ نَصِیْبٌ مِّمَّا تَرَكَ الْوَالِدٰنِ وَالْاَقْرَبُوْنَ وَلِلنِّسَآءِ نَصِیْبٌ مِّمَّا تَرَكَ الْوَالِدٰنِ وَالْاَقْرَبُوْنَ مِمَّا قَلَّ مِنْهُ اَوْ كَثُرَ نَصِیْبًا مَّفْرُوْضًا",
    "وَاِذَا حَضَرَ الْقِسْمَةَ اُولُوا الْقُرْبٰی وَالْیَتٰمٰی وَالْمَسٰكِیْنُ فَارْزُقُوْهُمْ مِّنْهُ وَقُوْلُوْا لَهُمْ قَوْلًا مَّعْرُوْفًا",
    "وَلْیَخْشَ الَّذِیْنَ لَوْ تَرَكُوْا مِنْ خَلْفِهِمْ ذُرِّیَّةً ضِعٰفًا خَافُوْا عَلَیْهِمْ فَلْیَتَّقُوا اللّٰهَ وَلْیَقُوْلُوْا قَوْلًا سَدِیْدًا",
    "اِنَّ الَّذِیْنَ یَاْكُلُوْنَ اَمْوَالَ الْیَتٰمٰی ظُلْمًا اِنَّمَا یَاْكُلُوْنَ فِیْ بُطُوْنِهِمْ نَارًا وَسَیَصْلَوْنَ سَعِیْرًا",
    "یُوْصِیْكُمُ اللّٰهُ فِیْۤ اَوْلَادِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ الْاُنْثَیَیْنِ فَاِنْ كُنَّ نِسَآءً فَوْقَ اثْنَتَیْنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ وَاِنْ كَانَتْ وَاحِدَةً فَلَهَا النِّصْفُ وَلِاَبَوَیْهِ لِكُلِّ وَاحِدٍ مِّنْهُمَا السُّدُسُ مِمَّا تَرَكَ اِنْ كَانَ لَهٗ وَلَدٌ فَاِنْ لَّمْ یَكُنْ لَّهٗ وَلَدٌ وَّوَرِثَهٗۤ اَبَوٰهُ فَلِاُمِّهِ الثُّلُثُ فَاِنْ كَانَ لَهٗۤ اِخْوَةٌ فَلِاُمِّهِ السُّدُسُ مِنْ بَعْدِ وَصِیَّةٍ یُّوْصِیْ بِهَاۤ اَوْ دَیْنٍ اٰبَآؤُكُمْ وَاَبْنَآؤُكُمْ لَا تَدْرُوْنَ اَیُّهُمْ اَقْرَبُ لَكُمْ نَفْعًا فَرِیْضَةً مِّنَ اللّٰهِ اِنَّ اللّٰهَ كَانَ عَلِیْمًا حَكِیْمًا",
    "وَلَكُمْ نِصْفُ مَا تَرَكَ اَزْوَاجُكُمْ اِنْ لَّمْ یَكُنْ لَّهُنَّ وَلَدٌ فَاِنْ كَانَ لَهُنَّ وَلَدٌ فَلَكُمُ الرُّبُعُ مِمَّا تَرَكْنَ مِنْ بَعْدِ وَصِیَّةٍ یُّوْصِیْنَ بِهَاۤ اَوْ دَیْنٍ وَلَهُنَّ الرُّبُعُ مِمَّا تَرَكْتُمْ اِنْ لَّمْ یَكُنْ لَّكُمْ وَلَدٌ فَاِنْ كَانَ لَكُمْ وَلَدٌ فَلَهُنَّ الثُّمُنُ مِمَّا تَرَكْتُمْ مِّنْ بَعْدِ وَصِیَّةٍ تُوْصُوْنَ بِهَاۤ اَوْ دَیْنٍ وَاِنْ كَانَ رَجُلٌ یُّوْرَثُ كَلٰلَةً اَوِ امْرَاَةٌ وَّلَهٗۤ اَخٌ اَوْ اُخْتٌ فَلِكُلِّ وَاحِدٍ مِّنْهُمَا السُّدُسُ فَاِنْ كَانُوْۤا اَكْثَرَ مِنْ ذٰلِكَ فَهُمْ شُرَكَآءُ فِی الثُّلُثِ مِنْ بَعْدِ وَصِیَّةٍ یُّوْصٰی بِهَاۤ اَوْ دَیْنٍ غَیْرَ مُضَآرٍّ وَصِیَّةً مِّنَ اللّٰهِ وَاللّٰهُ عَلِیْمٌ حَلِیْمٌ",
    "تِلْكَ حُدُوْدُ اللّٰهِ وَمَنْ یُّطِعِ اللّٰهَ وَرَسُوْلَهٗ یُدْخِلْهُ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِیْنَ فِیْهَا وَذٰلِكَ الْفَوْزُ الْعَظِیْمُ",
    "وَمَنْ یَّعْصِ اللّٰهَ وَرَسُوْلَهٗ وَیَتَعَدَّ حُدُوْدَهٗ یُدْخِلْهُ نَارًا خَالِدًا فِیْهَا وَلَهٗ عَذَابٌ مُّهِیْنٌ",
    "وَالّٰتِیْ یَاْتِیْنَ الْفَاحِشَةَ مِنْ نِّسَآىِٕكُمْ فَاسْتَشْهِدُوْا عَلَیْهِنَّ اَرْبَعَةً مِّنْكُمْ فَاِنْ شَهِدُوْا فَاَمْسِكُوْهُنَّ فِی الْبُیُوْتِ حَتّٰی یَتَوَفّٰهُنَّ الْمَوْتُ اَوْ یَجْعَلَ اللّٰهُ لَهُنَّ سَبِیْلًا",
    "وَالَّذٰنِ یَاْتِیٰنِهَا مِنْكُمْ فَاٰذُوْهُمَا فَاِنْ تَابَا وَاَصْلَحَا فَاَعْرِضُوْا عَنْهُمَا اِنَّ اللّٰهَ كَانَ تَوَّابًا رَّحِیْمًا",
    "اِنَّمَا التَّوْبَةُ عَلَی اللّٰهِ لِلَّذِیْنَ یَعْمَلُوْنَ السُّوْٓءَ بِجَهَالَةٍ ثُمَّ یَتُوْبُوْنَ مِنْ قَرِیْبٍ فَاُولٰٓىِٕكَ یَتُوْبُ اللّٰهُ عَلَیْهِمْ وَكَانَ اللّٰهُ عَلِیْمًا حَكِیْمًا",
    "وَلَیْسَتِ التَّوْبَةُ لِلَّذِیْنَ یَعْمَلُوْنَ السَّیِّاٰتِ حَتّٰۤی اِذَا حَضَرَ اَحَدَهُمُ الْمَوْتُ قَالَ اِنِّیْ تُبْتُ الْـٰٔنَ وَلَا الَّذِیْنَ یَمُوْتُوْنَ وَهُمْ كُفَّارٌ اُولٰٓىِٕكَ اَعْتَدْنَا لَهُمْ عَذَابًا اَلِیْمًا",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا یَحِلُّ لَكُمْ اَنْ تَرِثُوا النِّسَآءَ كَرْهًا وَلَا تَعْضُلُوْهُنَّ لِتَذْهَبُوْا بِبَعْضِ مَاۤ اٰتَیْتُمُوْهُنَّ اِلَّاۤ اَنْ یَّاْتِیْنَ بِفَاحِشَةٍ مُّبَیِّنَةٍ وَعَاشِرُوْهُنَّ بِالْمَعْرُوْفِ فَاِنْ كَرِهْتُمُوْهُنَّ فَعَسٰۤی اَنْ تَكْرَهُوْا شَیْـًٔا وَّیَجْعَلَ اللّٰهُ فِیْهِ خَیْرًا كَثِیْرًا",
    "وَاِنْ اَرَدْتُّمُ اسْتِبْدَالَ زَوْجٍ مَّكَانَ زَوْجٍ وَّاٰتَیْتُمْ اِحْدٰىهُنَّ قِنْطَارًا فَلَا تَاْخُذُوْا مِنْهُ شَیْـًٔا اَتَاْخُذُوْنَهٗ بُهْتَانًا وَّاِثْمًا مُّبِیْنًا",
    "وَكَیْفَ تَاْخُذُوْنَهٗ وَقَدْ اَفْضٰی بَعْضُكُمْ اِلٰی بَعْضٍ وَّاَخَذْنَ مِنْكُمْ مِّیْثَاقًا غَلِیْظًا",
    "وَلَا تَنْكِحُوْا مَا نَكَحَ اٰبَآؤُكُمْ مِّنَ النِّسَآءِ اِلَّا مَا قَدْ سَلَفَ اِنَّهٗ كَانَ فَاحِشَةً وَّمَقْتًا وَسَآءَ سَبِیْلًا",
    "حُرِّمَتْ عَلَیْكُمْ اُمَّهٰتُكُمْ وَبَنٰتُكُمْ وَاَخَوٰتُكُمْ وَعَمّٰتُكُمْ وَخٰلٰتُكُمْ وَبَنٰتُ الْاَخِ وَبَنٰتُ الْاُخْتِ وَاُمَّهٰتُكُمُ الّٰتِیْۤ اَرْضَعْنَكُمْ وَاَخَوٰتُكُمْ مِّنَ الرَّضَاعَةِ وَاُمَّهٰتُ نِسَآىِٕكُمْ وَرَبَآىِٕبُكُمُ الّٰتِیْ فِیْ حُجُوْرِكُمْ مِّنْ نِّسَآىِٕكُمُ الّٰتِیْ دَخَلْتُمْ بِهِنَّ فَاِنْ لَّمْ تَكُوْنُوْا دَخَلْتُمْ بِهِنَّ فَلَا جُنَاحَ عَلَیْكُمْ وَحَلَآىِٕلُ اَبْنَآىِٕكُمُ الَّذِیْنَ مِنْ اَصْلَابِكُمْ وَاَنْ تَجْمَعُوْا بَیْنَ الْاُخْتَیْنِ اِلَّا مَا قَدْ سَلَفَ اِنَّ اللّٰهَ كَانَ غَفُوْرًا رَّحِیْمًا",
    "وَّالْمُحْصَنٰتُ مِنَ النِّسَآءِ اِلَّا مَا مَلَكَتْ اَیْمَانُكُمْ كِتٰبَ اللّٰهِ عَلَیْكُمْ وَاُحِلَّ لَكُمْ مَّا وَرَآءَ ذٰلِكُمْ اَنْ تَبْتَغُوْا بِاَمْوَالِكُمْ مُّحْصِنِیْنَ غَیْرَ مُسٰفِحِیْنَ فَمَا اسْتَمْتَعْتُمْ بِهٖ مِنْهُنَّ فَاٰتُوْهُنَّ اُجُوْرَهُنَّ فَرِیْضَةً وَلَا جُنَاحَ عَلَیْكُمْ فِیْمَا تَرٰضَیْتُمْ بِهٖ مِنْ بَعْدِ الْفَرِیْضَةِ اِنَّ اللّٰهَ كَانَ عَلِیْمًا حَكِیْمًا",
    "وَمَنْ لَّمْ یَسْتَطِعْ مِنْكُمْ طَوْلًا اَنْ یَّنْكِحَ الْمُحْصَنٰتِ الْمُؤْمِنٰتِ فَمِنْ مَّا مَلَكَتْ اَیْمَانُكُمْ مِّنْ فَتَیٰتِكُمُ الْمُؤْمِنٰتِ وَاللّٰهُ اَعْلَمُ بِاِیْمَانِكُمْ بَعْضُكُمْ مِّنْ بَعْضٍ فَانْكِحُوْهُنَّ بِاِذْنِ اَهْلِهِنَّ وَاٰتُوْهُنَّ اُجُوْرَهُنَّ بِالْمَعْرُوْفِ مُحْصَنٰتٍ غَیْرَ مُسٰفِحٰتٍ وَّلَا مُتَّخِذٰتِ اَخْدَانٍ فَاِذَاۤ اُحْصِنَّ فَاِنْ اَتَیْنَ بِفَاحِشَةٍ فَعَلَیْهِنَّ نِصْفُ مَا عَلَی الْمُحْصَنٰتِ مِنَ الْعَذَابِ ذٰلِكَ لِمَنْ خَشِیَ الْعَنَتَ مِنْكُمْ وَاَنْ تَصْبِرُوْا خَیْرٌ لَّكُمْ وَاللّٰهُ غَفُوْرٌ رَّحِیْمٌ",
    "یُرِیْدُ اللّٰهُ لِیُبَیِّنَ لَكُمْ وَیَهْدِیَكُمْ سُنَنَ الَّذِیْنَ مِنْ قَبْلِكُمْ وَیَتُوْبَ عَلَیْكُمْ وَاللّٰهُ عَلِیْمٌ حَكِیْمٌ",
    "وَاللّٰهُ یُرِیْدُ اَنْ یَّتُوْبَ عَلَیْكُمْ ۫ وَیُرِیْدُ الَّذِیْنَ یَتَّبِعُوْنَ الشَّهَوٰتِ اَنْ تَمِیْلُوْا مَیْلًا عَظِیْمًا",
    "یُرِیْدُ اللّٰهُ اَنْ یُّخَفِّفَ عَنْكُمْ وَخُلِقَ الْاِنْسَانُ ضَعِیْفًا",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا تَاْكُلُوْۤا اَمْوَالَكُمْ بَیْنَكُمْ بِالْبَاطِلِ اِلَّاۤ اَنْ تَكُوْنَ تِجَارَةً عَنْ تَرَاضٍ مِّنْكُمْ ۫ وَلَا تَقْتُلُوْۤا اَنْفُسَكُمْ اِنَّ اللّٰهَ كَانَ بِكُمْ رَحِیْمًا",
    "وَمَنْ یَّفْعَلْ ذٰلِكَ عُدْوَانًا وَّظُلْمًا فَسَوْفَ نُصْلِیْهِ نَارًا وَكَانَ ذٰلِكَ عَلَی اللّٰهِ یَسِیْرًا",
    "اِنْ تَجْتَنِبُوْا كَبَآىِٕرَ مَا تُنْهَوْنَ عَنْهُ نُكَفِّرْ عَنْكُمْ سَیِّاٰتِكُمْ وَنُدْخِلْكُمْ مُّدْخَلًا كَرِیْمًا",
    "وَلَا تَتَمَنَّوْا مَا فَضَّلَ اللّٰهُ بِهٖ بَعْضَكُمْ عَلٰی بَعْضٍ لِلرِّجَالِ نَصِیْبٌ مِّمَّا اكْتَسَبُوْا وَلِلنِّسَآءِ نَصِیْبٌ مِّمَّا اكْتَسَبْنَ وَسْـَٔلُوا اللّٰهَ مِنْ فَضْلِهٖ اِنَّ اللّٰهَ كَانَ بِكُلِّ شَیْءٍ عَلِیْمًا",
    "وَلِكُلٍّ جَعَلْنَا مَوَالِیَ مِمَّا تَرَكَ الْوَالِدٰنِ وَالْاَقْرَبُوْنَ وَالَّذِیْنَ عَقَدَتْ اَیْمَانُكُمْ فَاٰتُوْهُمْ نَصِیْبَهُمْ اِنَّ اللّٰهَ كَانَ عَلٰی كُلِّ شَیْءٍ شَهِیْدًا",
    "اَلرِّجَالُ قَوّٰمُوْنَ عَلَی النِّسَآءِ بِمَا فَضَّلَ اللّٰهُ بَعْضَهُمْ عَلٰی بَعْضٍ وَّبِمَاۤ اَنْفَقُوْا مِنْ اَمْوَالِهِمْ فَالصّٰلِحٰتُ قٰنِتٰتٌ حٰفِظٰتٌ لِّلْغَیْبِ بِمَا حَفِظَ اللّٰهُ وَالّٰتِیْ تَخَافُوْنَ نُشُوْزَهُنَّ فَعِظُوْهُنَّ وَاهْجُرُوْهُنَّ فِی الْمَضَاجِعِ وَاضْرِبُوْهُنَّ فَاِنْ اَطَعْنَكُمْ فَلَا تَبْغُوْا عَلَیْهِنَّ سَبِیْلًا اِنَّ اللّٰهَ كَانَ عَلِیًّا كَبِیْرًا",
    "وَاِنْ خِفْتُمْ شِقَاقَ بَیْنِهِمَا فَابْعَثُوْا حَكَمًا مِّنْ اَهْلِهٖ وَحَكَمًا مِّنْ اَهْلِهَا اِنْ یُّرِیْدَاۤ اِصْلَاحًا یُّوَفِّقِ اللّٰهُ بَیْنَهُمَا اِنَّ اللّٰهَ كَانَ عَلِیْمًا خَبِیْرًا",
    "وَاعْبُدُوا اللّٰهَ وَلَا تُشْرِكُوْا بِهٖ شَیْـًٔا وَّبِالْوَالِدَیْنِ اِحْسَانًا وَّبِذِی الْقُرْبٰی وَالْیَتٰمٰی وَالْمَسٰكِیْنِ وَالْجَارِ ذِی الْقُرْبٰی وَالْجَارِ الْجُنُبِ وَالصَّاحِبِ بِالْجَنْۢبِ وَابْنِ السَّبِیْلِ وَمَا مَلَكَتْ اَیْمَانُكُمْ اِنَّ اللّٰهَ لَا یُحِبُّ مَنْ كَانَ مُخْتَالًا فَخُوْرَا",
    "١لَّذِیْنَ یَبْخَلُوْنَ وَیَاْمُرُوْنَ النَّاسَ بِالْبُخْلِ وَیَكْتُمُوْنَ مَاۤ اٰتٰىهُمُ اللّٰهُ مِنْ فَضْلِهٖ وَاَعْتَدْنَا لِلْكٰفِرِیْنَ عَذَابًا مُّهِیْنًا",
    "وَالَّذِیْنَ یُنْفِقُوْنَ اَمْوَالَهُمْ رِئَآءَ النَّاسِ وَلَا یُؤْمِنُوْنَ بِاللّٰهِ وَلَا بِالْیَوْمِ الْاٰخِرِ وَمَنْ یَّكُنِ الشَّیْطٰنُ لَهٗ قَرِیْنًا فَسَآءَ قَرِیْنًا",
    "وَمَاذَا عَلَیْهِمْ لَوْ اٰمَنُوْا بِاللّٰهِ وَالْیَوْمِ الْاٰخِرِ وَاَنْفَقُوْا مِمَّا رَزَقَهُمُ اللّٰهُ وَكَانَ اللّٰهُ بِهِمْ عَلِیْمًا",
    "اِنَّ اللّٰهَ لَا یَظْلِمُ مِثْقَالَ ذَرَّةٍ وَاِنْ تَكُ حَسَنَةً یُّضٰعِفْهَا وَیُؤْتِ مِنْ لَّدُنْهُ اَجْرًا عَظِیْمًا",
    "فَكَیْفَ اِذَا جِئْنَا مِنْ كُلِّ اُمَّةٍ بِشَهِیْدٍ وَّجِئْنَا بِكَ عَلٰی هٰۤؤُلَآءِ شَهِیْدًا",
    "یَوْمَىِٕذٍ یَّوَدُّ الَّذِیْنَ كَفَرُوْا وَعَصَوُا الرَّسُوْلَ لَوْ تُسَوّٰی بِهِمُ الْاَرْضُ وَلَا یَكْتُمُوْنَ اللّٰهَ حَدِیْثًا",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا تَقْرَبُوا الصَّلٰوةَ وَاَنْتُمْ سُكٰرٰی حَتّٰی تَعْلَمُوْا مَا تَقُوْلُوْنَ وَلَا جُنُبًا اِلَّا عَابِرِیْ سَبِیْلٍ حَتّٰی تَغْتَسِلُوْا وَاِنْ كُنْتُمْ مَّرْضٰۤی اَوْ عَلٰی سَفَرٍ اَوْ جَآءَ اَحَدٌ مِّنْكُمْ مِّنَ الْغَآىِٕطِ اَوْ لٰمَسْتُمُ النِّسَآءَ فَلَمْ تَجِدُوْا مَآءً فَتَیَمَّمُوْا صَعِیْدًا طَیِّبًا فَامْسَحُوْا بِوُجُوْهِكُمْ وَاَیْدِیْكُمْ اِنَّ اللّٰهَ كَانَ عَفُوًّا غَفُوْرًا",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ اُوْتُوْا نَصِیْبًا مِّنَ الْكِتٰبِ یَشْتَرُوْنَ الضَّلٰلَةَ وَیُرِیْدُوْنَ اَنْ تَضِلُّوا السَّبِیْلَ",
    "وَاللّٰهُ اَعْلَمُ بِاَعْدَآىِٕكُمْ وَكَفٰی بِاللّٰهِ وَلِیًّا وَّكَفٰی بِاللّٰهِ نَصِیْرًا",
    "مِنَ الَّذِیْنَ هَادُوْا یُحَرِّفُوْنَ الْكَلِمَ عَنْ مَّوَاضِعِهٖ وَیَقُوْلُوْنَ سَمِعْنَا وَعَصَیْنَا وَاسْمَعْ غَیْرَ مُسْمَعٍ وَّرَاعِنَا لَیًّا بِاَلْسِنَتِهِمْ وَطَعْنًا فِی الدِّیْنِ وَلَوْ اَنَّهُمْ قَالُوْا سَمِعْنَا وَاَطَعْنَا وَاسْمَعْ وَانْظُرْنَا لَكَانَ خَیْرًا لَّهُمْ وَاَقْوَمَ وَلٰكِنْ لَّعَنَهُمُ اللّٰهُ بِكُفْرِهِمْ فَلَا یُؤْمِنُوْنَ اِلَّا قَلِیْلًا",
    "یٰۤاَیُّهَا الَّذِیْنَ اُوْتُوا الْكِتٰبَ اٰمِنُوْا بِمَا نَزَّلْنَا مُصَدِّقًا لِّمَا مَعَكُمْ مِّنْ قَبْلِ اَنْ نَّطْمِسَ وُجُوْهًا فَنَرُدَّهَا عَلٰۤی اَدْبَارِهَاۤ اَوْ نَلْعَنَهُمْ كَمَا لَعَنَّاۤ اَصْحٰبَ السَّبْتِ وَكَانَ اَمْرُ اللّٰهِ مَفْعُوْلًا",
    "اِنَّ اللّٰهَ لَا یَغْفِرُ اَنْ یُّشْرَكَ بِهٖ وَیَغْفِرُ مَا دُوْنَ ذٰلِكَ لِمَنْ یَّشَآءُ وَمَنْ یُّشْرِكْ بِاللّٰهِ فَقَدِ افْتَرٰۤی اِثْمًا عَظِیْمًا",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ یُزَكُّوْنَ اَنْفُسَهُمْ بَلِ اللّٰهُ یُزَكِّیْ مَنْ یَّشَآءُ وَلَا یُظْلَمُوْنَ فَتِیْلًا",
    "اُنْظُرْ كَیْفَ یَفْتَرُوْنَ عَلَی اللّٰهِ الْكَذِبَ وَكَفٰی بِهٖۤ اِثْمًا مُّبِیْنًا",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ اُوْتُوْا نَصِیْبًا مِّنَ الْكِتٰبِ یُؤْمِنُوْنَ بِالْجِبْتِ وَالطَّاغُوْتِ وَیَقُوْلُوْنَ لِلَّذِیْنَ كَفَرُوْا هٰۤؤُلَآءِ اَهْدٰی مِنَ الَّذِیْنَ اٰمَنُوْا سَبِیْلًا",
    "اُولٰٓىِٕكَ الَّذِیْنَ لَعَنَهُمُ اللّٰهُ وَمَنْ یَّلْعَنِ اللّٰهُ فَلَنْ تَجِدَ لَهٗ نَصِیْرًا",
    "اَمْ لَهُمْ نَصِیْبٌ مِّنَ الْمُلْكِ فَاِذًا لَّا یُؤْتُوْنَ النَّاسَ نَقِیْرًا",
    "اَمْ یَحْسُدُوْنَ النَّاسَ عَلٰی مَاۤ اٰتٰىهُمُ اللّٰهُ مِنْ فَضْلِهٖ فَقَدْ اٰتَیْنَاۤ اٰلَ اِبْرٰهِیْمَ الْكِتٰبَ وَالْحِكْمَةَ وَاٰتَیْنٰهُمْ مُّلْكًا عَظِیْمًا",
    "فَمِنْهُمْ مَّنْ اٰمَنَ بِهٖ وَمِنْهُمْ مَّنْ صَدَّ عَنْهُ وَكَفٰی بِجَهَنَّمَ سَعِیْرًا",
    "اِنَّ الَّذِیْنَ كَفَرُوْا بِاٰیٰتِنَا سَوْفَ نُصْلِیْهِمْ نَارًا كُلَّمَا نَضِجَتْ جُلُوْدُهُمْ بَدَّلْنٰهُمْ جُلُوْدًا غَیْرَهَا لِیَذُوْقُوا الْعَذَابَ اِنَّ اللّٰهَ كَانَ عَزِیْزًا حَكِیْمًا",
    "وَالَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ سَنُدْخِلُهُمْ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِیْنَ فِیْهَاۤ اَبَدًا لَهُمْ فِیْهَاۤ اَزْوَاجٌ مُّطَهَّرَةٌ وَّنُدْخِلُهُمْ ظِلًّا ظَلِیْلًا",
    "اِنَّ اللّٰهَ یَاْمُرُكُمْ اَنْ تُؤَدُّوا الْاَمٰنٰتِ اِلٰۤی اَهْلِهَا وَاِذَا حَكَمْتُمْ بَیْنَ النَّاسِ اَنْ تَحْكُمُوْا بِالْعَدْلِ اِنَّ اللّٰهَ نِعِمَّا یَعِظُكُمْ بِهٖ اِنَّ اللّٰهَ كَانَ سَمِیْعًا بَصِیْرًا",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اَطِیْعُوا اللّٰهَ وَاَطِیْعُوا الرَّسُوْلَ وَاُولِی الْاَمْرِ مِنْكُمْ فَاِنْ تَنَازَعْتُمْ فِیْ شَیْءٍ فَرُدُّوْهُ اِلَی اللّٰهِ وَالرَّسُوْلِ اِنْ كُنْتُمْ تُؤْمِنُوْنَ بِاللّٰهِ وَالْیَوْمِ الْاٰخِرِ ذٰلِكَ خَیْرٌ وَّاَحْسَنُ تَاْوِیْلًا",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ یَزْعُمُوْنَ اَنَّهُمْ اٰمَنُوْا بِمَاۤ اُنْزِلَ اِلَیْكَ وَمَاۤ اُنْزِلَ مِنْ قَبْلِكَ یُرِیْدُوْنَ اَنْ یَّتَحَاكَمُوْۤا اِلَی الطَّاغُوْتِ وَقَدْ اُمِرُوْۤا اَنْ یَّكْفُرُوْا بِهٖ وَیُرِیْدُ الشَّیْطٰنُ اَنْ یُّضِلَّهُمْ ضَلٰلًا بَعِیْدًا",
    "وَاِذَا قِیْلَ لَهُمْ تَعَالَوْا اِلٰی مَاۤ اَنْزَلَ اللّٰهُ وَاِلَی الرَّسُوْلِ رَاَیْتَ الْمُنٰفِقِیْنَ یَصُدُّوْنَ عَنْكَ صُدُوْدًا",
    "فَكَیْفَ اِذَاۤ اَصَابَتْهُمْ مُّصِیْبَةٌ بِمَا قَدَّمَتْ اَیْدِیْهِمْ ثُمَّ جَآءُوْكَ یَحْلِفُوْنَ ۖ بِاللّٰهِ اِنْ اَرَدْنَاۤ اِلَّاۤ اِحْسَانًا وَّتَوْفِیْقًا",
    "اُولٰٓىِٕكَ الَّذِیْنَ یَعْلَمُ اللّٰهُ مَا فِیْ قُلُوْبِهِمْ فَاَعْرِضْ عَنْهُمْ وَعِظْهُمْ وَقُلْ لَّهُمْ فِیْۤ اَنْفُسِهِمْ قَوْلًا بَلِیْغًا",
    "وَمَاۤ اَرْسَلْنَا مِنْ رَّسُوْلٍ اِلَّا لِیُطَاعَ بِاِذْنِ اللّٰهِ وَلَوْ اَنَّهُمْ اِذْ ظَّلَمُوْۤا اَنْفُسَهُمْ جَآءُوْكَ فَاسْتَغْفَرُوا اللّٰهَ وَاسْتَغْفَرَ لَهُمُ الرَّسُوْلُ لَوَجَدُوا اللّٰهَ تَوَّابًا رَّحِیْمًا",
    "فَلَا وَرَبِّكَ لَا یُؤْمِنُوْنَ حَتّٰی یُحَكِّمُوْكَ فِیْمَا شَجَرَ بَیْنَهُمْ ثُمَّ لَا یَجِدُوْا فِیْۤ اَنْفُسِهِمْ حَرَجًا مِّمَّا قَضَیْتَ وَیُسَلِّمُوْا تَسْلِیْمًا",
    "وَلَوْ اَنَّا كَتَبْنَا عَلَیْهِمْ اَنِ اقْتُلُوْۤا اَنْفُسَكُمْ اَوِ اخْرُجُوْا مِنْ دِیَارِكُمْ مَّا فَعَلُوْهُ اِلَّا قَلِیْلٌ مِّنْهُمْ وَلَوْ اَنَّهُمْ فَعَلُوْا مَا یُوْعَظُوْنَ بِهٖ لَكَانَ خَیْرًا لَّهُمْ وَاَشَدَّ تَثْبِیْتًا",
    "وَّاِذًا لَّاٰتَیْنٰهُمْ مِّنْ لَّدُنَّاۤ اَجْرًا عَظِیْمًا",
    "وَّلَهَدَیْنٰهُمْ صِرَاطًا مُّسْتَقِیْمًا",
    "وَمَنْ یُّطِعِ اللّٰهَ وَالرَّسُوْلَ فَاُولٰٓىِٕكَ مَعَ الَّذِیْنَ اَنْعَمَ اللّٰهُ عَلَیْهِمْ مِّنَ النَّبِیّٖنَ وَالصِّدِّیْقِیْنَ وَالشُّهَدَآءِ وَالصّٰلِحِیْنَ وَحَسُنَ اُولٰٓىِٕكَ رَفِیْقًا",
    "ذٰلِكَ الْفَضْلُ مِنَ اللّٰهِ وَكَفٰی بِاللّٰهِ عَلِیْمًا",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا خُذُوْا حِذْرَكُمْ فَانْفِرُوْا ثُبَاتٍ اَوِ انْفِرُوْا جَمِیْعًا",
    "وَاِنَّ مِنْكُمْ لَمَنْ لَّیُبَطِّئَنَّ فَاِنْ اَصَابَتْكُمْ مُّصِیْبَةٌ قَالَ قَدْ اَنْعَمَ اللّٰهُ عَلَیَّ اِذْ لَمْ اَكُنْ مَّعَهُمْ شَهِیْدًا",
    "وَلَىِٕنْ اَصَابَكُمْ فَضْلٌ مِّنَ اللّٰهِ لَیَقُوْلَنَّ كَاَنْ لَّمْ تَكُنْ بَیْنَكُمْ وَبَیْنَهٗ مَوَدَّةٌ یّٰلَیْتَنِیْ كُنْتُ مَعَهُمْ فَاَفُوْزَ فَوْزًا عَظِیْمًا",
    "فَلْیُقَاتِلْ فِیْ سَبِیْلِ اللّٰهِ الَّذِیْنَ یَشْرُوْنَ الْحَیٰوةَ الدُّنْیَا بِالْاٰخِرَةِ وَمَنْ یُّقَاتِلْ فِیْ سَبِیْلِ اللّٰهِ فَیُقْتَلْ اَوْ یَغْلِبْ فَسَوْفَ نُؤْتِیْهِ اَجْرًا عَظِیْمًا",
    "وَمَا لَكُمْ لَا تُقَاتِلُوْنَ فِیْ سَبِیْلِ اللّٰهِ وَالْمُسْتَضْعَفِیْنَ مِنَ الرِّجَالِ وَالنِّسَآءِ وَالْوِلْدَانِ الَّذِیْنَ یَقُوْلُوْنَ رَبَّنَاۤ اَخْرِجْنَا مِنْ هٰذِهِ الْقَرْیَةِ الظَّالِمِ اَهْلُهَا وَاجْعَلْ لَّنَا مِنْ لَّدُنْكَ وَلِیًّا وَّاجْعَلْ لَّنَا مِنْ لَّدُنْكَ نَصِیْرًا",
    "اَلَّذِیْنَ اٰمَنُوْا یُقَاتِلُوْنَ فِیْ سَبِیْلِ اللّٰهِ وَالَّذِیْنَ كَفَرُوْا یُقَاتِلُوْنَ فِیْ سَبِیْلِ الطَّاغُوْتِ فَقَاتِلُوْۤا اَوْلِیَآءَ الشَّیْطٰنِ اِنَّ كَیْدَ الشَّیْطٰنِ كَانَ ضَعِیْفًا",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ قِیْلَ لَهُمْ كُفُّوْۤا اَیْدِیَكُمْ وَاَقِیْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ فَلَمَّا كُتِبَ عَلَیْهِمُ الْقِتَالُ اِذَا فَرِیْقٌ مِّنْهُمْ یَخْشَوْنَ النَّاسَ كَخَشْیَةِ اللّٰهِ اَوْ اَشَدَّ خَشْیَةً وَقَالُوْا رَبَّنَا لِمَ كَتَبْتَ عَلَیْنَا الْقِتَالَ لَوْلَاۤ اَخَّرْتَنَاۤ اِلٰۤی اَجَلٍ قَرِیْبٍ قُلْ مَتَاعُ الدُّنْیَا قَلِیْلٌ وَالْاٰخِرَةُ خَیْرٌ لِّمَنِ اتَّقٰی ۫ وَلَا تُظْلَمُوْنَ فَتِیْلًا",
    "اَیْنَمَا تَكُوْنُوْا یُدْرِكْكُّمُ الْمَوْتُ وَلَوْ كُنْتُمْ فِیْ بُرُوْجٍ مُّشَیَّدَةٍ وَاِنْ تُصِبْهُمْ حَسَنَةٌ یَّقُوْلُوْا هٰذِهٖ مِنْ عِنْدِ اللّٰهِ وَاِنْ تُصِبْهُمْ سَیِّئَةٌ یَّقُوْلُوْا هٰذِهٖ مِنْ عِنْدِكَ قُلْ كُلٌّ مِّنْ عِنْدِ اللّٰهِ فَمَالِ هٰۤؤُلَآءِ الْقَوْمِ لَا یَكَادُوْنَ یَفْقَهُوْنَ حَدِیْثًا",
    "مَاۤ اَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللّٰهِ وَمَاۤ اَصَابَكَ مِنْ سَیِّئَةٍ فَمِنْ نَّفْسِكَ وَاَرْسَلْنٰكَ لِلنَّاسِ رَسُوْلًا وَكَفٰی بِاللّٰهِ شَهِیْدًا",
    "مَنْ یُّطِعِ الرَّسُوْلَ فَقَدْ اَطَاعَ اللّٰهَ وَمَنْ تَوَلّٰی فَمَاۤ اَرْسَلْنٰكَ عَلَیْهِمْ حَفِیْظًا",
    "وَیَقُوْلُوْنَ طَاعَةٌ فَاِذَا بَرَزُوْا مِنْ عِنْدِكَ بَیَّتَ طَآىِٕفَةٌ مِّنْهُمْ غَیْرَ الَّذِیْ تَقُوْلُ وَاللّٰهُ یَكْتُبُ مَا یُبَیِّتُوْنَ فَاَعْرِضْ عَنْهُمْ وَتَوَكَّلْ عَلَی اللّٰهِ وَكَفٰی بِاللّٰهِ وَكِیْلًا",
    "اَفَلَا یَتَدَبَّرُوْنَ الْقُرْاٰنَ وَلَوْ كَانَ مِنْ عِنْدِ غَیْرِ اللّٰهِ لَوَجَدُوْا فِیْهِ اخْتِلَافًا كَثِیْرًا",
    "وَاِذَا جَآءَهُمْ اَمْرٌ مِّنَ الْاَمْنِ اَوِ الْخَوْفِ اَذَاعُوْا بِهٖ وَلَوْ رَدُّوْهُ اِلَی الرَّسُوْلِ وَاِلٰۤی اُولِی الْاَمْرِ مِنْهُمْ لَعَلِمَهُ الَّذِیْنَ یَسْتَنْۢبِطُوْنَهٗ مِنْهُمْ وَلَوْلَا فَضْلُ اللّٰهِ عَلَیْكُمْ وَرَحْمَتُهٗ لَاتَّبَعْتُمُ الشَّیْطٰنَ اِلَّا قَلِیْلًا",
    "فَقَاتِلْ فِیْ سَبِیْلِ اللّٰهِ لَا تُكَلَّفُ اِلَّا نَفْسَكَ وَحَرِّضِ الْمُؤْمِنِیْنَ عَسَی اللّٰهُ اَنْ یَّكُفَّ بَاْسَ الَّذِیْنَ كَفَرُوْا وَاللّٰهُ اَشَدُّ بَاْسًا وَّاَشَدُّ تَنْكِیْلًا",
    "مَنْ یَّشْفَعْ شَفَاعَةً حَسَنَةً یَّكُنْ لَّهٗ نَصِیْبٌ مِّنْهَا وَمَنْ یَّشْفَعْ شَفَاعَةً سَیِّئَةً یَّكُنْ لَّهٗ كِفْلٌ مِّنْهَا وَكَانَ اللّٰهُ عَلٰی كُلِّ شَیْءٍ مُّقِیْتًا",
    "وَاِذَا حُیِّیْتُمْ بِتَحِیَّةٍ فَحَیُّوْا بِاَحْسَنَ مِنْهَاۤ اَوْ رُدُّوْهَا اِنَّ اللّٰهَ كَانَ عَلٰی كُلِّ شَیْءٍ حَسِیْبًا",
    "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ لَیَجْمَعَنَّكُمْ اِلٰی یَوْمِ الْقِیٰمَةِ لَا رَیْبَ فِیْهِ وَمَنْ اَصْدَقُ مِنَ اللّٰهِ حَدِیْثًا",
    "فَمَا لَكُمْ فِی الْمُنٰفِقِیْنَ فِئَتَیْنِ وَاللّٰهُ اَرْكَسَهُمْ بِمَا كَسَبُوْا اَتُرِیْدُوْنَ اَنْ تَهْدُوْا مَنْ اَضَلَّ اللّٰهُ وَمَنْ یُّضْلِلِ اللّٰهُ فَلَنْ تَجِدَ لَهٗ سَبِیْلًا",
    "وَدُّوْا لَوْ تَكْفُرُوْنَ كَمَا كَفَرُوْا فَتَكُوْنُوْنَ سَوَآءً فَلَا تَتَّخِذُوْا مِنْهُمْ اَوْلِیَآءَ حَتّٰی یُهَاجِرُوْا فِیْ سَبِیْلِ اللّٰهِ فَاِنْ تَوَلَّوْا فَخُذُوْهُمْ وَاقْتُلُوْهُمْ حَیْثُ وَجَدْتُّمُوْهُمْ وَلَا تَتَّخِذُوْا مِنْهُمْ وَلِیًّا وَّلَا نَصِیْرًا",
    "اِلَّا الَّذِیْنَ یَصِلُوْنَ اِلٰی قَوْمٍ بَیْنَكُمْ وَبَیْنَهُمْ مِّیْثَاقٌ اَوْ جَآءُوْكُمْ حَصِرَتْ صُدُوْرُهُمْ اَنْ یُّقَاتِلُوْكُمْ اَوْ یُقَاتِلُوْا قَوْمَهُمْ وَلَوْ شَآءَ اللّٰهُ لَسَلَّطَهُمْ عَلَیْكُمْ فَلَقٰتَلُوْكُمْ فَاِنِ اعْتَزَلُوْكُمْ فَلَمْ یُقَاتِلُوْكُمْ وَاَلْقَوْا اِلَیْكُمُ السَّلَمَ فَمَا جَعَلَ اللّٰهُ لَكُمْ عَلَیْهِمْ سَبِیْلًا",
    "سَتَجِدُوْنَ اٰخَرِیْنَ یُرِیْدُوْنَ اَنْ یَّاْمَنُوْكُمْ وَیَاْمَنُوْا قَوْمَهُمْ كُلَّ مَا رُدُّوْۤا اِلَی الْفِتْنَةِ اُرْكِسُوْا فِیْهَا فَاِنْ لَّمْ یَعْتَزِلُوْكُمْ وَیُلْقُوْۤا اِلَیْكُمُ السَّلَمَ وَیَكُفُّوْۤا اَیْدِیَهُمْ فَخُذُوْهُمْ وَاقْتُلُوْهُمْ حَیْثُ ثَقِفْتُمُوْهُمْ وَاُولٰٓىِٕكُمْ جَعَلْنَا لَكُمْ عَلَیْهِمْ سُلْطٰنًا مُّبِیْنًا",
    "وَمَا كَانَ لِمُؤْمِنٍ اَنْ یَّقْتُلَ مُؤْمِنًا اِلَّا خَطَأً وَمَنْ قَتَلَ مُؤْمِنًا خَطَأً فَتَحْرِیْرُ رَقَبَةٍ مُّؤْمِنَةٍ وَّدِیَةٌ مُّسَلَّمَةٌ اِلٰۤی اَهْلِهٖۤ اِلَّاۤ اَنْ یَّصَّدَّقُوْا فَاِنْ كَانَ مِنْ قَوْمٍ عَدُوٍّ لَّكُمْ وَهُوَ مُؤْمِنٌ فَتَحْرِیْرُ رَقَبَةٍ مُّؤْمِنَةٍ وَاِنْ كَانَ مِنْ قَوْمٍ بَیْنَكُمْ وَبَیْنَهُمْ مِّیْثَاقٌ فَدِیَةٌ مُّسَلَّمَةٌ اِلٰۤی اَهْلِهٖ وَتَحْرِیْرُ رَقَبَةٍ مُّؤْمِنَةٍ فَمَنْ لَّمْ یَجِدْ فَصِیَامُ شَهْرَیْنِ مُتَتَابِعَیْنِ تَوْبَةً مِّنَ اللّٰهِ وَكَانَ اللّٰهُ عَلِیْمًا حَكِیْمًا",
    "وَمَنْ یَّقْتُلْ مُؤْمِنًا مُّتَعَمِّدًا فَجَزَآؤُهٗ جَهَنَّمُ خَلِدًا فِیْهَا وَغَضِبَ اللّٰهُ عَلَیْهِ وَلَعَنَهٗ وَاَعَدَّ لَهٗ عَذَابًا عَظِیْمًا",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اِذَا ضَرَبْتُمْ فِیْ سَبِیْلِ اللّٰهِ فَتَبَیَّنُوْا وَلَا تَقُوْلُوْا لِمَنْ اَلْقٰۤی اِلَیْكُمُ السَّلٰمَ لَسْتَ مُؤْمِنًا تَبْتَغُوْنَ عَرَضَ الْحَیٰوةِ الدُّنْیَا فَعِنْدَ اللّٰهِ مَغَانِمُ كَثِیْرَةٌ كَذٰلِكَ كُنْتُمْ مِّنْ قَبْلُ فَمَنَّ اللّٰهُ عَلَیْكُمْ فَتَبَیَّنُوْا اِنَّ اللّٰهَ كَانَ بِمَا تَعْمَلُوْنَ خَبِیْرًا",
    "لَا یَسْتَوِی الْقٰعِدُوْنَ مِنَ الْمُؤْمِنِیْنَ غَیْرُ اُولِی الضَّرَرِ وَالْمُجٰهِدُوْنَ فِیْ سَبِیْلِ اللّٰهِ بِاَمْوَالِهِمْ وَاَنْفُسِهِمْ فَضَّلَ اللّٰهُ الْمُجٰهِدِیْنَ بِاَمْوَالِهِمْ وَاَنْفُسِهِمْ عَلَی الْقٰعِدِیْنَ دَرَجَةً وَكُلًّا وَّعَدَ اللّٰهُ الْحُسْنٰی وَفَضَّلَ اللّٰهُ الْمُجٰهِدِیْنَ عَلَی الْقٰعِدِیْنَ اَجْرًا عَظِیْمًا",
    "دَرَجٰتٍ مِّنْهُ وَمَغْفِرَةً وَّرَحْمَةً وَكَانَ اللّٰهُ غَفُوْرًا رَّحِیْمًا",
    "اِنَّ الَّذِیْنَ تَوَفّٰىهُمُ الْمَلٰٓىِٕكَةُ ظَالِمِیْۤ اَنْفُسِهِمْ قَالُوْا فِیْمَ كُنْتُمْ قَالُوْا كُنَّا مُسْتَضْعَفِیْنَ فِی الْاَرْضِ قَالُوْۤا اَلَمْ تَكُنْ اَرْضُ اللّٰهِ وَاسِعَةً فَتُهَاجِرُوْا فِیْهَا فَاُولٰٓىِٕكَ مَاْوٰىهُمْ جَهَنَّمُ وَسَآءَتْ مَصِیْرًا",
    "اِلَّا الْمُسْتَضْعَفِیْنَ مِنَ الرِّجَالِ وَالنِّسَآءِ وَالْوِلْدَانِ لَا یَسْتَطِیْعُوْنَ حِیْلَةً وَّلَا یَهْتَدُوْنَ سَبِیْلًا",
    "فَاُولٰٓىِٕكَ عَسَی اللّٰهُ اَنْ یَّعْفُوَ عَنْهُمْ وَكَانَ اللّٰهُ عَفُوًّا غَفُوْرًا",
    "وَمَنْ یُّهَاجِرْ فِیْ سَبِیْلِ اللّٰهِ یَجِدْ فِی الْاَرْضِ مُرٰغَمًا كَثِیْرًا وَّسَعَةً وَمَنْ یَّخْرُجْ مِنْ بَیْتِهٖ مُهَاجِرًا اِلَی اللّٰهِ وَرَسُوْلِهٖ ثُمَّ یُدْرِكْهُ الْمَوْتُ فَقَدْ وَقَعَ اَجْرُهٗ عَلَی اللّٰهِ وَكَانَ اللّٰهُ غَفُوْرًا رَّحِیْمًا",
    "وَاِذَا ضَرَبْتُمْ فِی الْاَرْضِ فَلَیْسَ عَلَیْكُمْ جُنَاحٌ اَنْ تَقْصُرُوْا مِنَ الصَّلٰوةِ ۖ اِنْ خِفْتُمْ اَنْ یَّفْتِنَكُمُ الَّذِیْنَ كَفَرُوْا اِنَّ الْكٰفِرِیْنَ كَانُوْا لَكُمْ عَدُوًّا مُّبِیْنًا",
    "وَاِذَا كُنْتَ فِیْهِمْ فَاَقَمْتَ لَهُمُ الصَّلٰوةَ فَلْتَقُمْ طَآىِٕفَةٌ مِّنْهُمْ مَّعَكَ وَلْیَاْخُذُوْۤا اَسْلِحَتَهُمْ ۫ فَاِذَا سَجَدُوْا فَلْیَكُوْنُوْا مِنْ وَّرَآىِٕكُمْ وَلْتَاْتِ طَآىِٕفَةٌ اُخْرٰی لَمْ یُصَلُّوْا فَلْیُصَلُّوْا مَعَكَ وَلْیَاْخُذُوْا حِذْرَهُمْ وَاَسْلِحَتَهُمْ وَدَّ الَّذِیْنَ كَفَرُوْا لَوْ تَغْفُلُوْنَ عَنْ اَسْلِحَتِكُمْ وَاَمْتِعَتِكُمْ فَیَمِیْلُوْنَ عَلَیْكُمْ مَّیْلَةً وَّاحِدَةً وَلَا جُنَاحَ عَلَیْكُمْ اِنْ كَانَ بِكُمْ اَذًی مِّنْ مَّطَرٍ اَوْ كُنْتُمْ مَّرْضٰۤی اَنْ تَضَعُوْۤا اَسْلِحَتَكُمْ وَخُذُوْا حِذْرَكُمْ اِنَّ اللّٰهَ اَعَدَّ لِلْكٰفِرِیْنَ عَذَابًا مُّهِیْنًا",
    "فَاِذَا قَضَیْتُمُ الصَّلٰوةَ فَاذْكُرُوا اللّٰهَ قِیٰمًا وَّقُعُوْدًا وَّعَلٰی جُنُوْبِكُمْ فَاِذَا اطْمَاْنَنْتُمْ فَاَقِیْمُوا الصَّلٰوةَ اِنَّ الصَّلٰوةَ كَانَتْ عَلَی الْمُؤْمِنِیْنَ كِتٰبًا مَّوْقُوْتًا",
    "وَلَا تَهِنُوْا فِی ابْتِغَآءِ الْقَوْمِ اِنْ تَكُوْنُوْا تَاْلَمُوْنَ فَاِنَّهُمْ یَاْلَمُوْنَ كَمَا تَاْلَمُوْنَ وَتَرْجُوْنَ مِنَ اللّٰهِ مَا لَا یَرْجُوْنَ وَكَانَ اللّٰهُ عَلِیْمًا حَكِیْمًا",
    "اِنَّاۤ اَنْزَلْنَاۤ اِلَیْكَ الْكِتٰبَ بِالْحَقِّ لِتَحْكُمَ بَیْنَ النَّاسِ بِمَاۤ اَرٰىكَ اللّٰهُ وَلَا تَكُنْ لِّلْخَآىِٕنِیْنَ خَصِیْمًا",
    "وَّاسْتَغْفِرِ اللّٰهَ اِنَّ اللّٰهَ كَانَ غَفُوْرًا رَّحِیْمًا",
    "وَلَا تُجَادِلْ عَنِ الَّذِیْنَ یَخْتَانُوْنَ اَنْفُسَهُمْ اِنَّ اللّٰهَ لَا یُحِبُّ مَنْ كَانَ خَوَّانًا اَثِیْمًا",
    "یَّسْتَخْفُوْنَ مِنَ النَّاسِ وَلَا یَسْتَخْفُوْنَ مِنَ اللّٰهِ وَهُوَ مَعَهُمْ اِذْ یُبَیِّتُوْنَ مَا لَا یَرْضٰی مِنَ الْقَوْلِ وَكَانَ اللّٰهُ بِمَا یَعْمَلُوْنَ مُحِیْطًا",
    "هٰۤاَنْتُمْ هٰۤؤُلَآءِ جَدَلْتُمْ عَنْهُمْ فِی الْحَیٰوةِ الدُّنْیَا ۫ فَمَنْ یُّجَادِلُ اللّٰهَ عَنْهُمْ یَوْمَ الْقِیٰمَةِ اَمْ مَّنْ یَّكُوْنُ عَلَیْهِمْ وَكِیْلًا",
    "وَمَنْ یَّعْمَلْ سُوْٓءًا اَوْ یَظْلِمْ نَفْسَهٗ ثُمَّ یَسْتَغْفِرِ اللّٰهَ یَجِدِ اللّٰهَ غَفُوْرًا رَّحِیْمًا",
    "وَمَنْ یَّكْسِبْ اِثْمًا فَاِنَّمَا یَكْسِبُهٗ عَلٰی نَفْسِهٖ وَكَانَ اللّٰهُ عَلِیْمًا حَكِیْمًا",
    "وَمَنْ یَّكْسِبْ خَطِیْٓئَةً اَوْ اِثْمًا ثُمَّ یَرْمِ بِهٖ بَرِیْٓـًٔا فَقَدِ احْتَمَلَ بُهْتَانًا وَّاِثْمًا مُّبِیْنًا",
    "وَلَوْلَا فَضْلُ اللّٰهِ عَلَیْكَ وَرَحْمَتُهٗ لَهَمَّتْ طَّآىِٕفَةٌ مِّنْهُمْ اَنْ یُّضِلُّوْكَ وَمَا یُضِلُّوْنَ اِلَّاۤ اَنْفُسَهُمْ وَمَا یَضُرُّوْنَكَ مِنْ شَیْءٍ وَاَنْزَلَ اللّٰهُ عَلَیْكَ الْكِتٰبَ وَالْحِكْمَةَ وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ وَكَانَ فَضْلُ اللّٰهِ عَلَیْكَ عَظِیْمًا",
    "لَا خَیْرَ فِیْ كَثِیْرٍ مِّنْ نَّجْوٰىهُمْ اِلَّا مَنْ اَمَرَ بِصَدَقَةٍ اَوْ مَعْرُوْفٍ اَوْ اِصْلَاحٍ بَیْنَ النَّاسِ وَمَنْ یَّفْعَلْ ذٰلِكَ ابْتِغَآءَ مَرْضَاتِ اللّٰهِ فَسَوْفَ نُؤْتِیْهِ اَجْرًا عَظِیْمًا",
    "وَمَنْ یُّشَاقِقِ الرَّسُوْلَ مِنْ بَعْدِ مَا تَبَیَّنَ لَهُ الْهُدٰی وَیَتَّبِعْ غَیْرَ سَبِیْلِ الْمُؤْمِنِیْنَ نُوَلِّهٖ مَا تَوَلّٰی وَنُصْلِهٖ جَهَنَّمَ وَسَآءَتْ مَصِیْرًا",
    "اِنَّ اللّٰهَ لَا یَغْفِرُ اَنْ یُّشْرَكَ بِهٖ وَیَغْفِرُ مَا دُوْنَ ذٰلِكَ لِمَنْ یَّشَآءُ وَمَنْ یُّشْرِكْ بِاللّٰهِ فَقَدْ ضَلَّ ضَلٰلًا بَعِیْدًا",
    "اِنْ یَّدْعُوْنَ مِنْ دُوْنِهٖۤ اِلَّاۤ اِنٰثًا وَاِنْ یَّدْعُوْنَ اِلَّا شَیْطٰنًا مَّرِیْدًا",
    "لَّعَنَهُ اللّٰهُ وَقَالَ لَاَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِیْبًا مَّفْرُوْضًا",
    "وَّلَاُضِلَّنَّهُمْ وَلَاُمَنِّیَنَّهُمْ وَلَاٰمُرَنَّهُمْ فَلَیُبَتِّكُنَّ اٰذَانَ الْاَنْعَامِ وَلَاٰمُرَنَّهُمْ فَلَیُغَیِّرُنَّ خَلْقَ اللّٰهِ وَمَنْ یَّتَّخِذِ الشَّیْطٰنَ وَلِیًّا مِّنْ دُوْنِ اللّٰهِ فَقَدْ خَسِرَ خُسْرَانًا مُّبِیْنًا",
    "یَعِدُهُمْ وَیُمَنِّیْهِمْ وَمَا یَعِدُهُمُ الشَّیْطٰنُ اِلَّا غُرُوْرًا",
    "اُولٰٓىِٕكَ مَاْوٰىهُمْ جَهَنَّمُ وَلَا یَجِدُوْنَ عَنْهَا مَحِیْصًا",
    "وَالَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ سَنُدْخِلُهُمْ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِیْنَ فِیْهَاۤ اَبَدًا وَعْدَ اللّٰهِ حَقًّا وَمَنْ اَصْدَقُ مِنَ اللّٰهِ قِیْلًا",
    "لَیْسَ بِاَمَانِیِّكُمْ وَلَاۤ اَمَانِیِّ اَهْلِ الْكِتٰبِ مَنْ یَّعْمَلْ سُوْٓءًا یُّجْزَ بِهٖ وَلَا یَجِدْ لَهٗ مِنْ دُوْنِ اللّٰهِ وَلِیًّا وَّلَا نَصِیْرًا",
    "وَمَنْ یَّعْمَلْ مِنَ الصّٰلِحٰتِ مِنْ ذَكَرٍ اَوْ اُ وَهُوَ مُؤْمِنٌ فَاُولٰٓىِٕكَ یَدْخُلُوْنَ الْجَنَّةَ وَلَا یُظْلَمُوْنَ نَقِیْرًا",
    "وَمَنْ اَحْسَنُ دِیْنًا مِّمَّنْ اَسْلَمَ وَجْهَهٗ لِلّٰهِ وَهُوَ مُحْسِنٌ وَّاتَّبَعَ مِلَّةَ اِبْرٰهِیْمَ حَنِیْفًا وَاتَّخَذَ اللّٰهُ اِبْرٰهِیْمَ خَلِیْلًا",
    "وَلِلّٰهِ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَكَانَ اللّٰهُ بِكُلِّ شَیْءٍ مُّحِیْطًا",
    "وَیَسْتَفْتُوْنَكَ فِی النِّسَآءِ قُلِ اللّٰهُ یُفْتِیْكُمْ فِیْهِنَّ وَمَا یُتْلٰی عَلَیْكُمْ فِی الْكِتٰبِ فِیْ یَتٰمَی النِّسَآءِ الّٰتِیْ لَا تُؤْتُوْنَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُوْنَ اَنْ تَنْكِحُوْهُنَّ وَالْمُسْتَضْعَفِیْنَ مِنَ الْوِلْدَانِ وَاَنْ تَقُوْمُوْا لِلْیَتٰمٰی بِالْقِسْطِ وَمَا تَفْعَلُوْا مِنْ خَیْرٍ فَاِنَّ اللّٰهَ كَانَ بِهٖ عَلِیْمًا",
    "وَاِنِ امْرَاَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوْزًا اَوْ اِعْرَاضًا فَلَا جُنَاحَ عَلَیْهِمَاۤ اَنْ یُّصْلِحَا بَیْنَهُمَا صُلْحًا وَالصُّلْحُ خَیْرٌ وَاُحْضِرَتِ الْاَنْفُسُ الشُّحَّ وَاِنْ تُحْسِنُوْا وَتَتَّقُوْا فَاِنَّ اللّٰهَ كَانَ بِمَا تَعْمَلُوْنَ خَبِیْرًا",
    "وَلَنْ تَسْتَطِیْعُوْۤا اَنْ تَعْدِلُوْا بَیْنَ النِّسَآءِ وَلَوْ حَرَصْتُمْ فَلَا تَمِیْلُوْا كُلَّ الْمَیْلِ فَتَذَرُوْهَا كَالْمُعَلَّقَةِ وَاِنْ تُصْلِحُوْا وَتَتَّقُوْا فَاِنَّ اللّٰهَ كَانَ غَفُوْرًا رَّحِیْمًا",
    "وَاِنْ یَّتَفَرَّقَا یُغْنِ اللّٰهُ كُلًّا مِّنْ سَعَتِهٖ وَكَانَ اللّٰهُ وَاسِعًا حَكِیْمًا",
    "وَلِلّٰهِ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَلَقَدْ وَصَّیْنَا الَّذِیْنَ اُوْتُوا الْكِتٰبَ مِنْ قَبْلِكُمْ وَاِیَّاكُمْ اَنِ اتَّقُوا اللّٰهَ وَاِنْ تَكْفُرُوْا فَاِنَّ لِلّٰهِ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَكَانَ اللّٰهُ غَنِیًّا حَمِیْدًا",
    "وَلِلّٰهِ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَكَفٰی بِاللّٰهِ وَكِیْلًا",
    "اِنْ یَّشَاْ یُذْهِبْكُمْ اَیُّهَا النَّاسُ وَیَاْتِ بِاٰخَرِیْنَ وَكَانَ اللّٰهُ عَلٰی ذٰلِكَ قَدِیْرًا",
    "مَنْ كَانَ یُرِیْدُ ثَوَابَ الدُّنْیَا فَعِنْدَ اللّٰهِ ثَوَابُ الدُّنْیَا وَالْاٰخِرَةِ وَكَانَ اللّٰهُ سَمِیْعًا بَصِیْرًا",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا كُوْنُوْا قَوّٰمِیْنَ بِالْقِسْطِ شُهَدَآءَ لِلّٰهِ وَلَوْ عَلٰۤی اَنْفُسِكُمْ اَوِ الْوَالِدَیْنِ وَالْاَقْرَبِیْنَ اِنْ یَّكُنْ غَنِیًّا اَوْ فَقِیْرًا فَاللّٰهُ اَوْلٰی بِهِمَا ۫ فَلَا تَتَّبِعُوا الْهَوٰۤی اَنْ تَعْدِلُوْا وَاِنْ تَلْوٗۤا اَوْ تُعْرِضُوْا فَاِنَّ اللّٰهَ كَانَ بِمَا تَعْمَلُوْنَ خَبِیْرًا",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اٰمِنُوْا بِاللّٰهِ وَرَسُوْلِهٖ وَالْكِتٰبِ الَّذِیْ نَزَّلَ عَلٰی رَسُوْلِهٖ وَالْكِتٰبِ الَّذِیْۤ اَنْزَلَ مِنْ قَبْلُ وَمَنْ یَّكْفُرْ بِاللّٰهِ وَمَلٰٓىِٕكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ وَالْیَوْمِ الْاٰخِرِ فَقَدْ ضَلَّ ضَلٰلًا بَعِیْدًا",
    "اِنَّ الَّذِیْنَ اٰمَنُوْا ثُمَّ كَفَرُوْا ثُمَّ اٰمَنُوْا ثُمَّ كَفَرُوْا ثُمَّ ازْدَادُوْا كُفْرًا لَّمْ یَكُنِ اللّٰهُ لِیَغْفِرَ لَهُمْ وَلَا لِیَهْدِیَهُمْ سَبِیْلًا",
    "بَشِّرِ الْمُنٰفِقِیْنَ بِاَنَّ لَهُمْ عَذَابًا اَلِیْمَا",
    "١لَّذِیْنَ یَتَّخِذُوْنَ الْكٰفِرِیْنَ اَوْلِیَآءَ مِنْ دُوْنِ الْمُؤْمِنِیْنَ اَیَبْتَغُوْنَ عِنْدَهُمُ الْعِزَّةَ فَاِنَّ الْعِزَّةَ لِلّٰهِ جَمِیْعًا",
    "وَقَدْ نَزَّلَ عَلَیْكُمْ فِی الْكِتٰبِ اَنْ اِذَا سَمِعْتُمْ اٰیٰتِ اللّٰهِ یُكْفَرُ بِهَا وَیُسْتَهْزَاُ بِهَا فَلَا تَقْعُدُوْا مَعَهُمْ حَتّٰی یَخُوْضُوْا فِیْ حَدِیْثٍ غَیْرِهٖۤ ۖ اِنَّكُمْ اِذًا مِّثْلُهُمْ اِنَّ اللّٰهَ جَامِعُ الْمُنٰفِقِیْنَ وَالْكٰفِرِیْنَ فِیْ جَهَنَّمَ جَمِیْعَا",
    "١لَّذِیْنَ یَتَرَبَّصُوْنَ بِكُمْ فَاِنْ كَانَ لَكُمْ فَتْحٌ مِّنَ اللّٰهِ قَالُوْۤا اَلَمْ نَكُنْ مَّعَكُمْ ۖ وَاِنْ كَانَ لِلْكٰفِرِیْنَ نَصِیْبٌ قَالُوْۤا اَلَمْ نَسْتَحْوِذْ عَلَیْكُمْ وَنَمْنَعْكُمْ مِّنَ الْمُؤْمِنِیْنَ فَاللّٰهُ یَحْكُمُ بَیْنَكُمْ یَوْمَ الْقِیٰمَةِ وَلَنْ یَّجْعَلَ اللّٰهُ لِلْكٰفِرِیْنَ عَلَی الْمُؤْمِنِیْنَ سَبِیْلًا",
    "اِنَّ الْمُنٰفِقِیْنَ یُخٰدِعُوْنَ اللّٰهَ وَهُوَ خَادِعُهُمْ وَاِذَا قَامُوْۤا اِلَی الصَّلٰوةِ قَامُوْا كُسَالٰی یُرَآءُوْنَ النَّاسَ وَلَا یَذْكُرُوْنَ اللّٰهَ اِلَّا قَلِیْلًا",
    "مُّذَبْذَبِیْنَ بَیْنَ ذٰلِكَ ۖ لَاۤ اِلٰی هٰۤؤُلَآءِ وَلَاۤ اِلٰی هٰۤؤُلَآءِ وَمَنْ یُّضْلِلِ اللّٰهُ فَلَنْ تَجِدَ لَهٗ سَبِیْلًا",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا تَتَّخِذُوا الْكٰفِرِیْنَ اَوْلِیَآءَ مِنْ دُوْنِ الْمُؤْمِنِیْنَ اَتُرِیْدُوْنَ اَنْ تَجْعَلُوْا لِلّٰهِ عَلَیْكُمْ سُلْطٰنًا مُّبِیْنًا",
    "اِنَّ الْمُنٰفِقِیْنَ فِی الدَّرْكِ الْاَسْفَلِ مِنَ النَّارِ وَلَنْ تَجِدَ لَهُمْ نَصِیْرًا",
    "اِلَّا الَّذِیْنَ تَابُوْا وَاَصْلَحُوْا وَاعْتَصَمُوْا بِاللّٰهِ وَاَخْلَصُوْا دِیْنَهُمْ لِلّٰهِ فَاُولٰٓىِٕكَ مَعَ الْمُؤْمِنِیْنَ وَسَوْفَ یُؤْتِ اللّٰهُ الْمُؤْمِنِیْنَ اَجْرًا عَظِیْمًا",
    "مَا یَفْعَلُ اللّٰهُ بِعَذَابِكُمْ اِنْ شَكَرْتُمْ وَاٰمَنْتُمْ وَكَانَ اللّٰهُ شَاكِرًا عَلِیْمًا",
    "لَا یُحِبُّ اللّٰهُ الْجَهْرَ بِالسُّوْٓءِ مِنَ الْقَوْلِ اِلَّا مَنْ ظُلِمَ وَكَانَ اللّٰهُ سَمِیْعًا عَلِیْمًا",
    "اِنْ تُبْدُوْا خَیْرًا اَوْ تُخْفُوْهُ اَوْ تَعْفُوْا عَنْ سُوْٓءٍ فَاِنَّ اللّٰهَ كَانَ عَفُوًّا قَدِیْرًا",
    "اِنَّ الَّذِیْنَ یَكْفُرُوْنَ بِاللّٰهِ وَرُسُلِهٖ وَیُرِیْدُوْنَ اَنْ یُّفَرِّقُوْا بَیْنَ اللّٰهِ وَرُسُلِهٖ وَیَقُوْلُوْنَ نُؤْمِنُ بِبَعْضٍ وَّنَكْفُرُ بِبَعْضٍ وَّیُرِیْدُوْنَ اَنْ یَّتَّخِذُوْا بَیْنَ ذٰلِكَ سَبِیْلًا",
    "اُولٰٓىِٕكَ هُمُ الْكٰفِرُوْنَ حَقًّا وَاَعْتَدْنَا لِلْكٰفِرِیْنَ عَذَابًا مُّهِیْنًا",
    "وَالَّذِیْنَ اٰمَنُوْا بِاللّٰهِ وَرُسُلِهٖ وَلَمْ یُفَرِّقُوْا بَیْنَ اَحَدٍ مِّنْهُمْ اُولٰٓىِٕكَ سَوْفَ یُؤْتِیْهِمْ اُجُوْرَهُمْ وَكَانَ اللّٰهُ غَفُوْرًا رَّحِیْمًا",
    "یَسْـَٔلُكَ اَهْلُ الْكِتٰبِ اَنْ تُنَزِّلَ عَلَیْهِمْ كِتٰبًا مِّنَ السَّمَآءِ فَقَدْ سَاَلُوْا مُوْسٰۤی اَكْبَرَ مِنْ ذٰلِكَ فَقَالُوْۤا اَرِنَا اللّٰهَ جَهْرَةً فَاَخَذَتْهُمُ الصّٰعِقَةُ بِظُلْمِهِمْ ثُمَّ اتَّخَذُوا الْعِجْلَ مِنْ بَعْدِ مَا جَآءَتْهُمُ الْبَیِّنٰتُ فَعَفَوْنَا عَنْ ذٰلِكَ وَاٰتَیْنَا مُوْسٰی سُلْطٰنًا مُّبِیْنًا",
    "وَرَفَعْنَا فَوْقَهُمُ الطُّوْرَ بِمِیْثَاقِهِمْ وَقُلْنَا لَهُمُ ادْخُلُوا الْبَابَ سُجَّدًا وَّقُلْنَا لَهُمْ لَا تَعْدُوْا فِی السَّبْتِ وَاَخَذْنَا مِنْهُمْ مِّیْثَاقًا غَلِیْظًا",
    "فَبِمَا نَقْضِهِمْ مِّیْثَاقَهُمْ وَكُفْرِهِمْ بِاٰیٰتِ اللّٰهِ وَقَتْلِهِمُ الْاَنْۢبِیَآءَ بِغَیْرِ حَقٍّ وَّقَوْلِهِمْ قُلُوْبُنَا غُلْفٌ بَلْ طَبَعَ اللّٰهُ عَلَیْهَا بِكُفْرِهِمْ فَلَا یُؤْمِنُوْنَ اِلَّا قَلِیْلًا",
    "وَّبِكُفْرِهِمْ وَقَوْلِهِمْ عَلٰی مَرْیَمَ بُهْتَانًا عَظِیْمًا",
    "وَّقَوْلِهِمْ اِنَّا قَتَلْنَا الْمَسِیْحَ عِیْسَی ابْنَ مَرْیَمَ رَسُوْلَ اللّٰهِ وَمَا قَتَلُوْهُ وَمَا صَلَبُوْهُ وَلٰكِنْ شُبِّهَ لَهُمْ وَاِنَّ الَّذِیْنَ اخْتَلَفُوْا فِیْهِ لَفِیْ شَكٍّ مِّنْهُ مَا لَهُمْ بِهٖ مِنْ عِلْمٍ اِلَّا اتِّبَاعَ الظَّنِّ وَمَا قَتَلُوْهُ یَقِیْنًا",
    "بَلْ رَّفَعَهُ اللّٰهُ اِلَیْهِ وَكَانَ اللّٰهُ عَزِیْزًا حَكِیْمًا",
    "وَاِنْ مِّنْ اَهْلِ الْكِتٰبِ اِلَّا لَیُؤْمِنَنَّ بِهٖ قَبْلَ مَوْتِهٖ وَیَوْمَ الْقِیٰمَةِ یَكُوْنُ عَلَیْهِمْ شَهِیْدًا",
    "فَبِظُلْمٍ مِّنَ الَّذِیْنَ هَادُوْا حَرَّمْنَا عَلَیْهِمْ طَیِّبٰتٍ اُحِلَّتْ لَهُمْ وَبِصَدِّهِمْ عَنْ سَبِیْلِ اللّٰهِ كَثِیْرًا",
    "وَّاَخْذِهِمُ الرِّبٰوا وَقَدْ نُهُوْا عَنْهُ وَاَكْلِهِمْ اَمْوَالَ النَّاسِ بِالْبَاطِلِ وَاَعْتَدْنَا لِلْكٰفِرِیْنَ مِنْهُمْ عَذَابًا اَلِیْمًا",
    "لٰكِنِ الرّٰسِخُوْنَ فِی الْعِلْمِ مِنْهُمْ وَالْمُؤْمِنُوْنَ یُؤْمِنُوْنَ بِمَاۤ اُنْزِلَ اِلَیْكَ وَمَاۤ اُنْزِلَ مِنْ قَبْلِكَ وَالْمُقِیْمِیْنَ الصَّلٰوةَ وَالْمُؤْتُوْنَ الزَّكٰوةَ وَالْمُؤْمِنُوْنَ بِاللّٰهِ وَالْیَوْمِ الْاٰخِرِ اُولٰٓىِٕكَ سَنُؤْتِیْهِمْ اَجْرًا عَظِیْمًا",
    "اِنَّاۤ اَوْحَیْنَاۤ اِلَیْكَ كَمَاۤ اَوْحَیْنَاۤ اِلٰی نُوْحٍ وَّالنَّبِیّٖنَ مِنْ بَعْدِهٖ وَاَوْحَیْنَاۤ اِلٰۤی اِبْرٰهِیْمَ وَاِسْمٰعِیْلَ وَاِسْحٰقَ وَیَعْقُوْبَ وَالْاَسْبَاطِ وَعِیْسٰی وَاَیُّوْبَ وَیُوْنُسَ وَهٰرُوْنَ وَسُلَیْمٰنَ وَاٰتَیْنَا دَاوٗدَ زَبُوْرًا",
    "وَرُسُلًا قَدْ قَصَصْنٰهُمْ عَلَیْكَ مِنْ قَبْلُ وَرُسُلًا لَّمْ نَقْصُصْهُمْ عَلَیْكَ وَكَلَّمَ اللّٰهُ مُوْسٰی تَكْلِیْمًا",
    "رُسُلًا مُّبَشِّرِیْنَ وَمُنْذِرِیْنَ لِئَلَّا یَكُوْنَ لِلنَّاسِ عَلَی اللّٰهِ حُجَّةٌ بَعْدَ الرُّسُلِ وَكَانَ اللّٰهُ عَزِیْزًا حَكِیْمًا",
    "لٰكِنِ اللّٰهُ یَشْهَدُ بِمَاۤ اَنْزَلَ اِلَیْكَ اَنْزَلَهٗ بِعِلْمِهٖ وَالْمَلٰٓىِٕكَةُ یَشْهَدُوْنَ وَكَفٰی بِاللّٰهِ شَهِیْدًا",
    "اِنَّ الَّذِیْنَ كَفَرُوْا وَصَدُّوْا عَنْ سَبِیْلِ اللّٰهِ قَدْ ضَلُّوْا ضَلٰلًا بَعِیْدًا",
    "اِنَّ الَّذِیْنَ كَفَرُوْا وَظَلَمُوْا لَمْ یَكُنِ اللّٰهُ لِیَغْفِرَ لَهُمْ وَلَا لِیَهْدِیَهُمْ طَرِیْقًا",
    "اِلَّا طَرِیْقَ جَهَنَّمَ خٰلِدِیْنَ فِیْهَاۤ اَبَدًا وَكَانَ ذٰلِكَ عَلَی اللّٰهِ یَسِیْرًا",
    "یٰۤاَیُّهَا النَّاسُ قَدْ جَآءَكُمُ الرَّسُوْلُ بِالْحَقِّ مِنْ رَّبِّكُمْ فَاٰمِنُوْا خَیْرًا لَّكُمْ وَاِنْ تَكْفُرُوْا فَاِنَّ لِلّٰهِ مَا فِی السَّمٰوٰتِ وَالْاَرْضِ وَكَانَ اللّٰهُ عَلِیْمًا حَكِیْمًا",
    "یٰۤاَهْلَ الْكِتٰبِ لَا تَغْلُوْا فِیْ دِیْنِكُمْ وَلَا تَقُوْلُوْا عَلَی اللّٰهِ اِلَّا الْحَقَّ اِنَّمَا الْمَسِیْحُ عِیْسَی ابْنُ مَرْیَمَ رَسُوْلُ اللّٰهِ وَكَلِمَتُهٗ اَلْقٰىهَاۤ اِلٰی مَرْیَمَ وَرُوْحٌ مِّنْهُ فَاٰمِنُوْا بِاللّٰهِ وَرُسُلِهٖ ۫ وَلَا تَقُوْلُوْا ثَلٰثَةٌ اِنْتَهُوْا خَیْرًا لَّكُمْ اِنَّمَا اللّٰهُ اِلٰهٌ وَّاحِدٌ سُبْحٰنَهٗۤ اَنْ یَّكُوْنَ لَهٗ وَلَدٌ لَهٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَكَفٰی بِاللّٰهِ وَكِیْلًا",
    "لَنْ یَّسْتَنْكِفَ الْمَسِیْحُ اَنْ یَّكُوْنَ عَبْدًا لِّلّٰهِ وَلَا الْمَلٰٓىِٕكَةُ الْمُقَرَّبُوْنَ وَمَنْ یَّسْتَنْكِفْ عَنْ عِبَادَتِهٖ وَیَسْتَكْبِرْ فَسَیَحْشُرُهُمْ اِلَیْهِ جَمِیْعًا",
    "فَاَمَّا الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فَیُوَفِّیْهِمْ اُجُوْرَهُمْ وَیَزِیْدُهُمْ مِّنْ فَضْلِهٖ وَاَمَّا الَّذِیْنَ اسْتَنْكَفُوْا وَاسْتَكْبَرُوْا فَیُعَذِّبُهُمْ عَذَابًا اَلِیْمًا وَّلَا یَجِدُوْنَ لَهُمْ مِّنْ دُوْنِ اللّٰهِ وَلِیًّا وَّلَا نَصِیْرًا",
    "یٰۤاَیُّهَا النَّاسُ قَدْ جَآءَكُمْ بُرْهَانٌ مِّنْ رَّبِّكُمْ وَاَنْزَلْنَاۤ اِلَیْكُمْ نُوْرًا مُّبِیْنًا",
    "فَاَمَّا الَّذِیْنَ اٰمَنُوْا بِاللّٰهِ وَاعْتَصَمُوْا بِهٖ فَسَیُدْخِلُهُمْ فِیْ رَحْمَةٍ مِّنْهُ وَفَضْلٍ وَّیَهْدِیْهِمْ اِلَیْهِ صِرَاطًا مُّسْتَقِیْمًا",
    "یَسْتَفْتُوْنَكَ قُلِ اللّٰهُ یُفْتِیْكُمْ فِی الْكَلٰلَةِ اِنِ امْرُؤٌا هَلَكَ لَیْسَ لَهٗ وَلَدٌ وَّلَهٗۤ اُخْتٌ فَلَهَا نِصْفُ مَا تَرَكَ وَهُوَ یَرِثُهَاۤ اِنْ لَّمْ یَكُنْ لَّهَا وَلَدٌ فَاِنْ كَانَتَا اثْنَتَیْنِ فَلَهُمَا الثُّلُثٰنِ مِمَّا تَرَكَ وَاِنْ كَانُوْۤا اِخْوَةً رِّجَالًا وَّنِسَآءً فَلِلذَّكَرِ مِثْلُ حَظِّ الْاُنْثَیَیْنِ یُبَیِّنُ اللّٰهُ لَكُمْ اَنْ تَضِلُّوْا وَاللّٰهُ بِكُلِّ شَیْءٍ عَلِیْمٌ"
  ],
  "bengali": [
    "হে মানুষ, তোমরা তোমাদের রবকে ভয় কর, যিনি তোমাদেরকে সৃষ্টি করেছেন এক নফ্স থেকে। আর তা থেকে সৃষ্টি করেছেন তার স্ত্রীকে এবং তাদের থেকে ছড়িয়ে দিয়েছেন বহু পুরুষ ও নারী। আর তোমরা আল্লাহকে ভয় কর, যার মাধ্যমে তোমরা একে অপরের কাছে চেয়ে থাক। আর ভয় কর রক্ত-সম্পর্কিত আত্মীয়ের ব্যাপারে। নিশ্চয় আল্লাহ তোমাদের উপর পর্যবেক্ষক।",
    "আর তোমরা ইয়াতীমদেরকে তাদের ধন-সম্পদ দিয়ে দাও এবং তোমরা অপবিত্র বস্ত্তকে পবিত্র বস্ত্ত দ্বারা পরিবর্তন করো না এবং তাদের ধন-সম্পদকে তোমাদের ধন-সম্পদের সাথে খেয়ো না। নিশ্চয় তা বড় পাপ।",
    "আর যদি তোমরা আশঙ্কা কর যে, ইয়াতীমদের ব্যাপারে তোমরা ইনসাফ করতে পারবে না, তাহলে তোমরা বিয়ে কর নারীদের মধ্যে যাকে তোমাদের ভাল লাগে; দু’টি, তিনটি অথবা চারটি। আর যদি ভয় কর যে, তোমরা সমান আচরণ করতে পারবে না, তবে একটি অথবা তোমাদের ডান হাত যার মালিক হয়েছে। এটা অধিকতর নিকটবর্তী যে, তোমরা যুলম করবে না।",
    "আর তোমরা নারীদেরকে সন্তুষ্টচিত্তে তাদের মোহর দিয়ে দাও, অতঃপর যদি তারা তোমাদের জন্য তা থেকে খুশি হয়ে কিছু ছাড় দেয়, তাহলে তোমরা তা সানন্দে তৃপ্তিসহকারে খাও।",
    "আর তোমরা নির্বোধদের হাতে তোমাদের ধন-সম্পদ দিও না, যাকে আল্লাহ তোমাদের জন্য করেছেন জীবিকার মাধ্যম এবং তোমরা তা থেকে তাদেরকে আহার দাও, তাদেরকে পরিধান করাও এবং তাদের সাথে উত্তম কথা বল।",
    "আর তোমরা ইয়াতীমদেরকে পরীক্ষা কর যতক্ষণ না তারা বিবাহের বয়সে পৌঁছে। সুতরাং যদি তোমরা তাদের মধ্যে বিবেকের পরিপক্কতা দেখতে পাও, তবে তাদের ধন-সম্পদ তাদেরকে দিয়ে দাও। আর তোমরা তাদের সম্পদ খেয়ো না অপচয় করে এবং তারা বড় হওয়ার আগে তাড়াহুড়া করে। আর যে ধনী সে যেন সংযত থাকে, আর যে দরিদ্র সে যেন ন্যায়সঙ্গতভাবে খায়। অতঃপর যখন তোমরা তাদের ধন-সম্পদ তাদের নিকট সোপর্দ করবে তখন তাদের উপর তোমরা সাক্ষী রাখবে। আর হিসাব গ্রহণকারী হিসেবে আল্লাহ যথেষ্ট।",
    "পুরুষদের জন্য মাতা পিতা ও নিকটাত্মীয়রা যা রেখে গিয়েছে তা থেকে একটি অংশ রয়েছে। আর নারীদের জন্য রয়েছে মাতা পিতা ও নিকটাত্মীয়রা যা রেখে গিয়েছে তা থেকে একটি অংশ- তা থেকে কম হোক বা বেশি হোক- নির্ধারিত হারে।",
    "আর যদি বণ্টনে নিকটাত্মীয় এবং ইয়াতীম ও মিসকীনরা উপস্থিত হয়, তাহলে তোমরা তাদেরকে তা থেকে আহার দেবে এবং তাদের সাথে তোমরা উত্তম কথা বলবে।",
    "আর তাদের ভয় করা উচিৎ যে, যদি তারা তাদের পেছনে অসহায় সন্তান রেখে যেত, তাহলে তারা তাদের বিষয়ে উদ্বিগ্ন হত। সুতরাং তারা যেন আল্লাহকে ভয় করে এবং যেন সঠিক কথা বলে।",
    "নিশ্চয় যারা ইয়াতীমদের ধন-সম্পদ অন্যায়ভাবে ভক্ষণ করে তারা তো তাদের পেটে আগুন খাচ্ছে; আর অচিরেই তারা প্রজ্জ্বলিত আগুনে প্রবেশ করবে।",
    "আল্লাহ তোমাদেরকে তোমাদের সন্তানদের সম্পর্কে নির্দেশ দিচ্ছেন, এক ছেলের জন্য দুই মেয়ের অংশের সমপরিমাণ। তবে যদি তারা দুইয়ের অধিক মেয়ে হয়, তাহলে তাদের জন্য হবে, যা সে রেখে গেছে তার তিন ভাগের দুই ভাগ; আর যদি একজন মেয়ে হয় তখন তার জন্য অর্ধেক। আর তার মাতা পিতা উভয়ের প্রত্যেকের জন্য ছয় ভাগের এক ভাগ সে যা রেখে গেছে তা থেকে, যদি তার সন্তান থাকে। আর যদি তার সন্তান না থাকে এবং তার ওয়ারিছ হয় তার মাতা পিতা তখন তার মাতার জন্য তিন ভাগের এক ভাগ। আর যদি তার ভাই-বোন থাকে তবে তার মায়ের জন্য ছয় ভাগের এক ভাগ। অসিয়ত পালনের পর, যা দ্বারা সে অসিয়ত করেছে অথবা ঋণ পরিশোধের পর। তোমাদের মাতা পিতা ও তোমাদের সন্তান-সন্ততিদের মধ্য থেকে তোমাদের উপকারে কে অধিক নিকটবর্তী তা তোমরা জান না। আল্লাহর পক্ষ থেকে নির্ধারিত। নিশ্চয় আল্লাহ সর্বজ্ঞ, প্রজ্ঞাময়।",
    "আর তোমাদের জন্য তোমাদের স্ত্রীগণ যা রেখে গেছে তার অর্ধেক, যদি তাদের কোন সন্তান না থাকে। আর যদি তাদের সন্তান থাকে, তবে তারা যা রেখে গেছে তা থেকে তোমাদের জন্য চার ভাগের এক ভাগ। তারা যে অসিয়ত করে গেছে তা পালনের পর অথবা ঋণ পরিশোধের পর। আর স্ত্রীদের জন্য তোমরা যা রেখে গিয়েছ তা থেকে চার ভাগের একভাগ, যদি তোমাদের কোন সন্তান না থাকে। আর যদি তোমাদের সন্তান থাকে তাহলে তাদের জন্য আট ভাগের এক ভাগ, তোমরা যা রেখে গিয়েছে তা থেকে। তোমরা যে অসিয়ত করেছ তা পালন অথবা ঋণ পরিশোধের পর। আর যদি মা বাবা এবং সন্তান-সন্ততি নাই এমন কোন পুরুষ বা মহিলা মারা যায় এবং তার থাকে এক ভাই অথবা এক বোন, তখন তাদের প্রত্যেকের জন্য ছয় ভাগের একভাগ। আর যদি তারা এর থেকে অধিক হয় তবে তারা সবাই তিন ভাগের এক ভাগের মধ্যে সমঅংশীদার হবে, যে অসিয়ত করা হয়েছে তা পালনের পর অথবা ঋণ পরিশোধের পর। কারো কোন ক্ষতি না করে। আল্লাহর পক্ষ থেকে অসিয়তস্বরূপ। আর আল্লাহ সর্বজ্ঞ, সহনশীল।",
    "এগুলো আল্লাহর সীমারেখা। আর যে আল্লাহ ও তাঁর রাসূলের আনুগত্য করে আল্লাহ তাকে প্রবেশ করাবেন জান্নাতসমূহে, যার তলদেশে প্রবাহিত রয়েছে নহরসমূহ। সেখানে তারা স্থায়ী হবে। আর এটা মহা সফলতা ।",
    "আর যে আল্লাহ ও তাঁর রাসূলের নাফরমানী করে এবং তাঁর সীমারেখা লঙ্ঘন করে আল্লাহ তাকে আগুনে প্রবেশ করাবেন। সেখানে সে স্থায়ী হবে। আর তার জন্যই রয়েছে অপমানজনক আযাব।",
    "আর তোমাদের নারীদের মধ্য থেকে যারা ব্যভিচার করে, তোমরা তাদের উপর তোমাদের মধ্য থেকে চার জন সাক্ষী উপস্থিত কর। অতঃপর যদি তারা সাক্ষ্য দেয় তবে তোমরা তাদেরকে ঘরের মধ্যে আবদ্ধ রাখ যতক্ষণ না মৃত্যু তাদের জীবন শেষ করে দেয়। অথবা আল্লাহ তাদের জন্য কোন পথ তৈরি করে দেন।",
    "আর তোমাদের মধ্য থেকে যে দু’জন অপকর্ম করবে, তাদেরকে তোমরা আযাব দাও। অতঃপর যদি তারা তাওবা করে এবং শুধরিয়ে নেয় তবে তোমরা তাদের থেকে বিরত থাক। নিশ্চয় আল্লাহ তাওবা কবূলকারী, দয়ালু ।",
    "নিশ্চয় তাওবা কবূল করা আল্লাহর জিম্মায় তাদের জন্য, যারা অজ্ঞতাবশত মন্দ কাজ করে। তারপর শীঘ্রই তাওবা করে। অতঃপর আল্লাহ এদের তাওবা কবুল করবেন আর আল্লাহ মহাজ্ঞানী, প্রজ্ঞাময়।",
    "আর তাওবা নাই তাদের, যারা অন্যায় কাজ করতে থাকে, অবশেষে যখন তাদের কারো মৃত্যু এসে যায়, তখন বলে, আমি এখন তাওবা করলাম, আর তাওবা তাদের জন্য নয়, যারা কাফির অবস্থায় মারা যায়; আমি এদের জন্যই তৈরী করেছি যন্ত্রণাদায়ক আযাব।",
    "হে মুমিনগণ, তোমাদের জন্য হালাল নয় যে, তোমরা জোর করে নারীদের ওয়ারিছ হবে। আর তোমরা তাদেরকে আবদ্ধ করে রেখো না, তাদেরকে যা দিয়েছ তা থেকে তোমরা কিছু নিয়ে নেয়ার জন্য, তবে যদি তারা প্রকাশ্য অশ্লীলতায় লিপ্ত হয়। আর তোমরা তাদের সাথে সদ্ভাবে বসবাস কর। আর যদি তোমরা তাদেরকে অপছন্দ কর, তবে এমনও হতে পারে যে, তোমরা কোন কিছুকে অপছন্দ করছ আর আল্লাহ তাতে অনেক কল্যাণ রাখবেন।",
    "আর যদি তোমরা এক স্ত্রীর স্থলে অন্য স্ত্রীকে বদলাতে চাও আর তাদের কাউকে তোমরা প্রদান করেছ প্রচুর সম্পদ, তবে তোমরা তা থেকে কোন কিছু নিও না। তোমরা কি তা নেবে অপবাদ এবং প্রকাশ্য গুনাহের মাধ্যমে?",
    "আর তোমরা তা কীভাবে নেবে অথচ তোমরা একে অপরের সাথে একান্তে মিলিত হয়েছ; আর তারা তোমাদের থেকে নিয়েছিল দৃঢ় অঙ্গীকার?",
    "আর তোমরা বিবাহ করো না নারীদের মধ্য থেকে যাদেরকে বিবাহ করেছে তোমাদের পিতৃপুরুষগণ। তবে পূর্বে যা সংঘটিত হয়েছে (তা ক্ষমা করা হল)। নিশ্চয় তা হল অশ্লীলতা ও ঘৃণিত বিষয় এবং নিকৃষ্ট পথ।",
    "তোমাদের উপর হারাম করা হয়েছে তোমাদের মাতাদেরকে, তোমাদের মেয়েদেরকে, তোমাদের বোনদেরকে, তোমাদের ফুফুদেরকে, তোমাদের খালাদেরকে, ভাতিজীদেরকে, ভাগ্নীদেরকে, তোমাদের সে সব মাতাকে যারা তোমাদেরকে দুধপান করিয়েছে, তোমাদের দুধবোনদেরকে, তোমাদের শ্বাশুড়ীদেরকে, তোমরা যেসব স্ত্রীর সাথে মিলিত হয়েছ সেসব স্ত্রীর অপর স্বামী থেকে যেসব কন্যা তোমাদের কোলে রয়েছে তাদেরকে, আর যদি তোমরা তাদের সাথে মিলিত না হয়ে থাক তবে তোমাদের উপর কোন পাপ নেই এবং তোমাদের ঔরসজাত পুত্রদের স্ত্রীদেরকে এবং দুই বোনকে একত্র করা(তোমাদের উপর হারাম করা হয়েছে)। তবে অতীতে যা হয়ে গেছে তা ভিন্ন কথা। নিশ্চয় আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "আর (হারাম করা হয়েছে) নারীদের মধ্য থেকে সধবাদেরকে। তবে তোমাদের ডান হাত যাদের মালিক হয়েছে (দাসীগণ) তারা ছাড়া। এটি তোমাদের উপর আল্লাহর বিধান এবং এরা ছাড়া সকল নারীকে তোমাদের জন্য হালাল করা হয়েছে যে, তোমরা তোমাদের অর্থের বিনিময়ে তাদেরকে চাইবে বিবাহ করে, অবৈধ যৌনাচারে লিপ্ত হয়ে নয়। সুতরাং তাদের মধ্যে তোমরা যাদেরকে ভোগ করেছ তাদেরকে তাদের নির্ধারিত মোহর দিয়ে দাও। আর নির্ধারণের পর যে ব্যাপারে তোমরা পরস্পর সম্মত হবে তাতে তোমাদের উপর কোন অপরাধ নেই। নিশ্চয় আল্লাহ মহাজ্ঞানী, প্রজ্ঞাময়।",
    "আর তোমাদের মধ্যে যে ব্যক্তি স্বাধীন-মুমিন নারীদেরকে বিবাহ করার সামর্থ্য রাখে না, সে (বিবাহ করবে) তোমাদের মুমিন যুবতীদের মধ্য থেকে, তোমাদের হাত যাদের মালিক হয়েছে তাদের কাউকে। আর আল্লাহ তোমাদের ঈমান সম্পর্কে অধিক জ্ঞাত। তোমরা একে অন্যের থেকে (এসেছ)। সুতরাং তোমরা তাদেরকে তাদের মালিকদের অনুমতিক্রমে বিবাহ কর এবং ন্যায়সঙ্গতভাবে তাদেরকে তাদের মোহর দিয়ে দাও এমতাবস্থায় যে, তারা হবে সতী-সাধ্বী, ব্যভিচারিণী কিংবা গোপন যৌনসঙ্গী গ্রহণকারিণী নয়। অতঃপর যখন তারা বিবাহিত হবে তখন যদি ব্যভিচারে লিপ্ত হয় তাহলে তাদের উপর স্বাধীন নারীর অর্ধেক আযাব হবে। এটা তাদের জন্য, তোমাদের মধ্যে যারা ব্যভিচারের ভয় করে এবং ধৈর্যধারণ করা তোমাদের জন্য উত্তম। আর আললাহ ক্ষমাশীল, পরম দয়ালু।",
    "আল্লাহ চান তোমাদের জন্য বিস্তারিত বর্ণনা করতে, তোমাদেরকে তোমাদের পূর্ববর্তীদের আদর্শ প্রদর্শন করতে এবং তোমাদের তাওবা কবূল করতে। আর আল্লাহ মহাজ্ঞানী, প্রজ্ঞাময়।",
    "আর আল্লাহ চান তোমাদের তাওবা কবূল করতে। আর যারা প্রবৃত্তির অনুসরণ করে তারা চায় যে, তোমরা প্রবলভাবে (সত্য পথ থেকে) বিচ্যুত হও।",
    "আল্লাহ তোমাদের থেকে (বিধান) সহজ করতে চান, আর মানুষকে সৃষ্টি করা হয়েছে দুর্বল করে।",
    "হে মুমিনগণ, তোমরা পরস্পরের মধ্যে তোমাদের ধন-সম্পদ অন্যায়ভাবে খেয়ো না, তবে পারস্পরিক সম্মতিতে ব্যবসার মাধ্যমে হলে ভিন্ন কথা। আর তোমরা নিজেরা নিজদেরকে হত্যা করো না। নিশ্চয় আল্লাহ তোমাদের ব্যাপারে পরম দয়ালু।",
    "আর যে ঐ কাজ করবে সীমালঙ্ঘন ও অন্যায়ভাবে, আমি অচিরেই তাকে আগুনে প্রবেশ করাব। আর সেটি হবে আল্লাহর উপর সহজ।",
    "তোমরা যদি সেসব কবীরা গুনাহ পরিহার কর, যা থেকে তোমাদের বারণ করা হয়েছে, তাহলে আমি তোমাদের গুনাহসমূহ ক্ষমা করে দেব এবং তোমাদেরকে প্রবেশ করাব সম্মানজনক প্রবেশস্থলে।",
    "আর তোমরা আকাঙ্ক্ষা করো না সে সবের, যার মাধ্যমে আল্লাহ তোমাদের এক জনকে অন্য জনের উপর প্রাধান্য দিয়েছেন। পুরুষদের জন্য রয়েছে অংশ, তারা যা উপার্জন করে তা থেকে এবং নারীদের জন্য রয়েছে অংশ, যা তারা উপার্জন করে তা থেকে। আর তোমরা আল্লাহর কাছে তাঁর অনুগ্রহ চাও। নিশ্চয় আল্লাহ সর্ব বিষয়ে সম্যক জ্ঞাত।",
    "আর আমি প্রত্যেকের জন্য নির্ধারণ করেছি উত্তরাধিকারী, পিতা-মাতা ও নিকট আত্মীয়-স্বজন যা রেখে যায় এবং যাদের সাথে তোমরা চুক্তি করেছ, তা থেকে* । সুতরাং তোমরা তাদেরকে তাদের অংশ দিয়ে দাও। নিশ্চয় আল্লাহ সবকিছুর উপর সাক্ষী। \n* চুক্তিভিত্তিক উত্তরাধিকারের বিষয়টি জাহিলী যুগের প্রথা, ইসলামের সূচনাতে এটি বলবৎ থাকলেও পরে তা রহিত করা হয়।",
    "পুরুষরা নারীদের তত্ত্বাবধায়ক, এ কারণে যে, আল্লাহ তাদের একের উপর অন্যকে শ্রেষ্ঠত্ব দিয়েছেন এবং যেহেতু তারা নিজদের সম্পদ থেকে ব্যয় করে। সুতরাং পুণ্যবতী নারীরা অনুগত, তারা লোকচক্ষুর অন্তরালে হিফাযাতকারিনী ঐ বিষয়ের যা আল্লাহ হিফাযাত করেছেনে। আর তোমরা যাদের অবাধ্যতার আশঙ্কা কর তাদেরকে সদুপদেশ দাও, বিছানায় তাদেরকে ত্যাগ কর এবং তাদেরকে (মৃদু) প্রহার কর। এরপর যদি তারা তোমাদের আনুগত্য করে তাহলে তাদের বিরুদ্ধে কোন পথ অনুসন্ধান করো না। নিশ্চয় আল্লাহ সমুন্নত মহান।",
    "আর যদি তোমরা তাদের উভয়ের মধ্যে বিচ্ছেদের আশঙ্কা কর তাহলে স্বামীর পরিবার থেকে একজন বিচারক এবং স্ত্রীর পরিবার থেকে একজন বিচারক পাঠাও। যদি তারা মীমাংসা চায় তাহলে আল্লাহ উভয়ের মধ্যে মিল করে দেবেন। নিশ্চয়ই আল্লাহ সর্বজ্ঞানী, সম্যক অবগত।",
    "তোমরা ইবাদাত কর আল্লাহর, তাঁর সাথে কোন কিছুকে শরীক করো না। আর সদ্ব্যবহার কর মাতা-পিতার সাথে, নিকট আত্মীয়ের সাথে, ইয়াতীম, মিসকীন, নিকট আত্মীয়- প্রতিবেশী, অনাত্মীয়- প্রতিবেশী, পার্শ্ববর্তী সাথী, মুসাফির এবং তোমাদের মালিকানাভুক্ত দাস-দাসীদের সাথে। নিশ্চয় আল্লাহ পছন্দ করেন না তাদেরকে যারা দাম্ভিক, অহঙ্কারী।",
    "যারা কৃপণতা করে এবং মানুষকে কৃপণতার নির্দেশ দেয়; আর গোপন করে তা, যা আল্লাহ তাদেরকে স্বীয় অনুগ্রহে দান করেছেন। আর আমি প্রস্তুত করে রেখেছি কাফিরদের জন্য লাঞ্ছনাকর আযাব।",
    "আর যারা নিজ ধন-সম্পদ লোক দেখানোর উদ্দেশ্যে ব্যয় করে এবং ঈমান আনে না আল্লাহর প্রতি এবং না শেষ দিনের প্রতি। আর শয়তান যার সঙ্গী হয়, সঙ্গী হিসেবে কতইনা নিকৃষ্ট সে!",
    "তাদের এমন কী ক্ষতি হত যদি তারা ঈমান আনত আল্লাহ ও শেষ দিবসের প্রতি এবং আল্লাহ তাদের যে রিয্ক দিয়েছেন তা থেকে ব্যয় করত? আল্লাহ তাদের সম্পর্কে সম্যক জ্ঞাত।",
    "নিশ্চয় আল্লাহ অণু পরিমাণও যুলম করেন না। আর যদি সেটি ভাল কাজ হয়, তিনি তাকে দ্বিগুণ করে দেন এবং তাঁর পক্ষ থেকে মহা প্রতিদান প্রদান করেন।",
    "অতএব কেমন হবে যখন আমি প্রত্যেক উম্মত থেকে একজন সাক্ষী উপস্থিত করব এবং তোমাকে উপস্থিত করব তাদের উপর সাক্ষীরূপে?",
    "যারা কুফরী করেছে এবং রাসূলের অবাধ্য হয়েছে তারা সেদিন কামনা করবে, যদি যমীনকে তাদের সাথে (মিশিয়ে) সমান করে দেয়া হত, আর তারা আল্লাহর কাছে কোন কথা গোপন করতে পারবে না।",
    "হে মুমিনগণ, নেশাগ্রস্ত অবস্থায় তোমরা সালাতের নিকটবর্তী হয়ো না, যতক্ষণ না তোমরা বুঝতে পার যা তোমরা বল এবং অপবিত্র অবস্থায়ও না, যতক্ষণ না তোমরা গোসল কর, তবে যদি তোমরা পথ অতিক্রমকারী হও*। আর যদি তোমরা অসুস্থ হও বা সফরে থাক অথবা তোমাদের কেউ প্রস্রাব-পায়খানা থেকে আসে কিংবা তোমরা স্ত্রী সম্ভোগ কর, তবে যদি পানি না পাও তাহলে পবিত্র মাটিতে তায়াম্মুম কর** । সুতরাং তোমাদের মুখমন্ডল ও হাত মাসেহ কর। নিশ্চয় আল্লাহ মার্জনাকারী, ক্ষমাশীল। \n* তাহলে তার কথা ভিন্ন, সে গোসল না করেও শুধু তায়াম্মুম করে নামায পড়তে পারবে। কেউ কেউ বলেছেন, এখানে সালাত অর্থ সালাত আদায়স্থল। তাহলে অর্থ হবে, তোমরা অপবিত্র অবস্থায় সালাত আদায়স্থল তথা মসজিদে যেতে পারবে না। তবে পথ অতিক্রমের উদ্দেশ্যে যাওয়া যাবে। (যুবদাতুত-তাফসীর)।",
    "তুমি কি সে সব লোককে দেখনি, যাদেরকে কিতাবের কিছু অংশ দেয়া হয়েছে? তারা পথভ্রষ্টতা ক্রয় করে এবং চায় যে, তোমরাও পথভ্রষ্ট হয়ে যাও।",
    "আর আল্লাহ তোমাদের শত্রুদের সম্পর্কে অধিক অবগত। আর অভিভাবক হিসেবে আল্লাহ যথেষ্ট এবং আল্লাহ যথেষ্ট সাহায্যকারী হিসেবেও।",
    "ইয়াহূদীদের মধ্যে কিছু লোক আছে যারা কালামসমূহকে তার স্থান থেকে পরিবর্তন করে ফেলে এবং বলে, ‘আমরা শুনলাম ও অমান্য করলাম’। আর তুমি শোন না শোনার মত, তারা নিজদের জিহবা বাঁকা করে এবং দীনের প্রতি খোঁচা মেরে বলে, ‘রা‘ইনা’* । আর তারা যদি বলত, ‘আমরা শুনলাম ও মান্য করলাম এবং তুমি শোন ও আমাদের প্রতি লক্ষ্য রাখ’ তাহলে এটি হত তাদের জন্য কল্যাণকর ও যথার্থ। কিন্তু তাদের কুফরীর কারণে আল্লাহ তাদেরকে লা‘নত করেছেন। তাই তাদের কম সংখ্যক লোকই ঈমান আনে। \n* আরবীতে ‘রা’ইনা শব্দের অর্থ ‘আমাদের তত্ত্বাবধান করুন’। ইয়াহূদীরা শব্দটিকে বিকৃত করে উচ্চারণ করত, যা তাদের ভাষায় (হিব্রুতে) গালি হিসেবে ব্যবহৃত হত। এ সম্পর্কে আরো দ্র. সূরা বাকারার ১০৪ নং আয়াতের টীকা।",
    "হে কিতাবপ্রাপ্তগণ, তোমরা ঈমান আন, তার প্রতি যা আমি নাযিল করেছি তোমাদের সাথে যা আছে তার সত্যায়নকারীরূপে। আমি চেহারাসমূহকে বিকৃত করে তা তাদের পিঠের দিকে ফিরিয়ে দেয়া অথবা তাদেরকে লা‘নত করার পূর্বে যেমনিভাবে লা‘নত করেছি আসহাবুস্ সাবতকে* । আর আল্লাহর নির্দেশ কার্যকর হয়েই থাকে। \n* দাউদ (আঃ) এর উম্মতের উপর সাবত বা শনিবারে ইবাদাত করা ফরয ছিল এবং পরীক্ষাস্বরূপ এ দিনে মাছ শিকার করা নিষিদ্ধ ছিল। এ নিষেধাজ্ঞা উপেক্ষা করে মাছ শিকার করায় আল্লাহ তায়ালা তাদেরকে আযাবস্বরূপ বানরে পরিণত করেছিলেন।",
    "নিশ্চয় আল্লাহ তাঁর সাথে শরীক করাকে ক্ষমা করেন না। তিনি ক্ষমা করেন এ ছাড়া অন্যান্য পাপ, যার জন্য তিনি চান। আর যে আল্লাহর সাথে শরীক করে সে অবশ্যই মহাপাপ রচনা করে।",
    "তুমি কি তাদেরকে দেখনি, যারা নিজদেরকে পবিত্র মনে করে? বরং আল্লাহ যাকে চান তাকে পবিত্র করেন। আর তাদেরকে সূতা পরিমাণ যুলমও করা হবে না।",
    "দেখ, কেমন করে তারা আল্লাহর উপর মিথ্যা রটনা করে। আর প্রকাশ্য পাপ হিসেবে এটিই যথেষ্ট।",
    "তুমি কি তাদেরকে দেখনি, যাদেরকে কিতাবের এক অংশ দেয়া হয়েছে? তারা জিবত* ও তাগূতের প্রতি ঈমান আনে এবং কাফিরদেরকে বলে, এরা মুমিনদের তুলনায় অধিক সঠিক পথপ্রাপ্ত। \n* জিবত الجبتঅর্থ: মূর্তি , প্রতিমা, যাদুকর, ভেলকিবাজ, যাদু, ভেলকি ইত্যাদি।",
    "এরাই তারা যাদেরকে আল্লাহ লা‘নত করেছেন। আর আল্লাহ যাকে লা‘নত করেন তুমি কখনো তার কোন সাহায্যকারী পাবে না।",
    "তবে কি তাদের জন্য রাজত্বে কোন অংশ আছে? তাহলে তখনতো তারা মানুষকে খেজুরবীচির উপরের আবরণ পরিমাণও কিছু দেবে না।",
    "বরং তারা কি লোকদেরকে হিংসা করে, আল্লাহ স্বীয় অনুগ্রহে তাদেরকে যা দিয়েছেন তার কারণে? তাহলে তো আমি ইবরাহীমের বংশধরকে কিতাব ও হিকমত দান করেছি এবং তাদেরকে দিয়েছি বিশাল রাজত্ব।",
    "অতঃপর তাদের অনেকে এর প্রতি ঈমান এনেছে এবং অনেকে এ থেকে বিরত থেকেছে। আর দগ্ধকারী হিসেবে জাহান্নামই যথেষ্ট।",
    "নিশ্চয় যারা আমার আয়াতসমূহকে অস্বীকার করেছে, অচিরেই আমি তাদেরকে প্রবেশ করাব আগুনে। যখনই তাদের চামড়াগুলো পুড়ে যাবে তখনই আমি তাদেরকে পালটে দেব অন্য চামড়া দিয়ে যাতে তারা আস্বাদন করে আযাব। নিশ্চয় আল্লাহ পরাক্রমশালী, প্রজ্ঞাময়।",
    "আর যারা ঈমান এনেছে এবং নেক আমল করেছে, অচিরেই আমি তাদেরকে প্রবেশ করাব জান্নাতসমূহে, যার তলদেশে প্রবাহিত রয়েছে নহরসমূহ। সেখানে তারা হবে স্থায়ী। সেখানে তাদের জন্য রয়েছে পবিত্র স্ত্রীগণ এবং তাদেরকে আমি প্রবেশ করাব বিস্তৃত ঘন ছায়ায়।",
    "নিশ্চয় আল্লাহ তোমাদেরকে আদেশ দিচ্ছেন আমানতসমূহ তার হকদারদের কাছে পৌঁছে দিতে। আর যখন মানুষের মধ্যে ফয়সালা করবে তখন ন্যায়ভিত্তিক ফয়সালা করবে। নিশ্চয় আল্লাহ তোমাদেরকে কতইনা সুন্দর উপদেশ দিচ্ছেন। নিশ্চয় আল্লাহ সর্বশ্রোতা, সর্বদ্রষ্টা।",
    "হে মুমিনগণ, তোমরা আনুগত্য কর আল্লাহর ও আনুগত্য কর রাসূলের এবং তোমাদের মধ্য থেকে কর্তৃত্বের অধিকারীদের। অতঃপর কোন বিষয়ে যদি তোমরা মতবিরোধ কর তাহলে তা আল্লাহ ও রাসূলের দিকে প্রত্যার্পণ করাও- যদি তোমরা আল্লাহ ও শেষ দিনের প্রতি ঈমান রাখ। এটি উত্তম এবং পরিণামে উৎকৃষ্টতর।",
    "তুমি কি তাদেরকে দেখনি, যারা দাবী করে যে, নিশ্চয় তারা ঈমান এনেছে তার উপর, যা নাযিল করা হয়েছে তোমার প্রতি এবং যা নাযিল করা হয়েছে তোমার পূর্বে। তারা তাগূতের কাছে বিচার নিয়ে যেতে চায় অথচ তাদেরকে নির্দেশ দেয়া হয়েছে তাকে অস্বীকার করতে। আর শয়তান চায় তাদেরকে ঘোর বিভ্রান্তিতে বিভ্রান্ত করতে।",
    "আর যখন তাদেরকে বলা হয়, ‘তোমরা আস যা আল্লাহ নাযিল করেছেন তার দিকে এবং রাসূলের দিকে’, তখন মুনাফিকদেরকে দেখবে তোমার কাছ থেকে সম্পূর্ণরূপে ফিরে যাচ্ছে।",
    "সুতরাং তখন কেমন হবে, যখন তাদের উপর কোন মুসীবত আসবে, সেই কারণে যা তাদের হাত পূর্বেই প্রেরণ করেছে? তারপর তারা আল্লাহর নামে শপথ করা অবস্থায় তোমার কাছে আসবে যে, আমরা কল্যাণ ও সম্প্রীতি ভিন্ন অন্য কিছু চাইনি।",
    "ওরা হল সেসব লোক, যাদের অন্তরে কি আছে আল্লাহ তা জানেন। সুতরাং তুমি তাদের থেকে মুখ ফিরিয়ে নাও এবং তাদেরকে সদুপদেশ দাও। আর তাদেরকে তাদের নিজদের ব্যাপারে মর্মস্পর্শী কথা বল।",
    "আর আমি যে কোন রাসূল প্রেরণ করেছি তা কেবল এ জন্য, যেন আল্লাহর অনুমতিক্রমে তাদের আনুগত্য করা হয়। আর যদি তারা- যখন নিজদের প্রতি যুলম করেছিল তখন তোমার কাছে আসত অতঃপর আল্লাহর কাছে ক্ষমা চাইত এবং রাসূলও তাদের জন্য ক্ষমা চাইত তাহলে অবশ্যই তারা আল্লাহকে তাওবা কবূলকারী, দয়ালু পেত।",
    "অতএব তোমার রবের কসম, তারা মুমিন হবে না যতক্ষণ না তাদের মধ্যে সৃষ্ট বিবাদের ব্যাপারে তোমাকে বিচারক নির্ধারণ করে, তারপর তুমি যে ফয়সালা দেবে সে ব্যাপারে নিজদের অন্তরে কোন দ্বিধা অনুভব না করে এবং পূর্ণ সম্মতিতে মেনে নেয়।",
    "আর যদি আমি তাদের উপর লিখে দিতাম যে, তোমরা নিজদের হত্যা কর কিংবা নিজ গৃহ থেকে বের হয়ে যাও, তাহলে তাদের কম সংখ্যক লোকই তা বাস্তবায়ন করত। আর যে উপদেশ তাদেরকে দেয়া হয় যদি তারা তা বাস্তবায়ন করত, তাহলে সেটি হত তাদের জন্য উত্তম এবং স্থিরতায় সুদৃঢ়।",
    "আর তখন আমি অবশ্যই তাদেরকে আমার পক্ষ থেকে প্রদান করতাম মহাপুরস্কার।",
    "আর অবশ্যই আমি প্রদর্শন করতাম তাদেরকে সরল পথ।",
    "আর যারা আল্লাহ ও রাসূলের আনুগত্য করে তারা তাদের সাথে থাকবে, আল্লাহ যাদের উপর অনুগ্রহ করেছেন নবী, সিদ্দীক, শহীদ ও সৎকর্মশীলদের মধ্য থেকে। আর সাথী হিসেবে তারা হবে উত্তম।",
    "এই অনুগ্রহ আল্লাহর পক্ষ থেকে। আর সর্বজ্ঞ হিসেবে আল্লাহই যথেষ্ট।",
    "হে মুমিনগণ, তোমরা তোমাদের সতর্কতা অবলম্বন কর। অতঃপর ক্ষুদ্র ক্ষুদ্র দল হয়ে বেরিয়ে পড় অথবা একসাথে বের হও।",
    "আর তোমাদের মধ্যে কেউ কেউ এমন আছে, যে অবশ্যই বিলম্ব করবে। সুতরাং তোমাদের কোন বিপদ আপতিত হলে সে বলবে, ‘আল্লাহ আমার উপর অনুগ্রহ করেছেন যে, আমি তাদের সাথে উপস্থিত ছিলাম না’।",
    "আর তোমাদের কাছে আল্লাহর পক্ষ থেকে কোন অনুগ্রহ এসে পৌঁছলে অবশ্যই সে বলবে যেন তোমাদের ও তার মধ্যে কোন হৃদ্যতা ছিল না, ‘হায়! যদি আমি তাদের সাথে থাকতাম, তাহলে আমি মহাসফলতা অর্জন করতাম।",
    "সুতরাং যারা আখিরাতের বিনিময়ে দুনিয়ার জীবন বিক্রয় করে তারা যেন আল্লাহর রাস্তায় লড়াই করে। আর যে আল্লাহর রাস্তায় লড়াই করবে অতঃপর সে নিহত হোক কিংবা বিজয়ী, অচিরেই আমি তাকে দেব মহা পুরস্কার।",
    "আর তোমাদের কী হল যে, তোমরা আল্লাহর রাস্তায় লড়াই করছ না! অথচ দুর্বল পুরুষ, নারী ও শিশুরা বলছে, ‘হে আমাদের রব, আমাদেরকে বের করুন এ জনপদ থেকে যার অধিবাসীরা যালিম এবং আমাদের জন্য আপনার পক্ষ থেকে একজন অভিভাবক নির্ধারণ করুন। আর নির্ধারণ করুন আপনার পক্ষ থেকে একজন সাহায্যকারী।’",
    "যারা ঈমান এনেছে তারা লড়াই করে আল্লাহর রাস্তায়, আর যারা কুফরী করেছে তারা লড়াই করে তাগূতের পথে। সুতরাং তোমরা লড়াই কর শয়তানের বন্ধুদের বিরুদ্ধে। নিশ্চয় শয়তানের চক্রান্ত দুর্বল।",
    "তুমি কি তাদেরকে দেখনি যাদেরকে বলা হয়েছিল, তোমরা তোমাদের হাত গুটিয়ে নাও এবং সালাত কায়েম কর ও যাকাত প্রদান কর? অতঃপর তাদের উপর যখন লড়াই ফরয করা হল, তখন তাদের একদল মানুষকে ভয় করতে লাগল আল্লাহকে ভয় করার অনুরূপ অথবা তার চেয়ে কঠিন ভয়। আর বলল, ‘হে আমাদের রব, আপনি আমাদের উপর লড়াই ফরয করলেন কেন? আমাদেরকে কেন আরো কিছুকালের অবকাশ দিলেন না’? বল, ‘দুনিয়ার সুখ সামান্য। আর যে তাকওয়া অবলম্বন করে তার জন্য আখিরাত উত্তম। আর তোমাদের প্রতি সূতা পরিমাণ যুলমও করা হবে না’।",
    "তোমরা যেখানেই থাক না কেন মৃত্যু তোমাদের নাগাল পাবে, যদিও তোমরা সুদৃঢ় দুর্গে অবস্থান কর। আর যদি তাদের কাছে কোন কল্যাণ পৌঁছে তবে বলে, ‘এটি আল্লাহর পক্ষ থেকে’। আর যদি কোন অকল্যাণ পৌঁছে, তখন বলে, ‘এটি তোমার পক্ষ থেকে’। বল, ‘সব কিছু আল্লাহর পক্ষ থেকে’। সুতরাং এই কওমের কী হল, তারা কোন কথা বুঝতে চায় না!",
    "তোমার কাছে যে কল্যাণ পৌঁছে তা আল্লাহর পক্ষ থেকে, আর যে অকল্যাণ তোমার কাছে পৌঁছে তা তোমার নিজের পক্ষ থেকে। আর আমি তোমাকে মানুষের জন্য রাসূলরূপে প্রেরণ করেছি এবং সাক্ষী হিসেবে আল্লাহ যথেষ্ট।",
    "যে রাসূলের আনুগত্য করল, সে আল্লাহরই আনুগত্য করল। আর যে বিমুখ হল, তবে আমি তোমাকে তাদের উপর তত্ত্বাবধায়ক করে প্রেরণ করিনি।",
    "আর তারা বলে, ‘আনুগত্য (করি)’; অতঃপর যখন তারা তোমার কাছ থেকে বের হয়ে যায়, তাদের একদল যা বলে, রাতে তার বিপরীত পরিকল্পনা করে। আর আল্লাহ লিখে রাখেন, তারা রাতে যা পরিকল্পনা করে। সুতরাং তুমি তাদেরকে এড়িয়ে চল এবং আল্লাহর উপর তাওয়াক্কুল কর। কর্মবিধায়ক হিসেবে আল্লাহই যথেষ্ট।",
    "তারা কি কুরআন নিয়ে গবেষণা করে না? আর যদি তা আল্লাহ ছাড়া অন্য কারো পক্ষ থেকে হত, তবে অবশ্যই তারা এতে অনেক বৈপরীত্য দেখতে পেত।",
    "আর যখন তাদের কাছে শান্তি কিংবা ভীতিজনক কোন বিষয় আসে, তখন তারা তা প্রচার করে। আর যদি তারা সেটি রাসূলের কাছে এবং তাদের কর্তৃত্বের অধিকারীদের কাছে পৌঁছে দিত, তাহলে অবশ্যই তাদের মধ্যে যারা তা উদ্ভাবন করে তারা তা জানত। আর যদি তোমাদের উপর আল্লাহর অনুগ্রহ ও তাঁর রহমত না হত, তবে অবশ্যই অল্প কয়েকজন ছাড়া তোমরা শয়তানের অনুসরণ করতে।",
    "অতএব তুমি আল্লাহর রাস্তায় লড়াই কর। তুমি শুধু তোমার নিজের ব্যাপারে দায়িত্বপ্রাপ্ত এবং মুমিনদেরকে উদ্বুদ্ধ কর। আশা করা যায় আল্লাহ অচিরেই কাফিরদের শক্তি প্রতিহত করবেন। আর আল্লাহ শক্তিতে প্রবলতর এবং শাস্তিদানে কঠোরতর।",
    "যে ভাল সুপারিশ করবে, তা থেকে তার জন্য একটি অংশ থাকবে এবং যে মন্দ সুপারিশ করবে তার জন্যও তা থেকে একটি অংশ থাকবে। আর আল্লাহ প্রতিটি বিষয়ের সংরক্ষণকারী।",
    "আর যখন তোমাদেরকে সালাম দেয়া হবে তখন তোমরা তার চেয়ে উত্তম সালাম দেবে। অথবা জবাবে তাই দেবে। নিশ্চয় আল্লাহ সব বিষয়ে পূর্ণ হিসাবকারী।",
    "আল্লাহ, তিনি ছাড়া কোন (সত্য) ইলাহ নেই। অবশ্যই তিনি তোমাদেরকে একত্র করবেন কিয়ামতের দিনে। এতে কোন সন্দেহ নেই। আর কথায় আল্লাহর চেয়ে অধিক সত্যবাদী কে?",
    "সুতরাং মুনাফিকদের ব্যাপারে তোমাদের কী হল যে, তোমরা দু’ দল হয়ে গেলে? অথচ আল্লাহ তারা যা কামাই করেছে তার জন্য তাদেরকে পূর্বাবস্থায় ফিরিয়ে দিয়েছেন। আল্লাহ যাকে পথভ্রষ্ট করেছেন তোমরা কি তাকে হিদায়াত করতে চাও? আর আল্লাহ যাকে পথভ্রষ্ট করেন তুমি কখনো তার জন্য কোন পথ পাবে না।",
    "তারা কামনা করে, যদি তোমরা কুফরী করতে যেভাবে তারা কুফরী করেছে। অতঃপর তোমরা সমান হয়ে যেতে। সুতরাং আল্লাহর রাস্তায় হিজরত না করা পর্যন্ত তাদের মধ্য থেকে কাউকে তোমরা বন্ধুরূপে গ্রহণ করো না। অতএব তারা যদি মুখ ফিরিয়ে নেয় তাহলে তাদেরকে পাকড়াও কর এবং তাদেরকে যেখানে পাও হত্যা কর। আর তাদের কাউকে অভিভাবকরূপে গ্রহণ করো না এবং না সাহায্যকারীরূপে।",
    "তবে (তাদেরকে হত্যা করো না) যারা মিলিত হয় এমন কওমের সাথে, যাদের মধ্যে ও তোমাদের মধ্যে সন্ধিচুক্তি রয়েছে। অথবা তোমাদের কাছে আসে এমন অবস্থায় যে, তোমাদের বিরুদ্ধে যুদ্ধ করতে কিংবা তাদের কওমের বিরুদ্ধে যুদ্ধ করতে তাদের মন সঙ্কুচিত হয়ে গিয়েছে। আর আল্লাহ চাইলে অবশ্যই তাদেরকে তোমাদের উপর ক্ষমতা দিতে পারতেন। অতঃপর নিশ্চিতরূপে তারা তোমাদের বিরুদ্ধে যুদ্ধ করত। অতএব তারা যদি তোমাদের থেকে সরে যায় অতঃপর তোমাদের বিরুদ্ধে যুদ্ধ না করে এবং তোমাদের কাছে শান্তি প্রস্তাব উপস্থাপন করে, তাহলে আল্লাহ তোমাদের জন্য তাদের বিরুদ্ধে কোন পথ রাখেননি।",
    "তোমরা অচিরেই অন্য লোককে পাবে, যারা তোমাদের কাছে নিরাপত্তা চাইবে এবং নিরাপত্তা চাইবে তাদের কওমের কাছে। যখনই তাদেরকে ফিতনার দিকে ফিরানো হয়, তারা সেখানে ফিরে যায়। সুতরাং যদি তারা তোমাদের থেকে সরে না যায় এবং তোমাদের কাছে সন্ধি প্রস্তাব উপস্থাপন না করে এবং নিজদের হাত গুটিয়ে না নেয়, তাহলে তাদেরকে পাকড়াও করবে এবং হত্যা করবে যেখানেই তাদের নাগাল পাবে। আর ওরাই তারা, যাদের বিরুদ্ধে আমি তোমাদেরকে সুস্পষ্ট ক্ষমতা দিয়েছি।",
    "আর কোন মুমিনের কাজ নয় অন্য মুমিনকে হত্যা করা, তবে ভুলবশত (হলে ভিন্ন কথা)। যে ব্যক্তি ভুলক্রমে কোন মুমিনকে হত্যা করবে, তাহলে একজন মুমিন দাসকে মুক্ত করতে হবে এবং দিয়াত (রক্ত পণ দিতে হবে) যা হস্তান্তর করা হবে তার পরিজনদের কাছে। তবে তারা যদি সদাকা (ক্ষমা) করে দেয় (তাহলে দিতে হবে না)। আর সে যদি তোমাদের শত্রু কওমের হয় এবং সে মুমিন, তাহলে একজন মুমিন দাস মুক্ত করবে। আর যদি এমন কওমের হয় যাদের মধ্যে ও তোমাদের মধ্যে সন্ধিচুক্তি রয়েছে তাহলে দিয়াত দিতে হবে, যা হস্তান্তর করা হবে তার পরিবারের কাছে এবং একজন মুমিন দাস মুক্ত করতে হবে। তবে যদি না পায় তাহলে একাধারে দু’মাস সিয়াম পালন করবে। এটি আল্লাহর পক্ষ থেকে ক্ষমাস্বরূপ। আর আল্লাহ সর্বজ্ঞ, প্রজ্ঞাময়।",
    "আর যে ইচ্ছাকৃত কোন মুমিনকে হত্যা করবে, তার প্রতিদান হচ্ছে জাহান্নাম, সেখানে সে স্থায়ী হবে। আর আল্লাহ তার উপর ক্রুদ্ধ হবেন, তাকে লা‘নত করবেন এবং তার জন্য বিশাল আযাব প্রস্তুত করে রাখবেন।",
    "হে মুমিনগণ, যখন তোমরা আল্লাহর রাস্তায় বের হবে তখন যাচাই করবে এবং যে তোমাদেরকে সালাম দেবে দুনিয়ার জীবনের সম্পদের আশায় তাকে বলবে না যে, ‘তুমি মুমিন নও’। বস্ত্ততঃ আল্লাহর কাছে প্রচুর গনীমত আছে। তোমরাতো পূর্বে এরূপই ছিলে। অতঃপর আল্লাহ তোমাদের প্রতি অনুগ্রহ করলেন। সুতরাং তোমরা যাচাই করবে। নিশ্চয় তোমরা যা কর সে বিষয়ে আল্লাহ সম্যক অবগত।",
    "বসে থাকা মুমিনগণ, যারা ওযরগ্রস্ত নয় এবং নিজদের জান ও মাল দ্বারা আল্লাহর রাস্তায় জিহাদকারীগণ এক সমান নয়। নিজদের জান ও মাল দ্বারা জিহাদকারীদের মর্যাদা আল্লাহ বসে থাকাদের উপর অনেক বাড়িয়ে দিয়েছেন। আর আল্লাহ প্রত্যেককেই কল্যাণের প্রতিশ্রুতি দিয়েছেন এবং আল্লাহ জিহাদকারীদেরকে বসে থাকাদের উপর মহা পুরস্কার দ্বারা শ্রেষ্ঠত্ব দান করেছেন।",
    "তাঁর পক্ষ থেকে অনেক মর্যাদা, ক্ষমা ও রহমত। আর আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "নিশ্চয় যারা নিজদের প্রতি যুলমকারী, ফেরেশতারা তাদের জান কবজ করার সময় বলে, ‘তোমরা কী অবস্থায় ছিলে’? তারা বলে, ‘আমরা যমীনে দুর্বল ছিলাম’। ফেরেশতারা বলে, ‘আল্লাহর যমীন কি প্রশস্ত ছিল না যে, তোমরা তাতে হিজরত করতে’? সুতরাং ওরাই তারা যাদের আশ্রয়স্থল জাহান্নাম। আর তা মন্দ প্রত্যাবর্তনস্থল।",
    "তবে যে দুর্বল পুরুষ, নারী ও শিশুরা কোন উপায় অবলম্বন করতে পারে না এবং কোন রাস্তা খুঁজে পায় না।",
    "অতঃপর আশা করা যায় যে, আল্লাহ তাদেরকে ক্ষমা করবেন। আর আল্লাহ মার্জনাকারী, ক্ষমাশীল।",
    "আর যে আল্লাহর রাস্তায় হিজরত করবে, সে যমীনে বহু আশ্রয়ের জায়গা ও সচ্ছলতা পাবে। আর যে আল্লাহ ও তাঁর রাসূলের উদ্দেশ্যে মুহাজির হয়ে নিজ ঘর থেকে বের হয় তারপর তাকে মৃত্যু পেয়ে বসে, তাহলে তার প্রতিদান আল্লাহর উপর অবধারিত হয়। আর আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "আর যখন তোমরা যমীনে সফর করবে, তখন তোমাদের সালাত কসর করাতে কোন দোষ নেই। যদি আশঙ্কা কর যে, কাফিররা তোমাদেরকে ফিতনায় ফেলবে*। নিশ্চয় কাফিররা তোমাদের প্রকাশ্য শত্রু। \n* শত্রুদের আক্রমণের আশঙ্কা না থাকলেও সফরে সালাত ‘কসর’ করা যাবে। কেননা মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সকল সফরেই সালাত ‘কসর’ করেছেন।",
    "আর যখন তুমি তাদের মধ্যে থাকবে। অতঃপর তাদের জন্য সালাত কায়েম করবে, তখন যেন তাদের মধ্য থেকে একদল তোমার সাথে দাঁড়ায় এবং তারা তাদের অস্ত্র ধারণ করে। এরপর যখন সিজদা করে ফেলবে, তখন তারা যেন তোমাদের পেছনে অবস্থান নেয়। আর অপর একটি দল যারা সালাত আদায় করেনি তারা যেন তোমার সাথে এসে সালাত আদায় করে এবং তারা যেন তাদের সতর্কতা অবলম্বন ও অস্ত্র ধারণ করে। কাফিররা কামনা করে যদি তোমরা তোমাদের অস্ত্র-শস্ত্র ও আসবাব-পত্র সম্বন্ধে অসতর্ক হও তাহলে তারা তোমাদের উপর একসাথে ঝাঁপিয়ে পড়বে। আর যদি বৃষ্টির কারণে তোমাদের কোন কষ্ট হয় অথবা তোমরা অসুস্থ হও তাহলে অস্ত্র রেখেদেয়াতে তোমাদের কোন দোষ নেই। আর তোমরা তোমাদের সতর্কতা অবলম্বন করবে। নিশ্চয় আল্লাহ কাফিরদের জন্য প্রস্তুত করেছেন লাঞ্ছনাদায়ক আযাব।",
    "অতঃপর যখন তোমরা সালাত পূর্ণ করবে তখন দাঁড়ানো, বসা ও শোয়া অবস্থায় আল্লাহর স্মরণ করবে। অতঃপর যখন নিশ্চিন্ত হবে তখন সালাত (পূর্বের নিয়মে) কায়েম করবে। নিশ্চয় সালাত মুমিনদের উপর নির্দিষ্ট সময়ে ফরয।",
    "আর শত্রু সম্প্রদায় অনুসন্ধানে তোমরা দুর্বল হয়ো না। যদি তোমরা ব্যথা পেয়ে থাক তাহলে তারাও তো ব্যথা পাচ্ছে, যেভাবে তোমরা ব্যথা পাচ্ছ। আর তোমরা আল্লাহর নিকট থেকে আশা করছ যা তারা আশা করছে না। আল্লাহ সর্বজ্ঞ, প্রজ্ঞাময়।",
    "নিশ্চয় আমি তোমার প্রতি যথাযথভাবে কিতাব নাযিল করেছি, যাতে তুমি মানুষের মধ্যে ফয়সালা কর সে অনুযায়ী যা আল্লাহ তোমাকে দেখিয়েছেন। আর তুমি খিয়ানতকারীদের পক্ষে বিতর্ককারী হয়ো না।",
    "আর তুমি আল্লাহর কাছে ক্ষমা চাও। নিশ্চয় আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "আর যারা নিজদের খিয়ানত করে তুমি তাদের পক্ষে বিতর্ক করো না। নিশ্চয় আল্লাহ ভালবাসেন না তাকে, যে খিয়ানতকারী, পাপী।",
    "তারা মানুষের কাছ থেকে লুকাতে চায়, আর আল্লাহর কাছ থেকে লুকাতে চায় না। অথচ তিনি তাদের সাথেই থাকেন যখন তারা রাতে এমন কথার পরিকল্পনা করে যা তিনি পছন্দ করেন না। আর আল্লাহ তারা যা করে তা পরিবেষ্টন করে আছেন।",
    "হে, তোমরাই তো তারা, যারা দুনিয়ার জীবনে তাদের পক্ষে বিতর্ক করেছ। সুতরাং কিয়ামতের দিন তাদের পক্ষে আল্লাহর সাথে কে বিতর্ক করবে? কিংবা কে হবে তাদের তত্ত্বাবধায়ক?",
    "আর যে ব্যক্তি মন্দ কাজ করবে কিংবা নিজের প্রতি যুলম করবে তারপর আল্লাহর কাছে ক্ষমা চাইবে, সে আল্লাহকে পাবে ক্ষমাশীল, পরম দয়ালু।",
    "আর যে পাপ কামাই করবে, বস্ত্তত, সেতো নিজের বিরুদ্ধেই তা কামাই করবে। আর আল্লাহ সর্বজ্ঞ, প্রজ্ঞাময়।",
    "আর যে ব্যক্তি কোন অপরাধ বা পাপ অর্জন করে, অতঃপর কোন নির্দোষ ব্যক্তির উপর তা আরোপ করে, তাহলে সে তো মিথ্যা অপবাদ ও প্রকাশ্য গুনাহের বোঝা বহন করল।",
    "আর তোমার উপর যদি আল্লাহর অনুগ্রহ ও তাঁর দয়া না হত তবে তাদের মধ্য থেকে একদল তোমাকে পথভ্রষ্ট করার সংকল্প করেই ফেলেছিল! আর তারা নিজদের ছাড়া কাউকে পথভ্রষ্ট করে না এবং তারা তোমার কোনই ক্ষতি করতে পারে না। আর আল্লাহ তোমার প্রতি নাযিল করেছেন কিতাব ও হিকমাত এবং তোমাকে শিক্ষা দিয়েছেন যা তুমি জানতে না। আর তোমার উপর আল্লাহর অনুগ্রহ রয়েছে মহান।",
    "তাদের গোপন পরামর্শের অধিকাংশে কোন কল্যাণ নেই। তবে (কল্যাণ আছে) যে নির্দেশ দেয় সদাকা কিংবা ভালো কাজ অথবা মানুষের মধ্যে মীমাংসার। আর যে তা আল্লাহর সন্তুষ্টি লাভের উদ্দেশ্যে করবে তবে অচিরেই আমি তাকে মহাপুরস্কার দান করব।",
    "আর যে রাসূলের বিরুদ্ধাচরণ করে তার জন্য হিদায়াত প্রকাশ পাওয়ার পর এবং মুমিনদের পথের বিপরীত পথ অনুসরণ করে, আমি তাকে ফেরাব যেদিকে সে ফিরে এবং তাকে প্রবেশ করাব জাহান্নামে। আর আবাস হিসেবে তা খুবই মন্দ।",
    "নিশ্চয় আল্লাহ ক্ষমা করেন না তাঁর সাথে শরীক করাকে এবং এ ছাড়া যাকে চান ক্ষমা করেন। আর যে আল্লাহর সাথে শরীক করে সে তো ঘোর পথভ্রষ্টতায় পথভ্রষ্ট হল।",
    "আল্লাহ ছাড়া তারা শুধু নারীমূর্তিকে ডাকে এবং কেবল* অবাধ্য শয়তানকে ডাকে। \n* অর্থাৎ উপাসনা করে।",
    "আল্লাহ তাকে লা‘নত করেছেন এবং সে বলেছে, ‘অবশ্যই আমি তোমার বান্দাদের এক নির্দিষ্ট অংশকে (অনুসারী হিসেবে) গ্রহণ করব’।",
    "‘আর অবশ্যই আমি তাদেরকে পথভ্রষ্ট করব, মিথ্যা আশ্বাস দেব এবং অবশ্যই তাদেরকে আদেশ দেব, ফলে তারা পশুর কান ছিদ্র করবে এবং অবশ্যই তাদেরকে আদেশ করব, ফলে অবশ্যই তারা আল্লাহর সৃষ্টি বিকৃত করবে’। আর যারা আল্লাহর পরিবর্তে শয়তানকে অভিভাবকরূপে গ্রহণ করে, তারা তো স্পষ্টই ক্ষতিগ্রস্ত হল।",
    "সে তাদেরকে প্রতিশ্রুতি দেয় এবং তাদেরকে মিথ্যা আশ্বাস দেয়। আর শয়তান তাদেরকে কেবল প্রতারণামূলক প্রতিশ্রুতিই দেয়।",
    "এদেরই আশ্রয়স্থল জাহান্নাম। আর তারা সেখান থেকে পালাবার জায়গা পাবে না।",
    "আর যারা ঈমান এনেছে এবং নেক আমল করেছে, অচিরেই তাদেরকে আমি প্রবেশ করাব জান্নাতসমূহে, যার তলদেশে প্রবাহিত হচ্ছে নহরসমূহ। সেখানে তারা হবে স্থায়ী। আল্লাহর প্রতিশ্রুতি সত্য। আর কথায় আল্লাহ অপেক্ষা অধিক সত্যবাদী কে?",
    "না তোমাদের আশায় এবং না কিতাবীদের আশায় (কাজ হবে)। যে মন্দকাজ করবে তাকে তার প্রতিফল দেয়া হবে। আর সে তার জন্য আল্লাহ ছাড়া কোন অভিভাবক ও সাহায্যকারী পাবে না।",
    "আর পুরুষ কিংবা নারীর মধ্য থেকে যে নেককাজ করবে এমতাবস্থায় যে, সে মুমিন, তাহলে তারা জান্নাতে প্রবেশ করবে এবং তাদের প্রতি খেজুর বীচির আবরণ পরিমাণ যুলমও করা হবে না।",
    "আর দীনের ব্যাপারে তার তুলনায় কে উত্তম, যে সৎকর্মপরায়ণ অবস্থায় আল্লাহর কাছে নিজকে পূর্ণ সমর্পণ করল এবং একনিষ্ঠভাবে ইবরাহীমের আদর্শ অনুসরণ করল? আর আল্লাহ ইবরাহীমকে পরম বন্ধুরূপে গ্রহণ করেছেন।",
    "আর যা আসমানসমূহে আছে এবং যা আছে যমীনে সব আল্লাহরই। আর আল্লাহ সবকিছুকে পরিবেষ্টনকারী।",
    "তারা তোমার কাছে নারীদের ব্যাপারে সমাধান চায়। বল, আল্লাহ তাদের ব্যাপারে তোমাদেরকে সমাধান দিচ্ছেন এবং সমাধান দিচ্ছে ঐ আয়াতসমূহ যা কিতাবে তোমাদেরকে পাঠ করে শুনানো হয় ইয়াতীম নারীদের ব্যাপারে। যাদেরকে তোমরা প্রদান কর না যা তাদের জন্য নির্ধারণ করা হয়েছে, অথচ তোমরা তাদেরকে বিবাহ করতে আগ্রহী হও। আর দুর্বল শিশুদের ব্যাপারে ও ইয়াতীমদের প্রতি তোমাদের ইনসাফ প্রতিষ্ঠা সম্পর্কে। আর তোমরা যে কোন ভালো কাজ কর, নিশ্চয় আল্লাহ সে বিষয়ে পরিজ্ঞাত।",
    "যদি কোন নারী তার স্বামীর পক্ষ থেকে কোন দুর্ব্যবহার কিংবা উপেক্ষার আশঙ্কা করে, তাহলে তারা উভয়ে কোন মীমাংসা করলে তাদের কোন অপরাধ নেই। আর মীমাংসা কল্যাণকর এবং মানুষের মধ্যে কৃপণতা বিদ্যমান রয়েছে। আর যদি তোমরা সৎকর্ম কর এবং তাকওয়া অবলম্বন কর তবে আল্লাহ তোমরা যা কর সে বিষয়ে সম্যক অবগত।",
    "আর তোমরা যতই কামনা কর না কেন তোমাদের স্ত্রীদের মধ্যে সমান আচরণ করতে কখনো পারবে না। সুতরাং তোমরা (একজনের প্রতি) সম্পূর্ণরূপে ঝুঁকে পড়ো না, যার ফলে তোমরা (অপরকে) ঝুলন্তের মত করে রাখবে। আর যদি তোমরা মীমাংসা করে নাও এবং তাকওয়া অবলম্বন কর তবে নিশ্চয় আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "আর যদি তারা উভয়ে বিচ্ছিন্ন হয়ে যায় তবে আল্লাহ প্রত্যেককে নিজ প্রাচুর্য দ্বারা অভাবমুক্ত করবেন। আর আল্লাহ প্রাচুর্যময়, প্রজ্ঞাবান।",
    "আল্লাহর জন্যই রয়েছে আসমানসমূহে যা আছে এবং যা আছে যমীনে। আর তোমাদের পূর্বে যাদেরকে কিতাব দেয়া হয়েছে তাদেরকে এবং তোমাদেরকে আমি নির্দেশ দিয়েছি যে, তোমরা আল্লাহকে ভয় কর। আর যদি কুফরী কর তাহলে আসমানসমূহে যা আছে এবং যা আছে যমীনে সব আল্লাহরই। আর আল্লাহ অভাবহীন, প্রশংসিত।",
    "আর আল্লাহর জন্যই রয়েছে, যা আছে আসমানসমূহে এবং যা আছে যমীনে। আর কর্মবিধায়ক হিসেবে আল্লাহই যথেষ্ট।",
    "হে মানুষ, যদি আল্লাহ চান তোমাদেরকে সরিয়ে দেবেন এবং অপরকে আনবেন। আর আল্লাহ এর উপর সক্ষম।",
    "যে দুনিয়ার প্রতিদান চায় তবে আল্লাহর কাছে দুনিয়া ও আখিরাতের প্রতিদান রয়েছে। আর আল্লাহ সর্বশ্রোতা, সর্বদ্রষ্টা।",
    "হে মুমিনগণ, তোমরা ন্যায়ের উপর সুপ্রতিষ্ঠিত থাকবে আল্লাহর জন্য সাক্ষীরূপে। যদিও তা তোমাদের নিজদের কিংবা পিতা-মাতার অথবা নিকটাত্মীয়দের বিরুদ্ধে হয়। যদি সে বিত্তশালী হয় কিংবা দরিদ্র, তবে আল্লাহ উভয়ের ঘনিষ্ঠতর। সুতরাং ন্যায় প্রতিষ্ঠা করতে তোমরা প্রবৃত্তির অনুসরণ করো না। আর যদি তোমরা ঘুরিয়ে- পেঁচিয়ে কথা বল কিংবা এড়িয়ে যাও তবে আল্লাহ তোমরা যা কর সে বিষয়ে সম্যক অবগত।",
    "হে মুমিনগণ, তোমরা ঈমান আন আল্লাহর প্রতি, তাঁর রাসূলের প্রতি এবং সে কিতাবের প্রতি যা তিনি তাঁর রাসূলের উপর নাযিল করেছেন এবং সে কিতাবের প্রতি যা তিনি পূর্বে নাযিল করেছেন। আর যে আল্লাহ, তাঁর ফেরেশতাগণ, তাঁর কিতাবসমূহ, তাঁর রাসূলগণ এবং শেষ দিনকে অস্বীকার করবে, সে ঘোর বিভ্রান্তিতে বিভ্রান্ত হবে।",
    "নিশ্চয় যারা ঈমান এনেছে তারপর কুফরী করেছে, আবার ঈমান এনেছে তারপর কুফরী করেছে, এরপর কুফরীকে বাড়িয়ে দিয়েছে, আল্লাহ তাদেরকে ক্ষমা করার নন এবং তাদেরকে পথ প্রদর্শন করার নন।",
    "মুনাফিকদের সুসংবাদ দাও যে, নিশ্চয় তাদের জন্যই রয়েছে যন্ত্রণাদায়ক আযাব।",
    "যারা মুমিনদের পরিবর্তে কাফিরদেরকে বন্ধুরূপে গ্রহণ করে, তারা কি তাদের কাছে সম্মান চায়? অথচ যাবতীয় সম্মান আল্লাহর।",
    "আর তিনি তো কিতাবে তোমাদের প্রতি নাযিল করেছেন যে, যখন তোমরা শুনবে আল্লাহর আয়াতসমূহ অস্বীকার করা হচ্ছে এবং সেগুলো নিয়ে উপহাস করা হচ্ছে, তাহলে তোমরা তাদের সাথে বসবে না, যতক্ষণ না তারা অন্য কথায় নিবিষ্ট হয়, তা না হলে তোমরাও তাদের মত হয়ে যাবে। নিশ্চয় আল্লাহ মুনাফিক ও কাফিরদের সকলকে জাহান্নামে একত্রকারী।",
    "যারা তোমাদের ব্যাপারে (অকল্যাণের) অপেক্ষায় থাকে, অতঃপর আল্লাহর পক্ষ থেকে যদি তোমাদের বিজয় হয় তবে তারা বলে, ‘আমরা কি তোমাদের সাথে ছিলাম না’? আর যদি কাফিরদের আংশিক বিজয় হয়, তবে তারা বলে, ‘আমরা কি তোমাদের উপর কর্তৃত্ব করিনি এবং মুমিনদের কবল থেকে তোমাদেরকে রক্ষা করিনি’? সুতরাং আল্লাহ কিয়ামতের দিন তোমাদের মধ্যে বিচার করবেন। আর আল্লাহ কখনো মুমিনদের বিপক্ষে কাফিরদের জন্য পথ রাখবেন না।",
    "নিশ্চয় মুনাফিকরা আল্লাহকে ধোঁকা দেয়। আর তিনি তাদেরকে ধোঁকায় ফেলেন। আর যখন তারা সালাতে দাঁড়ায় তখন অলসভাবে দাঁড়ায়, তারা লোকদেরকে দেখায় এবং তারা আল্লাহকে কমই স্মরণ করে।",
    "তারা এর মধ্যে দোদুল্যমান, না এদের দিকে আর না ওদের দিকে। আর আল্লাহ যাকে পথভ্রষ্ট করেন তুমি কখনো তার জন্য কোন পথ পাবে না।",
    "হে মুমিনগণ, তোমরা মুমিনগণ ছাড়া কাফিরদেরকে বন্ধুরূপে গ্রহণ করো না। তোমরা কি আল্লাহর জন্য তোমাদের বিপক্ষে কোন স্পষ্ট দলীল সাব্যস্ত করতে চাও?",
    "নিশ্চয় মুনাফিকরা জাহান্নামের সর্বনিম্ন স্তরে থাকবে। আর তুমি কখনও তাদের জন্য কোন সাহায্যকারী পাবে না।",
    "তবে যারা তাওবা করে নিজদেরকে শুধরে নেয়, আল্লাহকে দৃঢ়ভাবে আঁকড়ে ধরে এবং আল্লাহর জন্য নিজদের দীনকে খালেস করে, তারা মুমিনদের সাথে থাকবে। আর অচিরেই আল্লাহ মুমিনদেরকে মহাপুরস্কার দান করবেন।",
    "যদি তোমরা কৃতজ্ঞতা প্রকাশ কর এবং ঈমান আন তাহলে তোমাদেরকে আযাব দিয়ে আল্লাহ কী করবেন? আল্লাহ পুরস্কার দানকারী, সর্বজ্ঞ।",
    "মন্দ কথার প্রচার আল্লাহ পছন্দ করেন না, তবে কারো উপর যুলম করা হলে ভিন্ন কথা। আর আল্লাহ সর্বশ্রোতা, সর্বজ্ঞানী।",
    "যদি তোমরা ভালো কিছু প্রকাশ কর, কিংবা গোপন কর অথবা মন্দ ক্ষমা করে দাও, তবে নিশ্চয় আল্লাহ ক্ষমাশীল, ক্ষমতাবান।",
    "নিশ্চয় যারা আল্লাহ ও তাঁর রাসূলগণের সাথে কুফরী করে এবং আল্লাহ ও তাঁর রাসূলগণের মধ্যে পার্থক্য করতে চায় এবং বলে, ‘আমরা কতককে বিশ্বাস করি আর কতকের সাথে কুফরী করি’ এবং তারা এর মাঝামাঝি একটি পথ গ্রহণ করতে চায় ।",
    "তারাই প্রকৃত কাফির এবং আমি কাফিরদের জন্য প্রস্তুত করেছি অপমানকর আযাব।",
    "আর যারা আল্লাহ ও তাঁর রাসূলগণের প্রতি ঈমান এনেছে এবং তাদের কারো মধ্যে পার্থক্য করেনি, তাদেরকে অচিরেই তিনি তাদের প্রতিদান দিবেন এবং আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "কিতাবীগণ তোমার নিকট চায় যে, আসমান থেকে তুমি তাদের উপর একটি কিতাব নাযিল কর। অথচ তারা মূসার কাছে এর চেয়ে বড় কিছু চেয়েছিল, যখন তারা বলেছিল, ‘আমাদেরকে সামনাসামনি আল্লাহকে দেখাও’। ফলে তাদেরকে তাদের অন্যায়ের কারণে বজ্র পাকড়াও করেছিল। অতঃপর তারা বাছুরকে (উপাস্যরূপে) গ্রহণ করল, তাদের নিকট স্পষ্ট প্রমাণসমূহ আসার পরও। তারপর আমি তা ক্ষমা করে দিয়েছিলাম এবং মূসাকে দিয়েছিলাম সুস্পষ্ট প্রমাণ।",
    "আর তাদের অঙ্গীকার গ্রহণের জন্য তূরকে তাদের উপর তুলে ধরেছিলাম এবং তাদেরকে বলেছিলাম, ‘দরজায় প্রবেশ কর অবনত হয়ে’। তাদেরকে আমি আরও বলেছিলাম, ‘শনিবারে সীমালঙ্ঘন করো না’ এবং আমি তাদের কাছ থেকে দৃঢ় অঙ্গীকার নিয়েছিলাম।",
    "অতঃপর (তাদের শাস্তি দেয়া হয়েছিল) তাদের অঙ্গীকার ভঙ্গ, আল্লাহর আয়াতসমূহের সাথে কুফরী করা, অন্যায়ভাবে নবীগণকে হত্যা করা এবং এ কথা বলার কারণে যে, ‘আমাদের অন্তরসমূহ আচ্ছাদিত’। বরং আল্লাহ তাদের কুফরীর কারণে অন্তরের উপর মোহর এঁটে দিয়েছিলেন। সুতরাং স্বল্পসংখ্যক ছাড়া তারা ঈমান আনবে না।",
    "আর তাদের কুফরীর কারণে এবং মারইয়ামের বিরুদ্ধে মারাত্মক অপবাদ দেয়ার কারণে।",
    "এবং তাদের এ কথার কারণে যে, ‘আমরা আল্লাহর রাসূল মারইয়াম পুত্র ঈসা মাসীহকে হত্যা করেছি’। অথচ তারা তাকে হত্যা করেনি এবং তাকে শূলেও চড়ায়নি। বরং তাদেরকে ধাঁধায় ফেলা হয়েছিল। আর নিশ্চয় যারা তাতে মতবিরোধ করেছিল, অবশ্যই তারা তার ব্যাপারে সন্দেহের মধ্যে ছিল। ধারণার অনুসরণ ছাড়া এ ব্যাপারে তাদের কোন জ্ঞান নেই। আর এটা নিশ্চিত যে, তারা তাকে হত্যা করেনি।",
    "বরং আল্লাহ তাঁর কাছে তাকে তুলে নিয়েছেন এবং আল্লাহ মহা পরাক্রমশালী, প্রজ্ঞাময়।",
    "কিতাবীদের মধ্যে এমন কেউ নেই, যে তার মৃত্যুর পূর্বে তার প্রতি ঈমান আনবে না* এবং কিয়ামতের দিনে সে তাদের বিরুদ্ধে সাক্ষী হবে। \n* কিয়ামতের পূর্বে ঈসা আঃ যখন অবতরণ করবেন, তখন সে যুগের ইয়াহূদী ও নাসারারা পুরো বিষয়টি উপলব্ধি করতে সক্ষম হবে এবং সকলেই মৃত্যুর মুহূর্তে তাঁর প্রতি ঈমান আনবে; কিন্তু ফির‘আউনের মত তাদের ঈমান তখন কোন কাজে আসবে না।",
    "সুতরাং ইয়াহূদীদের যুলমের কারণে আমি তাদের উপর উত্তম খাবারগুলো হারাম করেছিলাম, যা তাদের জন্য হালাল করা হয়েছিল এবং আল্লাহর রাস্তা থেকে অনেককে তাদের বাধা প্রদানের কারণে।",
    "আর তাদের সুদ গ্রহণের কারণে, অথচ তা থেকে তাদেরকে নিষেধ করা হয়েছিল এবং অবৈধভাবে মানুষের সম্পদ খাওয়ার কারণে। আর আমি তাদের মধ্য থেকে কাফিরদের জন্য প্রস্তুত করেছি যন্ত্রণাদায়ক আযাব।",
    "কিন্তু তাদের মধ্যে যারা জ্ঞানে পরিপক্ক এবং মুমিনগণ- যারা তোমার প্রতি যা নাযিল হয়েছে এবং যা নাযিল হয়েছে তোমার পূর্বে- তাতে ঈমান আনে। আর যারা সালাত প্রতিষ্ঠাকারী ও যাকাত প্রদানকারী এবং আল্লাহ ও শেষ দিনে ঈমান আনয়নকারী, তাদেরকে অচিরেই আমি মহাপুরস্কার প্রদান করব।",
    "নিশ্চয় আমি তোমার নিকট ওহী পাঠিয়েছি, যেমন ওহী পাঠিয়েছি নূহ ও তার পরবর্তী নবীগণের নিকট এবং আমি ওহী পাঠিয়েছি ইবরাহীম, ইসমাঈল, ইসহাক, ইয়া‘কূব, তার বংশধরগণ, ঈসা, আইয়ূব, ইউনুস, হারূন ও সুলায়মানের নিকট এবং দাঊদকে প্রদান করেছি যাবূর।",
    "আর অনেক রাসূল, যাদের বর্ণনা তোমাকে পূর্বে দিয়েছি এবং অনেক রাসূল, যাদের বর্ণনা তোমাকে দেইনি আর আল্লাহ মূসার সাথে সুস্পষ্টভাবে কথা বলেছেন।",
    "আর (পাঠিয়েছি) রাসূলগণকে সুসংবাদদাতা ও সতর্ককারীরূপে, যাতে আল্লাহর বিপক্ষে রাসূলদের পর মানুষের জন্য কোন অজুহাত না থাকে। আর আল্লাহ মহাপরাক্রমশালী, প্রজ্ঞাময় ।",
    "কিন্তু আল্লাহ সাক্ষ্য দিচ্ছেন, যা তোমার নিকট তিনি নাযিল করেছেন তার মাধ্যমে। তিনি তা নাযিল করেছেন নিজ জ্ঞানে এবং ফেরেশতারাও সাক্ষ্য দিচ্ছে। আর আল্লাহই সাক্ষীরূপে যথেষ্ট।",
    "নিশ্চয় যারা কুফরী করেছে এবং আল্লাহর পথ থেকে বাধা দিয়েছে,তারা অবশ্যই চূড়ান্তভাবে পথভ্রষ্ট হয়েছে।",
    "নিশ্চয়ই যারা কুফরী করেছে এবং যুলম করেছে, আল্লাহ তাদেরকে ক্ষমা করবেন না এবং তাদেরকে কোন পথ দেখাবেন না।",
    "জাহান্নামের পথ ছাড়া। তারা তাতে স্থায়ী হবে এবং তা আল্লাহর জন্য সহজ।",
    "হে মানুষ, অবশ্যই তোমাদের নিকট রাসূল এসেছে, তোমাদের রবের পক্ষ থেকে সত্য নিয়ে। সুতরাং তোমরা ঈমান আন, তা তোমাদের জন্য উত্তম হবে। আর যদি কুফরী কর, তবে নিশ্চয় আসমানসমূহ ও যমীনে যা রয়েছে, তা আল্লাহর জন্যই এবং আল্লাহ সর্বজ্ঞ, প্রজ্ঞাময়।",
    "হে কিতাবীগণ, তোমরা তোমাদের দীনের মধ্যে বাড়াবাড়ি করো না এবং আল্লাহর উপর সত্য ছাড়া অন্য কিছু বলো না। মারইয়ামের পুত্র মাসীহ ঈসা কেবলমাত্র আল্লাহর রাসূল ও তাঁর কালিমা, যা তিনি প্রেরণ করেছিলেন মারইয়ামের প্রতি এবং তাঁর পক্ষ থেকে রূহ। সুতরাং তোমরা আল্লাহ ও তাঁর রাসূলগণের প্রতি ঈমান আন এবং বলো না, 'তিন'। তোমরা বিরত হও, তা তোমাদের জন্য উত্তম। আল্লাহই কেবল এক ইলাহ, তিনি পবিত্র মহান এ থেকে যে, তাঁর কোন সন্তান হবে। আসমানসূহে যা রয়েছে এবং যা রয়েছে যমীনে, তা আল্লাহরই। আর কর্মবিধায়ক হিসেবে আল্লাহই যথেষ্ট।",
    "মাসীহ কখনো আল্লাহর বান্দা হতে (নিজকে) হেয় মনে করে না এবং নৈকট্যপ্রাপ্ত ফেরেশতারাও না, আর যারা তাঁর ইবাদাতকে হেয় জ্ঞান করে এবং অহঙ্কার করে, তবে অচিরেই আল্লাহ তাদের সবাইকে তাঁর নিকট সমবেত করবেন।",
    "পক্ষান্তরে যারা ঈমান এনেছে এবং সৎকাজ করেছে, তিনি তাদেরকে তাদের পুরষ্কার পরিপূর্ণ দেবেন এবং তাঁর অনুগ্রহে তাদেরকে বাড়িয়ে দেবেন। আর যারা হেয় জ্ঞান করেছে এবং অহঙ্কার করেছে, তিনি তাদেরকে যন্ত্রণাদায়ক শাস্তি দেবেন এবং তারা তাদের জন্য আল্লাহ ছাড়া কোন অভিভাবক ও সাহায্যকারী পাবে না।",
    "হে মানুষ, তোমাদের রবের পক্ষ থেকে তোমাদের নিকট প্রমাণ এসেছে এবং আমি তোমাদের নিকট স্পষ্ট আলো নাযিল করেছি।",
    "অতঃপর যারা আল্লাহর প্রতি ঈমান এনেছে এবং তাকে আঁকড়ে ধরেছে তিনি অবশ্যই তাদেরকে তাঁর পক্ষ থেকে দয়া ও অনুগ্রহে প্রবেশ করাবেন এবং তাঁর দিকে সরল পথ দেখাবেন।",
    "তারা তোমার কাছে সমাধান চায়। বল, ‘আল্লাহ তোমাদেরকে সমাধান দিচ্ছেন ‘কালালা’* সম্পর্কে। কোন ব্যক্তি যদি মারা যায় এমন অবস্থায় যে, তার কোন সন্তান নেই এবং তার এক বোন রয়েছে, তবে সে যা রেখে গিয়েছে বোনের জন্য তার অর্ধেক, আর সে (মহিলা)যদি সন্তানহীনা হয় তবে তার ভাই তার উত্তরাধিকারী হবে। কিন্তু যদি তারা (বোনেরা) দু’জন হয়, তবে সে যা রেখে গিয়েছে তাদের জন্য তার দুই তৃতীয়াংশ। আর যদি তারা কয়েক ভাই বোন পুরুষ ও নারী হয়, তবে পুরুষের জন্য দুই নারীর অংশের সমান হবে’। আল্লাহ তোমাদেরকে ব্যাখ্যা দিচ্ছেন, যাতে তোমরা পথভ্রষ্ট না হও এবং আল্লাহ প্রতিটি বিষয় সম্পর্কে সর্বজ্ঞ’। \n* যার পিতা মাতা জীবিত নেই এবং যে সন্তানহীন তাকে ‘কালালা’ বলা হয়।"
  ]
}