{
  "surahName": "Ar-Room",
  "surahNameArabic": "الروم",
  "surahNameArabicLong": "سورة الروم",
  "surahNameTranslation": "The Romans",
  "revelationPlace": "Mecca",
  "totalAyah": 60,
  "surahNo": 30,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/30.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/030.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/30.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/030.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/30.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/030.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/30.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/030.mp3"
    }
  },
  "english": [
    "Alif-Lãm-Mĩm.",
    "The Romans have been defeated",
    "in a nearby land. Yet following their defeat, they will triumph",
    "within three to nine years. The ˹whole˺ matter rests with Allah before and after ˹victory˺. And on that day the believers will rejoice",
    "at the victory willed by Allah. He gives victory to whoever He wills. For He is the Almighty, Most Merciful.",
    "˹This is˺ the promise of Allah. ˹And˺ Allah never fails in His promise. But most people do not know.",
    "They ˹only˺ know the worldly affairs of this life, but are ˹totally˺ oblivious to the Hereafter.",
    "Have they not reflected upon their own being? Allah only created the heavens and the earth and everything in between for a purpose and an appointed term. Yet most people are truly in denial of the meeting with their Lord!",
    "Have they not travelled throughout the land to see what was the end of those ˹destroyed˺ before them? They were far superior in might; they cultivated the land and developed it more than these ˹Meccans˺ ever have. Their messengers came to them with clear proofs. Allah would have never wronged them, but it was they who wronged themselves.",
    "Then most evil was the end of the evildoers for denying and mocking the signs of Allah.",
    "It is Allah Who originates the creation, and will resurrect it. And then to Him you will ˹all˺ be returned.",
    "On the Day the Hour will arrive, the wicked will be dumbstruck.",
    "There will be no intercessors for them from among their associate-gods, and they will ˹totally˺ deny their associate-gods.",
    "And on the Day the Hour will arrive, the people will then be split ˹into two groups˺.",
    "As for those who believed and did good, they will be rejoicing in a Garden.",
    "And as for those who disbelieved, and denied Our signs and the meeting ˹with Allah˺ in the Hereafter, they will be confined in punishment.",
    "So glorify Allah in the evening and in the morning—",
    "all praise is for Him in the heavens and the earth—as well as in the afternoon, and at noon.",
    "He brings forth the living from the dead and the dead from the living. And He gives life to the earth after its death. And so will you be brought forth ˹from the grave˺.",
    "One of His signs is that He created you from dust, then—behold!—you are human beings spreading over ˹the earth˺.",
    "And one of His signs is that He created for you spouses from among yourselves so that you may find comfort in them. And He has placed between you compassion and mercy. Surely in this are signs for people who reflect.",
    "And one of His signs is the creation of the heavens and the earth, and the diversity of your languages and colours. Surely in this are signs for those of ˹sound˺ knowledge.",
    "And one of His signs is your sleep by night and by day ˹for rest˺ as well as your seeking His bounty ˹in both˺. Surely in this are signs for people who listen.",
    "And one of His signs is that He shows you lightning, inspiring ˹you with˺ hope and fear. And He sends down rain from the sky, reviving the earth after its death. Surely in this are signs for people who understand.",
    "And one of His signs is that the heavens and the earth persist by His command. Then when He calls you out of the earth just once, you will instantly come forth.",
    "And to Him belong all those in the heavens and the earth—all are subject to His Will.",
    "And He is the One Who originates the creation then will resurrect it—which is even easier for Him. To Him belong the finest attributes in the heavens and the earth. And He is the Almighty, All-Wise.",
    "He sets forth for you an example ˹drawn˺ from your own lives: would you allow some of those ˹bondspeople˺ in your possession to be your equal partners in whatever ˹wealth˺ We have provided you, keeping them in mind as you are mindful of your peers? This is how We make the signs clear for people who understand.",
    "In fact, the wrongdoers merely follow their desires with no knowledge. Who then can guide those Allah has left to stray? They will have no helpers.",
    "So be steadfast in faith in all uprightness ˹O Prophet˺—the natural Way of Allah which He has instilled in ˹all˺ people. Let there be no change in this creation of Allah. That is the Straight Way, but most people do not know.",
    "˹O believers!˺ Always turn to Him ˹in repentance˺, be mindful of Him, and establish prayers. And do not be polytheists—",
    "˹like˺ those who have divided their faith and split into sects, each rejoicing in what they have.",
    "When people are touched with hardship, they cry out to their Lord, turning to Him ˹alone˺. But as soon as He gives them a taste of His mercy, a group of them associates ˹others˺ with their Lord ˹in worship˺",
    "becoming ungrateful for whatever ˹favours˺ We have given them. So enjoy yourselves, for soon you will know.",
    "Or have We sent down to them an authority which attests to what they associate ˹with Him˺?",
    "If We give people a taste of mercy, they become prideful ˹because˺ of it. But if they are afflicted with an evil for what their hands have done, they instantly fall into despair.",
    "Have they not seen that Allah gives abundant or limited provisions to whoever He wills? Surely in this are signs for people who believe.",
    "So give your close relatives their due, as well as the poor and the ˹needy˺ traveller. That is best for those who seek the pleasure of Allah, and it is they who will be successful.",
    "Whatever loans you give, ˹only˺ seeking interest at the expense of people’s wealth will not increase with Allah. But whatever charity you give, ˹only˺ seeking the pleasure of Allah—it is they whose reward will be multiplied.",
    "It is Allah Who created you, then gives you provisions, then will cause you to die, and then will bring you back to life. Can any of your associate-gods do any of this? Glorified and Exalted is He above what they associate with Him ˹in worship˺!",
    "Corruption has spread on land and sea as a result of what people’s hands have done, so that Allah may cause them to taste ˹the consequences of˺ some of their deeds and perhaps they might return ˹to the Right Path˺.",
    "Say, ˹O Prophet,˺ “Travel throughout the land and see what was the end of those ˹destroyed˺ before ˹you˺—most of them were polytheists.”",
    "So be steadfast in the Upright Faith ˹O Prophet˺, before the coming of a Day from Allah that cannot be averted. On that Day the people will be divided:",
    "those who disbelieved will bear ˹the burden of˺ their own disbelief; and those who did good will have prepared for themselves ˹eternal homes˺",
    "so that He may ˹generously˺ reward those who believe and do good, out of His grace. He truly does not like the disbelievers.",
    "And one of His signs is that He sends the winds, ushering in good news ˹of rain˺ so that He may give you a taste of His mercy, and that ships may sail by His command, and that you may seek His bounty, and perhaps you will be grateful.",
    "Indeed, We sent before you ˹O Prophet˺ messengers, each to their own people, and they came to them with clear proofs. Then We inflicted punishment upon those who persisted in wickedness. For it is Our duty to help the believers.",
    "It is Allah Who sends the winds, which then stir up ˹vapour, forming˺ clouds, which He then spreads out in the sky or piles up into masses as He wills, from which you see rain come forth. Then as soon as He causes it to fall on whoever He wills of His servants, they rejoice",
    "although they had utterly lost hope just before it was sent down to them.",
    "See then the impact of Allah’s mercy: how He gives life to the earth after its death! Surely That ˹same God˺ can raise the dead. For He is Most Capable of everything.",
    "Then if We send a ˹harsh˺ wind which they see withering ˹their˺ crops, they will definitely deny ˹old favours˺ right after.",
    "So you ˹O Prophet˺ certainly cannot make the dead hear ˹the truth˺. Nor can you make the deaf hear the call when they turn their backs and walk away.",
    "Nor can you lead the blind out of their misguidance. You can make none hear ˹the truth˺ except those who believe in Our revelations, ˹fully˺ submitting ˹to Allah˺.",
    "It is Allah Who created you in a state of weakness, then developed ˹your˺ weakness into strength, then developed ˹your˺ strength into weakness and old age. He creates whatever He wills. For He is the All-Knowing, Most Capable.",
    "And on the Day the Hour will arrive, the wicked will swear that they did not stay ˹in this world˺ more than an hour. In this way they were always deluded ˹in the world˺.",
    "But those gifted with knowledge and faith will say ˹to them˺, “You did actually stay—as destined by Allah—until the Day of Resurrection. So here is the Day of Resurrection ˹which you denied˺! But you did not know ˹it was true˺.”",
    "So on that Day the wrongdoers’ excuses will not benefit them, nor will they be allowed to appease ˹their Lord˺.",
    "We have certainly set forth every ˹kind of˺ lesson for people in this Quran. And no matter what sign you bring to them ˹O Prophet˺, the disbelievers will definitely say ˹to the believers˺, “You are only a people of falsehood.”",
    "This is how Allah seals the hearts of those unwilling to know ˹the truth˺.",
    "So be patient, for the promise of Allah certainly is true. And do not be disturbed by those who have no sure faith."
  ],
  "arabic1": [
    "الٓمّٓ",
    "غُلِبَتِ الرُّوْمُ",
    "فِیْۤ اَدْنَی الْاَرْضِ وَهُمْ مِّنْ بَعْدِ غَلَبِهِمْ سَیَغْلِبُوْنَ",
    "فِیْ بِضْعِ سِنِیْنَ لِلّٰهِ الْاَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ وَیَوْمَىِٕذٍ یَّفْرَحُ الْمُؤْمِنُوْنَ",
    "بِنَصْرِ اللّٰهِ یَنْصُرُ مَنْ یَّشَآءُ وَهُوَ الْعَزِیْزُ الرَّحِیْمُ",
    "وَعْدَ اللّٰهِ لَا یُخْلِفُ اللّٰهُ وَعْدَهٗ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَعْلَمُوْنَ",
    "یَعْلَمُوْنَ ظَاهِرًا مِّنَ الْحَیٰوةِ الدُّنْیَا وَهُمْ عَنِ الْاٰخِرَةِ هُمْ غٰفِلُوْنَ",
    "اَوَلَمْ یَتَفَكَّرُوْا فِیْۤ اَنْفُسِهِمْ ۫ مَا خَلَقَ اللّٰهُ السَّمٰوٰتِ وَالْاَرْضَ وَمَا بَیْنَهُمَاۤ اِلَّا بِالْحَقِّ وَاَجَلٍ مُّسَمًّی وَاِنَّ كَثِیْرًا مِّنَ النَّاسِ بِلِقَآئِ رَبِّهِمْ لَكٰفِرُوْنَ",
    "اَوَلَمْ یَسِیْرُوْا فِی الْاَرْضِ فَیَنْظُرُوْا كَیْفَ كَانَ عَاقِبَةُ الَّذِیْنَ مِنْ قَبْلِهِمْ كَانُوْۤا اَشَدَّ مِنْهُمْ قُوَّةً وَّاَثَارُوا الْاَرْضَ وَعَمَرُوْهَاۤ اَكْثَرَ مِمَّا عَمَرُوْهَا وَجَآءَتْهُمْ رُسُلُهُمْ بِالْبَیِّنٰتِ فَمَا كَانَ اللّٰهُ لِیَظْلِمَهُمْ وَلٰكِنْ كَانُوْۤا اَنْفُسَهُمْ یَظْلِمُوْنَ",
    "ثُمَّ كَانَ عَاقِبَةَ الَّذِیْنَ اَسَآءُوا السُّوْٓاٰۤی اَنْ كَذَّبُوْا بِاٰیٰتِ اللّٰهِ وَكَانُوْا بِهَا یَسْتَهْزِءُوْنَ",
    "اَللّٰهُ یَبْدَؤُا الْخَلْقَ ثُمَّ یُعِیْدُهٗ ثُمَّ اِلَیْهِ تُرْجَعُوْنَ",
    "وَیَوْمَ تَقُوْمُ السَّاعَةُ یُبْلِسُ الْمُجْرِمُوْنَ",
    "وَلَمْ یَكُنْ لَّهُمْ مِّنْ شُرَكَآىِٕهِمْ شُفَعٰٓؤُا وَكَانُوْا بِشُرَكَآىِٕهِمْ كٰفِرِیْنَ",
    "وَیَوْمَ تَقُوْمُ السَّاعَةُ یَوْمَىِٕذٍ یَّتَفَرَّقُوْنَ",
    "فَاَمَّا الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصَّلِحٰتِ فَهُمْ فِیْ رَوْضَةٍ یُّحْبَرُوْنَ",
    "وَاَمَّا الَّذِیْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰیٰتِنَا وَلِقَآئِ الْاٰخِرَةِ فَاُولٰٓىِٕكَ فِی الْعَذَابِ مُحْضَرُوْنَ",
    "فَسُبْحٰنَ اللّٰهِ حِیْنَ تُمْسُوْنَ وَحِیْنَ تُصْبِحُوْنَ",
    "وَلَهُ الْحَمْدُ فِی السَّمٰوٰتِ وَالْاَرْضِ وَعَشِیًّا وَّحِیْنَ تُظْهِرُوْنَ",
    "یُخْرِجُ الْحَیَّ مِنَ الْمَیِّتِ وَیُخْرِجُ الْمَیِّتَ مِنَ الْحَیِّ وَیُحْیِ الْاَرْضَ بَعْدَ مَوْتِهَا وَكَذٰلِكَ تُخْرَجُوْنَ",
    "وَمِنْ اٰیٰتِهٖۤ اَنْ خَلَقَكُمْ مِّنْ تُرَابٍ ثُمَّ اِذَاۤ اَنْتُمْ بَشَرٌ تَنْتَشِرُوْنَ",
    "وَمِنْ اٰیٰتِهٖۤ اَنْ خَلَقَ لَكُمْ مِّنْ اَنْفُسِكُمْ اَزْوَاجًا لِّتَسْكُنُوْۤا اِلَیْهَا وَجَعَلَ بَیْنَكُمْ مَّوَدَّةً وَّرَحْمَةً اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّقَوْمٍ یَّتَفَكَّرُوْنَ",
    "وَمِنْ اٰیٰتِهٖ خَلْقُ السَّمٰوٰتِ وَالْاَرْضِ وَاخْتِلَافُ اَلْسِنَتِكُمْ وَاَلْوَانِكُمْ اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّلْعٰلِمِیْنَ",
    "وَمِنْ اٰیٰتِهٖ مَنَامُكُمْ بِالَّیْلِ وَالنَّهَارِ وَابْتِغَآؤُكُمْ مِّنْ فَضْلِهٖ اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّقَوْمٍ یَّسْمَعُوْنَ",
    "وَمِنْ اٰیٰتِهٖ یُرِیْكُمُ الْبَرْقَ خَوْفًا وَّطَمَعًا وَّیُنَزِّلُ مِنَ السَّمَآءِ مَآءً فَیُحْیٖ بِهِ الْاَرْضَ بَعْدَ مَوْتِهَا اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّقَوْمٍ یَّعْقِلُوْنَ",
    "وَمِنْ اٰیٰتِهٖۤ اَنْ تَقُوْمَ السَّمَآءُ وَالْاَرْضُ بِاَمْرِهٖ ثُمَّ اِذَا دَعَاكُمْ دَعْوَةً ۖ مِّنَ الْاَرْضِ اِذَاۤ اَنْتُمْ تَخْرُجُوْنَ",
    "وَلَهٗ مَنْ فِی السَّمٰوٰتِ وَالْاَرْضِ كُلٌّ لَّهٗ قٰنِتُوْنَ",
    "وَهُوَ الَّذِیْ یَبْدَؤُا الْخَلْقَ ثُمَّ یُعِیْدُهٗ وَهُوَ اَهْوَنُ عَلَیْهِ وَلَهُ الْمَثَلُ الْاَعْلٰى فِی السَّمٰوٰتِ وَالْاَرْضِ وَهُوَ الْعَزِیْزُ الْحَكِیْمُ",
    "ضَرَبَ لَكُمْ مَّثَلًا مِّنْ اَنْفُسِكُمْ هَلْ لَّكُمْ مِّنْ مَّا مَلَكَتْ اَیْمَانُكُمْ مِّنْ شُرَكَآءَ فِیْ مَا رَزَقْنٰكُمْ فَاَنْتُمْ فِیْهِ سَوَآءٌ تَخَافُوْنَهُمْ كَخِیْفَتِكُمْ اَنْفُسَكُمْ كَذٰلِكَ نُفَصِّلُ الْاٰیٰتِ لِقَوْمٍ یَّعْقِلُوْنَ",
    "بَلِ اتَّبَعَ الَّذِیْنَ ظَلَمُوْۤا اَهْوَآءَهُمْ بِغَیْرِ عِلْمٍ فَمَنْ یَّهْدِیْ مَنْ اَضَلَّ اللّٰهُ وَمَا لَهُمْ مِّنْ نّٰصِرِیْنَ",
    "فَاَقِمْ وَجْهَكَ لِلدِّیْنِ حَنِیْفًا فِطْرَتَ اللّٰهِ الَّتِیْ فَطَرَ النَّاسَ عَلَیْهَا لَا تَبْدِیْلَ لِخَلْقِ اللّٰهِ ذٰلِكَ الدِّیْنُ الْقَیِّمُ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَعْلَمُوْنَ ۗ",
    "مُنِیْبِیْنَ اِلَیْهِ وَاتَّقُوْهُ وَاَقِیْمُوا الصَّلٰوةَ وَلَا تَكُوْنُوْا مِنَ الْمُشْرِكِیْنَ",
    "مِنَ الَّذِیْنَ فَرَّقُوْا دِیْنَهُمْ وَكَانُوْا شِیَعًا كُلُّ حِزْبٍ بِمَا لَدَیْهِمْ فَرِحُوْنَ",
    "وَاِذَا مَسَّ النَّاسَ ضُرٌّ دَعَوْا رَبَّهُمْ مُّنِیْبِیْنَ اِلَیْهِ ثُمَّ اِذَاۤ اَذَاقَهُمْ مِّنْهُ رَحْمَةً اِذَا فَرِیْقٌ مِّنْهُمْ بِرَبِّهِمْ یُشْرِكُوْنَ",
    "لِیَكْفُرُوْا بِمَاۤ اٰتَیْنٰهُمْ فَتَمَتَّعُوْا ۥ فَسَوْفَ تَعْلَمُوْنَ",
    "اَمْ اَنْزَلْنَا عَلَیْهِمْ سُلْطٰنًا فَهُوَ یَتَكَلَّمُ بِمَا كَانُوْا بِهٖ یُشْرِكُوْنَ",
    "وَاِذَاۤ اَذَقْنَا النَّاسَ رَحْمَةً فَرِحُوْا بِهَا وَاِنْ تُصِبْهُمْ سَیِّئَةٌ بِمَا قَدَّمَتْ اَیْدِیْهِمْ اِذَا هُمْ یَقْنَطُوْنَ",
    "اَوَلَمْ یَرَوْا اَنَّ اللّٰهَ یَبْسُطُ الرِّزْقَ لِمَنْ یَّشَآءُ وَیَقْدِرُ اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّقَوْمٍ یُّؤْمِنُوْنَ",
    "فَاٰتِ ذَا الْقُرْبٰى حَقَّهٗ وَالْمِسْكِیْنَ وَابْنَ السَّبِیْلِ ذٰلِكَ خَیْرٌ لِّلَّذِیْنَ یُرِیْدُوْنَ وَجْهَ اللّٰهِ وَاُولٰٓىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "وَمَاۤ اٰتَیْتُمْ مِّنْ رِّبًا لِّیَرْبُوَاۡ فِیْۤ اَمْوَالِ النَّاسِ فَلَا یَرْبُوْا عِنْدَ اللّٰهِ وَمَاۤ اٰتَیْتُمْ مِّنْ زَكٰوةٍ تُرِیْدُوْنَ وَجْهَ اللّٰهِ فَاُولٰٓىِٕكَ هُمُ الْمُضْعِفُوْنَ",
    "اَللّٰهُ الَّذِیْ خَلَقَكُمْ ثُمَّ رَزَقَكُمْ ثُمَّ یُمِیْتُكُمْ ثُمَّ یُحْیِیْكُمْ هَلْ مِنْ شُرَكَآىِٕكُمْ مَّنْ یَّفْعَلُ مِنْ ذٰلِكُمْ مِّنْ شَیْءٍ سُبْحٰنَهٗ وَتَعٰلٰى عَمَّا یُشْرِكُوْنَ",
    "ظَهَرَ الْفَسَادُ فِی الْبَرِّ وَالْبَحْرِ بِمَا كَسَبَتْ اَیْدِی النَّاسِ لِیُذِیْقَهُمْ بَعْضَ الَّذِیْ عَمِلُوْا لَعَلَّهُمْ یَرْجِعُوْنَ",
    "قُلْ سِیْرُوْا فِی الْاَرْضِ فَانْظُرُوْا كَیْفَ كَانَ عَاقِبَةُ الَّذِیْنَ مِنْ قَبْلُ كَانَ اَكْثَرُهُمْ مُّشْرِكِیْنَ",
    "فَاَقِمْ وَجْهَكَ لِلدِّیْنِ الْقَیِّمِ مِنْ قَبْلِ اَنْ یَّاْتِیَ یَوْمٌ لَّا مَرَدَّ لَهٗ مِنَ اللّٰهِ یَوْمَىِٕذٍ یَّصَّدَّعُوْنَ",
    "مَنْ كَفَرَ فَعَلَیْهِ كُفْرُهٗ وَمَنْ عَمِلَ صَالِحًا فَلِاَنْفُسِهِمْ یَمْهَدُوْنَ",
    "لِیَجْزِیَ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصَّلِحٰتِ مِنْ فَضْلِهٖ اِنَّهٗ لَا یُحِبُّ الْكٰفِرِیْنَ",
    "وَمِنْ اٰیٰتِهٖۤ اَنْ یُّرْسِلَ الرِّیٰحَ مُبَشِّرٰتٍ وَّلِیُذِیْقَكُمْ مِّنْ رَّحْمَتِهٖ وَلِتَجْرِیَ الْفُلْكُ بِاَمْرِهٖ وَلِتَبْتَغُوْا مِنْ فَضْلِهٖ وَلَعَلَّكُمْ تَشْكُرُوْنَ",
    "وَلَقَدْ اَرْسَلْنَا مِنْ قَبْلِكَ رُسُلًا اِلٰى قَوْمِهِمْ فَجَآءُوْهُمْ بِالْبَیِّنٰتِ فَانْتَقَمْنَا مِنَ الَّذِیْنَ اَجْرَمُوْا وَكَانَ حَقًّا عَلَیْنَا نَصْرُ الْمُؤْمِنِیْنَ",
    "اَللّٰهُ الَّذِیْ یُرْسِلُ الرِّیٰحَ فَتُثِیْرُ سَحَابًا فَیَبْسُطُهٗ فِی السَّمَآءِ كَیْفَ یَشَآءُ وَیَجْعَلُهٗ كِسَفًا فَتَرَی الْوَدْقَ یَخْرُجُ مِنْ خِلٰلِهٖ فَاِذَاۤ اَصَابَ بِهٖ مَنْ یَّشَآءُ مِنْ عِبَادِهٖۤ اِذَا هُمْ یَسْتَبْشِرُوْنَ",
    "وَاِنْ كَانُوْا مِنْ قَبْلِ اَنْ یُّنَزَّلَ عَلَیْهِمْ مِّنْ قَبْلِهٖ لَمُبْلِسِیْنَ",
    "فَانْظُرْ اِلٰۤی اٰثٰرِ رَحْمَتِ اللّٰهِ كَیْفَ یُحْیِ الْاَرْضَ بَعْدَ مَوْتِهَا اِنَّ ذٰلِكَ لَمُحْیِ الْمَوْتٰى وَهُوَ عَلٰى كُلِّ شَیْءٍ قَدِیْرٌ",
    "وَلَىِٕنْ اَرْسَلْنَا رِیْحًا فَرَاَوْهُ مُصْفَرًّا لَّظَلُّوْا مِنْ بَعْدِهٖ یَكْفُرُوْنَ",
    "فَاِنَّكَ لَا تُسْمِعُ الْمَوْتٰى وَلَا تُسْمِعُ الصُّمَّ الدُّعَآءَ اِذَا وَلَّوْا مُدْبِرِیْنَ",
    "وَمَاۤ اَنْتَ بِهٰدِ الْعُمْیِ عَنْ ضَلٰلَتِهِمْ اِنْ تُسْمِعُ اِلَّا مَنْ یُّؤْمِنُ بِاٰیٰتِنَا فَهُمْ مُّسْلِمُوْنَ",
    "اَللّٰهُ الَّذِیْ خَلَقَكُمْ مِّنْ ضُعْفٍ ثُمَّ جَعَلَ مِنْ بَعْدِ ضُعْفٍ قُوَّةً ثُمَّ جَعَلَ مِنْ بَعْدِ قُوَّةٍ ضُعْفًا وَّشَیْبَةً یَخْلُقُ مَا یَشَآءُ وَهُوَ الْعَلِیْمُ الْقَدِیْرُ",
    "وَیَوْمَ تَقُوْمُ السَّاعَةُ یُقْسِمُ الْمُجْرِمُوْنَ مَا لَبِثُوْا غَیْرَ سَاعَةٍ كَذٰلِكَ كَانُوْا یُؤْفَكُوْنَ",
    "وَقَالَ الَّذِیْنَ اُوْتُوا الْعِلْمَ وَالْاِیْمَانَ لَقَدْ لَبِثْتُمْ فِیْ كِتٰبِ اللّٰهِ اِلٰى یَوْمِ الْبَعْثِ فَهٰذَا یَوْمُ الْبَعْثِ وَلٰكِنَّكُمْ كُنْتُمْ لَا تَعْلَمُوْنَ",
    "فَیَوْمَىِٕذٍ لَّا یَنْفَعُ الَّذِیْنَ ظَلَمُوْا مَعْذِرَتُهُمْ وَلَا هُمْ یُسْتَعْتَبُوْنَ",
    "وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِیْ هٰذَا الْقُرْاٰنِ مِنْ كُلِّ مَثَلٍ وَلَىِٕنْ جِئْتَهُمْ بِاٰیَةٍ لَّیَقُوْلَنَّ الَّذِیْنَ كَفَرُوْۤا اِنْ اَنْتُمْ اِلَّا مُبْطِلُوْنَ",
    "كَذٰلِكَ یَطْبَعُ اللّٰهُ عَلٰى قُلُوْبِ الَّذِیْنَ لَا یَعْلَمُوْنَ",
    "فَاصْبِرْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ وَّلَا یَسْتَخِفَّنَّكَ الَّذِیْنَ لَا یُوْقِنُوْنَ"
  ],
  "bengali": [
    "আলিফ-লাম-মীম।",
    "রোমানরা পরাজিত হয়েছে।* \n* ৩৯৫ খৃস্টাব্দে রোমক সাম্রাজ্য থেকে পৃথক হয়ে বায়যানটাইন নামে যে সাম্রাজ্যটি পরিচিত হয়েছিল, এখানে الرومবলতে তাকে বুঝানো হয়েছে। সিরিয়া ও প্যালেস্টাইন এ সাম্রাজ্যের অধীন ছিল।",
    "নিকটবর্তী অঞ্চলে*, আর তারা তাদের এ পরাজয়ের পর অচিরেই বিজয়ী হবে, \n* হিজাযের উত্তর পশ্চিম সীমানা সংলগ্ন আযরুয়াত ও বুসরার মধ্যবর্তী স্থান। সম্রাট হিরাক্লিয়াস ও খসরু পারভেজের মধ্যে এখানে যুদ্ধ হয়। যুদ্ধে খসরু পারভেজ বিজয় লাভ করে। ফলে মক্কার পৌত্তলিকরা খুশি হয়ে বলতে শুরু করে, আমরা মুসলিমদেরকে পরাজিত করব। তখন উক্ত আয়াতগুলো নাযিল হয়।",
    "কয়েক বছরের মধ্যেই*। পূর্বের ও পরের সব ফয়সালা আল্লাহরই। আর সেদিন মুমিনরা আনন্দিত হবে, \n* بضع سنين তিন থেকে দশ বছর। এ আয়াতে ভবিষ্যদ্বাণী করা হয় যে, অনধিক নয় বছরের মধ্যে রোমানরা পারসিকদের উপর বিজয় লাভ করবে। ৬২৩-২৪ খৃ এ ভবিষ্যদ্বাণী সত্যে পরিণত হয়। আর সে বছরই বদর যুদ্ধে মুসলিমরা মুশরিকদেরকে পরাজিত করে।",
    "আল্লাহর সাহায্যে। তিনি যাকে ইচ্ছা সাহায্য করেন। আর তিনি মহাপরাক্রমশালী, পরম দয়ালু।",
    "আল্লাহর ওয়াদা। আল্লাহ তাঁর ওয়াদা খেলাফ করেন না। কিন্তু অধিকাংশ লোক জানে না।",
    "তারা দুনিয়ার জীবনের বাহ্যিক দিক সম্পর্কে জানে, আর আখিরাত সম্পর্কে তারা গাফিল।",
    "তারা কি নিজদের অন্তরে ভেবে দেখে না, আল্লাহ আসমানসমূহ ও যমীন এবং এ দু’য়ের মধ্যবর্তী সব কিছুই যথাযথভাবে ও এক নির্দিষ্ট সময়ের জন্য সৃষ্টি করেছেন? আর নিশ্চয় বহু লোক তাদের রবের সাক্ষাতে অবিশ্বাসী।",
    "তারা কি যমীনে ভ্রমণ করে না? তাহলে তারা দেখত যে, তাদের পূর্ববর্তীদের পরিণাম কেমন হয়েছিল। তারা শক্তিতে তাদের চেয়েও প্রবল ছিল। আর তারা জমি চাষ করত এবং তারা এদের আবাদ করার চেয়েও বেশী আবাদ করত। আর তাদের কাছে তাদের রাসূলগণ সুস্পষ্ট প্রমাণাদিসহ এসেছিল। বস্তুতঃ আল্লাহ এমন নন যে, তিনি তাদের প্রতি যুলম করবেন, কিন্তু তারা নিজেরাই নিজদের প্রতি যুলম করত।",
    "তারপর যারা মন্দ কাজ করেছিল তাদের পরিণাম মন্দ হয়েছিল। কারণ তারা আল্লাহর আয়াতগুলোকে অস্বীকার করেছিল এবং সেগুলো নিয়ে ঠাট্টা-বিদ্রূপ করত।",
    "আল্লাহ সৃষ্টির সূচনা করেন, তারপর তিনিই তার পুনরাবৃত্তি করবেন। তারপর তাঁর কাছেই তোমরা প্রত্যাবর্তিত হবে।",
    "আর যেদিন কিয়ামত সংঘটিত হবে সেদিন অপরাধীরা হতাশ হয়ে পড়বে।",
    "আর তাদের শরীকরা তাদের জন্য সুপারিশকারী হবে না এবং তারা তাদের শরীকদেরকে অস্বীকার করবে।",
    "আর যেদিন কিয়ামত সংঘটিত হবে সেদিন তারা বিভক্ত হয়ে পড়বে।",
    "অতএব যারা ঈমান এনেছে এবং সৎকাজ করেছে তাদেরকে জান্নাতে পরিতুষ্ট করা হবে।",
    "আর যারা কুফরী করেছে এবং আমার আয়াত ও আখিরাতের সাক্ষাতকে অস্বীকার করেছে, তাদেরকে আযাবের মধ্যে উপস্থিত করা হবে।",
    "অতএব তোমরা আল্লাহর তাসবীহ কর, যখন সন্ধ্যায় উপনীত হবে এবং সকালে উঠবে ।",
    "আর অপরাহ্নে ও যুহরের সময়ে; আর আসমান ও যমীনে সকল প্রশংসা একমাত্র তাঁরই।",
    "তিনি মৃত থেকে জীবিতকে বের করেন এবং জীবিত থেকে মৃতকে বের করেন। আর তিনি যমীনকে জীবিত করেন তার মৃত্যুর পর। আর এভাবেই তোমরা উত্থিত হবে।",
    "আর তাঁর নিদর্শনাবলীর মধ্যে রয়েছে যে, তিনি তোমাদেরকে মাটি থেকে সৃষ্টি করেছেন, তারপর তোমরা মানুষ হয়ে ছড়িয়ে পড়ছ।",
    "আর তাঁর নিদর্শনাবলীর মধ্যে রয়েছে যে, তিনি তোমাদের জন্য তোমাদের থেকেই স্ত্রীদের সৃষ্টি করেছেন, যাতে তোমরা তাদের কাছে প্রশান্তি পাও। আর তিনি তোমাদের মধ্যে ভালবাসা ও দয়া সৃষ্টি করেছেন। নিশ্চয় এর মধ্যে নিদর্শনাবলী রয়েছে সে কওমের জন্য, যারা চিন্তা করে।",
    "আর তাঁর নিদর্শনাবলীর মধ্যে রয়েছে আসমান ও যমীনের সৃষ্টি এবং তোমাদের ভাষা ও তোমাদের বর্ণের ভিন্নতা। নিশ্চয় এর মধ্যে নিদর্শনাবলী রয়েছে জ্ঞানীদের জন্য ।",
    "আর তাঁর নিদর্শনাবলীর মধ্যে রয়েছে রাতে ও দিনে তোমাদের নিদ্রা এবং তাঁর অনুগ্রহ থেকে তোমাদের (জীবিকা) অন্বেষণ। নিশ্চয় এর মধ্যে নিদর্শনাবলী রয়েছে সে কওমের জন্য যারা শোনে।",
    "আর তাঁর নিদর্শনাবলীর মধ্যে রয়েছে তিনি তোমাদেরকে ভয় ও ভরসাস্বরূপ বিদ্যুৎ দেখান, আর আসমান থেকে পানি বর্ষণ করেন। অতঃপর তা দ্বারা যমীনকে তার মৃত্যুর পর পুনর্জীবিত করেন। নিশ্চয় এর মধ্যে নিদর্শনাবলী রয়েছে সে কওমের জন্য যারা অনুধাবন করে।",
    "আর তাঁর নিদর্শনাবলীর মধ্যে রয়েছে, তাঁরই নির্দেশে আসমান ও যমীন স্থিতিশীল থাকে। তারপর তিনি যখন তোমাদেরকে যমীন থেকে বের হয়ে আসার জন্য একবার আহবান করবেন তখনই তোমরা বের হয়ে আসবে।",
    "আর আসমানসমূহ ও যমীনে যা কিছু আছে সব তাঁরই। সব কিছুই তাঁর অনুগত।",
    "আর তিনিই সৃষ্টির সূচনা করেন তারপর তিনিই এর পুনরাবৃত্তি করবেন। আর এটা তো তাঁর জন্য অধিকতর সহজ। আসমান ও যমীনে সর্বোচ্চ মর্যাদা তাঁরই এবং তিনি পরাক্রমশালী, প্রজ্ঞাময়।",
    "তিনি তোমাদের জন্য তোমাদের মধ্য থেকে একটি উপমা বর্ণনা করেছেন; আমি তোমাদেরকে যে রিয্ক দিয়েছি তাতে তোমাদের অধিকারভুক্ত দাস-দাসীরা কি অংশীদার? ফলে তোমরা কি এ বিষয়ে সমান? তোমরা কি তাদেরকে তেমনভাবে ভয় কর যেমনভাবে ভয় কর তোমাদের পরস্পরকে*? এভাবেই আমি নিদর্শনাবলী বিস্তারিত বর্ণনা করেছি সে কওমের জন্য যারা উপলব্ধি করে। \n* দাস-দাসীরা মনিবের সম্পদের অংশীদার হয় না এবং মনিবরা তাদেরকে ভয়ও করে না। তেমনিভাবে সারা জাহানের মালিক আল্লাহর সাথে কারো অংশিদারিত্ব হতে পারে না।",
    "বরং যালিমরা জ্ঞান ছাড়াই তাদের খেয়াল খুশীর অনুসরণ করে। সুতরাং যাকে আল্লাহ পথভ্রষ্ট করেন কে তাকে হিদায়াত করবে? আর তাদের জন্য কোন সাহায্যকারী নেই।",
    "অতএব তুমি একনিষ্ঠ হয়ে দীনের জন্য নিজকে প্রতিষ্ঠিত রাখ। আল্লাহর প্রকৃতি*, যে প্রকৃতির উপর তিনি মানুষ সৃষ্টি করেছেন। আল্লাহর সৃষ্টির কোন পরিবর্তন নেই। এটাই প্রতিষ্ঠিত দীন; কিন্তু অধিকাংশ মানুষ জানে না। \n* فطرة স্বভাব, প্রকৃতি। মহান আল্লাহ মানুষকে যে সহজাত প্রকৃতি দিয়ে সৃষ্টি করেছেন। তাকেই فطرة الله বলা হয়েছে। আর فطرة الله এর মর্মার্থ হল ইসলাম।",
    "তাঁর অভিমুখী হয়ে তাঁকে ভয় কর, সালাত কায়েম কর, আর মুশরিকদের অন্তর্ভুক্ত হয়ো না।",
    "যারা নিজদের দীনকে বিভক্ত করেছে এবং যারা বিভিন্ন দলে বিভক্ত হয়েছে (তাদের অন্তর্ভুক্ত হয়ো না)। প্রত্যেক দলই নিজদের যা আছে তা নিয়ে আনন্দিত।",
    "আর মানুষকে যখন দুঃখ-কষ্ট স্পর্শ করে তখন তারা তাদের রবের প্রতি বিনীতভাবে ফিরে এসে তাকে ডাকে। তারপর যখন তিনি তাদের স্বীয় রহমত আস্বাদন করান, তখন তাদের মধ্যকার একটি দল তাদের রবের সাথে শরীক করে;",
    "ফলে আমি তাদের যা দিয়েছি তার প্রতি তারা অকৃতজ্ঞ হয়। সুতরাং তোমরা ভোগ করে নাও। শীঘ্রই তোমরা জানতে পারবে।",
    "আমি কি তাদের প্রতি এমন কোন প্রমাণ নাযিল করেছি, যা তাদের শরীক করতে বলে?",
    "আর আমি যখন মানুষকে রহমতের স্বাদ আস্বাদন করাই তখন তারা তাতে আনন্দিত হয়। আর যদি তাদের কৃতকর্মের কারণে তাদের উপর অকল্যাণ পৌঁছে তখন তারা হতাশ হয়ে পড়ে।",
    "তারা কি দেখেনি, নিশ্চয় আল্লাহ যার জন্য ইচ্ছা রিয্ক প্রশস্ত করেন এবং সঙ্কুচিত করেন। নিশ্চয় এতে নিদর্শনাবলী রয়েছে সেই কওমের জন্য, যারা ঈমান আনে।",
    "অতএব আত্মীয়-স্বজনকে তাদের হক দিয়ে দাও এবং মিসকীন ও মুসাফিরকেও। এটি উত্তম তাদের জন্য, যারা আল্লাহর সন্তুষ্টি চায় এবং তারাই সফলকাম।",
    "আর তোমরা যে সূদ দিয়ে থাক, মানুষের সম্পদে বৃদ্ধি পাওয়ার জন্য তা মূলতঃ আল্লাহর কাছে বৃদ্ধি পায় না। আর তোমরা যে যাকাত দিয়ে থাক আল্লাহর সন্তুষ্টি কামনা করে (তাই বৃদ্ধি পায়) এবং তারাই বহুগুণ সম্পদ প্রাপ্ত।",
    "আল্লাহ সেই সত্তা যিনি তোমাদেরকে সৃষ্টি করেছেন, তারপর তোমাদেরকে রিয্ক দিয়েছেন। এরপর তিনি তোমাদের মৃত্যু দেবেন, পরে আবার তোমাদের জীবন দেবেন। তোমাদের শরীকদের মধ্যে এমন কেউ আছে কি, যে এ থেকে কোন কিছু করতে পারবে? তিনি পবিত্র এবং তারা যাদের শরীক করে তা থেকে তিনি ঊর্ধ্বে।",
    "মানুষের কৃতকর্মের দরুন স্থলে ও সমুদ্রে ফাসাদ প্রকাশ পায়। যার ফলে আল্লাহ তাদের কতিপয় কৃতকর্মের স্বাদ তাদেরকে আস্বাদন করান, যাতে তারা ফিরে আসে।",
    "বল, ‘তোমরা যমীনে ভ্রমণ কর। অতঃপর দেখ পূর্ববর্তীদের পরিণাম কিরূপ হয়েছিল’। তাদের অধিকাংশই ছিল মুশরিক।",
    "তাই তুমি তোমার নিজকে সরল-সঠিক দীনের উপর কায়েম রাখ, আল্লাহর পক্ষ থেকে সেদিন আসার পূর্বে, যা ফেরানো যাবে না। সেদিন তারা বিভক্ত হয়ে পড়বে।",
    "যে কুফরী করে তার কুফরীর পরিণাম তার উপরই। আর যারা সৎকর্ম করে তারা তাদের নিজদের জন্য শয্যা রচনা করে।",
    "যেন তিনি স্বীয় অনুগ্রহে প্রতিদান দেন, যারা ঈমান আনে এবং সৎকাজ করে তাদেরকে। নিশ্চয় তিনি কাফিরদের ভালবাসেন না।",
    "আর তাঁর নিদর্শনসমূহের মধ্যে রয়েছে, তিনি বাতাস প্রেরণ করেন [বৃষ্টির] সুসংবাদ বহনকারী হিসেবে এবং যাতে তিনি তোমাদেরকে তাঁর রহমত আস্বাদন করাতে পারেন এবং যাতে তাঁর নির্দেশে নৌযানগুলো চলাচল করে, আর যাতে তোমরা তাঁর অনুগ্রহ থেকে কিছু সন্ধান করতে পার। আর যাতে তোমরা কৃতজ্ঞ হও।",
    "আর অবশ্যই আমি তোমার পূর্বে রাসূলগণকে তাদের কওমের নিকট পাঠিয়েছিলাম। অতঃপর তারা তাদের কাছে সুস্পষ্ট প্রমাণাদি নিয়ে এসেছিল। অতঃপর যারা অপরাধ করেছিল আমি তাদের থেকে প্রতিশোধ গ্রহণ করলাম। আর মুমিনদেরকে সাহায্য করা তো আমার কর্তব্য।",
    "আল্লাহ, যিনি বাতাস প্রেরণ করেন ফলে তা মেঘমালাকে ধাওয়া করে; অতঃপর তিনি মেঘমালাকে যেমন ইচ্ছা আকাশে ছড়িয়ে দেন এবং তাকে খন্ড- বিখন্ড করে দেন, ফলে তুমি দেখতে পাও, তার মধ্য থেকে নির্গত হয় বারিধারা। অতঃপর যখন তিনি তাঁর বান্দাদের মধ্যে যাদের উপর ইচ্ছা বারি বর্ষণ করেন, তখন তারা হয় আনন্দিত।",
    "যদিও এর আগে তাদের প্রতি বৃষ্টি বর্ষণের পূর্বে তারা ছিল নিরাশ।",
    "অতএব তুমি আল্লাহর রহমতের চি‎হ্নসমূহের প্রতি দৃষ্টি দাও। কিভাবে তিনি যমীনের মৃত্যুর পর তা জীবিত করেন। নিশ্চয় এভাবেই তিনি মৃতকে জীবিত করেন এবং তিনি সব কিছুর উপর সর্বশক্তিমান।",
    "আর যদি আমি এমন বাতাস প্রেরণ করি যার ফলে তারা শস্যকে হলুদ রঙের দেখতে পায়। তখন তো তারা অকৃতজ্ঞ হয়ে পড়ে।",
    "নিশ্চয় তুমি মৃতকে শুনাতে পারবে না, না পারবে বধিরকে আহবান শুনাতে, যখন তারা পৃষ্ঠ প্রদর্শন করে ফিরে যায়।",
    "আর তুমি অন্ধদেরকেও তাদের ভ্রষ্টতা থেকে হিদায়াতে আনতে পারবে না, তুমি শুধু তাদেরই শুনাতে পারবে যারা আমার আয়াতসমূহের প্রতি ঈমান আনে, কারণ তারা আত্মসমর্পনকারী।",
    "আল্লাহ, যিনি তোমাদের সৃষ্টি করেছেন দুর্বল বস্তু থেকে এবং দুর্বলতার পর তিনি শক্তি দান করেন। আর শক্তির পর তিনি আবার দেন দুর্বলতা ও বার্ধক্য। তিনি যা ইচ্ছা সৃষ্টি করেন এবং তিনিই সর্বজ্ঞ, সর্বশক্তিমান।",
    "আর যেদিন কিয়ামত অনুষ্ঠিত হবে সেদিন অপরাধীরা কসম করে বলবে যে, তারা মুহূর্তকালের বেশী অবস্থান করেনি। এভাবেই তারা সত্যবিমুখ থেকেছে।",
    "আর যাদেরকে জ্ঞান ও ঈমান দেয়া হয়েছে তারা বলবে, ‘তোমরা আল্লাহর বিধান মত পুনরুত্থান দিবস পর্যন্ত অবস্থান করেছ। আর এটি পুনরুত্থান দিবস। কিন্তু তোমরা জানতে না।’",
    "অতঃপর যারা যুলম করেছে, সেদিন তাদের কোন ওযর-আপত্তি উপকারে আসবে না এবং (আল্লাহকে) সন্তুষ্ট করতেও তাদেরকে বলা হবে না।",
    "আর আমি তো মানুষের জন্য এই কুরআনে সব ধরনের দৃষ্টান্ত পেশ করেছি। আর যদি তুমি তাদের কাছে কোন আয়াত নিয়ে আস, তবে অবশ্যই কাফিররা বলবে, ‘তোমরা তো বাতিলপন্থী’।",
    "এমনিভাবে আল্লাহ মোহর মেরে দেন তাদের হৃদয়সমূহে যারা জানে না।",
    "অতএব, তুমি সবর কর। নিশ্চয় আল্লাহর ওয়াদা হক। আর যারা দৃঢ়ভাবে বিশ্বাস করে না তারা যেন তোমাকে অস্থির করতে না পারে ।"
  ]
}