{
  "surahName": "Muhammad",
  "surahNameArabic": "محمد",
  "surahNameArabicLong": "سورة محمد",
  "surahNameTranslation": "Muhammad",
  "revelationPlace": "Madina",
  "totalAyah": 38,
  "surahNo": 47,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/47.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/047.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/47.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/047.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/47.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/047.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/47.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/047.mp3"
    }
  },
  "english": [
    "Those who disbelieve and hinder ˹others˺ from the Way of Allah, He will render their deeds void.",
    "As for those who believe, do good, and have faith in what has been revealed to Muḥammad—which is the truth from their Lord—He will absolve them of their sins and improve their condition.",
    "This is because the disbelievers follow falsehood, while the believers follow the truth from their Lord. This is how Allah shows people their true state ˹of faith˺.",
    "So when you meet the disbelievers ˹in battle˺, strike ˹their˺ necks until you have thoroughly subdued them, then bind them firmly. Later ˹free them either as˺ an act of grace or by ransom until the war comes to an end. So will it be. Had Allah willed, He ˹Himself˺ could have inflicted punishment on them. But He does ˹this only to˺ test some of you by means of others. And those who are martyred in the cause of Allah, He will never render their deeds void.",
    "He will guide them ˹to their reward˺, improve their condition",
    "and admit them into Paradise, having made it known to them.",
    "O believers! If you stand up for Allah, He will help you and make your steps firm.",
    "As for the disbelievers, may they be doomed and may He render their deeds void.",
    "That is because they detest what Allah has revealed, so He has rendered their deeds void.",
    "Have they not travelled throughout the land to see what was the end of those before them? Allah annihilated them, and a similar fate awaits the disbelievers.",
    "This is because Allah is the Patron of the believers while the disbelievers have no patron.",
    "Surely Allah will admit those who believe and do good into Gardens under which rivers flow. As for the disbelievers, they enjoy themselves and feed like cattle. But the Fire will be their home.",
    "˹Imagine, O  Prophet,˺ how many societies We destroyed that were far superior in might than your society—which drove you out—and there was none to help them!",
    "Can those ˹believers˺ who stand on clear proof from their Lord be like those whose evil deeds are made appealing to them and ˹only˺ follow their desires?",
    "The description of the Paradise promised to the righteous is that in it are rivers of fresh water, rivers of milk that never changes in taste, rivers of wine delicious to drink, and rivers of pure honey. There they will ˹also˺ have all kinds of fruit, and forgiveness from their Lord. ˹Can they be˺ like those who will stay in the Fire forever, left to drink boiling water that will tear apart their insides?",
    "There are some of them who listen to you ˹O Prophet˺, but when they depart from you, they say ˹mockingly˺ to those ˹believers˺ gifted with knowledge, “What did he just say?” These are the ones whose hearts Allah has sealed and who ˹only˺ follow their desires.",
    "As for those who are ˹rightly˺ guided, He increases them in guidance and blesses them with righteousness.",
    "Are they only waiting for the Hour to take them by surprise? Yet ˹some of˺ its signs have already come. Once it actually befalls them, will it not be too late to be mindful?",
    "So, know ˹well, O  Prophet,˺ that there is no god ˹worthy of worship˺ except Allah. And seek forgiveness for your shortcomings and for ˹the sins of˺ the believing men and women. For Allah ˹fully˺ knows your movements and places of rest ˹O people˺.",
    "And the believers say, “If only a sûrah was revealed ˹allowing self-defence˺!” Yet when a precise sûrah is revealed, in which fighting is ˹explicitly˺ mentioned, you see those with sickness in their hearts staring at you like someone in the throes of death. It would have been better for them",
    "to obey and speak rightly. Then when fighting was ordained, it surely would have been better for them if they were true to Allah.",
    "Now if you ˹hypocrites˺ turn away, perhaps you would then spread corruption throughout the land and sever your ˹ties of˺ kinship!",
    "These are the ones who Allah has condemned, deafening them and blinding their eyes.",
    "Do they not then reflect on the Quran? Or are there locks upon their hearts?",
    "Indeed, those who relapse ˹into disbelief˺ after ˹true˺ guidance has become clear to them, ˹it is˺ Satan ˹that˺ has tempted them, luring them with false hopes.",
    "That is because they said ˹privately˺ to those who ˹also˺ detest what Allah has revealed, “We will obey you in some matters.” But Allah ˹fully˺ knows what they are hiding.",
    "Then how ˹horrible˺ will it be when the angels take their souls, beating their faces and backs!",
    "This is because they follow whatever displeases Allah and hate whatever pleases Him, so He has rendered their deeds void.",
    "Or do those with sickness in their hearts think that Allah will not ˹be able to˺ expose their malice?",
    "Had We willed, We could have truly shown them to you ˹O Prophet˺, and you would have certainly recognized them by their appearance. But you will surely recognize them by their tone of speech. And Allah ˹fully˺ knows your doings ˹O people˺.",
    "We will certainly test you ˹believers˺ until We prove those of you who ˹truly˺ struggle ˹in Allah’s cause˺ and remain steadfast, and reveal how you conduct yourselves.",
    "Indeed, those who disbelieve, hinder ˹others˺ from the Way of Allah, and defy the Messenger after ˹true˺ guidance has become clear to them; they will not harm Allah in the least, but He will render their deeds void.",
    "O believers! Obey Allah and obey the Messenger, and do not let your deeds be in vain.",
    "Surely those who disbelieve, hinder ˹others˺ from the Way of Allah, and then die as disbelievers; Allah will never forgive them.",
    "So do not falter or cry for peace, for you will have the upper hand and Allah is with you. And He will never let your deeds go to waste.",
    "This worldly life is no more than play and amusement. But if you are faithful and mindful ˹of Allah˺, He will grant you your ˹full˺ reward, and will not ask you ˹to donate all˺ your wealth.",
    "If He were to do so and pressure you, you would withhold and He would bring out your resentment.",
    "Here you are, being invited to donate ˹a little˺ in the cause of Allah. Still some of you withhold. And whoever does so, it is only to their own loss. For Allah is the Self-Sufficient, whereas you stand in need ˹of Him˺. If you ˹still˺ turn away, He will replace you with another people. And they will not be like you."
  ],
  "arabic1": [
    "اَلَّذِیْنَ كَفَرُوْا وَصَدُّوْا عَنْ سَبِیْلِ اللّٰهِ اَضَلَّ اَعْمَالَهُمْ",
    "وَالَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَاٰمَنُوْا بِمَا نُزِّلَ عَلٰی مُحَمَّدٍ وَّهُوَ الْحَقُّ مِنْ رَّبِّهِمْ كَفَّرَ عَنْهُمْ سَیِّاٰتِهِمْ وَاَصْلَحَ بَالَهُمْ",
    "ذٰلِكَ بِاَنَّ الَّذِیْنَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ وَاَنَّ الَّذِیْنَ اٰمَنُوا اتَّبَعُوا الْحَقَّ مِنْ رَّبِّهِمْ كَذٰلِكَ یَضْرِبُ اللّٰهُ لِلنَّاسِ اَمْثَالَهُمْ",
    "فَاِذَا لَقِیْتُمُ الَّذِیْنَ كَفَرُوْا فَضَرْبَ الرِّقَابِ حَتّٰۤی اِذَاۤ اَثْخَنْتُمُوْهُمْ فَشُدُّوا الْوَثَاقَ فَاِمَّا مَنًّا بَعْدُ وَاِمَّا فِدَآءً حَتّٰی تَضَعَ الْحَرْبُ اَوْزَارَهَا ذٰلِكَ وَلَوْ یَشَآءُ اللّٰهُ لَانْتَصَرَ مِنْهُمْ وَلٰكِنْ لِّیَبْلُوَاۡ بَعْضَكُمْ بِبَعْضٍ وَالَّذِیْنَ قُتِلُوْا فِیْ سَبِیْلِ اللّٰهِ فَلَنْ یُّضِلَّ اَعْمَالَهُمْ",
    "سَیَهْدِیْهِمْ وَیُصْلِحُ بَالَهُمْ",
    "وَیُدْخِلُهُمُ الْجَنَّةَ عَرَّفَهَا لَهُمْ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اِنْ تَنْصُرُوا اللّٰهَ یَنْصُرْكُمْ وَیُثَبِّتْ اَقْدَامَكُمْ",
    "وَالَّذِیْنَ كَفَرُوْا فَتَعْسًا لَّهُمْ وَاَضَلَّ اَعْمَالَهُمْ",
    "ذٰلِكَ بِاَنَّهُمْ كَرِهُوْا مَاۤ اَنْزَلَ اللّٰهُ فَاَحْبَطَ اَعْمَالَهُمْ",
    "اَفَلَمْ یَسِیْرُوْا فِی الْاَرْضِ فَیَنْظُرُوْا كَیْفَ كَانَ عَاقِبَةُ الَّذِیْنَ مِنْ قَبْلِهِمْ دَمَّرَ اللّٰهُ عَلَیْهِمْ وَلِلْكٰفِرِیْنَ اَمْثَالُهَا",
    "ذٰلِكَ بِاَنَّ اللّٰهَ مَوْلَی الَّذِیْنَ اٰمَنُوْا وَاَنَّ الْكٰفِرِیْنَ لَا مَوْلٰی لَهُمْ",
    "اِنَّ اللّٰهَ یُدْخِلُ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ وَالَّذِیْنَ كَفَرُوْا یَتَمَتَّعُوْنَ وَیَاْكُلُوْنَ كَمَا تَاْكُلُ الْاَنْعَامُ وَالنَّارُ مَثْوًی لَّهُمْ",
    "وَكَاَیِّنْ مِّنْ قَرْیَةٍ هِیَ اَشَدُّ قُوَّةً مِّنْ قَرْیَتِكَ الَّتِیْۤ اَخْرَجَتْكَ اَهْلَكْنٰهُمْ فَلَا نَاصِرَ لَهُمْ",
    "اَفَمَنْ كَانَ عَلٰی بَیِّنَةٍ مِّنْ رَّبِّهٖ كَمَنْ زُیِّنَ لَهٗ سُوْٓءُ عَمَلِهٖ وَاتَّبَعُوْۤا اَهْوَآءَهُمْ",
    "مَثَلُ الْجَنَّةِ الَّتِیْ وُعِدَ الْمُتَّقُوْنَ فِیْهَاۤ اَنْهٰرٌ مِّنْ مَّآءٍ غَیْرِ اٰسِنٍ وَاَنْهٰرٌ مِّنْ لَّبَنٍ لَّمْ یَتَغَیَّرْ طَعْمُهٗ وَاَنْهٰرٌ مِّنْ خَمْرٍ لَّذَّةٍ لِّلشّٰرِبِیْنَ وَاَنْهٰرٌ مِّنْ عَسَلٍ مُّصَفًّی وَلَهُمْ فِیْهَا مِنْ كُلِّ الثَّمَرٰتِ وَمَغْفِرَةٌ مِّنْ رَّبِّهِمْ كَمَنْ هُوَ خَالِدٌ فِی النَّارِ وَسُقُوْا مَآءً حَمِیْمًا فَقَطَّعَ اَمْعَآءَهُمْ",
    "وَمِنْهُمْ مَّنْ یَّسْتَمِعُ اِلَیْكَ حَتّٰۤی اِذَا خَرَجُوْا مِنْ عِنْدِكَ قَالُوْا لِلَّذِیْنَ اُوْتُوا الْعِلْمَ مَاذَا قَالَ اٰنِفًا ۫ اُولٰٓىِٕكَ الَّذِیْنَ طَبَعَ اللّٰهُ عَلٰی قُلُوْبِهِمْ وَاتَّبَعُوْۤا اَهْوَآءَهُمْ",
    "وَالَّذِیْنَ اهْتَدَوْا زَادَهُمْ هُدًی وَّاٰتٰىهُمْ تَقْوٰىهُمْ",
    "فَهَلْ یَنْظُرُوْنَ اِلَّا السَّاعَةَ اَنْ تَاْتِیَهُمْ بَغْتَةً فَقَدْ جَآءَ اَشْرَاطُهَا فَاَنّٰی لَهُمْ اِذَا جَآءَتْهُمْ ذِكْرٰىهُمْ",
    "فَاعْلَمْ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا اللّٰهُ وَاسْتَغْفِرْ لِذَنْۢبِكَ وَلِلْمُؤْمِنِیْنَ وَالْمُؤْمِنٰتِ وَاللّٰهُ یَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوٰىكُمْ",
    "وَیَقُوْلُ الَّذِیْنَ اٰمَنُوْا لَوْلَا نُزِّلَتْ سُوْرَةٌ فَاِذَاۤ اُنْزِلَتْ سُوْرَةٌ مُّحْكَمَةٌ وَّذُكِرَ فِیْهَا الْقِتَالُ رَاَیْتَ الَّذِیْنَ فِیْ قُلُوْبِهِمْ مَّرَضٌ یَّنْظُرُوْنَ اِلَیْكَ نَظَرَ الْمَغْشِیِّ عَلَیْهِ مِنَ الْمَوْتِ فَاَوْلٰى لَهُمْ",
    "طَاعَةٌ وَّقَوْلٌ مَّعْرُوْفٌ ۫ فَاِذَا عَزَمَ الْاَمْرُ ۫ فَلَوْ صَدَقُوا اللّٰهَ لَكَانَ خَیْرًا لَّهُمْ",
    "فَهَلْ عَسَیْتُمْ اِنْ تَوَلَّیْتُمْ اَنْ تُفْسِدُوْا فِی الْاَرْضِ وَتُقَطِّعُوْۤا اَرْحَامَكُمْ",
    "اُولٰٓىِٕكَ الَّذِیْنَ لَعَنَهُمُ اللّٰهُ فَاَصَمَّهُمْ وَاَعْمٰۤی اَبْصَارَهُمْ",
    "اَفَلَا یَتَدَبَّرُوْنَ الْقُرْاٰنَ اَمْ عَلٰی قُلُوْبٍ اَقْفَالُهَا",
    "اِنَّ الَّذِیْنَ ارْتَدُّوْا عَلٰۤی اَدْبَارِهِمْ مِّنْ بَعْدِ مَا تَبَیَّنَ لَهُمُ الْهُدَی الشَّیْطٰنُ سَوَّلَ لَهُمْ وَاَمْلٰی لَهُمْ",
    "ذٰلِكَ بِاَنَّهُمْ قَالُوْا لِلَّذِیْنَ كَرِهُوْا مَا نَزَّلَ اللّٰهُ سَنُطِیْعُكُمْ فِیْ بَعْضِ الْاَمْرِ وَاللّٰهُ یَعْلَمُ اِسْرَارَهُمْ",
    "فَكَیْفَ اِذَا تَوَفَّتْهُمُ الْمَلٰٓىِٕكَةُ یَضْرِبُوْنَ وُجُوْهَهُمْ وَاَدْبَارَهُمْ",
    "ذٰلِكَ بِاَنَّهُمُ اتَّبَعُوْا مَاۤ اَسْخَطَ اللّٰهَ وَكَرِهُوْا رِضْوَانَهٗ فَاَحْبَطَ اَعْمَالَهُمْ",
    "اَمْ حَسِبَ الَّذِیْنَ فِیْ قُلُوْبِهِمْ مَّرَضٌ اَنْ لَّنْ یُّخْرِجَ اللّٰهُ اَضْغَانَهُمْ",
    "وَلَوْ نَشَآءُ لَاَرَیْنٰكَهُمْ فَلَعَرَفْتَهُمْ بِسِیْمٰهُمْ وَلَتَعْرِفَنَّهُمْ فِیْ لَحْنِ الْقَوْلِ وَاللّٰهُ یَعْلَمُ اَعْمَالَكُمْ",
    "وَلَنَبْلُوَنَّكُمْ حَتّٰی نَعْلَمَ الْمُجٰهِدِیْنَ مِنْكُمْ وَالصّٰبِرِیْنَ وَنَبْلُوَاۡ اَخْبَارَكُمْ",
    "اِنَّ الَّذِیْنَ كَفَرُوْا وَصَدُّوْا عَنْ سَبِیْلِ اللّٰهِ وَشَآقُّوا الرَّسُوْلَ مِنْ بَعْدِ مَا تَبَیَّنَ لَهُمُ الْهُدٰی لَنْ یَّضُرُّوا اللّٰهَ شَیْـًٔا وَسَیُحْبِطُ اَعْمَالَهُمْ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اَطِیْعُوا اللّٰهَ وَاَطِیْعُوا الرَّسُوْلَ وَلَا تُبْطِلُوْۤا اَعْمَالَكُمْ",
    "اِنَّ الَّذِیْنَ كَفَرُوْا وَصَدُّوْا عَنْ سَبِیْلِ اللّٰهِ ثُمَّ مَاتُوْا وَهُمْ كُفَّارٌ فَلَنْ یَّغْفِرَ اللّٰهُ لَهُمْ",
    "فَلَا تَهِنُوْا وَتَدْعُوْۤا اِلَی السَّلْمِ ۖ وَاَنْتُمُ الْاَعْلَوْنَ ۖ وَاللّٰهُ مَعَكُمْ وَلَنْ یَّتِرَكُمْ اَعْمَالَكُمْ",
    "اِنَّمَا الْحَیٰوةُ الدُّنْیَا لَعِبٌ وَّلَهْوٌ وَاِنْ تُؤْمِنُوْا وَتَتَّقُوْا یُؤْتِكُمْ اُجُوْرَكُمْ وَلَا یَسْـَٔلْكُمْ اَمْوَالَكُمْ",
    "اِنْ یَّسْـَٔلْكُمُوْهَا فَیُحْفِكُمْ تَبْخَلُوْا وَیُخْرِجْ اَضْغَانَكُمْ",
    "هٰۤاَنْتُمْ هٰۤؤُلَآءِ تُدْعَوْنَ لِتُنْفِقُوْا فِیْ سَبِیْلِ اللّٰهِ فَمِنْكُمْ مَّنْ یَّبْخَلُ وَمَنْ یَّبْخَلْ فَاِنَّمَا یَبْخَلُ عَنْ نَّفْسِهٖ وَاللّٰهُ الْغَنِیُّ وَاَنْتُمُ الْفُقَرَآءُ وَاِنْ تَتَوَلَّوْا یَسْتَبْدِلْ قَوْمًا غَیْرَكُمْ ثُمَّ لَا یَكُوْنُوْۤا اَمْثَالَكُمْ"
  ],
  "bengali": [
    "যারা কুফরী করেছে এবং আল্লাহর পথ থেকে বারণ করেছে, তিনি তাদের আমলসমূহ ব্যর্থ করে দিয়েছেন।",
    "আর যারা ঈমান এনেছে, সৎকর্ম করেছে এবং মুহাম্মাদের প্রতি যা নাযিল করা হয়েছে তাতে বিশ্বাস স্থাপন করেছে ‘আর তা তাদের রবের পক্ষ হতে (প্রেরিত) সত্য, তিনি তাদের থেকে তাদের মন্দ কাজগুলো দূর করে দেবেন এবং তিনি তাদের অবস্থা সংশোধন করে দেবেন।",
    "তা এজন্য যে, যারা কুফরী করে তারা বাতিলের অনুসরণ করে, আর যারা ঈমান আনে তারা তাদের রবের প্রেরিত হকের অনুসরণ করে। এভাবেই আল্লাহ মানুষের জন্য তাদের দৃষ্টান্তসমূহ বর্ণনা করেন।",
    "অতএব তোমরা যখন কাফিরদের সাথে যুদ্ধে অবতীর্ণ হও, তখন তাদের ঘাড়ে আঘাত কর। পরিশেষে তোমরা যখন তাদেরকে সম্পূর্ণভাবে পর্যুদস্ত করবে তখন তাদেরকে শক্তভাবে বেঁধে নাও। তারপর হয় অনুগ্রহ না হয় মুক্তিপণ আদায়, যতক্ষণ না যুদ্ধ তার বোঝা রেখে দেয়*। এটাই বিধান। আর আল্লাহ ইচ্ছা করলে তাদের কাছ থেকে প্রতিশোধ গ্রহণ করতে পারতেন, কিন্তু তিনি তোমাদের একজনকে অন্যের দ্বারা পরীক্ষা করতে চান। আর যারা আল্লাহর পথে নিহত হয় তিনি কখনো তাদের আমলসমূহ বিনষ্ট করবেন না। \n* অর্থ যুদ্ধ বন্ধ হওয়া।",
    "অচিরেই তিনি তাদেরকে হিদায়াত দিবেন এবং তাদের অবস্থা সংশোধন করে দিবেন।",
    "আর তিনি তাদেরকে জান্নাতে প্রবেশ করাবেন, যার পরিচয় তিনি তাদেরকে দিয়েছেন।",
    "হে মুমিনগণ, যদি তোমরা আল্লাহকে সাহায্য কর তবে আল্লাহও তোমাদেরকে সাহায্য করবেন এবং তোমাদের পা সুদৃঢ় করে দেবেন।",
    "আর যারা কুফরী করে তাদের জন্য রয়েছে ধ্বংস এবং তিনি তাদের আমলসমূহ ব্যর্থ করে দিয়েছেন।",
    "তা এজন্য যে, আল্লাহ যা নাযিল করেছেন তারা তা অপছন্দ করে। অতএব তিনি তাদের আমলসমূহ বিনষ্ট করে দিয়েছেন।",
    "তবে কি তারা যমীনে ভ্রমণ করেনি, তারপর দেখেনি যারা তাদের পূর্বে ছিল তাদের পরিণাম কেমন হয়েছিল? আল্লাহ তাদেরকে ধ্বংস করে দিয়েছেন। আর কাফিরদের জন্য রয়েছে এর অনুরূপ পরিণাম।",
    "তা এজন্য যে, নিশ্চয় আল্লাহ মুমিনদের অভিভাবক। আর নিশ্চয় কাফিরদের কোন অভিভাবক নেই।",
    "নিশ্চয় যারা ঈমান এনেছে ও সৎকর্ম করেছে, আল্লাহ তাদেরকে জান্নাতে দাখিল করবেন। যার নিম্নদেশে নহরসমূহ প্রবাহিত হয়। কিন্তু যারা কুফরী করে তারা ভোগ-বিলাসে মত্ত থাকে এবং তারা আহার করে যেমন চতুষ্পদ জন্তুরা আহার করে। আর জাহান্নামই তাদের বাসস্থান।",
    "আর তোমার জনপদ যা থেকে তারা তোমাকে বহিষ্কার করেছে তার তুলনায় শক্তিমত্তায় প্রবলতর অনেক জনপদ ছিল, আমি তাদেরকে ধ্বংস করে দিয়েছিলাম, ফলে তাদের কোনই সাহায্যকারী ছিল না।",
    "যে ব্যক্তি তার রবের পক্ষ থেকে আগত সুস্পষ্ট প্রমাণের উপর প্রতিষ্ঠিত সে কি তার মত, যার মন্দ আমল তার জন্য চাকচিক্যময় করে দেয়া হয়েছে এবং যারা তাদের খেয়াল খুশীর অনুসরণ করে?",
    "মুত্তাকীদেরকে যে জান্নাতের ওয়াদা দেয়া হয়েছে তার দৃষ্টান্ত হল, তাতে রয়েছে নির্মল পানির নহরসমূহ, দুধের ঝর্নাধারা, যার স্বাদ পরিবর্তিত হয়নি, পানকারীদের জন্য সুস্বাদু সুরার নহরসমূহ এবং আছে পরিশোধিত মধুর ঝর্নাধারা। তথায় তাদের জন্য থাকবে সব ধরনের ফলমূল আর তাদের রবের পক্ষ থেকে ক্ষমা। তারা কি তাদের ন্যায়, যারা জাহান্নামে স্থায়ী হবে এবং তাদেরকে ফুটন্ত পানি পান করানো হবে ফলে তা তাদের নাড়িভুঁড়ি ছিন্ন-বিচ্ছিন্ন করে দেবে?",
    "আর তাদের মধ্যে এমন কতক রয়েছে, যারা তোমার প্রতি মনোযোগ দিয়ে শুনে। অবশেষে যখন তারা তোমার কাছ থেকে বের হয়ে যায় তখন তারা যাদের জ্ঞান দান করা হয়েছে তাদের উদ্দেশ্যে বলে, ‘এই মাত্র সে কী বলল?’ এরাই তারা, যাদের অন্তরসমূহে আল্লাহ মোহর মেরে দিয়েছেন এবং তারা নিজদের খেয়াল-খুশীর অনুসরণ করেছে।",
    "আর যারা হিদায়াতপ্রাপ্ত হয়েছে আল্লাহ তাদের হিদায়াত প্রাপ্তি আরো বৃদ্ধি করেন এবং তাদেরকে তাদের তাকওয়া প্রদান করেন।",
    "সুতরাং তারা কি কেবল এই অপেক্ষা করছে যে, কিয়ামত তাদের উপর আকস্মিকভাবে এসে পড়ুক? অথচ কিয়ামতের আলামতসমূহ তো এসেই পড়েছে। সুতরাং কিয়ামত এসে পড়লে তারা উপদেশ গ্রহণ করবে কেমন করে?",
    "অতএব জেনে রাখ, নিঃসন্দেহে আল্লাহ ছাড়া কোন (সত্য) ইলাহ নেই। তুমি ক্ষমা চাও তোমার ও মুমিন নারী-পুরুষদের ত্রুটি-বিচ্যুতির জন্য। আল্লাহ তোমাদের গতিবিধি এবং নিবাস সম্পর্কে অবগত রয়েছেন।",
    "আর যারা ঈমান এনেছে তারা বলে, ‘কেন একটি সূরা নাযিল করা হয়নি?’ অতঃপর যখন দ্ব্যর্থহীন কোন সুস্পষ্ট সূরা নাযিল করা হয় এবং তাতে যুদ্ধের উল্লেখ থাকে, তখন তুমি দেখবে যাদের অন্তরে ব্যাধি রয়েছে তারা তোমার দিকে মৃত্যুভয়ে মূর্ছিত ব্যক্তির দৃষ্টিতে তাকাচ্ছে। সুতরাং ধ্বংস তাদের জন্য।",
    "আনুগত্য ও ন্যায়সঙ্গত কথা (তাদের জন্য) উত্তম। অতঃপর যখন সিদ্ধান্ত চূড়ান্ত হয়, তখন যদি তারা আল্লাহর সাথে কৃত ওয়াদা সত্যে পরিণত করত, তবে তা তাদের জন্য কল্যাণকর হত।",
    "তবে কি তোমরা প্রত্যাশা করছ যে, যদি তোমরা শাসন কর্তৃত্ব পাও, তবে তোমরা যমীনে বিপর্যয় সৃষ্টি করবে এবং তোমাদের আত্মীয়তার বন্ধন ছিন্ন করবে?",
    "এরাই যাদেরকে আল্লাহ লানত করেছেন, ফলে তাদেরকে বধির ও তাদের দৃষ্টিসমূহকে অন্ধ করে দিয়েছেন।",
    "তবে কি তারা কুরআন নিয়ে গভীর চিন্তা- ভাবনা করে না? নাকি তাদের অন্তরসমূহে তালা রয়েছে?",
    "নিশ্চয় যারা হিদায়াতের পথ সুস্পষ্ট হওয়ার পর তাদের পৃষ্টপ্রদর্শনপূর্বক মুখ ফিরিয়ে নেয়, শয়তান তাদের কাজকে চমৎকৃত করে দেখায় এবং তাদেরকে মিথ্যা আশা দিয়ে থাকে।",
    "এটি এ জন্য যে, আল্লাহ যা নাযিল করেছেন তা যারা অপছন্দ করে। তাদের উদ্দেশ্যে, তারা বলে, ‘অচিরেই আমরা কতিপয় বিষয়ে তোমাদের আনুগত্য করব’। আল্লাহ তাদের গোপনীয়তা সম্পর্কে অবহিত রয়েছেন।",
    "অতঃপর তাদের অবস্থা কেমন হবে, যখন ফেরেশতারা তাদের মুখমন্ডল ও পৃষ্ঠদেশসমূহে আঘাত করতে করতে তাদের জীবনাবসান ঘটাবে?",
    "এটি এ জন্য যে, তারা এমন সব বিষয়ের অনুসরণ করেছে যা আল্লাহকে ক্রোধান্বিত করেছে এবং তারা তাঁর সন্তোষকে অপছন্দ করেছে। ফলে আল্লাহ তাদের কর্মসমূহ নিষ্ফল করে দিয়েছেন।",
    "নাকি যাদের অন্তরে ব্যাধি রয়েছে তারা ধারণা করেছে যে, আল্লাহ তাদের গোপন বিদ্বেষভাব প্রকাশ করে দিবেন না?",
    "আর যদি আমি চাইতাম তবে আমি তোমাকে এদের দেখিয়ে দিতে পারতাম। ফলে লক্ষণ দেখেই তুমি তাদের চিনতে পারতে। তবে তুমি অবশ্যই কথার ভঙ্গিতে তাদের চিনতে পারবে। আল্লাহ তোমাদের আমলসমূহ জানেন।",
    "আর আমি অবশ্যই তোমাদেরকে পরীক্ষা করব যতক্ষণ না আমি প্রকাশ করে দেই তোমাদের মধ্যে কারা জিহাদকারী ও ধৈর্যশীল এবং আমি তোমাদের কথা- কাজ পরীক্ষা করে নেব।",
    "নিশ্চয় যারা কুফরী করেছে, আল্লাহর পথে বাধা দিয়েছে এবং তাদের নিকট হিদায়াতের পথ সুস্পষ্ট হওয়ার পরও রাসূলের বিরোধিতা করেছে, তারা আল্লাহর কোনই ক্ষতি সাধন করতে পারবে না। আর শীঘ্রই তিনি তাদের আমলসমূহ নিষ্ফল করে দেবেন।",
    "হে মুমিনগণ, তোমরা আল্লাহর আনুগত্য কর এবং রাসূলের আনুগত্য কর। আর তোমরা তোমাদের আমলসমূহ বিনষ্ট করো না।",
    "নিশ্চয়ই যারা কুফরী করেছে এবং আল্লাহর পথে বাধা দিয়েছে। তারপর কাফির অবস্থায়ই মারা গেছে, আল্লাহ কখনই তাদের ক্ষমা করবেন না।",
    "অতএব তোমরা হীনবল হয়ো না ও সন্ধির আহবান জানিও না এবং তোমরাই প্রবল। আর আল্লাহ তোমাদের সাথেই রয়েছেন এবং কখনই তিনি তোমাদের কর্মফল হ্রাস করবেন না।",
    "দুনিয়ার জীবন তো কেবল খেল-তামাশা ও অর্থহীন কথাবার্তা। আর যদি তোমরা ঈমান আন এবং তাকওয়া অবলম্বন কর, তবে তিনি তোমাদেরকে তোমাদের প্রতিদান দিবেন এবং তিনি তোমাদের কাছে ধন-সম্পদ চাইবেন না।",
    "যদি তিনি তোমাদের নিকট তা চান, অতঃপর তিনি তোমাদের ওপর প্রবল চাপ দেন, তাহলে তো তোমরা কার্পণ্য করবে। আর তিনি তোমাদের গোপন বিদ্বেষসমূহ বের করে দেবেন।",
    "তোমরাই তো তারা, তোমাদের আহবান করা হচ্ছে যে, তোমরা আল্লাহর পথে ব্যয় করবে। অথচ তোমাদের কেউ কেউ কার্পণ্য করছে। তবে যে কার্পণ্য করছে সে তো নিজের প্রতিই কার্পণ্য করছে। আর আল্লাহ অভাবমুক্ত এবং তোমরা অভাবগ্রস্ত। যদি তোমরা মুখ ফিরিয়ে নাও, তবে তিনি তোমাদের ছাড়া অন্য কোন কওমকে স্থলাভিষিক্ত করবেন। তারপর তারা তোমাদের অনুরূপ হবে না।"
  ]
}