{
  "surahName": "Al-Hajj",
  "surahNameArabic": "الحج",
  "surahNameArabicLong": "سورة الحج",
  "surahNameTranslation": "The Pilgrimage",
  "revelationPlace": "Madina",
  "totalAyah": 78,
  "surahNo": 22,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/22.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/022.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/22.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/022.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/22.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/022.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/22.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/022.mp3"
    }
  },
  "english": [
    "O humanity! Fear your Lord, for the ˹violent˺ quaking at the Hour is surely a dreadful thing.",
    "The Day you see it, every nursing mother will abandon what she is nursing, and every pregnant woman will deliver her burden ˹prematurely˺. And you will see people ˹as if they were˺ drunk, though they will not be drunk; but the torment of Allah is ˹terribly˺ severe.",
    "˹Still˺ there are some who dispute about Allah without knowledge, and follow every rebellious devil.",
    "It has been decreed for such devils that whoever takes them as a guide will be misguided and led by them into the torment of the Blaze.",
    "O humanity! If you are in doubt about the Resurrection, then ˹know that˺ We did create you from dust, then from a sperm-drop, then ˹developed you into˺ a clinging clot ˹of blood˺, then a lump of flesh—fully formed or unformed—in order to demonstrate ˹Our power˺ to you. ˹Then˺ We settle whatever ˹embryo˺ We will in the womb for an appointed term, then bring you forth as infants, so that you may reach your prime. Some of you ˹may˺ die ˹young˺, while others are left to reach the most feeble stage of life so that they may know nothing after having known much. And you see the earth lifeless, but as soon as We send down rain upon it, it begins to stir ˹to life˺ and swell, producing every type of pleasant plant.",
    "That is because Allah ˹alone˺ is the Truth, He ˹alone˺ gives life to the dead, and He ˹alone˺ is Most Capable of everything.",
    "And certainly the Hour is coming, there is no doubt about it. And Allah will surely resurrect those in the graves.",
    "˹Still˺ there are some who dispute about Allah without knowledge, guidance, or an enlightening scripture",
    "turning away ˹in pride˺ to lead ˹others˺ astray from Allah’s Way. They will suffer disgrace in this world, and on the Day of Judgment We will make them taste the torment of burning.",
    "˹They will be told,˺ “This is ˹the reward˺ for what your hands have done. And Allah is never unjust to ˹His˺ creation.”",
    "And there are some who worship Allah on the verge ˹of faith˺: if they are blessed with something good, they are content with it; but if they are afflicted with a trial, they relapse ˹into disbelief˺, losing this world and the Hereafter. That is ˹truly˺ the clearest loss.",
    "They call besides Allah what can neither harm nor benefit them. That is ˹truly˺ the farthest one can stray.",
    "They invoke those whose worship leads to harm, not benefit. What an evil patron and what an evil associate!",
    "Indeed, Allah will admit those who believe and do good into Gardens, under which rivers flow. Surely Allah does what He wills.",
    "Whoever thinks that Allah will not help His Prophet in this world and the Hereafter, let them stretch out a rope to the ceiling and strangle themselves, then let them see if this plan will do away with ˹the cause of˺ their rage.",
    "And so We revealed this ˹Quran˺ as clear verses. And Allah certainly guides whoever He wills.",
    "Indeed, the believers, Jews, Sabians, Christians, Magi, and the polytheists—Allah will judge between them ˹all˺ on Judgment Day. Surely Allah is a Witness over all things.",
    "Do you not see that to Allah bow down ˹in submission˺ all those in the heavens and all those on the earth, as well as the sun, the moon, the stars, the mountains, the trees, and ˹all˺ living beings, as well as many humans, while many are deserving of punishment. And whoever Allah disgraces, none can honour. Surely Allah does what He wills.",
    "These are two opposing groups that disagree about their Lord: as for the disbelievers, garments of Fire will be cut out for them and boiling water will be poured over their heads",
    "melting whatever is in their bellies, along with their skin.",
    "And awaiting them are maces of iron.",
    "Whenever they try to escape from Hell—out of anguish—they will be forced back into it, ˹and will be told,˺ “Taste the torment of burning!”",
    "˹But˺ Allah will surely admit those who believe and do good into Gardens, under which rivers flow, where they will be adorned with bracelets of gold and pearls, and their clothing will be silk",
    "for they have been guided to the best of speech, and they have been guided to the Commendable Path.",
    "Indeed, those who persist in disbelief and hinder ˹others˺ from the Way of Allah and from the Sacred Mosque—which We have appointed for all people, residents and visitors alike—along with whoever intends to deviate by doing wrong in it, We will cause them to taste a painful punishment.",
    "And ˹remember˺ when We assigned to Abraham the site of the House, ˹saying,˺ “Do not associate anything with Me ˹in worship˺ and purify My House for those who circle ˹the Ka’bah˺, stand ˹in prayer˺, and bow and prostrate themselves.",
    "Call ˹all˺ people to the pilgrimage. They will come to you on foot and on every lean camel from every distant path",
    "so they may obtain the benefits ˹in store˺ for them, and pronounce the Name of Allah on appointed days over the sacrificial animals He has provided for them. So eat from their meat and feed the desperately poor.",
    "Then let them groom themselves, fulfil their vows, and circle the Ancient House.”",
    "That is so. And whoever honours the rituals of Allah, it is best for them in the sight of their Lord. The ˹meat of˺ cattle has been made lawful for you, except what has ˹already˺ been recited to you. So shun the impurity of idolatry, and shun words of falsehood.",
    "Be upright ˹in devotion˺ to Allah, associating none with Him ˹in worship˺. For whoever associates ˹others˺ with Allah is like someone who has fallen from the sky and is either snatched away by birds or swept by the wind to a remote place.",
    "That is so. And whoever honours the symbols of Allah, it is certainly out of the piety of the heart.",
    "You may benefit from sacrificial animals for an appointed term, then their place of sacrifice is at the Ancient House.",
    "For every community We appointed a rite of sacrifice so that they may pronounce the Name of Allah over the sacrificial animals He has provided for them. For your God is only One God, so submit yourselves to Him ˹alone˺. And give good news ˹O Prophet˺ to the humble:",
    "those whose hearts tremble at the remembrance of Allah, who patiently endure whatever may befall them, and who establish prayer and donate from what We have provided for them.",
    "We have made sacrificial camels ˹and cattle˺ among the symbols of Allah, in which there is ˹much˺ good for you. So pronounce the Name of Allah over them when they are lined up ˹for sacrifice˺. Once they have fallen ˹lifeless˺ on their sides, you may eat from their meat, and feed the needy—those who do not beg, and those who do. In this way We have subjected these ˹animals˺ to you so that you may be grateful.",
    "Neither their meat nor blood reaches Allah. Rather, it is your piety that reaches Him. This is how He has subjected them to you so that you may proclaim the greatness of Allah for what He has guided you to, and give good news to the good-doers.",
    "Indeed, Allah defends those who believe. Surely Allah does not like whoever is deceitful, ungrateful.",
    "Permission ˹to fight back˺ is ˹hereby˺ granted to those being fought, for they have been wronged. And Allah is truly Most Capable of helping them ˹prevail˺.",
    "˹They are˺ those who have been expelled from their homes for no reason other than proclaiming: “Our Lord is Allah.” Had Allah not repelled ˹the aggression of˺ some people by means of others, destruction would have surely claimed monasteries, churches, synagogues, and mosques in which Allah’s Name is often mentioned. Allah will certainly help those who stand up for Him. Allah is truly All-Powerful, Almighty.",
    "˹They are˺ those who, if established in the land by Us, would perform prayer, pay alms-tax, encourage what is good, and forbid what is evil. And with Allah rests the outcome of all affairs.",
    "If they deny you ˹O Prophet˺, so did the people of Noah before them, as well as ˹the tribes of˺ ’Ȃd and Thamûd",
    "the people of Abraham, the people of Lot",
    "and the residents of Midian. And Moses was denied ˹too˺. But I delayed ˹the fate of˺ the disbelievers ˹until their appointed time˺ then seized them. And how severe was My response!",
    "Many are the societies We have destroyed for persisting in wrongdoing, leaving them in total ruin. ˹Many are˺ also the abandoned wells and lofty palaces!",
    "Have they not travelled throughout the land so their hearts may reason, and their ears may listen? Indeed, it is not the eyes that are blind, but it is the hearts in the chests that grow blind.",
    "They challenge you ˹O Prophet˺ to hasten the torment. And Allah will never fail in His promise. But a day with your Lord is indeed like a thousand years by your counting.",
    "Many are the societies whose end We delayed while they did wrong, then seized them. And to Me is the final return.",
    "Say, ˹O Prophet,˺ “O humanity! I am only sent to you with a clear warning.",
    "So those who believe and do good will have forgiveness and an honourable provision.",
    "But those who strive to discredit Our revelations, they will be the residents of the Hellfire.”",
    "Whenever We sent a messenger or a prophet before you ˹O Prophet˺ and he recited ˹Our revelations˺, Satan would influence ˹people’s understanding of˺ his recitation. But ˹eventually˺ Allah would eliminate Satan’s influence. Then Allah would ˹firmly˺ establish His revelations. And Allah is All-Knowing, All-Wise.",
    "All that so He may make Satan’s influence a trial for those ˹hypocrites˺ whose hearts are sick and those ˹disbelievers˺ whose hearts are hardened. Surely the wrongdoers are totally engrossed in opposition.",
    "˹This is˺ also so that those gifted with knowledge would know that this ˹revelation˺ is the truth from your Lord, so they have faith in it, and so their hearts would submit humbly to it. And Allah surely guides the believers to the Straight Path.",
    "Yet the disbelievers will persist in doubt about this ˹revelation˺ until the Hour takes them by surprise, or the torment of a terminating Day comes to them.",
    "All authority on that Day is for Allah ˹alone˺. He will judge between them. So those who believe and do good will be in the Gardens of Bliss.",
    "But those who disbelieve and deny Our revelations, it is they who will suffer a humiliating punishment.",
    "As for those who emigrate in the cause of Allah and then are martyred or die, Allah will indeed grant them a good provision. Surely Allah is the Best Provider.",
    "He will certainly admit them into a place they will be pleased with. For Allah is truly All-Knowing, Most Forbearing.",
    "That is so. And whoever retaliates in equivalence to the injury they have received, and then are wronged ˹again˺, Allah will certainly help them. Surely Allah is Ever-Pardoning, All-Forgiving.",
    "That is because Allah causes the night to merge into the day, and the day into the night. Indeed, Allah is All-Hearing, All-Seeing.",
    "That is because Allah ˹alone˺ is the Truth and what they invoke besides Him is falsehood, and Allah ˹alone˺ is truly the Most High, All-Great.",
    "Do you not see that Allah sends down rain from the sky, then the earth becomes green? Surely Allah is Most Subtle, All-Aware.",
    "To Him belongs whatever is in the heavens and whatever is on the earth. Allah ˹alone˺ is truly the Self-Sufficient, Praiseworthy.",
    "Do you not see that Allah has subjected to you whatever is in the earth as well as the ships ˹that˺ sail through the sea by His command? He keeps the sky from falling down on the earth except by His permission. Surely Allah is Ever Gracious and Most Merciful to humanity.",
    "And He is the One Who gave you life, then will cause you to die, and then will bring you back to life. ˹But˺ surely humankind is ever ungrateful.",
    "For every community We appointed a code of life to follow. So do not let them dispute with you ˹O Prophet˺ in this matter. And invite ˹all˺ to your Lord, for you are truly on the Right Guidance.",
    "But if they argue with you, then say, “Allah knows best what you do.”",
    "Allah will judge between you ˹all˺ on Judgment Day regarding your differences.",
    "Do you not know that Allah ˹fully˺ knows whatever is in the heavens and the earth? Surely it is all ˹written˺ in a Record. That is certainly easy for Allah.",
    "Yet they worship besides Allah that for which He has sent down no authority, and of which they have no knowledge. The wrongdoers will have no helper.",
    "Whenever Our clear revelations are recited to them, you ˹O Prophet˺ recognize rage on the faces of the disbelievers, as if they are going to snap at those who recite Our revelations to them. Say, “Shall I inform you of something far more enraging than that? ˹It is˺ the Fire with which Allah has threatened those who disbelieve. What an evil destination!”",
    "O humanity! A lesson is set forth, so listen to it ˹carefully˺: those ˹idols˺ you invoke besides Allah can never create ˹so much as˺ a fly, even if they ˹all˺ were to come together for that. And if a fly were to snatch anything away from them, they cannot ˹even˺ retrieve it from the fly. How powerless are those who invoke and those invoked!",
    "They have not shown Allah the reverence He deserves. Surely Allah is All-Powerful, Almighty.",
    "Allah selects messengers from both angels and people, for Allah is truly All-Hearing, All-Seeing.",
    "He knows what is ahead of them and what is behind them. And to Allah ˹all˺ matters will be returned ˹for judgment˺.",
    "O believers! Bow down, prostrate yourselves, worship your Lord, and do ˹what is˺ good so that you may be successful.",
    "Strive for ˹the cause of˺ Allah in the way He deserves, for ˹it is˺ He ˹Who˺ has chosen you, and laid upon you no hardship in the religion—the way of your forefather Abraham. ˹It is Allah˺ Who named you ‘the ones who submit’ ˹in the˺ earlier ˹Scriptures˺ and in this ˹Quran˺, so that the Messenger may be a witness over you, and that you may be witnesses over humanity. So establish prayer, pay alms-tax, and hold fast to Allah. He ˹alone˺ is your Guardian. What an excellent Guardian, and what an excellent Helper!"
  ],
  "arabic1": [
    "یٰۤاَیُّهَا النَّاسُ اتَّقُوْا رَبَّكُمْ اِنَّ زَلْزَلَةَ السَّاعَةِ شَیْءٌ عَظِیْمٌ",
    "یَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّاۤ اَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَی النَّاسَ سُكٰرٰی وَمَا هُمْ بِسُكٰرٰی وَلٰكِنَّ عَذَابَ اللّٰهِ شَدِیْدٌ",
    "وَمِنَ النَّاسِ مَنْ یُّجَادِلُ فِی اللّٰهِ بِغَیْرِ عِلْمٍ وَّیَتَّبِعُ كُلَّ شَیْطٰنٍ مَّرِیْدٍ",
    "كُتِبَ عَلَیْهِ اَنَّهٗ مَنْ تَوَلَّاهُ فَاَنَّهٗ یُضِلُّهٗ وَیَهْدِیْهِ اِلٰی عَذَابِ السَّعِیْرِ",
    "یٰۤاَیُّهَا النَّاسُ اِنْ كُنْتُمْ فِیْ رَیْبٍ مِّنَ الْبَعْثِ فَاِنَّا خَلَقْنٰكُمْ مِّنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ مِنْ مُّضْغَةٍ مُّخَلَّقَةٍ وَّغَیْرِ مُخَلَّقَةٍ لِّنُبَیِّنَ لَكُمْ وَنُقِرُّ فِی الْاَرْحَامِ مَا نَشَآءُ اِلٰۤی اَجَلٍ مُّسَمًّی ثُمَّ نُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوْۤا اَشُدَّكُمْ وَمِنْكُمْ مَّنْ یُّتَوَفّٰی وَمِنْكُمْ مَّنْ یُّرَدُّ اِلٰۤی اَرْذَلِ الْعُمُرِ لِكَیْلَا یَعْلَمَ مِنْ بَعْدِ عِلْمٍ شَیْـًٔا وَتَرَی الْاَرْضَ هَامِدَةً فَاِذَاۤ اَنْزَلْنَا عَلَیْهَا الْمَآءَ اهْتَزَّتْ وَرَبَتْ وَاَنْۢبَتَتْ مِنْ كُلِّ زَوْجٍ بَهِیْجٍ",
    "ذٰلِكَ بِاَنَّ اللّٰهَ هُوَ الْحَقُّ وَاَنَّهٗ یُحْیِ الْمَوْتٰی وَاَنَّهٗ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "وَّاَنَّ السَّاعَةَ اٰتِیَةٌ لَّا رَیْبَ فِیْهَا وَاَنَّ اللّٰهَ یَبْعَثُ مَنْ فِی الْقُبُوْرِ",
    "وَمِنَ النَّاسِ مَنْ یُّجَادِلُ فِی اللّٰهِ بِغَیْرِ عِلْمٍ وَّلَا هُدًی وَّلَا كِتٰبٍ مُّنِیْرٍ",
    "ثَانِیَ عِطْفِهٖ لِیُضِلَّ عَنْ سَبِیْلِ اللّٰهِ لَهٗ فِی الدُّنْیَا خِزْیٌ وَّنُذِیْقُهٗ یَوْمَ الْقِیٰمَةِ عَذَابَ الْحَرِیْقِ",
    "ذٰلِكَ بِمَا قَدَّمَتْ یَدٰكَ وَاَنَّ اللّٰهَ لَیْسَ بِظَلَّامٍ لِّلْعَبِیْدِ",
    "وَمِنَ النَّاسِ مَنْ یَّعْبُدُ اللّٰهَ عَلٰی حَرْفٍ فَاِنْ اَصَابَهٗ خَیْرُ ١طْمَاَنَّ بِهٖ وَاِنْ اَصَابَتْهُ فِتْنَةُ ١نْقَلَبَ عَلٰی وَجْهِهٖ ۫ خَسِرَ الدُّنْیَا وَالْاٰخِرَةَ ذٰلِكَ هُوَ الْخُسْرَانُ الْمُبِیْنُ",
    "یَدْعُوْا مِنْ دُوْنِ اللّٰهِ مَا لَا یَضُرُّهٗ وَمَا لَا یَنْفَعُهٗ ذٰلِكَ هُوَ الضَّلٰلُ الْبَعِیْدُ",
    "یَدْعُوْا لَمَنْ ضَرُّهٗۤ اَقْرَبُ مِنْ نَّفْعِهٖ لَبِئْسَ الْمَوْلٰی وَلَبِئْسَ الْعَشِیْرُ",
    "اِنَّ اللّٰهَ یُدْخِلُ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ اِنَّ اللّٰهَ یَفْعَلُ مَا یُرِیْدُ",
    "مَنْ كَانَ یَظُنُّ اَنْ لَّنْ یَّنْصُرَهُ اللّٰهُ فِی الدُّنْیَا وَالْاٰخِرَةِ فَلْیَمْدُدْ بِسَبَبٍ اِلَی السَّمَآءِ ثُمَّ لْیَقْطَعْ فَلْیَنْظُرْ هَلْ یُذْهِبَنَّ كَیْدُهٗ مَا یَغِیْظُ",
    "وَكَذٰلِكَ اَنْزَلْنٰهُ اٰیٰتٍۢ بَیِّنٰتٍ وَّاَنَّ اللّٰهَ یَهْدِیْ مَنْ یُّرِیْدُ",
    "اِنَّ الَّذِیْنَ اٰمَنُوْا وَالَّذِیْنَ هَادُوْا وَالصّٰبِـِٕیْنَ وَالنَّصٰرٰی وَالْمَجُوْسَ وَالَّذِیْنَ اَشْرَكُوْۤا ۖ اِنَّ اللّٰهَ یَفْصِلُ بَیْنَهُمْ یَوْمَ الْقِیٰمَةِ اِنَّ اللّٰهَ عَلٰی كُلِّ شَیْءٍ شَهِیْدٌ",
    "اَلَمْ تَرَ اَنَّ اللّٰهَ یَسْجُدُ لَهٗ مَنْ فِی السَّمٰوٰتِ وَمَنْ فِی الْاَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُوْمُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَآبُّ وَكَثِیْرٌ مِّنَ النَّاسِ وَكَثِیْرٌ حَقَّ عَلَیْهِ الْعَذَابُ وَمَنْ یُّهِنِ اللّٰهُ فَمَا لَهٗ مِنْ مُّكْرِمٍ اِنَّ اللّٰهَ یَفْعَلُ مَا یَشَآءُ",
    "هٰذٰنِ خَصْمٰنِ اخْتَصَمُوْا فِیْ رَبِّهِمْ فَالَّذِیْنَ كَفَرُوْا قُطِّعَتْ لَهُمْ ثِیَابٌ مِّنْ نَّارٍ یُصَبُّ مِنْ فَوْقِ رُءُوْسِهِمُ الْحَمِیْمُ",
    "یُصْهَرُ بِهٖ مَا فِیْ بُطُوْنِهِمْ وَالْجُلُوْدُ",
    "وَلَهُمْ مَّقَامِعُ مِنْ حَدِیْدٍ",
    "كُلَّمَاۤ اَرَادُوْۤا اَنْ یَّخْرُجُوْا مِنْهَا مِنْ غَمٍّ اُعِیْدُوْا فِیْهَا وَذُوْقُوْا عَذَابَ الْحَرِیْقِ",
    "اِنَّ اللّٰهَ یُدْخِلُ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ یُحَلَّوْنَ فِیْهَا مِنْ اَسَاوِرَ مِنْ ذَهَبٍ وَّلُؤْلُؤًا وَلِبَاسُهُمْ فِیْهَا حَرِیْرٌ",
    "وَهُدُوْۤا اِلَی الطَّیِّبِ مِنَ الْقَوْلِ ۖۗ وَهُدُوْۤا اِلٰی صِرَاطِ الْحَمِیْدِ",
    "اِنَّ الَّذِیْنَ كَفَرُوْا وَیَصُدُّوْنَ عَنْ سَبِیْلِ اللّٰهِ وَالْمَسْجِدِ الْحَرَامِ الَّذِیْ جَعَلْنٰهُ لِلنَّاسِ سَوَآءَ ١لْعَاكِفُ فِیْهِ وَالْبَادِ وَمَنْ یُّرِدْ فِیْهِ بِاِلْحَادٍ بِظُلْمٍ نُّذِقْهُ مِنْ عَذَابٍ اَلِیْمٍ",
    "وَاِذْ بَوَّاْنَا لِاِبْرٰهِیْمَ مَكَانَ الْبَیْتِ اَنْ لَّا تُشْرِكْ بِیْ شَیْـًٔا وَّطَهِّرْ بَیْتِیَ لِلطَّآىِٕفِیْنَ وَالْقَآىِٕمِیْنَ وَالرُّكَّعِ السُّجُوْدِ",
    "وَاَذِّنْ فِی النَّاسِ بِالْحَجِّ یَاْتُوْكَ رِجَالًا وَّعَلٰی كُلِّ ضَامِرٍ یَّاْتِیْنَ مِنْ كُلِّ فَجٍّ عَمِیْقٍ",
    "لِّیَشْهَدُوْا مَنَافِعَ لَهُمْ وَیَذْكُرُوا اسْمَ اللّٰهِ فِیْۤ اَیَّامٍ مَّعْلُوْمٰتٍ عَلٰی مَا رَزَقَهُمْ مِّنْ بَهِیْمَةِ الْاَنْعَامِ فَكُلُوْا مِنْهَا وَاَطْعِمُوا الْبَآىِٕسَ الْفَقِیْرَ",
    "ثُمَّ لْیَقْضُوْا تَفَثَهُمْ وَلْیُوْفُوْا نُذُوْرَهُمْ وَلْیَطَّوَّفُوْا بِالْبَیْتِ الْعَتِیْقِ",
    "ذٰلِكَ وَمَنْ یُّعَظِّمْ حُرُمٰتِ اللّٰهِ فَهُوَ خَیْرٌ لَّهٗ عِنْدَ رَبِّهٖ وَاُحِلَّتْ لَكُمُ الْاَنْعَامُ اِلَّا مَا یُتْلٰی عَلَیْكُمْ فَاجْتَنِبُوا الرِّجْسَ مِنَ الْاَوْثَانِ وَاجْتَنِبُوْا قَوْلَ الزُّوْرِ",
    "حُنَفَآءَ لِلّٰهِ غَیْرَ مُشْرِكِیْنَ بِهٖ وَمَنْ یُّشْرِكْ بِاللّٰهِ فَكَاَنَّمَا خَرَّ مِنَ السَّمَآءِ فَتَخْطَفُهُ الطَّیْرُ اَوْ تَهْوِیْ بِهِ الرِّیْحُ فِیْ مَكَانٍ سَحِیْقٍ",
    "ذٰلِكَ وَمَنْ یُّعَظِّمْ شَعَآىِٕرَ اللّٰهِ فَاِنَّهَا مِنْ تَقْوَی الْقُلُوْبِ",
    "لَكُمْ فِیْهَا مَنَافِعُ اِلٰۤی اَجَلٍ مُّسَمًّی ثُمَّ مَحِلُّهَاۤ اِلَی الْبَیْتِ الْعَتِیْقِ",
    "وَلِكُلِّ اُمَّةٍ جَعَلْنَا مَنْسَكًا لِّیَذْكُرُوا اسْمَ اللّٰهِ عَلٰی مَا رَزَقَهُمْ مِّنْ بَهِیْمَةِ الْاَنْعَامِ فَاِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ فَلَهٗۤ اَسْلِمُوْا وَبَشِّرِ الْمُخْبِتِیْنَ",
    "الَّذِیْنَ اِذَا ذُكِرَ اللّٰهُ وَجِلَتْ قُلُوْبُهُمْ وَالصّٰبِرِیْنَ عَلٰی مَاۤ اَصَابَهُمْ وَالْمُقِیْمِی الصَّلٰوةِ وَمِمَّا رَزَقْنٰهُمْ یُنْفِقُوْنَ",
    "وَالْبُدْنَ جَعَلْنٰهَا لَكُمْ مِّنْ شَعَآىِٕرِ اللّٰهِ لَكُمْ فِیْهَا خَیْرٌ ۖ فَاذْكُرُوا اسْمَ اللّٰهِ عَلَیْهَا صَوَآفَّ فَاِذَا وَجَبَتْ جُنُوْبُهَا فَكُلُوْا مِنْهَا وَاَطْعِمُوا الْقَانِعَ وَالْمُعْتَرَّ كَذٰلِكَ سَخَّرْنٰهَا لَكُمْ لَعَلَّكُمْ تَشْكُرُوْنَ",
    "لَنْ یَّنَالَ اللّٰهَ لُحُوْمُهَا وَلَا دِمَآؤُهَا وَلٰكِنْ یَّنَالُهُ التَّقْوٰی مِنْكُمْ كَذٰلِكَ سَخَّرَهَا لَكُمْ لِتُكَبِّرُوا اللّٰهَ عَلٰی مَا هَدٰىكُمْ وَبَشِّرِ الْمُحْسِنِیْنَ",
    "اِنَّ اللّٰهَ یُدٰفِعُ عَنِ الَّذِیْنَ اٰمَنُوْا اِنَّ اللّٰهَ لَا یُحِبُّ كُلَّ خَوَّانٍ كَفُوْرٍ",
    "اُذِنَ لِلَّذِیْنَ یُقٰتَلُوْنَ بِاَنَّهُمْ ظُلِمُوْا وَاِنَّ اللّٰهَ عَلٰی نَصْرِهِمْ لَقَدِیْرُ",
    "١لَّذِیْنَ اُخْرِجُوْا مِنْ دِیَارِهِمْ بِغَیْرِ حَقٍّ اِلَّاۤ اَنْ یَّقُوْلُوْا رَبُّنَا اللّٰهُ وَلَوْلَا دَفْعُ اللّٰهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَّهُدِّمَتْ صَوَامِعُ وَبِیَعٌ وَّصَلَوٰتٌ وَّمَسٰجِدُ یُذْكَرُ فِیْهَا اسْمُ اللّٰهِ كَثِیْرًا وَلَیَنْصُرَنَّ اللّٰهُ مَنْ یَّنْصُرُهٗ اِنَّ اللّٰهَ لَقَوِیٌّ عَزِیْزٌ",
    "اَلَّذِیْنَ اِنْ مَّكَّنّٰهُمْ فِی الْاَرْضِ اَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ وَاَمَرُوْا بِالْمَعْرُوْفِ وَنَهَوْا عَنِ الْمُنْكَرِ وَلِلّٰهِ عَاقِبَةُ الْاُمُوْرِ",
    "وَاِنْ یُّكَذِّبُوْكَ فَقَدْ كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ وَّعَادٌ وَّثَمُوْدُ",
    "وَقَوْمُ اِبْرٰهِیْمَ وَقَوْمُ لُوْطٍ",
    "وَّاَصْحٰبُ مَدْیَنَ وَكُذِّبَ مُوْسٰی فَاَمْلَیْتُ لِلْكٰفِرِیْنَ ثُمَّ اَخَذْتُهُمْ فَكَیْفَ كَانَ نَكِیْرِ",
    "فَكَاَیِّنْ مِّنْ قَرْیَةٍ اَهْلَكْنٰهَا وَهِیَ ظَالِمَةٌ فَهِیَ خَاوِیَةٌ عَلٰی عُرُوْشِهَا وَبِئْرٍ مُّعَطَّلَةٍ وَّقَصْرٍ مَّشِیْدٍ",
    "اَفَلَمْ یَسِیْرُوْا فِی الْاَرْضِ فَتَكُوْنَ لَهُمْ قُلُوْبٌ یَّعْقِلُوْنَ بِهَاۤ اَوْ اٰذَانٌ یَّسْمَعُوْنَ بِهَا فَاِنَّهَا لَا تَعْمَی الْاَبْصَارُ وَلٰكِنْ تَعْمَی الْقُلُوْبُ الَّتِیْ فِی الصُّدُوْرِ",
    "وَیَسْتَعْجِلُوْنَكَ بِالْعَذَابِ وَلَنْ یُّخْلِفَ اللّٰهُ وَعْدَهٗ وَاِنَّ یَوْمًا عِنْدَ رَبِّكَ كَاَلْفِ سَنَةٍ مِّمَّا تَعُدُّوْنَ",
    "وَكَاَیِّنْ مِّنْ قَرْیَةٍ اَمْلَیْتُ لَهَا وَهِیَ ظَالِمَةٌ ثُمَّ اَخَذْتُهَا وَاِلَیَّ الْمَصِیْرُ",
    "قُلْ یٰۤاَیُّهَا النَّاسُ اِنَّمَاۤ اَنَا لَكُمْ نَذِیْرٌ مُّبِیْنٌ",
    "فَالَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَهُمْ مَّغْفِرَةٌ وَّرِزْقٌ كَرِیْمٌ",
    "وَالَّذِیْنَ سَعَوْا فِیْۤ اٰیٰتِنَا مُعٰجِزِیْنَ اُولٰٓىِٕكَ اَصْحٰبُ الْجَحِیْمِ",
    "وَمَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ وَّلَا نَبِیٍّ اِلَّاۤ اِذَا تَمَنّٰۤی اَلْقَی الشَّیْطٰنُ فِیْۤ اُمْنِیَّتِهٖ فَیَنْسَخُ اللّٰهُ مَا یُلْقِی الشَّیْطٰنُ ثُمَّ یُحْكِمُ اللّٰهُ اٰیٰتِهٖ وَاللّٰهُ عَلِیْمٌ حَكِیْمٌ",
    "لِّیَجْعَلَ مَا یُلْقِی الشَّیْطٰنُ فِتْنَةً لِّلَّذِیْنَ فِیْ قُلُوْبِهِمْ مَّرَضٌ وَّالْقَاسِیَةِ قُلُوْبُهُمْ وَاِنَّ الظّٰلِمِیْنَ لَفِیْ شِقَاقٍ بَعِیْدٍ",
    "وَّلِیَعْلَمَ الَّذِیْنَ اُوْتُوا الْعِلْمَ اَنَّهُ الْحَقُّ مِنْ رَّبِّكَ فَیُؤْمِنُوْا بِهٖ فَتُخْبِتَ لَهٗ قُلُوْبُهُمْ وَاِنَّ اللّٰهَ لَهَادِ الَّذِیْنَ اٰمَنُوْۤا اِلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "وَلَا یَزَالُ الَّذِیْنَ كَفَرُوْا فِیْ مِرْیَةٍ مِّنْهُ حَتّٰی تَاْتِیَهُمُ السَّاعَةُ بَغْتَةً اَوْ یَاْتِیَهُمْ عَذَابُ یَوْمٍ عَقِیْمٍ",
    "اَلْمُلْكُ یَوْمَىِٕذٍ لِّلّٰهِ یَحْكُمُ بَیْنَهُمْ فَالَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فِیْ جَنّٰتِ النَّعِیْمِ",
    "وَالَّذِیْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰیٰتِنَا فَاُولٰٓىِٕكَ لَهُمْ عَذَابٌ مُّهِیْنٌ",
    "وَالَّذِیْنَ هَاجَرُوْا فِیْ سَبِیْلِ اللّٰهِ ثُمَّ قُتِلُوْۤا اَوْ مَاتُوْا لَیَرْزُقَنَّهُمُ اللّٰهُ رِزْقًا حَسَنًا وَاِنَّ اللّٰهَ لَهُوَ خَیْرُ الرّٰزِقِیْنَ",
    "لَیُدْخِلَنَّهُمْ مُّدْخَلًا یَّرْضَوْنَهٗ وَاِنَّ اللّٰهَ لَعَلِیْمٌ حَلِیْمٌ",
    "ذٰلِكَ وَمَنْ عَاقَبَ بِمِثْلِ مَا عُوْقِبَ بِهٖ ثُمَّ بُغِیَ عَلَیْهِ لَیَنْصُرَنَّهُ اللّٰهُ اِنَّ اللّٰهَ لَعَفُوٌّ غَفُوْرٌ",
    "ذٰلِكَ بِاَنَّ اللّٰهَ یُوْلِجُ الَّیْلَ فِی النَّهَارِ وَیُوْلِجُ النَّهَارَ فِی الَّیْلِ وَاَنَّ اللّٰهَ سَمِیْعٌ بَصِیْرٌ",
    "ذٰلِكَ بِاَنَّ اللّٰهَ هُوَ الْحَقُّ وَاَنَّ مَا یَدْعُوْنَ مِنْ دُوْنِهٖ هُوَ الْبَاطِلُ وَاَنَّ اللّٰهَ هُوَ الْعَلِیُّ الْكَبِیْرُ",
    "اَلَمْ تَرَ اَنَّ اللّٰهَ اَنْزَلَ مِنَ السَّمَآءِ مَآءً فَتُصْبِحُ الْاَرْضُ مُخْضَرَّةً اِنَّ اللّٰهَ لَطِیْفٌ خَبِیْرٌ",
    "لَهٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَاِنَّ اللّٰهَ لَهُوَ الْغَنِیُّ الْحَمِیْدُ",
    "اَلَمْ تَرَ اَنَّ اللّٰهَ سَخَّرَ لَكُمْ مَّا فِی الْاَرْضِ وَالْفُلْكَ تَجْرِیْ فِی الْبَحْرِ بِاَمْرِهٖ وَیُمْسِكُ السَّمَآءَ اَنْ تَقَعَ عَلَی الْاَرْضِ اِلَّا بِاِذْنِهٖ اِنَّ اللّٰهَ بِالنَّاسِ لَرَءُوْفٌ رَّحِیْمٌ",
    "وَهُوَ الَّذِیْۤ اَحْیَاكُمْ ثُمَّ یُمِیْتُكُمْ ثُمَّ یُحْیِیْكُمْ اِنَّ الْاِنْسَانَ لَكَفُوْرٌ",
    "لِكُلِّ اُمَّةٍ جَعَلْنَا مَنْسَكًا هُمْ نَاسِكُوْهُ فَلَا یُنَازِعُنَّكَ فِی الْاَمْرِ وَادْعُ اِلٰی رَبِّكَ اِنَّكَ لَعَلٰی هُدًی مُّسْتَقِیْمٍ",
    "وَاِنْ جٰدَلُوْكَ فَقُلِ اللّٰهُ اَعْلَمُ بِمَا تَعْمَلُوْنَ",
    "اَللّٰهُ یَحْكُمُ بَیْنَكُمْ یَوْمَ الْقِیٰمَةِ فِیْمَا كُنْتُمْ فِیْهِ تَخْتَلِفُوْنَ",
    "اَلَمْ تَعْلَمْ اَنَّ اللّٰهَ یَعْلَمُ مَا فِی السَّمَآءِ وَالْاَرْضِ اِنَّ ذٰلِكَ فِیْ كِتٰبٍ اِنَّ ذٰلِكَ عَلَی اللّٰهِ یَسِیْرٌ",
    "وَیَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ مَا لَمْ یُنَزِّلْ بِهٖ سُلْطٰنًا وَّمَا لَیْسَ لَهُمْ بِهٖ عِلْمٌ وَمَا لِلظّٰلِمِیْنَ مِنْ نَّصِیْرٍ",
    "وَاِذَا تُتْلٰی عَلَیْهِمْ اٰیٰتُنَا بَیِّنٰتٍ تَعْرِفُ فِیْ وُجُوْهِ الَّذِیْنَ كَفَرُوا الْمُنْكَرَ یَكَادُوْنَ یَسْطُوْنَ بِالَّذِیْنَ یَتْلُوْنَ عَلَیْهِمْ اٰیٰتِنَا قُلْ اَفَاُنَبِّئُكُمْ بِشَرٍّ مِّنْ ذٰلِكُمْ اَلنَّارُ وَعَدَهَا اللّٰهُ الَّذِیْنَ كَفَرُوْا وَبِئْسَ الْمَصِیْرُ",
    "یٰۤاَیُّهَا النَّاسُ ضُرِبَ مَثَلٌ فَاسْتَمِعُوْا لَهٗ اِنَّ الَّذِیْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ لَنْ یَّخْلُقُوْا ذُبَابًا وَّلَوِ اجْتَمَعُوْا لَهٗ وَاِنْ یَّسْلُبْهُمُ الذُّبَابُ شَیْـًٔا لَّا یَسْتَنْقِذُوْهُ مِنْهُ ضَعُفَ الطَّالِبُ وَالْمَطْلُوْبُ",
    "مَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖ اِنَّ اللّٰهَ لَقَوِیٌّ عَزِیْزٌ",
    "اَللّٰهُ یَصْطَفِیْ مِنَ الْمَلٰٓىِٕكَةِ رُسُلًا وَّمِنَ النَّاسِ اِنَّ اللّٰهَ سَمِیْعٌ بَصِیْرٌ",
    "یَعْلَمُ مَا بَیْنَ اَیْدِیْهِمْ وَمَا خَلْفَهُمْ وَاِلَی اللّٰهِ تُرْجَعُ الْاُمُوْرُ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوا ارْكَعُوْا وَاسْجُدُوْا وَاعْبُدُوْا رَبَّكُمْ وَافْعَلُوا الْخَیْرَ لَعَلَّكُمْ تُفْلِحُوْنَ",
    "وَجَاهِدُوْا فِی اللّٰهِ حَقَّ جِهَادِهٖ هُوَ اجْتَبٰىكُمْ وَمَا جَعَلَ عَلَیْكُمْ فِی الدِّیْنِ مِنْ حَرَجٍ مِلَّةَ اَبِیْكُمْ اِبْرٰهِیْمَ هُوَ سَمّٰىكُمُ الْمُسْلِمِیْنَ مِنْ قَبْلُ وَفِیْ هٰذَا لِیَكُوْنَ الرَّسُوْلُ شَهِیْدًا عَلَیْكُمْ وَتَكُوْنُوْا شُهَدَآءَ عَلَی النَّاسِ فَاَقِیْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاعْتَصِمُوْا بِاللّٰهِ هُوَ مَوْلٰىكُمْ فَنِعْمَ الْمَوْلٰی وَنِعْمَ النَّصِیْرُ"
  ],
  "bengali": [
    "হে মানুষ, তোমরা তোমাদের রবকে ভয় কর। নিশ্চয় কিয়ামতের প্রকম্পন এক ভয়ঙ্কর ব্যাপার।",
    "যেদিন তোমরা তা দেখবে সেদিন প্রত্যেক স্তন্য দানকারিনী আপন দুগ্ধপোষ্য শিশুকে ভুলে যাবে এবং প্রত্যেক গর্ভধারিণী তার গর্ভপাত করে ফেলবে, তুমি দেখবে মানুষকে মাতাল সদৃশ, অথচ তারা মাতাল নয়। তবে আল্লাহর আযাবই কঠিন।",
    "মানুষের মধ্যে কতক আল্লাহ সম্পর্কে তর্ক-বিতর্ক করে না জেনে এবং সে অনুসরণ করে প্রত্যেক বিদ্রোহী শয়তানের।",
    "তার সম্পর্কে নির্ধারণ করা হয়েছে যে, যে তার সাথে বন্ধুত্ব করবে সে অবশ্যই তাকে পথভ্রষ্ট করবে এবং তাকে প্রজ্জ্বলিত আগুনের শাস্তির দিকে পরিচালিত করবে।",
    "হে মানুষ! যদি তোমরা পুনরুত্থানের ব্যাপারে সন্দেহে থাক তবে নিশ্চয়ই জেনে রেখো, আমি তোমাদেরকে মাটি থেকে সৃষ্টি করেছি, তারপর শুক্র থেকে, তারপর আলাকা* থেকে, তারপর পূর্ণাকৃতিবিশিষ্ট অথবা অপূর্ণাকৃতিবিশিষ্ট গোশ্ত থেকে। তোমাদের নিকট বিষয়টি সুস্পষ্টরূপে বর্ণনা করার নিমিত্তে। আর আমি যা ইচ্ছা করি তা একটি নির্দিষ্ট কাল পর্যন্ত মাতৃগর্ভে অবস্থিত রাখি। অতঃপর আমি তোমাদেরকে শিশুরূপে বের করি, পরে যাতে তোমরা যৌবনে উপনীত হও। তোমাদের মধ্যে কারো কারো মৃত্যু দেয়া হয় এ বয়সেই, আবার কাউকে কাউকে ফিরিয়ে নেয়া হয় হীনতম বয়সে, যাতে সে জ্ঞান লাভের পরও কিছু না জানে। তুমি যমীনকে দেখতে পাও শুষ্কাবস্থায়, অতঃপর যখনই আমি তাতে পানি বর্ষণ করি, তখন তা আন্দোলিত ও স্ফীত হয় এবং উদগত করে সকল প্রকার সুদৃশ্য উদ্ভিদ। \n* علق মানে যুক্ত ও ঝুলন্ত বস্তু। পূর্ববর্তী তাফসীরকারকদের অনেকে এর অর্থ করেছেন রক্তপিন্ড। তবে আধুনিক জীববিজ্ঞানীদের মতে, পুরুষের শুক্র ও নারীর ডিম্বানু মিলিত হয়ে মাতৃগর্ভে যে ভ্রূণের সৃষ্টি হয় তা পরে জরায়ূ গাত্রে সংযুক্ত হয়ে পড়ে। এ জন্য ‘আলাকা শব্দের অনুবাদ এখন করা হয়, এমন কিছু যা যুক্ত হয়ে থাকে।",
    "এটি এজন্য যে, আল্লাহই সত্য এবং তিনিই মৃতকে জীবন দান করেন এবং তিনিই সব কিছুর উপর ক্ষমতাবান।",
    "আর কিয়ামত আসবেই, এতে কোন সন্দেহ নেই এবং কবরে যারা আছে নিশ্চয়ই আল্লাহ তাদের পুনরুত্থিত করবেন।",
    "আর মানুষের মধ্যে কতক আল্লাহ সম্পর্কে বিতর্ক করে কোন জ্ঞান ছাড়া, কোন হিদায়াত ছাড়া এবং দীপ্তিমান কিতাব ছাড়া।",
    "সে বিতর্ক করে ঘাড় বাঁকিয়ে, মানুষকে আল্লাহর পথ থেকে ভ্রষ্ট করার উদ্দেশ্যে তার জন্য রয়েছে দুনিয়াতে লাঞ্ছনা এবং কিয়ামতের দিন আমি তাকে দহন যন্ত্রণা আস্বাদন করাব।",
    "(সেদিন তাকে বলা হবে), ‘এটি তোমার দু’হাত যা পূর্বে প্রেরণ করেছে তার কারণে। আর নিশ্চয়ই আল্লাহ বান্দাদের প্রতি যুলমকারী নন’।",
    "মানুষের মধ্যে কতক এমন রয়েছে, যারা দ্বিধার সাথে আল্লাহর ইবাদাত করে। যদি তার কোন কল্যাণ হয় তবে সে তাতে প্রশান্ত হয়। আর যদি তার কোন বিপর্যয় ঘটে, তাহলে সে তার আসল চেহারায় ফিরে যায়। সে দুনিয়া ও আখিরাতে ক্ষতিগ্রস্ত হয়। এটি হল সুস্পষ্ট ক্ষতি।",
    "সে আল্লাহর পরিবর্তে এমন কিছুকে ডাকে, যা তার কোন ক্ষতি করতে পারে না এবং কোন উপকারও করতে পারে না। এটিই চরম পথভ্রষ্টতা।",
    "সে এমন কিছুকে ডাকে যার ক্ষতি তার উপকার অপেক্ষা নিকটতর। কতইনা নিকৃষ্ট এই অভিভাবক এবং কতই না নিকৃষ্ট এই সঙ্গী!",
    "নিশ্চয় যারা ঈমান আনে এবং সৎকর্ম করে আল্লাহ তাদেরকে দাখিল করবেন এমন জান্নাতে, যার পাদদেশে নহরসমূহ প্রবাহিত। নিশ্চয়ই আল্লাহ যা ইচ্ছা তাই করেন।",
    "যে ধারণা করে যে, আল্লাহ দুনিয়া ও আখিরাতে কখনো তাকে (রাসূলকে) সাহায্য করবেন না, সে আসমানের দিকে একটি রশি প্রসারিত করুক, এরপর তা কেটে দিক, অতঃপর দেখুক তার কৌশল তার আক্রোশ দূর করে কিনা।",
    "এভাবেই আমি সুস্পষ্ট আয়াতরূপে তা (কুরআন) নাযিল করেছি। আর আল্লাহ নিঃসন্দেহে যাকে ইচ্ছা হিদায়াত দান করেন।",
    "নিশ্চয় যারা ঈমান এনেছে এবং যারা ইয়াহূদী হয়েছে, যারা সাবিঈ, খৃস্টান ও অগ্নিপূজক এবং যারা মুশরিক হয়েছে- কিয়ামতের দিন আল্লাহ তাদের মধ্যে ফয়সালা করে দেবেন। নিঃসন্দেহে আল্লাহ সব কিছুই সম্যক প্রত্যক্ষকারী।",
    "তুমি কি দেখ না যে, আল্লাহর উদ্দেশ্যে সিজদা করে যা কিছু রয়েছে আসমানসমূহে এবং যা কিছু রয়েছে যমীনে, সূর্য, চাঁদ, তারকারাজী, পর্বতমালা, বৃক্ষলতা, জীবজন্তু ও মানুষের মধ্যে অনেকে। আবার অনেকের উপর শাস্তি অবধারিত হয়ে আছে। আল্লাহ যাকে অপমানিত করেন তার সম্মানদাতা কেউ নেই। নিশ্চয় আল্লাহ যা ইচ্ছা তাই করেন।[সাজদাহ]",
    "এরা দু’টি বিবদমান পক্ষ, যারা তাদের রব সম্পর্কে বিতর্ক করে। তবে যারা কুফরী করে তাদের জন্য আগুনের পোশাক প্রস্ত্তত করা হয়েছে। তাদের মাথার উপর থেকে ঢেলে দেয়া হবে ফুটন্ত পানি।",
    "যার দ্বারা তাদের পেটের অভ্যন্তরে যা কিছু রয়েছে তা ও তাদের চামড়াসমূহ বিগলিত করা হবে।",
    "আর তাদের জন্য থাকবে লোহার হাতুড়ী।",
    "যখনই তারা যন্ত্রণাকাতর হয়ে তা থেকে বের হয়ে আসতে চাইবে, তখনই তাদেরকে তাতে ফিরিয়ে দেয়া হবে এবং বলা হবে, দহন-যন্ত্রণা আস্বাদন কর।",
    "যারা ঈমান আনে ও সৎকর্ম করে নিশ্চয় আল্লাহ তাদেরকে দাখিল করবেন এমন জান্নাতে, যার পাদদেশে নহরসমূহ প্রবাহিত। যেখানে তাদেরকে সোনার কাঁকন ও মুক্তা দ্বারা অলংকৃত করা হবে এবং যেখানে তাদের পোশাক-পরিচ্ছদ হবে রেশমের।",
    "তাদেরকে পবিত্র বাণীর দিকে পরিচালনা করা হয়েছিল এবং তাদেরকে মহা প্রশংসিত আল্লাহর পথ দেখানো হয়েছিল।",
    "নিশ্চয় যারা কুফরী করে এবং আল্লাহর পথ থেকে ও মসজিদে হারাম থেকে বাধা দেয়, যাকে আমি স্থানীয় ও বহিরাগত সকলের জন্য সমান করেছি। আর যে ব্যক্তি সীমালঙ্ঘন করে সেখানে পাপকাজ করতে চায়, তাকে আমি যন্ত্রণাদায়ক আযাব আস্বাদন করাব।",
    "আর স্মরণ কর, যখন আমি ইবরাহীমকে সে ঘরের (বায়তুল্লাহ্র) স্থান নির্ধারণ করে দিয়েছিলাম এবং বলেছিলাম, ‘আমার সাথে কাউকে শরীক করবে না এবং আমার ঘরকে পাক সাফ রাখবে তাওয়াফকারী, রুকূ-সিজদা ও দাঁড়িয়ে সালাত আদায়কারীর জন্য’।",
    "‘আর মানুষের নিকট হজ্জের ঘোষণা দাও; তারা তোমার কাছে আসবে পায়ে হেঁটে এবং কৃশকায় উটে চড়ে দূর পথ পাড়ি দিয়ে’।",
    "‘যেন তারা নিজদের কল্যাণের স্থানসমূহে হাযির হতে পারে এবং তিনি তাদেরকে চতুষ্পদ জন্তু থেকে যে রিয্ক দিয়েছেন তার উপর নির্দিষ্ট দিনসমূহে আল্লাহর নাম স্মরণ করতে পারে। অতঃপর তোমরা তা থেকে খাও এবং দুস্থ-দরিদ্রকে খেতে দাও’।",
    "‘তারপর তারা যেন পরিষ্কার-পরিচ্ছন্ন হয়, তাদের মানতসমূহ পূরণ করে এবং প্রাচীন ঘরের* তাওয়াফ করে’। \n* البيت العتيق বা পুরাতন ঘর বলতে আল্লাহর ইবাদাতের জন্য তৈরীকৃত সবচাইতে পুরাতন ঘর তথা কা‘বা ঘরকে বুঝানো হয়েছে। কারণ ইবাদাতের জন্য নির্মিত এটাই যমীনের বুকে সর্বপ্রথম ঘর।",
    "এটিই বিধান আর কেউ আল্লাহ কর্তৃক নির্ধারিত পবিত্র বিষয়সমূহকে সম্মান করলে তার রবের নিকট তা-ই তার জন্য উত্তম। আর তোমাদের জন্য হালাল করা হয়েছে চতুষ্পদ জন্তু; তবে যা তোমাদের কাছে পাঠ করা হয় সেগুলি ছাড়া। সুতরাং মূর্তিপূজার অপবিত্রতা থেকে বিরত থাক এবং মিথ্যা কথা পরিহার কর-",
    "আল্লাহর জন্য একনিষ্ঠ হয়ে এবং তাঁর সাথে কাউকে শরীক না করে। আর যে আল্লাহর সাথে শরীক করে, সে যেন আকাশ থেকে পড়ল। অতঃপর পাখি তাকে ছোঁ মেরে নিয়ে গেল কিম্বা বাতাস তাকে দূরের কোন জায়গায় নিক্ষেপ করল।",
    "এটাই হল আল্লাহর বিধান; যে আল্লাহর নিদর্শনসমূহকে সম্মান করে, নিঃসন্দেহে তা অন্তরের তাকওয়া থেকেই।",
    "এসব চতুষ্পদ জন্তুতে নির্দিষ্ট সময় পর্যন্ত তোমাদের জন্য কল্যাণ রয়েছে, তারপর এগুলোর কুরবানীর স্থান হবে প্রাচীন ঘরের নিকট।",
    "প্রত্যেক জাতির জন্য আমি কুরবানীর নিয়ম করে দিয়েছি; যাতে তারা আল্লাহর নাম স্মরণ করতে পারে, যে সমস্ত জন্তু তিনি রিয্ক হিসেবে দিয়েছেন তার উপর। তোমাদের ইলাহ তো এক ইলাহ; অতএব তাঁরই কাছে আত্মসমর্পণ কর; আর অনুগতদেরকে সুসংবাদ দাও,",
    "যাদের কাছে আল্লাহর কথা উল্লেখ করা হলে তাদের অন্তর কেঁপে ওঠে, যারা তাদের বিপদ-আপদে ধৈর্যধারণ করে, যারা সালাত কায়েম করে এবং আমি তাদেরকে যে রিয্ক দিয়েছি তা থেকে ব্যয় করে।",
    "আর কুরবানীর উটকে আমি তোমাদের জন্য আল্লাহর অন্যতম নিদর্শন বানিয়েছি; তোমাদের জন্য তাতে রয়েছে কল্যাণ। সুতরাং সারিবদ্ধভাবে দন্ডায়মান অবস্থায় সেগুলির উপর আল্লাহর নাম উচ্চারণ কর যখন সেগুলি কাত হয়ে পড়ে যায় তখন তা থেকে খাও। যে অভাবী, মানুষের কাছে হাত পাতে না এবং যে অভাবী চেয়ে বেড়ায়-তাদেরকে খেতে দাও। এভাবেই আমি ওগুলিকে তোমাদের অনুগত করে দিয়েছি; যাতে তোমরা কৃতজ্ঞতা প্রকাশ কর।",
    "আল্লাহর কাছে পৌঁছে না এগুলোর গোশ্ত ও রক্ত; বরং তাঁর কাছে পৌঁছে তোমাদের তাকওয়া। এভাবেই তিনি সে সবকে তোমাদের অধীন করে দিয়েছেন, যাতে তোমরা আল্লাহর তাকবীর পাঠ করতে পার, এজন্য যে, তিনি তোমাদেরকে হিদায়াত দান করেছেন; সুতরাং তুমি সৎকর্মশীলদেরকে সুসংবাদ দাও।",
    "নিশ্চয় আল্লাহ মুমিনদেরকে রক্ষা করেন এবং কোন বিশ্বাসঘাতক, অকৃতজ্ঞকে পছন্দ করেন না।",
    "যুদ্ধের অনুমতি দেয়া হল তাদেরকে, যাদেরকে আক্রমণ করা হচ্ছে। কারণ তাদের ওপর নির্যাতন করা হয়েছে। নিশ্চয় আল্লাহ তাদেরকে বিজয় দানে সক্ষম।",
    "যাদেরকে তাদের নিজ বাড়ী-ঘর থেকে অন্যায়ভাবে শুধু এ কারণে বের করে দেয়া হয়েছে যে, তারা বলে, ‘আমাদের রব আল্লাহ’। আর আল্লাহ যদি মানবজাতির একদলকে অপর দল দ্বারা দমন না করতেন, তবে বিধস্ত হয়ে যেত খৃস্টান সন্ন্যাসীদের আশ্রম, গির্জা, ইয়াহূদীদের উপাসনালয় ও মসজিদসমূহ- যেখানে আল্লাহর নাম অধিক স্মরণ করা হয়। আর আল্লাহ অবশ্যই তাকে সাহায্য করেন, যে তাকে সাহায্য করে। নিশ্চয় আল্লাহ শক্তিমান, পরাক্রমশালী।",
    "তারা এমন যাদেরকে আমি যমীনে ক্ষমতা দান করলে তারা সালাত কায়েম করবে, যাকাত দেবে এবং সৎকাজের আদেশ দেবে ও অসৎকাজ থেকে নিষেধ করবে; আর সব কাজের পরিণাম আল্লাহরই অধিকারে।",
    "আর তারা যদি তোমাকে অস্বীকার করে তবে তাদের পূর্বে অস্বীকার করেছিল নূহ, ‘আদ ও ছামূদের কওম।",
    "আর ইবরাহীমের কওম ও লূতের কওম।",
    "আর মাদইয়ানবাসীরা। আর অস্বীকার করা হয়েছিল মূসাকে। তাই কাফিরদেরকে আমি অবকাশ দিয়েছিলাম, তারপর আমি তাদেরকে পাকড়াও করেছিলাম। অতএব কেমন ছিল আমার শাস্তি!",
    "অতঃপর কত জনপদ আমি ধ্বংস করেছি যেগুলির বাসিন্দারা ছিল যালিম, তাই এইসব জনপদ তাদের ঘরের ছাদসহ ধ্বংসস্তুপে পরিণত হয়েছিল, কত কূপ পরিত্যক্ত হয়েছে এবং কত সুদৃঢ় প্রাসাদ ধ্বংস হয়েছে!",
    "তারা কি যমীনে ভ্রমণ করেনি? তাহলে তাদের হত এমন হৃদয় যা দ্বারা তারা উপলব্ধি করতে পারত এবং এমন কান যা দ্বারা তারা শুনতে পারত। বস্ত্তত চোখ তো অন্ধ হয় না, বরং অন্ধ হয় বক্ষস্থিত হৃদয়।",
    "আর তারা তোমাকে আযাব তরান্বিত করতে বলে, অথচ আল্লাহ কখনো তাঁর ওয়াদা খেলাফ করেন না। আর তোমার রবের নিকট নিশ্চয় এক দিন তোমাদের গণনায় হাজার বছরের সমান।",
    "আর আমি কত জনপদকে অবকাশ দিয়েছি, অথচ তারা ছিল যালিম; অতঃপর আমি তাদেরকে পাকড়াও করেছি। আর আমারই নিকট প্রত্যাবর্তনস্থল ।",
    "বল, ‘হে মানুষ, আমি তো কেবল তোমাদের জন্য সুস্পষ্ট সতর্ককারী’।",
    "সুতরাং যারা ঈমান আনে ও সৎকর্ম করে, তাদের জন্য রয়েছে ক্ষমা ও সম্মানজনক রিয্ক।",
    "আর যারা আমার আয়াতসমূহকে ব্যর্থ করে দেয়ার চেষ্টা করে, তারা জাহান্নামের অধিবাসী।",
    "আর আমি তোমার পূর্বে যে রাসূল কিংবা নবী পাঠিয়েছি, সে যখনই (ওহীকৃত বাণী) পাঠ করেছে, শয়তান তার পাঠে (কিছু) নিক্ষেপ করেছে। কিন্তু শয়তান যা নিক্ষেপ করে আল্লাহ তা মুছে দেন। অতঃপর আল্লাহ তাঁর আয়াতসমূহকে সুদৃঢ় করে দেন। আর আল্লাহ মহাজ্ঞানী, অতি প্রজ্ঞাময়।",
    "এটা এজন্য যে, শয়তান যা নিক্ষেপ করে, তা যাতে তিনি তাদের জন্য পরীক্ষার বস্ত্ত বানিয়ে দেন, যাদের অন্তরসমূহে ব্যাধি রয়েছে এবং যাদের হৃদয়সমূহ পাষাণ। আর নিশ্চয় যালিমরা দুস্তর মতভেদে লিপ্ত রয়েছে।",
    "এটা এজন্যও যে, যাদেরকে জ্ঞান দেয়া হয়েছে, তারা যেন জানতে পারে যে, এটা অবশ্যই তোমার রবের পক্ষ থেকে সত্য। অতঃপর তারা যেন এর প্রতি ঈমান আনে এবং তাদের অন্তর যেন এর প্রতি অনুগত হয়। আর যারা ঈমান এনেছে, নিশ্চয় আল্লাহ তাদেরকে সরল পথ প্রদর্শনকারী।",
    "আর যারা কুফরী করে, তারা এতে সন্দেহ পোষণ করতে থাকবে যতক্ষণ না তাদের নিকট আকস্মিকভাবে কিয়ামত এসে পড়বে অথবা তাদের নিকট এসে পড়বে এক বন্ধ্যা দিনের আযাব।",
    "সে দিনের বাদশাহী আল্লাহরই। তিনিই তাদের মধ্যে বিচার করবেন। সুতরাং যারা ঈমান আনে ও সৎকর্ম করে, তারা নিআমতপূর্ণ জান্নাতসমূহে অবস্থান করবে।",
    "আর যারা কুফরী করে এবং আমার আয়াতসমূহকে অস্বীকার করে, তাদের জন্যেই রয়েছে অপমানজনক আযাব।",
    "আর যারা আল্লাহর পথে হিজরত করে, অতঃপর নিহত হয় কিংবা মারা যায়, তাদেরকে অবশ্যই আল্লাহ উত্তম রিয্ক দান করবেন। আর নিশ্চয় আল্লাহই সর্বোৎকৃষ্ট রিয্কদাতা।",
    "তিনি অবশ্যই তাদেরকে এমন স্থানে প্রবেশ করাবেন, যা তারা পছন্দ করবে আর আল্লাহ তো নিশ্চয় মহাজ্ঞানী, পরম সহনশীল।",
    "এটাই প্রকৃত অবস্থা। আর যে ব্যক্তি নিপীড়িত হয়ে তার সমপরিমাণ প্রতিশোধ গ্রহণ করে; অতঃপর তার উপর আবার নিপীড়ন করা হয় তাহলে আল্লাহ অবশ্যই তাকে সাহায্য করবেন। নিশ্চয় আল্লাহ পাপ মোচনকারী, অতীব ক্ষমাশীল।",
    "এটা এজন্য যে, নিশ্চয় আল্লাহ রাতকে দিনের মধ্যে প্রবেশ করান এবং দিনকে রাতের মধ্যে প্রবেশ করান। আর নিশ্চয় আল্লাহ সর্বশ্রোতা, সম্যক দ্রষ্টা।",
    "আর এটা এজন্য যে, নিশ্চয় আল্লাহই সত্য এবং তারা তাঁর পরিবর্তে যাকে ডাকে, অবশ্যই তা বাতিল। আর নিশ্চয় আল্লাহ তো সমুচ্চ, সুমহান।",
    "তুমি কি লক্ষ্য কর না যে, আল্লাহ আকাশ থেকে পানি বর্ষণ করেন, যার ফলে যমীন সবুজ-শ্যামল হয়ে উঠে। নিশ্চয় আল্লাহ স্নেহপরায়ণ, সর্ববিষয়ে সম্যকজ্ঞাত।",
    "আসমানসমূহ ও যমীনে যা কিছু আছে, সব তাঁরই। আর নিশ্চয় আল্লাহই তো অভাবমুক্ত, সকল প্রশংসার অধিকারী।",
    "তুমি কি লক্ষ্য কর না যে, যমীনে যা কিছু আছে এবং নৌযানগুলো যা তাঁরই নির্দেশে সমুদ্রে বিচরণ করে সবই আল্লাহ তোমাদের জন্য অনুগত করে দিয়েছেন। আর তিনিই আসমানকে আটকিয়ে রেখেছেন, যাতে তাঁর অনুমতি ছাড়া তা যমীনের উপর পড়ে না যায়। নিশ্চয় আল্লাহ মানুষের প্রতি বড়ই করুণাময়, পরম দয়ালু।",
    "আর তিনিই তোমাদের জীবন দিয়েছেন, অতঃপর তিনিই তোমাদের মৃত্যু দেবেন, তারপর তিনিই তোমাদেরকে আবার জীবন দেবেন। নিশ্চয় মানুষ বড়ই অকৃতজ্ঞ।",
    "আমি প্রত্যেক জাতির জন্য ইবাদাতের নিয়ম-কানুন নির্ধারণ করে দিয়েছি, তারা যার অনুসরণকারী। সুতরাং তারা যেন তোমার সাথে এ ব্যাপারে কোন বিতর্ক করতে না পারে। আর তুমি তোমার রবের দিকে আহবান কর। নিশ্চয় তুমি সরল পথেই রয়েছ।",
    "আর তারা যদি তোমার সাথে বাকবিতন্ডা করে, তাহলে বল, ‘তোমরা যা কর, সে সম্পর্কে আল্লাহ সম্যক অবহিত।’",
    "তোমরা যে বিষয়ে মতভেদ করছ, আল্লাহ সে বিষয়ে কিয়ামতের দিন ফয়সালা করে দেবেন।",
    "তুমি কি জান না যে, আসমান ও যমীনে যা কিছু রয়েছে, আল্লাহ তা জানেন? নিশ্চয় তা একটি কিতাবে রয়েছে। অবশ্যই এটা আল্লাহর জন্য খুবই সহজ।",
    "আর তারা আল্লাহর পরিবর্তে এমন কিছুর ইবাদাত করে, যে সম্পর্কে তিনি কোন প্রমাণ নাযিল করেননি এবং যে ব্যাপারে তাদেরও কোন জ্ঞান নেই। আর যালিমদের কোন সাহায্যকারী নেই।",
    "আর তাদের কাছে আমার আয়াতসমূহ সুস্পষ্টরূপে তিলাওয়াত করা হলে যারা কুফরী করে তাদের মুখমন্ডলে তুমি অসন্তোষ লক্ষ্য করবে; তাদের কাছে যারা আমার আয়াতসমূহ তিলাওয়াত করে, তাদেরকে তারা আক্রমণ করতে উদ্যত হয়। বল, তাহলে কি আমি তোমাদেরকে এর চেয়েও খারাপ কিছুর সংবাদ দেব? সেটা আগুন। যারা কুফরী করে, আল্লাহ তাদেরকে এর ওয়াদা দিয়েছেন। আর এটা কত নিকৃষ্ট ঠিকানা!",
    "হে মানুষ, একটি উপমা পেশ করা হল, মনোযোগ দিয়ে তা শোন, তোমরা আল্লাহর পরিবর্তে যাদেরকে ডাক তারা কখনো একটি মাছিও সৃষ্টি করতে পারবে না। যদিও তারা এ উদ্দেশ্যে একত্রিত হয়। আর যদি মাছি তাদের কাছ থেকে কিছু ছিনিয়ে নেয়, তারা তার কাছ থেকে তাও উদ্ধার করতে পারবে না। অন্বেষণকারী ও যার কাছে অন্বেষণ করা হয় উভয়েই দুর্বল।",
    "তারা আল্লাহকে যথাযথ মর্যাদা দেয় না। নিশ্চয় আল্লাহ মহাক্ষমতাবান, মহাপরাক্রমশালী।",
    "আল্লাহ ফেরেশতা ও মানুষের মধ্য থেকে রাসূল মনোনীত করেন। অবশ্যই আল্লাহ সর্বশ্রোতা সর্বদ্রষ্টা।",
    "তাদের সামনে এবং পেছনে যা কিছু আছে তিনি তা জানেন। আর সবকিছু আল্লাহর কাছেই প্রত্যাবর্তিত হবে।",
    "হে মুমিনগণ, তোমরা রুকূ‘ কর, সিজদা কর, তোমাদের রবের ইবাদাত কর এবং ভাল কাজ কর, আশা করা যায় তোমরা সফল হতে পারবে।[সাজদাহ]",
    "আর তোমরা আল্লাহর পথে জিহাদ কর যেভাবে জিহাদ করা উচিৎ। তিনি তোমাদেরকে মনোনীত করেছেন। দীনের ব্যাপারে তিনি তোমাদের উপর কোন কঠোরতা আরোপ করেননি। এটা তোমাদের পিতা ইবরাহীমের দীন। তিনিই তোমাদের নাম রেখেছেন ‘মুসলিম’ পূর্বে এবং এ কিতাবেও। যাতে রাসূল তোমাদের জন্য সাক্ষী হয় আর তোমরা মানুষের জন্য সাক্ষী হও। অতএব তোমরা সালাত কায়েম কর, যাকাত দাও এবং আল্লাহকে মজবুতভাবে ধর। তিনিই তোমাদের অভিভাবক। আর তিনি কতই না উত্তম অভিভাবক এবং কতই না উত্তম সাহায্যকারী!"
  ]
}