{
  "surahName": "Taa-Haa",
  "surahNameArabic": "طه",
  "surahNameArabicLong": "سورة طه",
  "surahNameTranslation": "Taa-Haa",
  "revelationPlace": "Mecca",
  "totalAyah": 135,
  "surahNo": 20,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/20.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/020.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/20.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/020.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/20.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/020.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/20.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/020.mp3"
    }
  },
  "english": [
    "Ṭâ-Hâ.",
    "We have not revealed the Quran to you ˹O Prophet˺ to cause you distress",
    "but as a reminder to those in awe ˹of Allah˺.",
    "˹It is˺ a revelation from the One Who created the earth and the high heavens—",
    "the Most Compassionate, ˹Who is˺ established on the Throne.",
    "To Him belongs whatever is in the heavens and whatever is on the earth and whatever is in between and whatever is underground.",
    "Whether you speak openly ˹or not˺, He certainly knows what is secret and what is even more hidden.",
    "Allah—there is no god ˹worthy of worship˺ except Him. He has the Most Beautiful Names.",
    "Has the story of Moses reached you ˹O Prophet˺?",
    "When he saw a fire, he said to his family, “Wait here, ˹for˺ I have spotted a fire. Perhaps I can bring you a torch from it, or find some guidance at the fire.”",
    "But when he approached it, he was called, “O Moses!",
    "It is truly I. I am your Lord! So take off your sandals, for you are in the sacred valley of Ṭuwa.",
    "I have chosen you, so listen to what is revealed:",
    "‘It is truly I. I am Allah! There is no god ˹worthy of worship˺ except Me. So worship Me ˹alone˺, and establish prayer for My remembrance.",
    "The Hour is sure to come. My Will is to keep it hidden, so that every soul may be rewarded according to their efforts.",
    "So do not let those who disbelieve in it and follow their desires distract you from it, or you will be doomed.’”",
    "˹Allah added,˺ “And what is that in your right hand, O  Moses?”",
    "He replied, “It is my staff! I lean on it, and with it I beat down ˹branches˺ for my sheep, and have other uses for it.”",
    "Allah said, “Throw it down, O  Moses!”",
    "So he did, then—behold!—it became a serpent, slithering.",
    "Allah said, “Take it, and have no fear. We will return it to its former state.",
    "And put your hand under your armpit, it will come out ˹shining˺ white, unblemished, as another sign",
    "so that We may show you some of Our greatest signs.",
    "Go to Pharaoh, for he has truly transgressed ˹all bounds˺.”",
    "Moses prayed, “My Lord! Uplift my heart for me",
    "and make my task easy",
    "and remove the impediment from my tongue",
    "so people may understand my speech",
    "and grant me a helper from my family",
    "Aaron, my brother.",
    "Strengthen me through him",
    "and let him share my task",
    "so that we may glorify You much",
    "and remember You much",
    "for truly You have ˹always˺ been overseeing us.”",
    "Allah responded, “All that you requested has been granted, O  Moses!",
    "And surely We had shown You favour before",
    "when We inspired your mother with this:",
    "‘Put him into a chest, then put it into the river. The river will wash it ashore, and he will be taken by ˹Pharaoh,˺ an enemy of Mine and his.’ And I blessed you with lovability from Me ˹O Moses˺ so that you would be brought up under My ˹watchful˺ Eye.",
    "˹Remember˺ when your sister came along and proposed, ‘Shall I direct you to someone who will nurse him?’ So We reunited you with your mother so that her heart would be put at ease, and she would not grieve. ˹Later˺ you killed a man ˹by mistake˺, but We saved you from sorrow, as well as other tests We put you through. Then you stayed for a number of years among the people of Midian. Then you came here as pre-destined, O  Moses!",
    "And I have selected you for My service.",
    "Go forth, you and your brother, with My signs and never falter in remembering Me.",
    "Go, both of you, to Pharaoh, for he has truly transgressed ˹all bounds˺.",
    "Speak to him gently, so perhaps he may be mindful ˹of Me˺ or fearful ˹of My punishment˺.”",
    "They both pleaded, “Our Lord! We fear that he may be quick to harm us or act tyrannically.”",
    "Allah reassured ˹them˺, “Have no fear! I am with you, hearing and seeing.",
    "So go to him and say, ‘Indeed we are both messengers from your Lord, so let the Children of Israel go with us, and do not oppress them. We have come to you with a sign from your Lord. And salvation will be for whoever follows the ˹right˺ guidance.",
    "It has indeed been revealed to us that the punishment will be upon whoever denies ˹the truth˺ and turns away.’”",
    "Pharaoh asked, “Who then is the Lord of you two, O  Moses?”",
    "He answered, “Our Lord is the One Who has given everything its ˹distinctive˺ form, then guided ˹it˺.”",
    "Pharaoh asked, “And what about previous peoples?”",
    "He replied, “That knowledge is with my Lord in a Record. My Lord neither falters nor forgets ˹anything˺.”",
    "˹He is the One˺ Who has laid out the earth for ˹all of˺ you, and set in it pathways for you, and sends down rain from the sky, causing various types of plants to grow",
    "˹so˺ eat and graze your cattle. Surely in this are signs for people of sound judgment.",
    "From the earth We created you, and into it We will return you, and from it We will bring you back again.",
    "And We certainly showed Pharaoh all of Our signs, but he denied them and refused ˹to believe˺.",
    "He said, “Have you come to drive us out of our land with your magic, O  Moses?",
    "We can surely meet you with similar magic. So set for us an appointment that neither of us will fail to keep, in a central place.”",
    "Moses said, “Your appointment is on the Day of the Festival, and let the people be gathered mid-morning.”",
    "Pharaoh then withdrew, orchestrated his scheme, then returned.",
    "Moses warned the magicians, “Woe to you! Do not fabricate a lie against Allah, or He will wipe you out with a torment. Whoever fabricates ˹lies˺ is bound to fail.”",
    "So the magicians disputed the matter among themselves, conversing privately.",
    "They concluded, “These two are only magicians who want to drive you out of your land with their magic, and do away with your most cherished traditions.",
    "So orchestrate your plan, then come forward in ˹perfect˺ ranks. And whoever prevails today will certainly be successful.”",
    "They said, “O Moses! Either you cast, or let us be the first to cast.”",
    "Moses responded, “No, you go first.” And suddenly their ropes and staffs appeared to him—by their magic—to be slithering.",
    "So Moses concealed fear within himself.",
    "We reassured ˹him˺, “Do not fear! It is certainly you who will prevail.",
    "Cast what is in your right hand, and it will swallow up what they have made, for what they have made is no more than a magic trick. And magicians can never succeed wherever they go.”",
    "So the magicians fell down in prostration, declaring, “We believe in the Lord of Aaron and Moses.”",
    "Pharaoh threatened, “How dare you believe in him before I give you permission? He must be your master who taught you magic. I will certainly cut off your hands and feet on opposite sides, and crucify you on the trunks of palm trees. You will really see whose punishment is more severe and more lasting.”",
    "They responded, “By the One Who created us! We will never prefer you over the clear proofs that have come to us. So do whatever you want! Your authority only covers the ˹fleeting˺ life of this world.",
    "Indeed, we have believed in our Lord so He may forgive our sins and that magic you have forced us to practice. And Allah is far superior ˹in reward˺ and more lasting ˹in punishment˺.”",
    "Whoever comes to their Lord as an evildoer will certainly have Hell, where they can neither live nor die.",
    "But whoever comes to Him as a believer, having done good, they will have the highest ranks:",
    "the Gardens of Eternity, under which rivers flow, where they will stay forever. That is the reward of those who purify themselves.",
    "And We surely inspired Moses, ˹saying,˺ “Leave with My servants ˹at night˺ and strike a dry passage for them across the sea. Have no fear of being overtaken, nor be concerned ˹of drowning˺.”",
    "Then Pharaoh pursued them with his soldiers—but how overwhelming were the waters that submerged them!",
    "And ˹so˺ Pharaoh led his people astray, and did not guide ˹them rightly˺.",
    "O Children of Israel! We saved you from your enemy, and made an appointment with you on the right side of Mount Ṭûr, and sent down to you manna and quails",
    "˹saying,˺ “Eat from the good things We have provided for you, but do not transgress in them, or My wrath will befall you. And whoever My wrath befalls is certainly doomed.",
    "But I am truly Most Forgiving to whoever repents, believes, and does good, then persists on ˹true˺ guidance.”",
    "˹Allah asked,˺ “Why have you come with such haste ahead of your people, O  Moses?”",
    "He replied, “They are close on my tracks. And I have hastened to You, my Lord, so You will be pleased.”",
    "Allah responded, “We have indeed tested your people in your absence, and the Sâmiri has led them astray.”",
    "So Moses returned to his people, furious and sorrowful. He said, “O my people! Had your Lord not made you a good promise? Has my absence been too long for you? Or have you wished for wrath from your Lord to befall you, so you broke your promise to me?”",
    "They argued, “We did not break our promise to you of our own free will, but we were made to carry the burden of the people’s ˹golden˺ jewellery, then we threw it ˹into the fire˺, and so did the Sâmiri.”",
    "Then he moulded for them an idol of a calf that made a lowing sound. They said, “This is your god and the god of Moses, but Moses forgot ˹where it was˺!”",
    "Did they not see that it did not respond to them, nor could it protect or benefit them?",
    "Aaron had already warned them beforehand, “O my people! You are only being tested by this, for indeed your ˹one true˺ Lord is the Most Compassionate. So follow me and obey my orders.”",
    "They replied, “We will not cease to worship it until Moses returns to us.”",
    "Moses scolded ˹his brother˺, “O Aaron! What prevented you, when you saw them going astray",
    "from following after me? How could you disobey my orders?”",
    "Aaron pleaded, “O son of my mother! Do not seize me by my beard or ˹the hair of˺ my head. I really feared that you would say, ‘You have caused division among the Children of Israel, and did not observe my word.’”",
    "Moses then asked, “What did you think you were doing, O  Sâmiri?”",
    "He said, “I saw what they did not see, so I took a handful ˹of dust˺ from the hoof-prints of ˹the horse of˺ the messenger-angel ˹Gabriel˺ then cast it ˹on the moulded calf˺. This is what my lower-self tempted me into.”",
    "Moses said, “Go away then! And for ˹the rest of your˺ life you will surely be crying, ‘Do not touch ˹me˺!’ Then you will certainly have a fate that you cannot escape. Now look at your god to which you have been devoted: we will burn it up, then scatter it in the sea completely.”",
    "˹Then Moses addressed his people,˺ “Your only god is Allah, there is no god ˹worthy of worship˺ except Him. He encompasses everything in ˹His˺ knowledge.”",
    "This is how We relate to you ˹O Prophet˺ some of the stories of the past. And We have certainly granted you a Reminder from Us.",
    "Whoever turns away from it will surely bear the burden ˹of sin˺ on the Day of Judgment",
    "suffering its consequences forever. What an evil burden they will carry on Judgment Day!",
    "˹Beware of˺ the Day the Trumpet will be blown, and We will gather the wicked on that Day blue-faced ˹from horror and thirst˺.",
    "They will whisper among themselves, “You stayed no more than ten days ˹on the earth˺.”",
    "We know best what they will say—the most reasonable of them will say, “You stayed no more than a day.”",
    "And ˹if˺ they ask you ˹O Prophet˺ about the mountains, ˹then˺ say, “My Lord will wipe them out completely",
    "leaving the earth level and bare",
    "with neither depressions nor elevations to be seen.”",
    "On that Day all will follow the caller ˹for assembly˺, ˹and˺ none will dare to deviate. All voices will be hushed before the Most Compassionate. Only whispers will be heard.",
    "On that Day no intercession will be of any benefit, except by those granted permission by the Most Compassionate and whose words are agreeable to Him.",
    "He ˹fully˺ knows what is ahead of them and what is behind them, but they cannot encompass Him in ˹their˺ knowledge.",
    "And all faces will be humbled before the Ever-Living, All-Sustaining. And those burdened with wrongdoing will be in loss.",
    "But whoever does good and is a believer will have no fear of being wronged or denied ˹their reward˺.",
    "And so We have sent it down as an Arabic Quran and varied the warnings in it, so perhaps they will shun evil or it may cause them to be mindful.",
    "Exalted is Allah, the True King! Do not rush to recite ˹a revelation of˺ the Quran ˹O Prophet˺ before it is ˹properly˺ conveyed to you, and pray, “My Lord! Increase me in knowledge.”",
    "And indeed, We once made a covenant with Adam, but he forgot, and ˹so˺ We did not find determination in him.",
    "And ˹remember˺ when We said to the angels, “Prostrate before Adam,” so they all did—but not Iblîs, who refused ˹arrogantly˺.",
    "So We cautioned, “O Adam! This is surely an enemy to you and to your wife. So do not let him drive you both out of Paradise, for you ˹O Adam˺ would then suffer ˹hardship˺.",
    "Here it is guaranteed that you will never go hungry or unclothed",
    "nor will you ˹ever˺ suffer from thirst or ˹the sun’s˺ heat.”",
    "But Satan whispered to him, saying, “O Adam! Shall I show you the Tree of Immortality and a kingdom that does not fade away?”",
    "So they both ate from the tree and then their nakedness was exposed to them, prompting them to cover themselves with leaves from Paradise. So Adam disobeyed his Lord, and ˹so˺ lost his way.",
    "Then his Lord chose him ˹for His grace˺, accepted his repentance, and guided him ˹rightly˺.",
    "Allah said, “Descend, both of you, from here together ˹with Satan˺ as enemies to each other. Then when guidance comes to you from Me, whoever follows My guidance will neither go astray ˹in this life˺ nor suffer ˹in the next˺.",
    "But whoever turns away from My Reminder will certainly have a miserable life, then We will raise them up blind on the Day of Judgment.”",
    "They will cry, “My Lord! Why have you raised me up blind, although I used to see?”",
    "Allah will respond, “It is so, just as Our revelations came to you and you neglected them, so Today you are neglected.”",
    "This is how We reward whoever transgresses and does not believe in the revelations of their Lord. And the punishment of the Hereafter is far more severe and more lasting.",
    "Is it not yet clear to them how many peoples We destroyed before them, whose ruins they still pass by? Surely in this are signs for people of sound judgment.",
    "Had it not been for a prior decree from your Lord ˹O Prophet˺ and a term already set, their ˹instant˺ doom would have been inevitable.",
    "So be patient ˹O Prophet˺ with what they say. And glorify the praises of your Lord before sunrise and before sunset, and glorify Him in the hours of the night and at both ends of the day, so that you may be pleased ˹with the reward˺.",
    "Do not let your eyes crave what We have allowed some of the disbelievers to enjoy; the ˹fleeting˺ splendour of this worldly life, which We test them with. But your Lord’s provision ˹in the Hereafter˺ is far better and more lasting.",
    "Bid your people to pray, and be diligent in ˹observing˺ it. We do not ask you to provide. It is We Who provide for you. And the ultimate outcome is ˹only˺ for ˹the people of˺ righteousness.",
    "They demand, “If only he could bring us a sign from his Lord!” Have they not ˹already˺ received a confirmation of what is in earlier Scriptures?",
    "Had We destroyed them with a torment before this ˹Prophet came˺, they would have surely argued, “Our Lord! If only You had sent us a messenger, we would have followed Your revelations before being humiliated and put to shame.”",
    "Say ˹to them, O  Prophet˺, “Each ˹of us˺ is waiting, so keep waiting! You will soon know who is on the Straight Path and is ˹rightly˺ guided.”"
  ],
  "arabic1": [
    "طٰهٰ",
    "مَاۤ اَنْزَلْنَا عَلَیْكَ الْقُرْاٰنَ لِتَشْقٰۤی",
    "اِلَّا تَذْكِرَةً لِّمَنْ یَّخْشٰی",
    "تَنْزِیْلًا مِّمَّنْ خَلَقَ الْاَرْضَ وَالسَّمٰوٰتِ الْعُلٰی",
    "اَلرَّحْمٰنُ عَلَی الْعَرْشِ اسْتَوٰی",
    "لَهٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَمَا بَیْنَهُمَا وَمَا تَحْتَ الثَّرٰی",
    "وَاِنْ تَجْهَرْ بِالْقَوْلِ فَاِنَّهٗ یَعْلَمُ السِّرَّ وَاَخْفٰی",
    "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ لَهُ الْاَسْمَآءُ الْحُسْنٰی",
    "وَهَلْ اَتٰىكَ حَدِیْثُ مُوْسٰی",
    "اِذْ رَاٰ نَارًا فَقَالَ لِاَهْلِهِ امْكُثُوْۤا اِنِّیْۤ اٰنَسْتُ نَارًا لَّعَلِّیْۤ اٰتِیْكُمْ مِّنْهَا بِقَبَسٍ اَوْ اَجِدُ عَلَی النَّارِ هُدًی",
    "فَلَمَّاۤ اَتٰىهَا نُوْدِیَ یٰمُوْسٰی",
    "اِنِّیْۤ اَنَا رَبُّكَ فَاخْلَعْ نَعْلَیْكَ اِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًی",
    "وَاَنَا اخْتَرْتُكَ فَاسْتَمِعْ لِمَا یُوْحٰی",
    "اِنَّنِیْۤ اَنَا اللّٰهُ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدْنِیْ وَاَقِمِ الصَّلٰوةَ لِذِكْرِیْ",
    "اِنَّ السَّاعَةَ اٰتِیَةٌ اَكَادُ اُخْفِیْهَا لِتُجْزٰی كُلُّ نَفْسٍ بِمَا تَسْعٰی",
    "فَلَا یَصُدَّنَّكَ عَنْهَا مَنْ لَّا یُؤْمِنُ بِهَا وَاتَّبَعَ هَوٰىهُ فَتَرْدٰی",
    "وَمَا تِلْكَ بِیَمِیْنِكَ یٰمُوْسٰی",
    "قَالَ هِیَ عَصَایَ اَتَوَكَّؤُا عَلَیْهَا وَاَهُشُّ بِهَا عَلٰی غَنَمِیْ وَلِیَ فِیْهَا مَاٰرِبُ اُخْرٰی",
    "قَالَ اَلْقِهَا یٰمُوْسٰی",
    "فَاَلْقٰىهَا فَاِذَا هِیَ حَیَّةٌ تَسْعٰی",
    "قَالَ خُذْهَا وَلَا تَخَفْ ۫ سَنُعِیْدُهَا سِیْرَتَهَا الْاُوْلٰی",
    "وَاضْمُمْ یَدَكَ اِلٰی جَنَاحِكَ تَخْرُجْ بَیْضَآءَ مِنْ غَیْرِ سُوْٓءٍ اٰیَةً اُخْرٰی",
    "لِنُرِیَكَ مِنْ اٰیٰتِنَا الْكُبْرٰی",
    "اِذْهَبْ اِلٰی فِرْعَوْنَ اِنَّهٗ طَغٰی",
    "قَالَ رَبِّ اشْرَحْ لِیْ صَدْرِیْ",
    "وَیَسِّرْ لِیْۤ اَمْرِیْ",
    "وَاحْلُلْ عُقْدَةً مِّنْ لِّسَانِیْ",
    "یَفْقَهُوْا قَوْلِیْ",
    "وَاجْعَلْ لِّیْ وَزِیْرًا مِّنْ اَهْلِیْ",
    "هٰرُوْنَ اَخِی",
    "اشْدُدْ بِهٖۤ اَزْرِیْ",
    "وَاَشْرِكْهُ فِیْۤ اَمْرِیْ",
    "كَیْ نُسَبِّحَكَ كَثِیْرًا",
    "وَّنَذْكُرَكَ كَثِیْرًا",
    "اِنَّكَ كُنْتَ بِنَا بَصِیْرًا",
    "قَالَ قَدْ اُوْتِیْتَ سُؤْلَكَ یٰمُوْسٰی",
    "وَلَقَدْ مَنَنَّا عَلَیْكَ مَرَّةً اُخْرٰۤی",
    "اِذْ اَوْحَیْنَاۤ اِلٰۤی اُمِّكَ مَا یُوْحٰۤی",
    "اَنِ اقْذِفِیْهِ فِی التَّابُوْتِ فَاقْذِفِیْهِ فِی الْیَمِّ فَلْیُلْقِهِ الْیَمُّ بِالسَّاحِلِ یَاْخُذْهُ عَدُوٌّ لِّیْ وَعَدُوٌّ لَّهٗ وَاَلْقَیْتُ عَلَیْكَ مَحَبَّةً مِّنِّیْ وَلِتُصْنَعَ عَلٰی عَیْنِیْ",
    "اِذْ تَمْشِیْۤ اُخْتُكَ فَتَقُوْلُ هَلْ اَدُلُّكُمْ عَلٰی مَنْ یَّكْفُلُهٗ فَرَجَعْنٰكَ اِلٰۤی اُمِّكَ كَیْ تَقَرَّ عَیْنُهَا وَلَا تَحْزَنَ وَقَتَلْتَ نَفْسًا فَنَجَّیْنٰكَ مِنَ الْغَمِّ وَفَتَنّٰكَ فُتُوْنًا ۫ فَلَبِثْتَ سِنِیْنَ فِیْۤ اَهْلِ مَدْیَنَ ثُمَّ جِئْتَ عَلٰی قَدَرٍ یّٰمُوْسٰی",
    "وَاصْطَنَعْتُكَ لِنَفْسِیْ",
    "اِذْهَبْ اَنْتَ وَاَخُوْكَ بِاٰیٰتِیْ وَلَا تَنِیَا فِیْ ذِكْرِیْ",
    "اِذْهَبَاۤ اِلٰی فِرْعَوْنَ اِنَّهٗ طَغٰی ۖ",
    "فَقُوْلَا لَهٗ قَوْلًا لَّیِّنًا لَّعَلَّهٗ یَتَذَكَّرُ اَوْ یَخْشٰی",
    "قَالَا رَبَّنَاۤ اِنَّنَا نَخَافُ اَنْ یَّفْرُطَ عَلَیْنَاۤ اَوْ اَنْ یَّطْغٰی",
    "قَالَ لَا تَخَافَاۤ اِنَّنِیْ مَعَكُمَاۤ اَسْمَعُ وَاَرٰی",
    "فَاْتِیٰهُ فَقُوْلَاۤ اِنَّا رَسُوْلَا رَبِّكَ فَاَرْسِلْ مَعَنَا بَنِیْۤ اِسْرَآءِیْلَ وَلَا تُعَذِّبْهُمْ قَدْ جِئْنٰكَ بِاٰیَةٍ مِّنْ رَّبِّكَ وَالسَّلٰمُ عَلٰی مَنِ اتَّبَعَ الْهُدٰی",
    "اِنَّا قَدْ اُوْحِیَ اِلَیْنَاۤ اَنَّ الْعَذَابَ عَلٰی مَنْ كَذَّبَ وَتَوَلّٰی",
    "قَالَ فَمَنْ رَّبُّكُمَا یٰمُوْسٰی",
    "قَالَ رَبُّنَا الَّذِیْۤ اَعْطٰی كُلَّ شَیْءٍ خَلْقَهٗ ثُمَّ هَدٰی",
    "قَالَ فَمَا بَالُ الْقُرُوْنِ الْاُوْلٰی",
    "قَالَ عِلْمُهَا عِنْدَ رَبِّیْ فِیْ كِتٰبٍ لَا یَضِلُّ رَبِّیْ وَلَا یَنْسَی",
    "الَّذِیْ جَعَلَ لَكُمُ الْاَرْضَ مَهْدًا وَّسَلَكَ لَكُمْ فِیْهَا سُبُلًا وَّاَنْزَلَ مِنَ السَّمَآءِ مَآءً فَاَخْرَجْنَا بِهٖۤ اَزْوَاجًا مِّنْ نَّبَاتٍ شَتّٰی",
    "كُلُوْا وَارْعَوْا اَنْعَامَكُمْ اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّاُولِی النُّهٰی",
    "مِنْهَا خَلَقْنٰكُمْ وَفِیْهَا نُعِیْدُكُمْ وَمِنْهَا نُخْرِجُكُمْ تَارَةً اُخْرٰی",
    "وَلَقَدْ اَرَیْنٰهُ اٰیٰتِنَا كُلَّهَا فَكَذَّبَ وَاَبٰی",
    "قَالَ اَجِئْتَنَا لِتُخْرِجَنَا مِنْ اَرْضِنَا بِسِحْرِكَ یٰمُوْسٰی",
    "فَلَنَاْتِیَنَّكَ بِسِحْرٍ مِّثْلِهٖ فَاجْعَلْ بَیْنَنَا وَبَیْنَكَ مَوْعِدًا لَّا نُخْلِفُهٗ نَحْنُ وَلَاۤ اَنْتَ مَكَانًا سُوًی",
    "قَالَ مَوْعِدُكُمْ یَوْمُ الزِّیْنَةِ وَاَنْ یُّحْشَرَ النَّاسُ ضُحًی",
    "فَتَوَلّٰی فِرْعَوْنُ فَجَمَعَ كَیْدَهٗ ثُمَّ اَتٰی",
    "قَالَ لَهُمْ مُّوْسٰی وَیْلَكُمْ لَا تَفْتَرُوْا عَلَی اللّٰهِ كَذِبًا فَیُسْحِتَكُمْ بِعَذَابٍ وَقَدْ خَابَ مَنِ افْتَرٰی",
    "فَتَنَازَعُوْۤا اَمْرَهُمْ بَیْنَهُمْ وَاَسَرُّوا النَّجْوٰی",
    "قَالُوْۤا اِنْ هٰذٰنِ لَسٰحِرٰنِ یُرِیْدٰنِ اَنْ یُّخْرِجٰكُمْ مِّنْ اَرْضِكُمْ بِسِحْرِهِمَا وَیَذْهَبَا بِطَرِیْقَتِكُمُ الْمُثْلٰی",
    "فَاَجْمِعُوْا كَیْدَكُمْ ثُمَّ ائْتُوْا صَفًّا وَقَدْ اَفْلَحَ الْیَوْمَ مَنِ اسْتَعْلٰی",
    "قَالُوْا یٰمُوْسٰۤی اِمَّاۤ اَنْ تُلْقِیَ وَاِمَّاۤ اَنْ نَّكُوْنَ اَوَّلَ مَنْ اَلْقٰی",
    "قَالَ بَلْ اَلْقُوْا فَاِذَا حِبَالُهُمْ وَعِصِیُّهُمْ یُخَیَّلُ اِلَیْهِ مِنْ سِحْرِهِمْ اَنَّهَا تَسْعٰی",
    "فَاَوْجَسَ فِیْ نَفْسِهٖ خِیْفَةً مُّوْسٰی",
    "قُلْنَا لَا تَخَفْ اِنَّكَ اَنْتَ الْاَعْلٰی",
    "وَاَلْقِ مَا فِیْ یَمِیْنِكَ تَلْقَفْ مَا صَنَعُوْا اِنَّمَا صَنَعُوْا كَیْدُ سٰحِرٍ وَلَا یُفْلِحُ السَّاحِرُ حَیْثُ اَتٰی",
    "فَاُلْقِیَ السَّحَرَةُ سُجَّدًا قَالُوْۤا اٰمَنَّا بِرَبِّ هٰرُوْنَ وَمُوْسٰی",
    "قَالَ اٰمَنْتُمْ لَهٗ قَبْلَ اَنْ اٰذَنَ لَكُمْ اِنَّهٗ لَكَبِیْرُكُمُ الَّذِیْ عَلَّمَكُمُ السِّحْرَ فَلَاُقَطِّعَنَّ اَیْدِیَكُمْ وَاَرْجُلَكُمْ مِّنْ خِلَافٍ وَّلَاُوصَلِّبَنَّكُمْ فِیْ جُذُوْعِ النَّخْلِ وَلَتَعْلَمُنَّ اَیُّنَاۤ اَشَدُّ عَذَابًا وَّاَبْقٰی",
    "قَالُوْا لَنْ نُّؤْثِرَكَ عَلٰی مَا جَآءَنَا مِنَ الْبَیِّنٰتِ وَالَّذِیْ فَطَرَنَا فَاقْضِ مَاۤ اَنْتَ قَاضٍ اِنَّمَا تَقْضِیْ هٰذِهِ الْحَیٰوةَ الدُّنْیَا",
    "اِنَّاۤ اٰمَنَّا بِرَبِّنَا لِیَغْفِرَ لَنَا خَطٰیٰنَا وَمَاۤ اَكْرَهْتَنَا عَلَیْهِ مِنَ السِّحْرِ وَاللّٰهُ خَیْرٌ وَّاَبْقٰی",
    "اِنَّهٗ مَنْ یَّاْتِ رَبَّهٗ مُجْرِمًا فَاِنَّ لَهٗ جَهَنَّمَ لَا یَمُوْتُ فِیْهَا وَلَا یَحْیٰی",
    "وَمَنْ یَّاْتِهٖ مُؤْمِنًا قَدْ عَمِلَ الصّٰلِحٰتِ فَاُولٰٓىِٕكَ لَهُمُ الدَّرَجٰتُ الْعُلٰی",
    "جَنّٰتُ عَدْنٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِیْنَ فِیْهَا وَذٰلِكَ جَزٰٓؤُا مَنْ تَزَكّٰی",
    "وَلَقَدْ اَوْحَیْنَاۤ اِلٰی مُوْسٰۤی اَنْ اَسْرِ بِعِبَادِیْ فَاضْرِبْ لَهُمْ طَرِیْقًا فِی الْبَحْرِ یَبَسًا لَّا تَخٰفُ دَرَكًا وَّلَا تَخْشٰی",
    "فَاَتْبَعَهُمْ فِرْعَوْنُ بِجُنُوْدِهٖ فَغَشِیَهُمْ مِّنَ الْیَمِّ مَا غَشِیَهُمْ",
    "وَاَضَلَّ فِرْعَوْنُ قَوْمَهٗ وَمَا هَدٰی",
    "یٰبَنِیْۤ اِسْرَآءِیْلَ قَدْ اَنْجَیْنٰكُمْ مِّنْ عَدُوِّكُمْ وَوٰعَدْنٰكُمْ جَانِبَ الطُّوْرِ الْاَیْمَنَ وَنَزَّلْنَا عَلَیْكُمُ الْمَنَّ وَالسَّلْوٰی",
    "كُلُوْا مِنْ طَیِّبٰتِ مَا رَزَقْنٰكُمْ وَلَا تَطْغَوْا فِیْهِ فَیَحِلَّ عَلَیْكُمْ غَضَبِیْ وَمَنْ یَّحْلِلْ عَلَیْهِ غَضَبِیْ فَقَدْ هَوٰی",
    "وَاِنِّیْ لَغَفَّارٌ لِّمَنْ تَابَ وَاٰمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدٰی",
    "وَمَاۤ اَعْجَلَكَ عَنْ قَوْمِكَ یٰمُوْسٰی",
    "قَالَ هُمْ اُولَآءِ عَلٰۤی اَثَرِیْ وَعَجِلْتُ اِلَیْكَ رَبِّ لِتَرْضٰی",
    "قَالَ فَاِنَّا قَدْ فَتَنَّا قَوْمَكَ مِنْ بَعْدِكَ وَاَضَلَّهُمُ السَّامِرِیُّ",
    "فَرَجَعَ مُوْسٰۤی اِلٰی قَوْمِهٖ غَضْبَانَ اَسِفًا قَالَ یٰقَوْمِ اَلَمْ یَعِدْكُمْ رَبُّكُمْ وَعْدًا حَسَنًا اَفَطَالَ عَلَیْكُمُ الْعَهْدُ اَمْ اَرَدْتُّمْ اَنْ یَّحِلَّ عَلَیْكُمْ غَضَبٌ مِّنْ رَّبِّكُمْ فَاَخْلَفْتُمْ مَّوْعِدِیْ",
    "قَالُوْا مَاۤ اَخْلَفْنَا مَوْعِدَكَ بِمَلْكِنَا وَلٰكِنَّا حُمِّلْنَاۤ اَوْزَارًا مِّنْ زِیْنَةِ الْقَوْمِ فَقَذَفْنٰهَا فَكَذٰلِكَ اَلْقَی السَّامِرِیُّ",
    "فَاَخْرَجَ لَهُمْ عِجْلًا جَسَدًا لَّهٗ خُوَارٌ فَقَالُوْا هٰذَاۤ اِلٰهُكُمْ وَاِلٰهُ مُوْسٰی فَنَسِیَ",
    "اَفَلَا یَرَوْنَ اَلَّا یَرْجِعُ اِلَیْهِمْ قَوْلًا وَّلَا یَمْلِكُ لَهُمْ ضَرًّا وَّلَا نَفْعًا",
    "وَلَقَدْ قَالَ لَهُمْ هٰرُوْنُ مِنْ قَبْلُ یٰقَوْمِ اِنَّمَا فُتِنْتُمْ بِهٖ وَاِنَّ رَبَّكُمُ الرَّحْمٰنُ فَاتَّبِعُوْنِیْ وَاَطِیْعُوْۤا اَمْرِیْ",
    "قَالُوْا لَنْ نَّبْرَحَ عَلَیْهِ عٰكِفِیْنَ حَتّٰی یَرْجِعَ اِلَیْنَا مُوْسٰی",
    "قَالَ یٰهٰرُوْنُ مَا مَنَعَكَ اِذْ رَاَیْتَهُمْ ضَلُّوْۤا",
    "اَلَّا تَتَّبِعَنِ اَفَعَصَیْتَ اَمْرِیْ",
    "قَالَ یَبْنَؤُمَّ لَا تَاْخُذْ بِلِحْیَتِیْ وَلَا بِرَاْسِیْ اِنِّیْ خَشِیْتُ اَنْ تَقُوْلَ فَرَّقْتَ بَیْنَ بَنِیْۤ اِسْرَآءِیْلَ وَلَمْ تَرْقُبْ قَوْلِیْ",
    "قَالَ فَمَا خَطْبُكَ یٰسَامِرِیُّ",
    "قَالَ بَصُرْتُ بِمَا لَمْ یَبْصُرُوْا بِهٖ فَقَبَضْتُ قَبْضَةً مِّنْ اَثَرِ الرَّسُوْلِ فَنَبَذْتُهَا وَكَذٰلِكَ سَوَّلَتْ لِیْ نَفْسِیْ",
    "قَالَ فَاذْهَبْ فَاِنَّ لَكَ فِی الْحَیٰوةِ اَنْ تَقُوْلَ لَا مِسَاسَ وَاِنَّ لَكَ مَوْعِدًا لَّنْ تُخْلَفَهٗ وَانْظُرْ اِلٰۤی اِلٰهِكَ الَّذِیْ ظَلْتَ عَلَیْهِ عَاكِفًا لَنُحَرِّقَنَّهٗ ثُمَّ لَنَنْسِفَنَّهٗ فِی الْیَمِّ نَسْفًا",
    "اِنَّمَاۤ اِلٰهُكُمُ اللّٰهُ الَّذِیْ لَاۤ اِلٰهَ اِلَّا هُوَ وَسِعَ كُلَّ شَیْءٍ عِلْمًا",
    "كَذٰلِكَ نَقُصُّ عَلَیْكَ مِنْ اَنْۢبَآءِ مَا قَدْ سَبَقَ وَقَدْ اٰتَیْنٰكَ مِنْ لَّدُنَّا ذِكْرًا",
    "مَنْ اَعْرَضَ عَنْهُ فَاِنَّهٗ یَحْمِلُ یَوْمَ الْقِیٰمَةِ وِزْرًا",
    "خٰلِدِیْنَ فِیْهِ وَسَآءَ لَهُمْ یَوْمَ الْقِیٰمَةِ حِمْلًا",
    "یَّوْمَ یُنْفَخُ فِی الصُّوْرِ وَنَحْشُرُ الْمُجْرِمِیْنَ یَوْمَىِٕذٍ زُرْقًا",
    "یَّتَخَافَتُوْنَ بَیْنَهُمْ اِنْ لَّبِثْتُمْ اِلَّا عَشْرًا",
    "نَحْنُ اَعْلَمُ بِمَا یَقُوْلُوْنَ اِذْ یَقُوْلُ اَمْثَلُهُمْ طَرِیْقَةً اِنْ لَّبِثْتُمْ اِلَّا یَوْمًا",
    "وَیَسْـَٔلُوْنَكَ عَنِ الْجِبَالِ فَقُلْ یَنْسِفُهَا رَبِّیْ نَسْفًا",
    "فَیَذَرُهَا قَاعًا صَفْصَفًا",
    "لَّا تَرٰی فِیْهَا عِوَجًا وَّلَاۤ اَمْتًا",
    "یَوْمَىِٕذٍ یَّتَّبِعُوْنَ الدَّاعِیَ لَا عِوَجَ لَهٗ وَخَشَعَتِ الْاَصْوَاتُ لِلرَّحْمٰنِ فَلَا تَسْمَعُ اِلَّا هَمْسًا",
    "یَوْمَىِٕذٍ لَّا تَنْفَعُ الشَّفَاعَةُ اِلَّا مَنْ اَذِنَ لَهُ الرَّحْمٰنُ وَرَضِیَ لَهٗ قَوْلًا",
    "یَعْلَمُ مَا بَیْنَ اَیْدِیْهِمْ وَمَا خَلْفَهُمْ وَلَا یُحِیْطُوْنَ بِهٖ عِلْمًا",
    "وَعَنَتِ الْوُجُوْهُ لِلْحَیِّ الْقَیُّوْمِ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْمًا",
    "وَمَنْ یَّعْمَلْ مِنَ الصّٰلِحٰتِ وَهُوَ مُؤْمِنٌ فَلَا یَخٰفُ ظُلْمًا وَّلَا هَضْمًا",
    "وَكَذٰلِكَ اَنْزَلْنٰهُ قُرْاٰنًا عَرَبِیًّا وَّصَرَّفْنَا فِیْهِ مِنَ الْوَعِیْدِ لَعَلَّهُمْ یَتَّقُوْنَ اَوْ یُحْدِثُ لَهُمْ ذِكْرًا",
    "فَتَعٰلَی اللّٰهُ الْمَلِكُ الْحَقُّ وَلَا تَعْجَلْ بِالْقُرْاٰنِ مِنْ قَبْلِ اَنْ یُّقْضٰۤی اِلَیْكَ وَحْیُهٗ وَقُلْ رَّبِّ زِدْنِیْ عِلْمًا",
    "وَلَقَدْ عَهِدْنَاۤ اِلٰۤی اٰدَمَ مِنْ قَبْلُ فَنَسِیَ وَلَمْ نَجِدْ لَهٗ عَزْمًا",
    "وَاِذْ قُلْنَا لِلْمَلٰٓىِٕكَةِ اسْجُدُوْا لِاٰدَمَ فَسَجَدُوْۤا اِلَّاۤ اِبْلِیْسَ اَبٰی",
    "فَقُلْنَا یٰۤاٰدَمُ اِنَّ هٰذَا عَدُوٌّ لَّكَ وَلِزَوْجِكَ فَلَا یُخْرِجَنَّكُمَا مِنَ الْجَنَّةِ فَتَشْقٰی",
    "اِنَّ لَكَ اَلَّا تَجُوْعَ فِیْهَا وَلَا تَعْرٰی",
    "وَاَنَّكَ لَا تَظْمَؤُا فِیْهَا وَلَا تَضْحٰی",
    "فَوَسْوَسَ اِلَیْهِ الشَّیْطٰنُ قَالَ یٰۤاٰدَمُ هَلْ اَدُلُّكَ عَلٰی شَجَرَةِ الْخُلْدِ وَمُلْكٍ لَّا یَبْلٰی",
    "فَاَكَلَا مِنْهَا فَبَدَتْ لَهُمَا سَوْاٰتُهُمَا وَطَفِقَا یَخْصِفٰنِ عَلَیْهِمَا مِنْ وَّرَقِ الْجَنَّةِ وَعَصٰۤی اٰدَمُ رَبَّهٗ فَغَوٰی ۖ",
    "ثُمَّ اجْتَبٰهُ رَبُّهٗ فَتَابَ عَلَیْهِ وَهَدٰی",
    "قَالَ اهْبِطَا مِنْهَا جَمِیْعًا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ فَاِمَّا یَاْتِیَنَّكُمْ مِّنِّیْ هُدًی فَمَنِ اتَّبَعَ هُدَایَ فَلَا یَضِلُّ وَلَا یَشْقٰی",
    "وَمَنْ اَعْرَضَ عَنْ ذِكْرِیْ فَاِنَّ لَهٗ مَعِیْشَةً ضَنْكًا وَّنَحْشُرُهٗ یَوْمَ الْقِیٰمَةِ اَعْمٰی",
    "قَالَ رَبِّ لِمَ حَشَرْتَنِیْۤ اَعْمٰی وَقَدْ كُنْتُ بَصِیْرًا",
    "قَالَ كَذٰلِكَ اَتَتْكَ اٰیٰتُنَا فَنَسِیْتَهَا وَكَذٰلِكَ الْیَوْمَ تُنْسٰی",
    "وَكَذٰلِكَ نَجْزِیْ مَنْ اَسْرَفَ وَلَمْ یُؤْمِنْ بِاٰیٰتِ رَبِّهٖ وَلَعَذَابُ الْاٰخِرَةِ اَشَدُّ وَاَبْقٰی",
    "اَفَلَمْ یَهْدِ لَهُمْ كَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنَ الْقُرُوْنِ یَمْشُوْنَ فِیْ مَسٰكِنِهِمْ اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّاُولِی النُّهٰی",
    "وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ لَكَانَ لِزَامًا وَّاَجَلٌ مُّسَمًّی",
    "فَاصْبِرْ عَلٰی مَا یَقُوْلُوْنَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوْعِ الشَّمْسِ وَقَبْلَ غُرُوْبِهَا وَمِنْ اٰنَآئِ الَّیْلِ فَسَبِّحْ وَاَطْرَافَ النَّهَارِ لَعَلَّكَ تَرْضٰی",
    "وَلَا تَمُدَّنَّ عَیْنَیْكَ اِلٰی مَا مَتَّعْنَا بِهٖۤ اَزْوَاجًا مِّنْهُمْ زَهْرَةَ الْحَیٰوةِ الدُّنْیَا لِنَفْتِنَهُمْ فِیْهِ وَرِزْقُ رَبِّكَ خَیْرٌ وَّاَبْقٰی",
    "وَاْمُرْ اَهْلَكَ بِالصَّلٰوةِ وَاصْطَبِرْ عَلَیْهَا لَا نَسْـَٔلُكَ رِزْقًا نَحْنُ نَرْزُقُكَ وَالْعَاقِبَةُ لِلتَّقْوٰی",
    "وَقَالُوْا لَوْلَا یَاْتِیْنَا بِاٰیَةٍ مِّنْ رَّبِّهٖ اَوَلَمْ تَاْتِهِمْ بَیِّنَةُ مَا فِی الصُّحُفِ الْاُوْلٰی",
    "وَلَوْ اَنَّاۤ اَهْلَكْنٰهُمْ بِعَذَابٍ مِّنْ قَبْلِهٖ لَقَالُوْا رَبَّنَا لَوْلَاۤ اَرْسَلْتَ اِلَیْنَا رَسُوْلًا فَنَتَّبِعَ اٰیٰتِكَ مِنْ قَبْلِ اَنْ نَّذِلَّ وَنَخْزٰی",
    "قُلْ كُلٌّ مُّتَرَبِّصٌ فَتَرَبَّصُوْا فَسَتَعْلَمُوْنَ مَنْ اَصْحٰبُ الصِّرَاطِ السَّوِیِّ وَمَنِ اهْتَدٰی"
  ],
  "bengali": [
    "ত্ব-হা",
    "আমি তোমার প্রতি আল-কুরআন এজন্য নাযিল করিনি যে, তুমি দুর্ভোগ পোহাবে",
    "বরং যে ভয় করে তার জন্য উপদেশ স্বরূপ।",
    "যিনি যমীন ও সুউচ্চ আসমানসমূহ সৃষ্টি করেছেন তাঁর নিকট থেকে অবতীর্ণ।",
    "পরম করুণাময় আরশের ওপর উঠেছেন* । \n* এ আয়াতে আল্লাহর একটি ক্রিয়াবাচক গুণ সাব্যস্ত করা হয়েছে। সেটি হচ্ছে استواء বা আরশের উপর উঠা। ইমাম মালেককে এ গুণ সম্পর্কে জিজ্ঞাসা করা হলে তিনি বলেন, استواء এর অর্থ জানা আছে। তবে তার ধরন (كيفيت) জানা নেই। এর প্রতি ঈমান রাখা ওয়াজিব এবং ধরন সম্পর্কে জিজ্ঞাসা করা বিদআত। এ নীতিটি আল্লাহর সকল গুণের ক্ষেত্রে প্রযোজ্য।",
    "যা আছে আসমানসমূহ, যমীন ও এ দু’য়ের মধ্যবর্তী স্থানে এবং যা আছে মাটির নিচে সব তাঁরই।",
    "আর যদি তুমি উচ্চস্বরে কথা বল তবে তিনি গোপন ও অতি গোপন বিষয় জানেন।",
    "আল্লাহ, তিনি ছাড়া কোন (সত্য) ইলাহ নেই; সুন্দর নামসমূহ তাঁরই।",
    "আর তোমার কাছে কি মূসার কথা পৌঁছেছে?",
    "যখন সে আগুন দেখল, তখন নিজ পরিবারকে বলল, ‘তোমরা অপেক্ষা কর, আমি আগুন দেখতে পেয়েছি, আশা করি আমি তোমাদের জন্য তা থেকে কিছু জ্বলন্ত আঙ্গার নিয়ে আসতে পারব অথবা আগুনের নিকট পথনির্দেশ পাব।’",
    "যখন সে আগুনের কাছে আসল তখন তাকে আহবান করা হল, ‘হে মূসা’",
    "নিশ্চয় আমি তোমার রব; সুতরাং তোমার জুতা জোড়া খুলে ফেল, নিশ্চয় তুমি পবিত্র ‘তুওয়া’ উপত্যকায় রয়েছ’।",
    "‘আর আমি তোমাকে মনোনীত করেছি, সুতরাং যা ওহীরূপে পাঠানো হচ্ছে তা মনোযোগ দিয়ে শুন’।",
    "‘নিশ্চয় আমি আল্লাহ, আমি ছাড়া কোন (সত্য) ইলাহ নেই; সুতরাং আমার ইবাদাত কর এবং আমার স্মরণার্থে সালাত কায়েম কর’।",
    "‘নিশ্চয় কিয়ামত আসবে; আমি তা গোপন রাখতে চাই যাতে প্রত্যেককে স্বীয় চেষ্টা-সাধনা অনুযায়ী প্রতিদান দেয়া যায়’।",
    "অতএব যে ব্যক্তি তার প্রতি ঈমান রাখে না এবং স্বীয় প্রবৃত্তির অনুসরণ করে সে যেন কিছুতেই তাতে ঈমান আনয়নে তোমাকে বাধা দিতে না পারে; অন্যথায় তুমি ধ্বংস হয়ে যাবে।",
    "আর ‘হে মূসা, তোমার ডান হাতে ওটা কি’?",
    "সে বলল, ‘এটি আমার লাঠি; আমি এর ওপর ভর করি, এটি দিয়ে আমি আমার মেষপালের জন্য গাছের পাতা পাড়ি এবং এটি আমার আরো অনেক কাজে লাগে।’",
    "তিনি বললেন, ‘হে মূসা! ওটা ফেলে দাও।’",
    "অতঃপর সে তা ফেলে দিল; অমনি তা সাপ হয়ে ছুটতে লাগল।",
    "তিনি বললেন, ‘ওটা ধর এবং ভয় করো না, আমি ওকে ওর পূর্বের অবস্থায় ফিরিয়ে দেব’।",
    "‘আর তোমার হাত তোমার বগলের সাথে মিলাও, তাহলে তা উজ্জ্বল হয়ে বেরিয়ে আসবে কোনরূপ ত্রুটি ছাড়া; আরেকটি নিদর্শনরূপে’।",
    "এটা এজন্য যে, আমি তোমাকে আমার বড় বড় নিদর্শনসমূহের কিছু দেখাব।",
    "‘ফির‘আউনের কাছে যাও; নিশ্চয় সে সীমালঙ্ঘন করেছে’।",
    "সে বলল, ‘হে আমার রব, আমার বুক প্রশস্ত করে দিন’",
    "‘এবং আমার কাজ সহজ করে দিন,",
    "‘আর আমার জিহবার জড়তা দূর করে দিন-",
    "যাতে তারা আমার কথা বুঝতে পারে’।",
    "‘আর আমার পরিবার থেকে আমার জন্য একজন সাহায্যকারী নির্ধারণ করে দিন।",
    "আমার ভাই হারূনকে’",
    "‘তার দ্বারা আমার শক্তি সুদৃঢ় করুন",
    "এবং তাকে আমার কাজে শরীক করুন’।",
    "‘যাতে আমরা বেশী করে আপনার তাসবীহ পাঠ করতে পারি’,",
    "এবং অধিক পরিমাণে আপনাকে স্মরণ করতে পারি।",
    "‘আপনিই তো আমাদের সম্যক দ্রষ্টা’।",
    "তিনি বললেন, ‘হে মূসা, তুমি যা চেয়েছ তা তোমাকে দেয়া হল’।",
    "‘আর আমি আরো একবার তোমার প্রতি অনুগ্রহ করেছিলাম’।",
    "‘যখন আমি তোমার মাতাকে জানিয়ে দিয়েছিলাম যা জানাবার ছিল,",
    "‘যে, তুমি তাঁকে সিন্ধুকের মধ্যে রেখে দাও। তারপর তা দরিয়ায় ভাসিয়ে দাও। যেন দরিয়া তাকে তীরে ঠেলে দেয়। ফলে তাকে আমার শত্রু ও তার শত্রু নিয়ে নেবে। আর আমি আমার পক্ষ থেকে তোমার প্রতি ভালবাসা ঢেলে দিয়েছিলাম, যাতে তুমি আমার চোখের সামনে প্রতিপালিত হও’।",
    "যখন তোমার বোন (সিন্দুকের সাথে সাথে) চলছিল। অতঃপর সে গিয়ে বলল, ‘আমি কি তোমাদেরকে এমন একজনের সন্ধান দেব, যে এর দায়িত্বভার নিতে পারবে’? অতঃপর আমি তোমাকে তোমার মায়ের নিকট ফিরিয়ে দিলাম; যাতে তার চোখ জুড়ায় এবং সে দুঃখ না পায়। আর তুমি এক ব্যক্তিকে হত্যা করেছিলে। তখন আমি তোমাকে মানোবেদনা থেকে মুক্তি দিলাম এবং তোমাকে আমি বিভিন্নভাবে পরীক্ষা করেছি। অতঃপর তুমি কয়েক বছর মাদইয়ানবাসীদের মধ্যে অবস্থান করেছ। হে মূসা, তারপর নির্ধারিত সময়ে তুমি এসে উপস্থিত হলে’।",
    "এবং আমি তোমাকে আমার নিজের জন্য মনোনীত করেছি।",
    "তুমি ও তোমার ভাই আমার আয়াতসমূহ নিয়ে যাও এবং আমাকে স্মরণ করার ক্ষেত্রে কোনরূপ অলসতা করো না।",
    "তোমরা দু’জন ফির‘আউনের নিকট যাও, কেননা সে তো সীমালংঘন করেছে।",
    "তোমরা তার সাথে নরম কথা বলবে। হয়তোবা সে উপদেশ গ্রহণ করবে অথবা ভয় করবে।",
    "তারা বলল, ‘হে আমাদের রব, আমরা তো আশংকা করছি যে, সে আমাদের উপর বাড়াবাড়ি করবে অথবা সীমালঙ্ঘন করবে’।",
    "তিনি বললেন, ‘তোমরা ভয় করো না। আমি তো তোমাদের সাথেই আছি। আমি সবকিছু শুনি ও দেখি’।",
    "সুতরাং তোমরা দু’জন তার কাছে যাও অতঃপর বল, ‘আমরা তোমার রবের দু’জন রাসূল। সুতরাং তুমি বনী ইসরাঈলকে আমাদের সাথে যেতে দাও এবং তাদেরকে নির্যাতন করো না। আমরা তোমার কাছে এসেছি তোমার রবের আয়াত নিয়ে। আর যারা সৎ পথ অনুসরণ করে, তাদের প্রতি শান্তি’।",
    "নিশ্চয় আমাদের নিকট ওহী প্রেরণ করা হয়েছে যে, আযাবতো তার জন্য, যে মিথ্যা আরোপ করে এবং মুখ ফিরিয়ে নেয়।",
    "ফির‘আউন বলল, ‘হে মূসা, তাহলে কে তোমাদের রব’?",
    "মূসা বলল, ‘আমাদের রব তিনি, যিনি সকল বস্তুকে তার আকৃতি দান করেছেন, অতঃপর সঠিক পথ নির্দেশ করেছেন’।",
    "ফির‘আউন বলল, ‘তাহলে অতীত যুগের লোকদের অবস্থা কী’?",
    "মূসা বলল, ‘এর জ্ঞান আমার রবের নিকট কিতাবে আছে। আমার রব বিভ্রান্ত হন না এবং ভুলেও যান না’।",
    "‘যিনি তোমাদের জন্য যমীনকে বিছানা বানিয়েছেন এবং তাতে তোমাদের জন্য চলার পথ করে দিয়েছেন। আর আসমান থেকে তিনি পানি বর্ষণ করেন’; অতঃপর তা দিয়ে আমি বিভিন্ন প্রকারের উদ্ভিদ উৎপন্ন করি।",
    "তোমরা নিজেরা খাও এবং তোমাদের গবাদি পশু চরাও। অবশ্যই এতে বিবেকসম্পন্ন লোকদের জন্য নিদর্শন রয়েছে।",
    "মাটি থেকেই আমি তোমাদেরকে সৃষ্টি করেছি, মাটিতেই আমি তোমাদেরকে ফিরিয়ে নেব এবং মাটি থেকেই তোমাদেরকে পুনরায় বের করে আনব।",
    "আমি তাকে আমার সকল নিদর্শন দেখিয়েছিলাম, কিন্তু সে মিথ্যা আরোপ করেছে এবং অমান্য করেছে।",
    "সে বলল, ‘হে মূসা, তুমি কি আমাদের কাছে এজন্য এসেছ যে, তোমার যাদুর দ্বারা আমাদেরকে আমাদের দেশ থেকে বের করে দেবে’?",
    "‘তাহলে আমরা অবশ্যই তোমার নিকট অনুরূপ যাদু নিয়ে আসব। সুতরাং একটা মধ্যবর্তী স্থানে আমাদের ও তোমার মিলিত হওয়ার জন্য একটি সময় নির্ধারণ কর, যা আমরাও লঙ্ঘন করব না, তুমিও করবে না’।",
    "মূসা বলল, ‘তোমাদের নির্ধারিত সময় হল উৎসবের দিন। আর সেদিন পূর্বাহ্নেই যেন লোকজনকে সমবেত করা হয়’।",
    "অতঃপর ফির‘আউন উঠে গেল। তারপর সে তার কৌশল একত্র করল, তারপর সে আসল।",
    "মূসা তাদেরকে বলল, ‘তোমাদের দুর্ভাগ্য! তোমরা আল্লাহর প্রতি মিথ্যা আরোপ করো না। করলে তিনি আযাব দ্বারা তোমাদেরকে সমূলে ধ্বংস করে দেবেন। আর যে ব্যক্তি মিথ্যা আরোপ করে, সে-ই ব্যর্থ হয়।",
    "তখন তারা নিজদের মধ্যে তাদের কর্ম সম্বন্ধে বাক-বিতন্ডা করল এবং তারা গোপনে পরামর্শ করল।",
    "তারা বলল, ‘এ দু’জন অবশ্যই যাদুকর। তারা চায় তাদের যাদুর মাধ্যমে তোমাদেরকে তোমাদের দেশ থেকে বের করে দিতে এবং তোমাদের উৎকৃষ্ট জীবন পদ্ধতি ধ্বংস করে দিতে’।",
    "‘কাজেই তোমরা তোমাদের কলা-কৌশল জমা কর। তারপর তোমরা সবাই সারিবদ্ধভাবে আস। আর আজ যে বিজয়ী হবে, সে-ই সফল হবে’।",
    "তারা বলল, হে মূসা, হয় তুমি নিক্ষেপ কর, না হয় আমরাই প্রথমে নিক্ষেপ করি।",
    "মূসা বলল, ‘বরং তোমরাই নিক্ষেপ কর। অতঃপর তাদের যাদুর প্রভাবে মূসার কাছে মনে হল যেন তাদের রশি ও লাঠিগুলো ছুটোছুটি করছে।",
    "তখন মূসা তার অন্তরে কিছুটা ভীতি অনুভব করল।",
    "আমি বললাম, ‘তুমি ভয় পেয়ো না, নিশ্চয় তুমিই বিজয়ী হবে’।",
    "‘আর তোমার ডান হাতে যা আছে, তা ফেলে দাও। তারা যা করেছে, এটা সেগুলো গ্রাস করে ফেলবে। তারা যা করেছে, তাতো কেবল যাদুকরের কৌশল। আর যাদুকর যেখানেই আসুক না কেন, সে সফল হবে না’।",
    "অতঃপর যাদুকরেরা সিজদায় লুটিয়ে পড়ল। তারা বলল, ‘আমরা হারূন ও মূসার রবের প্রতি ঈমান আনলাম’।",
    "ফির‘আউন বলল, ‘কী, আমি তোমাদেরকে অনুমতি দেয়ার আগেই তোমরা তার প্রতি ঈমান আনলে? নিশ্চয় সে-ই তোমাদের প্রধান, যে তোমাদেরকে যাদু শিখিয়েছে। সুতরাং আমি অবশ্যই তোমাদের হাত ও পা বিপরীত দিক থেকে কেটে ফেলব এবং আমি তোমাদেরকে খেজুর গাছের কান্ডে শূলিবিদ্ধ করবই। আর তোমরা অবশ্যই জানতে পারবে, আমাদের মধ্যে কার আযাব বেশী কঠোর এবং বেশী স্থায়ী।",
    "তারা বলল, ‘আমাদের নিকট যে সকল স্পষ্ট নিদর্শন এসেছে এবং যিনি আমাদেরকে সৃষ্টি করেছেন, তার উপর আমরা তোমাকে কিছুতেই প্রাধান্য দেব না। সুতরাং তুমি যা ফয়সালা করতে চাও, তাই করো। তুমিতো কেবল এ দুনিয়ার জীবনের উপর কর্তৃত্ব করতে পার’।",
    "‘নিশ্চয় আমরা আমাদের রবের প্রতি ঈমান এনেছি, যাতে তিনি আমাদের অপরাধসমূহ এবং যে যাদু তুমি আমাদেরকে করতে বাধ্য করেছ, তা ক্ষমা করে দেন। আর আল্লাহ সর্বশ্রেষ্ঠ ও চিরস্থায়ী’।",
    "যে তার রবের নিকট অপরাধী অবস্থায় আসবে, তার জন্য রয়েছে জাহান্নাম। সেখানে সে মরবেও না, বাঁচবেও না।",
    "আর যারা তাঁর নিকট আসবে মুমিন অবস্থায়, সৎকর্ম করে তাদের জন্যই রয়েছে সুউচ্চ মর্যাদা।",
    "স্থায়ী জান্নাত, যার পাদদেশে নদী প্রবাহিত, তারা সেখানে স্থায়ী হবে। আর এটা হল যারা পরিশুদ্ধ হয় তাদের পুরষ্কার।",
    "আর আমি অবশ্যই মূসার কাছে ওহী প্রেরণ করেছিলাম যে, ‘আমার বান্দাদেরকে নিয়ে রাতের বেলায় রওয়ানা হও। অতঃপর সজোরে আঘাত করে তাদের জন্য শুকনো রাস্তা বানাও। পেছন থেকে ধরে ফেলার আশংকা করো না এবং ভয়ও করো না’।",
    "তারপর ফির‘আউন তার সেনাবাহিনী সহ তাদের পিছু নিল। অতঃপর সমুদ্র তাদেরকে সম্পূর্ণরূপে নিমজ্জিত করল।",
    "আর ফির‘আউন তার কওমকে পথভ্রষ্ট করেছিল এবং সে সঠিক পথ দেখায়নি।",
    "হে বনী ইসরাঈল, আমিই তোমাদেরকে তোমাদের শত্রু থেকে নাজাত দিয়েছি। আর তোমাদেরকে ওয়াদা দিয়েছিলাম তূর পাহাড়ের ডান পাশের* এবং আমি তোমাদের জন্য অবতরণ করেছিলাম ‘মান্না’ ও ‘সালওয়া’। \n* তারা তূর পাহাড়ের ডানপার্শ্বে উপস্থিত হলে আল্লাহ তা‘আলা তাদেরকে তাওরাত কিতাব প্রদান করবেন বলে ওয়াদা করেছিলেন।",
    "আমি তোমাদেরকে যে রিয্ক দান করেছি তা থেকে ভালগুলো খাও এবং এতে সীমালংঘন করো না। করলে তোমাদের উপর আমার গযব পতিত হবে। আর যার উপর আমার গযব পতিত হয় সে অবশ্যই ধ্বংস হয়।",
    "আর অবশ্যই আমি তার প্রতি ক্ষমাশীল, যে তাওবা করে, ঈমান আনে এবং সৎকর্ম করে অতঃপর সৎ পথে চলতে থাকে।",
    "হে মূসা, কিসে তাড়াতাড়ি নিয়ে এসেছে তোমাকে, তোমার কওমকে পেছনে ফেলে?",
    "মূসা বলল, ‘এই তো তারা আমার পিছনে। হে আমার রব, আমি তাড়াতাড়ি করে আপনার নিকট এসেছি, যাতে আপনি আমার উপর সন্তুষ্ট হন’।",
    "আল্লাহ বললেন, ‘তোমার চলে আসার পর আমি তো তোমার কওমকে পরীক্ষায় ফেলে দিয়েছি। আর সামেরী তাদেরকে পথভ্রষ্ট করেছে’।",
    "তারপর মূসা ক্রোধ ও দুঃখভরে তার কওমের কাছে ফিরে গেল। সে বলল, ‘হে কওম, তোমাদের রব কি তোমাদের সাথে এক উত্তম ওয়াদা করেননি? তোমাদের কাছে কি সেই ওয়াদার সময় দীর্ঘ হয়ে গেছে? নাকি তোমরা চেয়েছ যে, তোমাদের উপর তোমাদের রবের গযব পতিত হোক? তাই তোমরা আমার সাথে কৃত ওয়াদা ভঙ্গ করলে’?",
    "তারা বলল, ‘আমরা তো স্বেচ্ছায় আপনার সাথে কৃত ওয়াদা ভঙ্গ করিনি, বরং কওমের অলংকারের বোঝা আমাদের উপর চাপিয়ে দেয়া হয়েছিল। তাই আমরা তা (আগুনে) নিক্ষেপ করেছি, অনুরূপভাবে সামেরীও ফেলে দিয়েছে’।",
    "তারপর সে তাদের জন্য একটা গো বাছুরের প্রতিকৃতি বের করে আনল, যার ছিল আওয়াজ। তখন তারা বলল, ‘এটাই তোমাদের ইলাহ এবং মূসারও ইলাহ; কিন্তু সে এ কথা ভুলে গেছে’।",
    "তারা কি দেখে না যে, এটা তাদের কোন কথার জবাব দিতে পারে না, আর তাদের কোন ক্ষতি বা উপকার করার ক্ষমতাও রাখে না?",
    "আর হারূন পূর্বেই তাদেরকে বলেছিল, ‘হে আমার কওম, এটা দ্বারা তো কেবল তোমাদেরকে পরীক্ষায় ফেলা হয়েছে। আর তোমাদের রব তো পরম করুণাময়। তাই তোমরা আমার অনুসরণ কর এবং আমার আদেশ মেনে চল’।",
    "তারা বলল, ‘আমরা এর উপরই অবিচল থাকব যতক্ষণ না মূসা আমাদের কাছে ফিরে আসে’।",
    "মূসা বলল, ‘হে হারূন! তুমি যখন দেখলে যে, তারা পথভ্রষ্ট হয়ে গেছে তখন তোমাকে কিসে বিরত রাখল’",
    "যে তুমি আমার অনুসরণ করলে না? তাহলে তুমিও কি আমার আদেশ অমান্য করেছ’?",
    "সে বলল, ‘হে আমার সহোদর! আমার দাড়িও ধরো না, মাথার চুলও ধরো না। আমি আশংকা করেছিলাম যে, তুমি বলবে, তুমি বনী ইসরাঈলের মধ্যে বিভেদ সৃষ্টি করেছ এবং আমার কথা রক্ষা করনি’।",
    "মূসা বলল, ‘হে সামেরী! তোমার কী অবস্থা’?",
    "সে বলল, ‘আমি এমন কিছু দেখেছি যা ওরা দেখেনি। তারপর আমি দূতের (জিবরীলের) পায়ের চিহ্ন থেকে এক মুষ্টি মাটি নিয়েছিলাম। অতঃপর তা নিক্ষেপ করেছিলাম। আর আমার মন আমার জন্য এরূপ করাটা শোভন করেছিল’।",
    "মূসা বলল, ‘যাও, তোমার শাস্তি হল, জীবদ্দশায় তুমি বলতে থাকবে, ‘আমি অস্পৃশ্য’। আর তোমার জন্য একটা নির্দিষ্ট সময় রইল যার কখনো ব্যতিক্রম হবে না। আর তুমি তোমার ইলাহের প্রতি চেয়ে দেখ, যার পূজায় তুমি রত ছিলে, আমরা তা অবশ্যই জ্বালিয়ে দেব। তারপর বিক্ষিপ্ত করে তা সাগরে নিক্ষেপ করবই’।",
    "‘তোমাদের ইলাহ তো কেবল আল্লাহই। তিনি ছাড়া তোমাদের কোন ইলাহ নেই। সকল বিষয়েই তার জ্ঞান পরিব্যাপ্ত’।",
    "পূর্বে যা ঘটে গেছে তার কিছু সংবাদ এভাবেই আমি তোমার কাছে বর্ণনা করি। আর আমি তোমাকে আমার পক্ষ থেকে উপদেশ দান করেছি।",
    "তা থেকে যে বিমুখ হবে, অবশ্যই সে কিয়ামতের দিন পাপের বোঝা বহন করবে।",
    "সেখানে তারা স্থায়ী হবে এবং কিয়ামতের দিন এটা তাদের জন্য বোঝা হিসেবে কতই না মন্দ হবে!",
    "যেদিন শিংগায় ফুঁক দেয়া হবে, আর সেদিন আমি অপরাধীদেরকে দৃষ্টিহীন অবস্থায় সমবেত করব।",
    "সেদিন তারা চুপে চুপে নিজদের মধ্যে বলাবলি করবে, ‘তোমরা মাত্র দশদিন অবস্থান করেছিলে’।",
    "আমি ভালভাবেই জানি তারা কী বলবে, তাদের মধ্যে অপেক্ষাকৃত সৎপথে ছিল যে লোকটি সে বলবে, ‘তোমরা মাত্র একদিন অবস্থান করেছিলে’!",
    "আর তারা তোমাকে পাহাড় সম্পর্কে জিজ্ঞাসা করে। বল, ‘আমার রব এগুলোকে সমূলে উৎপাটন করে বিক্ষিপ্ত করে দিবেন’।",
    "‘তারপর তিনি তাকে মসৃণ সমতলভূমি করে দিবেন’।",
    "‘তাতে তুমি কোন বক্রতা ও উচ্চতা দেখবে না’।",
    "সেদিন তারা আহবানকারীর (ফেরেশতার) অনুসরণ করবে। এর কোন এদিক সেদিক হবে না এবং পরম করুণাময়ের সামনে সকল আওয়াজ নিচু হয়ে যাবে। তাই মৃদু আওয়াজ ছাড়া তুমি কিছুই শুনতে পাবে না।",
    "সেদিন পরম করুণাময় যাকে অনুমতি দিবেন আর যার কথায় তিনি সন্তুষ্ট হবেন তার সুপারিশ ছাড়া কারো সুপারিশ কোন কাজে আসবে না।",
    "তিনি তাদের আগের ও পরের সব কিছুই জানেন, কিন্তু তারা জ্ঞান দিয়ে তাঁকে বেষ্টন করতে পারবে না।",
    "আর চিরঞ্জীব, চিরপ্রতিষ্ঠিত সত্তার সামনে সকলেই অবনত হবে। আর সে অবশ্যই ব্যর্থ হবে যে যুলম বহন করবে।",
    "এবং যে মুমিন অবস্থায় ভাল কাজ করবে সে কোন যুলম বা ক্ষতির আশংকা করবে না।",
    "আর এভাবেই আমি আরবী ভাষায় কুরআন নাযিল করেছি এবং তাতে বিভিন্ন সতর্কবাণী বর্ণনা করেছি, যাতে তারা মুত্তাকী হতে পারে অথবা তা হয় তাদের জন্য উপদেশ।",
    "সুতরাং আল্লাহ মহান যিনি সত্যিকার অধিপতি; তোমার প্রতি ওহী সম্পূর্ণ হওয়ার পূর্বে তুমি কুরআন পাঠে তাড়াহুড়া করো না এবং তুমি বল, ‘হে আমার রব, আমার জ্ঞান বৃদ্ধি করে দিন।’",
    "আর আমি ইতিপূর্বে আদমের প্রতি নির্দেশ দিয়েছিলাম; কিন্তু সে তা ভুলে গিয়েছিল এবং আমি তার মধ্যে সংকল্পে দৃঢ়তা পাইনি।",
    "আর স্মরণ কর, যখন আমি ফেরেশতাদেরকে বললাম, ‘তোমরা আদমকে সিজদা কর,’ তখন ইবলীস ছাড়া সকলেই সিজদা করল; সে অমান্য করল।",
    "অতঃপর আমি বললাম, ‘হে আদম, নিশ্চয় এ তোমার ও তোমার স্ত্রীর শত্রু। সুতরাং সে যেন তোমাদের উভয়কে জান্নাত থেকে কিছুতেই বের করে না দেয়, তাহলে তোমরা দুর্ভোগ পোহাবে’।",
    "‘নিশ্চয় তোমার জন্য এ ব্যবস্থা যে, তুমি সেখানে ক্ষুধার্তও হবে না এবং বস্ত্রহীনও হবে না’।",
    "‘আর সেখানে তুমি পিপাসার্তও হবে না এবং রৌদ্রদগ্ধও হবে না’।",
    "অতঃপর শয়তান তাকে কুমন্ত্রণা দিল, বলল, ‘হে আদম, আমি কি তোমাকে বলে দিব অনন্ত জীবনপ্রদ গাছ এবং অক্ষয় রাজত্ব সম্পর্কে?’",
    "অতঃপর তারা উভয়েই সে গাছ থেকে খেল। তখন তাদের উভয়ের সতর তাদের সামনে প্রকাশ হয়ে পড়ল এবং তারা জান্নাতের গাছের পাতা দিয়ে নিজদেরকে আবৃত করতে লাগল এবং আদম তার রবের হুকুম অমান্য করল; ফলে সে বিভ্রান্ত হল।",
    "এরপর তার রব তাকে মনোনীত করলেন, অতঃপর তার তাওবা কবূল করলেন এবং তাকে পথনির্দেশ করলেন।",
    "তিনি বললেন, ‘তোমরা উভয়েই জান্নাত হতে এক সাথে নেমে যাও। তোমরা একে অপরের শত্রু। অতঃপর যখন তোমাদের কাছে আমার পক্ষ থেকে হিদায়াত আসবে, তখন যে আমার হিদায়াতের অনুসরণ করবে সে বিপথগামী হবে না এবং দুর্ভাগাও হবে না’।",
    "‘আর যে আমার স্মরণ থেকে মুখ ফিরিয়ে নেবে, তার জন্য হবে নিশ্চয় এক সংকুচিত জীবন এবং আমি তাকে কিয়ামত দিবসে উঠাবো অন্ধ অবস্থায়।",
    "সে বলবে, ‘হে আমার রব, কেন আপনি আমাকে অন্ধ অবস্থায় উঠালেন? অথচ আমি তো ছিলাম দৃষ্টিশক্তি সম্পন্ন’?",
    "তিনি বলবেন, ‘এমনিভাবেই তোমার নিকট আমার নিদর্শনাবলী এসেছিল, কিন্তু তুমি তা ভুলে গিয়েছিলে এবং সেভাবেই আজ তোমাকে ভুলে যাওয়া হল’।",
    "আর এভাবেই আমি প্রতিফল দান করি তাকে, যে বাড়াবাড়ি করে এবং তার রবের নিদর্শনাবলীতে ঈমান আনে না। আর আখিরাতের আযাব তো অবশ্যই কঠোরতর ও অধিকতর স্থায়ী।",
    "এটি কি তাদেরকে সৎপথ প্রদর্শন করল না যে, আমি তাদের পূর্বে কত মানবগোষ্ঠীকে ধ্বংস করে দিয়েছি, যাদের বাসভূমিতে তারা বিচরণ করে? নিশ্চয় এর মধ্যে রয়েছে বিবেকসম্পন্নদের জন্য নিদর্শন।",
    "আর যদি তোমার রবের পক্ষ থেকে পূর্ব সিদ্ধান্ত ও একটি কাল নির্ধারিত হয়ে না থাকত, তবে আশু শাস্তি অবশ্যম্ভাবী হত।",
    "সুতরাং এরা যা বলে তার উপর ধৈর্য ধারণ কর এবং তাসবীহ পাঠ কর তোমার রবের প্রশংসা বর্ণনার মাধ্যমে, সূর্যোদয়ের পূর্বে, সূর্যাস্তের পূর্বে এবং তাসবীহ পাঠ কর রাতের কিছু অংশে ও দিনের প্রান্তসমূহে, যাতে তুমি সন্তুষ্ট হতে পার।",
    "আর তুমি কখনো প্রসারিত করো না তোমার দু’চোখ সে সবের প্রতি, যা আমি তাদের বিভিন্ন শ্রেণীকে দুনিয়ার জীবনের জাঁক-জমকস্বরূপ উপভোগের উপকরণ হিসেবে দিয়েছি। যাতে আমি সে বিষয়ে তাদেরকে পরীক্ষা করে নিতে পারি। আর তোমার রবের প্রদত্ত রিয্ক সর্বোৎকৃষ্ট ও অধিকতর স্থায়ী।",
    "আর তোমার পরিবার-পরিজনকে সালাত আদায়ের আদেশ দাও এবং নিজেও তার উপর অবিচল থাক। আমি তোমার কাছে কোন রিয্ক চাই না। আমিই তোমাকে রিয্ক দেই আর শুভ পরিণাম তো মুত্তাকীদের জন্য।",
    "আর তারা বলে, ‘সে তার রবের কাছ থেকে আমাদের নিকট কোন নিদর্শন নিয়ে আসে না কেন’? পূর্ববর্তী গ্রন্থসমূহে যে সুস্পষ্ট প্রমাণ রয়েছে তা কি তাদের কাছে আসেনি?",
    "আর যদি আমি তাদেরকে ইতঃপূর্বে কোন আযাব দ্বারা ধ্বংস করতাম তবে অবশ্যই, তারা বলত, ‘হে আমাদের রব, আপনি আমাদের কাছে কোন রাসূল পাঠালেন না কেন? তাহলে তো আমরা লাঞ্ছিত ও অপমানিত হওয়ার পূর্বে আপনার নিদর্শনাবলী অনুসরণ করতাম’।",
    "বল, ‘প্রত্যেকেই প্রতীক্ষা করছে, অতএব তোমরাও প্রতীক্ষায় থাক। শীঘ্রই তোমরা জানতে পারবে কারা সঠিক পথের উপর রয়েছে এবং কারা হিদায়াতপ্রাপ্ত’।"
  ]
}