{
  "surahName": "Al-Hadid",
  "surahNameArabic": "الحديد",
  "surahNameArabicLong": "سورة الحديد",
  "surahNameTranslation": "The Iron",
  "revelationPlace": "Madina",
  "totalAyah": 29,
  "surahNo": 57,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/57.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/057.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/57.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/057.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/57.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/057.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/57.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/057.mp3"
    }
  },
  "english": [
    "Whatever is in the heavens and the earth glorifies Allah, for He is the Almighty, All-Wise.",
    "To Him belongs the kingdom of the heavens and the earth. He gives life and causes death. And He is Most Capable of everything.",
    "He is the First and the Last, the Most High and Most Near, and He has ˹perfect˺ knowledge of all things.",
    "He is the One Who created the heavens and the earth in six Days, then established Himself on the Throne. He knows whatever goes into the earth and whatever comes out of it, and whatever descends from the sky and whatever ascends into it. And He is with you wherever you are. For Allah is All-Seeing of what you do.",
    "To Him belongs the kingdom of the heavens and the earth. And to Allah all matters are returned.",
    "He merges the night into day and the day into night. And He knows best what is ˹hidden˺ in the heart.",
    "Believe in Allah and His Messenger, and donate from what He has entrusted you with. So those of you who believe and donate will have a mighty reward.",
    "Why do you not believe in Allah while the Messenger is inviting you to have faith in your Lord, although He has already taken your covenant, if you will ever believe.",
    "He is the One Who sends down clear revelations to His servant to bring you out of darkness and into light. For indeed Allah is Ever Gracious and Most Merciful to you.",
    "And why should you not spend in the cause of Allah, while Allah is the ˹sole˺ inheritor of the heavens and the earth? Those of you who donated and fought before the victory ˹over Mecca˺ are unparalleled. They are far greater in rank than those who donated and fought afterwards. Yet Allah has promised each a fine reward. And Allah is All-Aware of what you do.",
    "Who is it that will lend to Allah a good loan which Allah will multiply ˹many times over˺ for them, and they will have an honourable reward?",
    "On that Day you will see believing men and women with their light shining ahead of them and on their right. ˹They will be told,˺ “Today you have good news of Gardens, under which rivers flow, ˹for you˺ to stay in forever. This is ˹truly˺ the ultimate triumph.”",
    "On that Day hypocrite men and women will beg the believers, “Wait for us so that we may have some of your light.” It will be said ˹mockingly˺, “Go back ˹to the world˺ and seek a light ˹there˺!” Then a ˹separating˺ wall with a gate will be erected between them. On the near side will be grace and on the far side will be torment.",
    "The tormented will cry out to those graced, “Were we not with you?” They will reply, “Yes ˹you were˺. But you chose to be tempted ˹by hypocrisy˺, ˹eagerly˺ awaited ˹our demise˺, doubted ˹the truth˺, and were deluded by false hopes until Allah’s decree ˹of your death˺ came to pass. And ˹so˺ the Chief Deceiver deceived you about Allah.",
    "So Today no ransom will be accepted from you ˹hypocrites˺, nor from the disbelievers. Your home is the Fire—it is the ˹only˺ fitting place for you. What an evil destination!”",
    "Has the time not yet come for believers’ hearts to be humbled at the remembrance of Allah and what has been revealed of the truth, and not be like those given the Scripture before—˹those˺ who were spoiled for so long that their hearts became hardened. And many of them are ˹still˺ rebellious.",
    "Know that Allah revives the earth after its death. We have certainly made the signs clear for you so perhaps you will understand.",
    "Indeed, those men and women who give in charity and lend to Allah a good loan will have it multiplied for them, and they will have an honourable reward.",
    "˹As for˺ those who believe in Allah and His messengers, it is they who are ˹truly˺ the people of truth. And the martyrs, with their Lord, will have their reward and their light. But ˹as for˺ those who disbelieve and reject Our signs, it is they who will be the residents of the Hellfire.",
    "Know that this worldly life is no more than play, amusement, luxury, mutual boasting, and competition in wealth and children. This is like rain that causes plants to grow, to the delight of the planters. But later the plants dry up and you see them wither, then they are reduced to chaff. And in the Hereafter there will be either severe punishment or forgiveness and pleasure of Allah, whereas the life of this world is no more than the delusion of enjoyment.",
    "˹So˺ compete with one another for forgiveness from your Lord and a Paradise as vast as the heavens and the earth, prepared for those who believe in Allah and His messengers. This is the favour of Allah. He grants it to whoever He wills. And Allah is the Lord of infinite bounty.",
    "No calamity ˹or blessing˺ occurs on earth or in yourselves without being ˹written˺ in a Record before We bring it into being. This is certainly easy for Allah.",
    "˹We let you know this˺ so that you neither grieve over what you have missed nor boast over what He has granted you. For Allah does not like whoever is arrogant, boastful—",
    "those who are stingy and promote stinginess among people. And whoever turns away ˹should know that˺ Allah ˹alone˺ is truly the Self-Sufficient, Praiseworthy.",
    "Indeed, We sent Our messengers with clear proofs, and with them We sent down the Scripture and the balance ˹of justice˺ so that people may administer justice. And We sent down iron with its great might, benefits for humanity, and means for Allah to prove who ˹is willing to˺ stand up for Him and His messengers without seeing Him. Surely Allah is All-Powerful, Almighty.",
    "And indeed, We sent Noah and Abraham and reserved prophethood and revelation for their descendants. Some of them are ˹rightly˺ guided, while most are rebellious.",
    "Then in the footsteps of these ˹prophets˺, We sent Our messengers, and ˹after them˺ We sent Jesus, son of Mary, and granted him the Gospel, and instilled compassion and mercy into the hearts of his followers. As for monasticism, they made it up—We never ordained it for them—only seeking to please Allah, yet they did not ˹even˺ observe it strictly. So We rewarded those of them who were faithful. But most of them are rebellious.",
    "O people of faith! Fear Allah and believe in His Messenger. ˹And˺ He will grant you a double share of His mercy, provide you with a light to walk in ˹on Judgment Day˺, and forgive you. For Allah is All-Forgiving, Most Merciful.",
    "˹This is so˺ that the People of the Book ˹who deny the Prophet˺ may know that they do not have any control over Allah’s grace, and that all grace is in Allah’s Hands. He grants it to whoever He wills. For Allah is the Lord of infinite bounty."
  ],
  "arabic1": [
    "سَبَّحَ لِلّٰهِ مَا فِی السَّمٰوٰتِ وَالْاَرْضِ وَهُوَ الْعَزِیْزُ الْحَكِیْمُ",
    "لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ یُحْیٖ وَیُمِیْتُ وَهُوَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "هُوَ الْاَوَّلُ وَالْاٰخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَیْءٍ عَلِیْمٌ",
    "هُوَ الَّذِیْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ فِیْ سِتَّةِ اَیَّامٍ ثُمَّ اسْتَوٰی عَلَی الْعَرْشِ یَعْلَمُ مَا یَلِجُ فِی الْاَرْضِ وَمَا یَخْرُجُ مِنْهَا وَمَا یَنْزِلُ مِنَ السَّمَآءِ وَمَا یَعْرُجُ فِیْهَا وَهُوَ مَعَكُمْ اَیْنَ مَا كُنْتُمْ وَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِیْرٌ",
    "لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَاِلَی اللّٰهِ تُرْجَعُ الْاُمُوْرُ",
    "یُوْلِجُ الَّیْلَ فِی النَّهَارِ وَیُوْلِجُ النَّهَارَ فِی الَّیْلِ وَهُوَ عَلِیْمٌۢ بِذَاتِ الصُّدُوْرِ",
    "اٰمِنُوْا بِاللّٰهِ وَرَسُوْلِهٖ وَاَنْفِقُوْا مِمَّا جَعَلَكُمْ مُّسْتَخْلَفِیْنَ فِیْهِ فَالَّذِیْنَ اٰمَنُوْا مِنْكُمْ وَاَنْفَقُوْا لَهُمْ اَجْرٌ كَبِیْرٌ",
    "وَمَا لَكُمْ لَا تُؤْمِنُوْنَ بِاللّٰهِ وَالرَّسُوْلُ یَدْعُوْكُمْ لِتُؤْمِنُوْا بِرَبِّكُمْ وَقَدْ اَخَذَ مِیْثَاقَكُمْ اِنْ كُنْتُمْ مُّؤْمِنِیْنَ",
    "هُوَ الَّذِیْ یُنَزِّلُ عَلٰی عَبْدِهٖۤ اٰیٰتٍۢ بَیِّنٰتٍ لِّیُخْرِجَكُمْ مِّنَ الظُّلُمٰتِ اِلَی النُّوْرِ وَاِنَّ اللّٰهَ بِكُمْ لَرَءُوْفٌ رَّحِیْمٌ",
    "وَمَا لَكُمْ اَلَّا تُنْفِقُوْا فِیْ سَبِیْلِ اللّٰهِ وَلِلّٰهِ مِیْرَاثُ السَّمٰوٰتِ وَالْاَرْضِ لَا یَسْتَوِیْ مِنْكُمْ مَّنْ اَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَقٰتَلَ اُولٰٓىِٕكَ اَعْظَمُ دَرَجَةً مِّنَ الَّذِیْنَ اَنْفَقُوْا مِنْ بَعْدُ وَقَاتَلُوْا وَكُلًّا وَّعَدَ اللّٰهُ الْحُسْنٰی وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِیْرٌ",
    "مَنْ ذَا الَّذِیْ یُقْرِضُ اللّٰهَ قَرْضًا حَسَنًا فَیُضٰعِفَهٗ لَهٗ وَلَهٗۤ اَجْرٌ كَرِیْمٌ",
    "یَوْمَ تَرَی الْمُؤْمِنِیْنَ وَالْمُؤْمِنٰتِ یَسْعٰی نُوْرُهُمْ بَیْنَ اَیْدِیْهِمْ وَبِاَیْمَانِهِمْ بُشْرٰىكُمُ الْیَوْمَ جَنّٰتٌ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِیْنَ فِیْهَا ذٰلِكَ هُوَ الْفَوْزُ الْعَظِیْمُ",
    "یَوْمَ یَقُوْلُ الْمُنٰفِقُوْنَ وَالْمُنٰفِقٰتُ لِلَّذِیْنَ اٰمَنُوا انْظُرُوْنَا نَقْتَبِسْ مِنْ نُّوْرِكُمْ قِیْلَ ارْجِعُوْا وَرَآءَكُمْ فَالْتَمِسُوْا نُوْرًا فَضُرِبَ بَیْنَهُمْ بِسُوْرٍ لَّهٗ بَابٌ بَاطِنُهٗ فِیْهِ الرَّحْمَةُ وَظَاهِرُهٗ مِنْ قِبَلِهِ الْعَذَابُ",
    "یُنَادُوْنَهُمْ اَلَمْ نَكُنْ مَّعَكُمْ قَالُوْا بَلٰی وَلٰكِنَّكُمْ فَتَنْتُمْ اَنْفُسَكُمْ وَتَرَبَّصْتُمْ وَارْتَبْتُمْ وَغَرَّتْكُمُ الْاَمَانِیُّ حَتّٰی جَآءَ اَمْرُ اللّٰهِ وَغَرَّكُمْ بِاللّٰهِ الْغَرُوْرُ",
    "فَالْیَوْمَ لَا یُؤْخَذُ مِنْكُمْ فِدْیَةٌ وَّلَا مِنَ الَّذِیْنَ كَفَرُوْا مَاْوٰىكُمُ النَّارُ هِیَ مَوْلٰىكُمْ وَبِئْسَ الْمَصِیْرُ",
    "اَلَمْ یَاْنِ لِلَّذِیْنَ اٰمَنُوْۤا اَنْ تَخْشَعَ قُلُوْبُهُمْ لِذِكْرِ اللّٰهِ وَمَا نَزَلَ مِنَ الْحَقِّ وَلَا یَكُوْنُوْا كَالَّذِیْنَ اُوْتُوا الْكِتٰبَ مِنْ قَبْلُ فَطَالَ عَلَیْهِمُ الْاَمَدُ فَقَسَتْ قُلُوْبُهُمْ وَكَثِیْرٌ مِّنْهُمْ فٰسِقُوْنَ",
    "اِعْلَمُوْۤا اَنَّ اللّٰهَ یُحْیِ الْاَرْضَ بَعْدَ مَوْتِهَا قَدْ بَیَّنَّا لَكُمُ الْاٰیٰتِ لَعَلَّكُمْ تَعْقِلُوْنَ",
    "اِنَّ الْمُصَّدِّقِیْنَ وَالْمُصَّدِّقٰتِ وَاَقْرَضُوا اللّٰهَ قَرْضًا حَسَنًا یُّضٰعَفُ لَهُمْ وَلَهُمْ اَجْرٌ كَرِیْمٌ",
    "وَالَّذِیْنَ اٰمَنُوْا بِاللّٰهِ وَرُسُلِهٖۤ اُولٰٓىِٕكَ هُمُ الصِّدِّیْقُوْنَ ۖ وَالشُّهَدَآءُ عِنْدَ رَبِّهِمْ لَهُمْ اَجْرُهُمْ وَنُوْرُهُمْ وَالَّذِیْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰیٰتِنَاۤ اُولٰٓىِٕكَ اَصْحٰبُ الْجَحِیْمِ",
    "اِعْلَمُوْۤا اَنَّمَا الْحَیٰوةُ الدُّنْیَا لَعِبٌ وَّلَهْوٌ وَّزِیْنَةٌ وَّتَفَاخُرٌ بَیْنَكُمْ وَتَكَاثُرٌ فِی الْاَمْوَالِ وَالْاَوْلَادِ كَمَثَلِ غَیْثٍ اَعْجَبَ الْكُفَّارَ نَبَاتُهٗ ثُمَّ یَهِیْجُ فَتَرٰىهُ مُصْفَرًّا ثُمَّ یَكُوْنُ حُطَامًا وَفِی الْاٰخِرَةِ عَذَابٌ شَدِیْدٌ وَّمَغْفِرَةٌ مِّنَ اللّٰهِ وَرِضْوَانٌ وَمَا الْحَیٰوةُ الدُّنْیَاۤ اِلَّا مَتَاعُ الْغُرُوْرِ",
    "سَابِقُوْۤا اِلٰی مَغْفِرَةٍ مِّنْ رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَآءِ وَالْاَرْضِ اُعِدَّتْ لِلَّذِیْنَ اٰمَنُوْا بِاللّٰهِ وَرُسُلِهٖ ذٰلِكَ فَضْلُ اللّٰهِ یُؤْتِیْهِ مَنْ یَّشَآءُ وَاللّٰهُ ذُو الْفَضْلِ الْعَظِیْمِ",
    "مَاۤ اَصَابَ مِنْ مُّصِیْبَةٍ فِی الْاَرْضِ وَلَا فِیْۤ اَنْفُسِكُمْ اِلَّا فِیْ كِتٰبٍ مِّنْ قَبْلِ اَنْ نَّبْرَاَهَا اِنَّ ذٰلِكَ عَلَی اللّٰهِ یَسِیْرٌ",
    "لِّكَیْلَا تَاْسَوْا عَلٰی مَا فَاتَكُمْ وَلَا تَفْرَحُوْا بِمَاۤ اٰتٰىكُمْ وَاللّٰهُ لَا یُحِبُّ كُلَّ مُخْتَالٍ فَخُوْرِ",
    "١لَّذِیْنَ یَبْخَلُوْنَ وَیَاْمُرُوْنَ النَّاسَ بِالْبُخْلِ وَمَنْ یَّتَوَلَّ فَاِنَّ اللّٰهَ هُوَ الْغَنِیُّ الْحَمِیْدُ",
    "لَقَدْ اَرْسَلْنَا رُسُلَنَا بِالْبَیِّنٰتِ وَاَنْزَلْنَا مَعَهُمُ الْكِتٰبَ وَالْمِیْزَانَ لِیَقُوْمَ النَّاسُ بِالْقِسْطِ وَاَنْزَلْنَا الْحَدِیْدَ فِیْهِ بَاْسٌ شَدِیْدٌ وَّمَنَافِعُ لِلنَّاسِ وَلِیَعْلَمَ اللّٰهُ مَنْ یَّنْصُرُهٗ وَرُسُلَهٗ بِالْغَیْبِ اِنَّ اللّٰهَ قَوِیٌّ عَزِیْزٌ",
    "وَلَقَدْ اَرْسَلْنَا نُوْحًا وَّاِبْرٰهِیْمَ وَجَعَلْنَا فِیْ ذُرِّیَّتِهِمَا النُّبُوَّةَ وَالْكِتٰبَ فَمِنْهُمْ مُّهْتَدٍ وَكَثِیْرٌ مِّنْهُمْ فٰسِقُوْنَ",
    "ثُمَّ قَفَّیْنَا عَلٰۤی اٰثَارِهِمْ بِرُسُلِنَا وَقَفَّیْنَا بِعِیْسَی ابْنِ مَرْیَمَ وَاٰتَیْنٰهُ الْاِنْجِیْلَ وَجَعَلْنَا فِیْ قُلُوْبِ الَّذِیْنَ اتَّبَعُوْهُ رَاْفَةً وَّرَحْمَةً وَرَهْبَانِیَّةَ ١بْتَدَعُوْهَا مَا كَتَبْنٰهَا عَلَیْهِمْ اِلَّا ابْتِغَآءَ رِضْوَانِ اللّٰهِ فَمَا رَعَوْهَا حَقَّ رِعَایَتِهَا فَاٰتَیْنَا الَّذِیْنَ اٰمَنُوْا مِنْهُمْ اَجْرَهُمْ وَكَثِیْرٌ مِّنْهُمْ فٰسِقُوْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَاٰمِنُوْا بِرَسُوْلِهٖ یُؤْتِكُمْ كِفْلَیْنِ مِنْ رَّحْمَتِهٖ وَیَجْعَلْ لَّكُمْ نُوْرًا تَمْشُوْنَ بِهٖ وَیَغْفِرْ لَكُمْ وَاللّٰهُ غَفُوْرٌ رَّحِیْمٌ",
    "لِّئَلَّا یَعْلَمَ اَهْلُ الْكِتٰبِ اَلَّا یَقْدِرُوْنَ عَلٰی شَیْءٍ مِّنْ فَضْلِ اللّٰهِ وَاَنَّ الْفَضْلَ بِیَدِ اللّٰهِ یُؤْتِیْهِ مَنْ یَّشَآءُ وَاللّٰهُ ذُو الْفَضْلِ الْعَظِیْمِ"
  ],
  "bengali": [
    "আসমানসমূহ ও যমীনে যা কিছু আছে, সবই আল্লাহর তাসবীহ পাঠ করে। আর তিনি পরাক্রমশালী, প্রজ্ঞাময়।",
    "আসমানসমূহ ও যমীনের রাজত্ব তাঁরই। তিনিই জীবন দেন এবং তিনিই মৃত্যু দেন। আর তিনি সকল কিছুর উপর সর্বশক্তিমান।",
    "তিনিই প্রথম ও শেষ এবং প্রকাশ্য ও গোপন; আর তিনি সকল বিষয়ে সম্যক অবগত।",
    "তিনিই আসমানসমূহ ও যমীন ছয় দিনে সৃষ্টি করেছেন, তারপর তিনি আরশে উঠেছেন। তিনি জানেন যমীনে যা কিছু প্রবেশ করে এবং তা থেকে যা কিছু বের হয়; আর আসমান থেকে যা কিছু অবতীর্ণ হয় এবং তাতে যা কিছু উত্থিত হয়। আর তোমরা যেখানেই থাক না কেন, তিনি তোমাদের সাথেই আছেন। আর তোমরা যা কর, আল্লাহ তার সম্যক দ্রষ্টা।",
    "আসমানসমূহ ও যমীনের রাজত্ব তাঁরই এবং আল্লাহরই দিকে সকল বিষয় প্রত্যাবর্তিত হবে।",
    "তিনি রাতকে দিনের মধ্যে প্রবেশ করান এবং দিনকে রাতের মধ্যে প্রবেশ করান। আর তিনি অন্তরসমূহের বিষয়াদি সম্পর্কে সম্যক অবগত।",
    "তোমরা আল্লাহ ও তাঁর রাসূলের প্রতি ঈমান আন এবং তিনি তোমাদেরকে যা কিছুর উত্তরাধিকারী করেছেন, তা থেকে ব্যয় কর। অতঃপর তোমাদের মধ্যে যারা ঈমান আনে ও (আল্লাহর পথে) ব্যয় করে তাদের জন্য রয়েছে বিরাট প্রতিফল।",
    "আর তোমাদের কী হলো যে, তোমরা আল্লাহর প্রতি ঈমান আনছ না? অথচ রাসূল তোমাদেরকে তোমাদের রবের প্রতি ঈমান আনতে আহবান করছে। আর তিনি তোমাদের কাছ থেকে অঙ্গীকার গ্রহণ করেছেন, যদি তোমরা মুমিন হও।",
    "তিনিই তাঁর বান্দার প্রতি সুস্পষ্ট আয়াতসমূহ নাযিল করেন, যাতে তিনি তোমাদেরকে অন্ধকার থেকে আলোর দিকে বের করে আনতে পারেন। আর নিশ্চয় আল্লাহ তোমাদের প্রতি অতিশয় দয়ালু, পরম করুণাময়।",
    "তোমাদের কী হলো যে, তোমরা আল্লাহর পথে ব্যয় করছ না ? অথচ আসমানসমূহ ও যমীনের উত্তরাধিকারতো আল্লাহরই? তোমাদের মধ্যে যারা মক্কা বিজয়ের পূর্বে ব্যয় করেছে এবং যুদ্ধ করেছে তারা সমান নয়। তারা মর্যাদায় তাদের চেয়ে শ্রেষ্ঠ, যারা পরে ব্যয় করেছে ও যুদ্ধ করেছে। তবে আল্লাহ প্রত্যেকের জন্যই কল্যাণের ওয়াদা করেছেন। আর তোমরা যা কর, সে সম্পর্কে আল্লাহ সবিশেষ অবগত।",
    "এমন কে আছে যে, আল্লাহকে উত্তম করয দিবে ? তাহলে তিনি তার জন্য তা বহুগুণে বৃদ্ধি করে দিবেন এবং তার জন্য রয়েছে সম্মানজনক প্রতিদান।",
    "সেদিন তুমি মুমিন পুরুষদের ও মুমিন নারীদের দেখতে পাবে যে, তাদের সামনে ও তাদের ডান পার্শ্বে তাদের নূর ছুটতে থাকবে। (বলা হবে) ‘আজ তোমাদের সুসংবাদ হল জান্নাত, যার তলদেশ দিয়ে নদীসমূহ প্রবাহিত, তথায় তোমরা স্থায়ী হবে। এটাই হল মহাসাফল্য।",
    "সেদিন মুনাফিক পুরুষ ও মুনাফিক নারীগণ ঈমানদারদের বলবে, ‘তোমরা আমাদের জন্য অপেক্ষা কর, তোমাদের নূর থেকে আমরা একটু নিয়ে নেই’, বলা হবে, ‘তোমরা তোমাদের পিছনে ফিরে যাও এবং নূরের সন্ধান কর,’ তারপর তাদের মাঝখানে একটি প্রাচীর স্থাপন করে দেয়া হবে, যাতে একটি দরজা থাকবে। তার ভিতরভাগে থাকবে রহমত এবং তার বহির্ভাগে থাকবে আযাব।",
    "মুনাফিকরা মুমিনদেরকে ডেকে বলবে, ‘আমরা কি তোমাদের সাথে ছিলাম না? তারা বলবে ‘হ্যাঁ, কিন্তু তোমরা নিজেরাই নিজদেরকে বিপদগ্রস্ত করেছ। আর তোমরা অপেক্ষা করেছিলে* এবং সন্দেহ পোষণ করেছিলে এবং আকাঙ্ক্ষা তোমাদেরকে প্রতারিত করেছিল, অবশেষে আল্লাহর নির্দেশ এসে গেল। আর মহা প্রতারক** তোমাদেরকে আল্লাহ সম্পর্কে প্রতারিত করেছিল। \n*আমাদের অমঙ্গলের। **শয়তান।",
    "সুতরাং আজ তোমাদের কাছ থেকে কোন মুক্তিপণ গ্রহণ করা হবে না এবং যারা কুফরী করেছিল তাদের কাছ থেকেও না। জাহান্নামই তোমাদের আবাসস্থল। সেটাই তোমাদের উপযুক্ত স্থান। আর কতই না নিকৃষ্ট সেই গন্তব্যস্থল!",
    "যারা ঈমান এনেছে তাদের হৃদয় কি আল্লাহর স্মরণে এবং যে সত্য নাযিল হয়েছে তার কারণে বিগলিত হওয়ার সময় হয়নি ? আর তারা যেন তাদের মত না হয়, যাদেরকে ইতঃপূর্বে কিতাব দেয়া হয়েছিল, তারপর তাদের উপর দিয়ে দীর্ঘকাল অতিক্রান্ত হল, অতঃপর তাদের অন্তরসমূহ কঠিন হয়ে গেল। আর তাদের অধিকাংশই ফাসিক।",
    "তোমরা জেনে রাখ যে, আল্লাহ্ যমীনকে তার মৃত্যুর পর পুনর্জীবিত করেন। আমি নিদর্শনসমূহ তোমাদের কাছে সুস্পষ্টভাবে বর্ণনা করেছি, আশা করা যায় তোমরা বুঝতে পারবে।",
    "নিশ্চয় দানশীল পুরুষ ও দানশীল নারী এবং যারা আল্লাহকে উত্তম করয দেয়, তাদের জন্য বহুগুণ বাড়িয়ে দেয়া হবে এবং তাদের জন্য রয়েছে সম্মানজনক প্রতিদান।",
    "আর যারা আল্লাহ ও তাঁর রাসূলদের প্রতি ঈমান আনে, তারাই তাদের রবের নিকট সিদ্দীক ও শহীদ। তাদের জন্য রয়েছে তাদের প্রতিফল এবং তাদের নূর। আর যারা কুফরী করে এবং আমার আয়াতসমূহ অস্বীকার করে, তারাই জাহান্নামের অধিবাসী।",
    "তোমরা জেনে রাখ যে, দুনিয়ার জীবন ক্রীড়া কৌতুক, শোভা-সৌন্দর্য, তোমাদের পারস্পরিক গর্ব-অহঙ্কার এবং ধন-সম্পদ ও সন্তান-সন্ততিতে আধিক্যের প্রতিযোগিতা মাত্র। এর উপমা হল বৃষ্টির মত, যার উৎপন্ন ফসল কৃষকদেরকে আনন্দ দেয়, তারপর তা শুকিয়ে যায়, তখন তুমি তা হলুদ বর্ণের দেখতে পাও, তারপর তা খড়-কুটায় পরিণত হয়। আর আখিরাতে আছে কঠিন আযাব এবং আল্লাহর পক্ষ থেকে ক্ষমা ও সন্তুষ্টি। আর দুনিয়ার জীবনটা তো ধোকার সামগ্রী ছাড়া আর কিছুই নয়।",
    "তোমরা তোমাদের রবের পক্ষ থেকে ক্ষমা ও সেই জান্নাতের দিকে প্রতিযোগিতায় অবতীর্ণ হও, যার প্রশস্ততা আসমান ও যমীনের প্রশস্ততার মত। তা প্রস্তত করা হয়েছে যারা আল্লাহ ও তাঁর রাসূলদের প্রতি ঈমান আনে তাদের জন্য। এটা আল্লাহর অনুগ্রহ। তিনি যাকে ইচ্ছা তা দান করেন। আর আল্লাহ মহা অনুগ্রহশীল।",
    "যমীনে এবং তোমাদের নিজদের মধ্যে এমন কোন মুসীবত আপতিত হয় না, যা আমি সংঘটিত করার পূর্বে কিতাবে লিপিবদ্ধ রাখি না। নিশ্চয় এটা আল্লাহর পক্ষে খুবই সহজ।",
    "যাতে তোমরা আফসোস না কর তার উপর যা তোমাদের থেকে হারিয়ে গেছে এবং তোমরা উৎফুল্ল না হও তিনি তোমাদেরকে যা দিয়েছেন তার কারণে। আর আল্লাহ কোন উদ্ধত ও অহঙ্কারীকে পছন্দ করেন না।",
    "যারা কৃপণতা করে এবং মানুষকে কৃপণতার নির্দেশ দেয়, আর যে মুখ ফিরিয়ে নেয়, তাহলে আল্লাহ নিশ্চয় অভাবমুক্ত, সপ্রশংসিত।",
    "নিশ্চয় আমি আমার রাসূলদেরকে স্পষ্ট প্রমাণাদিসহ পাঠিয়েছি এবং তাদের সাথে কিতাব ও (ন্যায়ের) মানদন্ড নাযিল করেছি, যাতে মানুষ সুবিচার প্রতিষ্ঠা করে। আমি আরো নাযিল করেছি লোহা, তাতে প্রচন্ড শক্তি ও মানুষের জন্য বহু কল্যাণ রয়েছে। আর যাতে আল্লাহ জেনে নিতে পারেন, কে না দেখেও তাঁকে ও তাঁর রাসূলদেরকে সাহায্য করে। অবশ্যই আল্লাহ মহাশক্তিধর, মহাপরাক্রমশালী।",
    "আর আমি তো নূহ ও ইবরাহীমকে রাসূলরূপে পাঠিয়েছিলাম এবং তাদের বংশধরদের মধ্যে নবুওয়াত ও কিতাব দিয়েছিলাম। তারপর তাদের মধ্যে কেউ কেউ সঠিক পথ অবলম্বনকারী ছিল, আর তাদের অধিকাংশই ছিল ফাসিক।",
    "তারপর তাদের পিছনে আমি আমার রাসূলদেরকে অনুগামী করেছিলাম এবং মারইয়াম পুত্র ঈসাকেও অনুগামী করেছিলাম। আর তাকে ইনজীল কিতাব দিয়েছিলাম এবং যারা তার অনুসরণ করেছিল তাদের অন্তরসমূহে করুণা ও দয়ামায়া দিয়েছিলাম। আল্লাহর সন্তুষ্টি লাভের আশায় তারাই বৈরাগ্যবাদের প্রবর্তন করেছিল। এটা আমি তাদের ওপর লিপিবদ্ধ করে দেইনি। তারপর তাও তারা যথাযথভাবে রক্ষণাবেক্ষণ করেনি। আর তাদের মধ্যে যারা ঈমান এনেছিল তাদেরকে আমি তাদের প্রতিদান দিয়েছিলাম এবং তাদের মধ্যে অধিকাংশই ছিল ফাসিক।",
    "হে মুমিনগণ, তোমরা আল্লাহকে ভয় কর এবং তাঁর রাসূলের প্রতি ঈমান আন, তিনি স্বীয় রহমতে তোমাদেরকে দ্বিগুণ পুরস্কার দেবেন, আর তোমাদেরকে নূর দেবেন যার সাহায্যে তোমরা চলতে পারবে এবং তিনি তোমাদেরকে ক্ষমা করে দেবেন। আর আল্লাহ বড়ই ক্ষমাশীল, পরম দয়ালু।",
    "(তা এজন্য যে,) আহলে কিতাবগণ যেন জেনে নিতে পারে, আল্লাহর অনুগ্রহের কোন বস্তুতেই তারা ক্ষমতা রাখে না। আর নিশ্চয় অনুগ্রহ আল্লাহর হাতেই, যাকে ইচ্ছা তিনি তা দেন। আর আল্লাহ মহাঅনুগ্রহের অধিকারী।"
  ]
}