{
  "surahName": "Yunus",
  "surahNameArabic": "يونس",
  "surahNameArabicLong": "سورة يونس",
  "surahNameTranslation": "Jonas",
  "revelationPlace": "Mecca",
  "totalAyah": 109,
  "surahNo": 10,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/10.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/010.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/10.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/010.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/10.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/010.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/10.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/010.mp3"
    }
  },
  "english": [
    "Alif-Lãm-Ra. These are the verses of the Book, rich in wisdom.",
    "Is it astonishing to people that We have sent revelation to a man from among themselves, ˹instructing him,˺ “Warn humanity and give good news to the believers that they will have an honourable status with their Lord.”? Yet the disbelievers said, “Indeed, this ˹man˺ is clearly a magician!”",
    "Surely your Lord is Allah Who created the heavens and the earth in six Days, then established Himself on the Throne, conducting every affair. None can intercede except by His permission. That is Allah—your Lord, so worship Him ˹alone˺. Will you not then be mindful?",
    "To Him is your return all together. Allah’s promise is ˹always˺ true. Indeed, He originates the creation then resurrects it so that He may justly reward those who believe and do good. But those who disbelieve will have a boiling drink and a painful punishment for their disbelief.",
    "He is the One Who made the sun a radiant source and the moon a reflected light, with precisely ordained phases, so that you may know the number of years and calculation ˹of time˺. Allah did not create all this except for a purpose. He makes the signs clear for people of knowledge.",
    "Surely in the alternation of the day and the night, and in all that Allah has created in the heavens and the earth, there are truly signs for those mindful ˹of Him˺.",
    "Indeed, those who do not expect to meet Us, being pleased and content with this worldly life, and who are heedless of Our signs",
    "they will have the Fire as a home because of what they have committed.",
    "Surely those who believe and do good, their Lord will guide them ˹to Paradise˺ through their faith, rivers will flow under their feet in the Gardens of Bliss",
    "in which their prayer will be, “Glory be to You, O  Allah!” and their greeting will be, “Peace!” and their closing prayer will be, “All praise is for Allah—Lord of all worlds!”",
    "If Allah were to hasten evil for people as they wish to hasten good, they would have certainly been doomed. But We leave those who do not expect to meet Us to wander blindly in their defiance.",
    "Whenever someone is touched by hardship, they cry out to Us, whether lying on their side, sitting, or standing. But when We relieve their hardship, they return to their old ways as if they had never cried to Us to remove any hardship! This is how the misdeeds of the transgressors have been made appealing to them.",
    "We surely destroyed ˹other˺ peoples before you when they did wrong, and their messengers came to them with clear proofs but they would not believe! This is how We reward the wicked people.",
    "Then We made you their successors in the land to see how you would act.",
    "When Our clear revelations are recited to them, those who do not expect to meet Us say ˹to the Prophet˺, “Bring us a different Quran or make some changes in it.” Say ˹to them˺, “It is not for me to change it on my own. I only follow what is revealed to me. I fear, if I were to disobey my Lord, the punishment of a tremendous Day.”",
    "Say, “Had Allah willed, I would not have recited it to you, nor would He have made it known to you. I had lived my whole life among you before this ˹revelation˺. Do you not understand?”",
    "Who does more wrong than those who fabricate lies against Allah or deny His revelations? Indeed, the wicked will never succeed.",
    "They worship besides Allah others who can neither harm nor benefit them, and say, “These are our intercessors with Allah.” Ask ˹them, O  Prophet˺, “Are you informing Allah of something He does not know in the heavens or the earth? Glorified and Exalted is He above what they associate ˹with Him˺!”",
    "Humanity was once nothing but a single community ˹of believers˺, but then they differed. Had it not been for a prior decree from your Lord, their differences would have been settled ˹at once˺.",
    "They ask, “Why has no ˹other˺ sign been sent down to him from his Lord?” Say, ˹O Prophet,˺ “˹The knowledge of˺ the unseen is with Allah alone. So wait! I too am waiting with you.”",
    "When We give people a taste of mercy after being afflicted with a hardship, they swiftly devise plots against Our revelations! Say, ˹O Prophet,˺ “Allah is swifter in devising ˹punishment˺. Surely Our messenger-angels record whatever you devise.”",
    "He is the One Who enables you to travel through land and sea. And it so happens that you are on ships, sailing with a favourable wind, to the passengers’ delight. Suddenly, the ships are overcome by a gale wind and those on board are overwhelmed by waves from every side, and they assume they are doomed. They cry out to Allah ˹alone˺ in sincere devotion, “If You save us from this, we will certainly be grateful.”",
    "But as soon as He rescues them, they transgress in the land unjustly. O  humanity! Your transgression is only against your own souls. ˹There is only˺ brief enjoyment in this worldly life, then to Us is your return, and then We will inform you of what you used to do.",
    "The life of this world is just like rain We send down from the sky, producing a mixture of plants which humans and animals consume. Then just as the earth looks its best, perfectly beautified, and its people think they have full control over it, there comes to it Our command by night or by day, so We mow it down as if it never flourished yesterday! This is how We make the signs clear for people who reflect.",
    "And Allah invites ˹all˺ to the Home of Peace and guides whoever He wills to the Straight Path.",
    "Those who do good will have the finest reward and ˹even˺ more. Neither gloom nor disgrace will cover their faces. It is they who will be the residents of Paradise. They will be there forever.",
    "As for those who commit evil, the reward of an evil deed is its equivalent. Humiliation will cover them—with no one to protect them from Allah—as if their faces were covered with patches of the night’s deep darkness. It is they who will be the residents of the Fire. They will be there forever.",
    "˹Consider˺ the Day We will gather them all together then say to those who associated others ˹with Allah in worship˺, “Stay in your places—you and your associate-gods.” We will separate them from each other, and their associate-gods will say, “It was not us that you worshipped!",
    "Allah is sufficient as a Witness between each of us that we were totally unaware of your worship.”",
    "Then and there every soul will face ˹the consequences of˺ what it had done. They all will be returned to Allah—their True Master. And whatever ˹gods˺ they fabricated will fail them.",
    "Ask ˹them, O  Prophet˺, “Who provides for you from heaven and earth? Who owns ˹your˺ hearing and sight? Who brings forth the living from the dead and the dead from the living? And who conducts every affair?” They will ˹surely˺ say, “Allah.” Say, “Will you not then fear ˹Him˺?",
    "That is Allah—your True Lord. So what is beyond the truth except falsehood? How can you then be turned away?”",
    "And so your Lord’s decree has been proven true against the rebellious—that they will never believe.",
    "Ask ˹them, O  Prophet˺, “Can any of your associate-gods originate creation and then resurrect it?” Say, “˹Only˺ Allah originates creation and then resurrects it. How can you then be deluded ˹from the truth˺?”",
    "Ask ˹them, O  Prophet˺, “Can any of your associate-gods guide to the truth?” Say, “˹Only˺ Allah guides to the truth.” Who then is more worthy to be followed: the One Who guides to the truth or those who cannot find the way unless guided? What is the matter with you? How do you judge?",
    "Most of them follow nothing but ˹inherited˺ assumptions. ˹And˺ surely assumptions can in no way replace the truth. Allah is indeed All-Knowing of what they do.",
    "It is not ˹possible˺ for this Quran to have been produced by anyone other than Allah. In fact, it is a confirmation of what came before, and an explanation of the Scripture. It is, without a doubt, from the Lord of all worlds.",
    "Or do they claim, “He made it up!”? Tell them ˹O Prophet˺, “Produce one sûrah like it then, and seek help from whoever you can—other than Allah—if what you say is true!”",
    "In fact, they ˹hastily˺ rejected the Book without comprehending it and before the fulfilment of its warnings. Similarly, those before them were in denial. See then what was the end of the wrongdoers!",
    "Some of them will ˹eventually˺ believe in it; others will not. And your Lord knows best the corruptors.",
    "If they deny you, then say, “My deeds are mine and your deeds are yours. You are free of what I do and I am free of what you do!”",
    "Some of them listen to what you say, but can you make the deaf hear even though they do not understand?",
    "And some of them look at you, but can you guide the blind even though they cannot see?",
    "Indeed, Allah does not wrong people in the least, but it is people who wrong themselves.",
    "On the Day He will gather them, it will be as if they had not stayed ˹in the world˺ except for an hour of a day, ˹as though they were only˺ getting to know one another. Lost indeed will be those who denied the meeting with Allah, and were not ˹rightly˺ guided!",
    "Whether We show you ˹O Prophet˺ some of what We threaten them with, or cause you to die ˹before that˺, to Us is their return and Allah is a Witness over what they do.",
    "And for every community there is a messenger. After their messenger has come, judgment is passed on them in all fairness, and they are not wronged.",
    "They ask ˹the believers˺, “When will this threat come to pass if what you say is true?”",
    "Say, ˹O Prophet,˺ “I have no power to benefit or protect myself, except by the Will of Allah.” For each community there is an appointed term. When their time arrives, they cannot delay it for a moment, nor could they advance it.",
    "Tell them ˹O Prophet˺, “Imagine if His torment were to overcome you by night or day—do the wicked realize what they are ˹really˺ asking Him to hasten?",
    "Will you believe in it only after it has overtaken you? Now? But you always wanted to hasten it!”",
    "Then the wrongdoers will be told, “Taste the torment of eternity! Are you not rewarded except for what you used to commit?”",
    "They ask you ˹O Prophet˺, “Is this true?” Say, “Yes, by my Lord! Most certainly it is true! And you will have no escape.”",
    "If every wrongdoer were to possess everything in the world, they would surely ransom themselves with it. They will hide ˹their˺ remorse when they see the torment. And they will be judged in all fairness, and none will be wronged.",
    "Surely to Allah belongs whatever is in the heavens and the earth. Surely Allah’s promise is ˹always˺ true, but most of them do not know.",
    "He ˹is the One Who˺ gives life and causes death, and to Him you will ˹all˺ be returned.",
    "O humanity! Indeed, there has come to you a warning from your Lord, a cure for what is in the hearts, a guide, and a mercy for the believers.",
    "Say, ˹O Prophet,˺ “In Allah’s grace and mercy let them rejoice. That is far better than whatever ˹wealth˺ they amass.”",
    "Ask ˹the pagans, O  Prophet˺, “Have you seen that which Allah has sent down for you as a provision, of which you have made some lawful and some unlawful?” Say, “Has Allah given you authorization, or are you fabricating lies against Allah?”",
    "What do those who fabricate lies against Allah expect on Judgment Day? Surely Allah is ever Bountiful to humanity, but most of them are ungrateful.",
    "There is no activity you may be engaged in ˹O Prophet˺ or portion of the Quran you may be reciting, nor any deed you ˹all˺ may be doing except that We are a Witness over you while doing it. Not ˹even˺ an atom’s weight is hidden from your Lord on earth or in heaven; nor anything smaller or larger than that, but is ˹written˺ in a perfect Record.",
    "There will certainly be no fear for the close servants of Allah, nor will they grieve.",
    "˹They are˺ those who are faithful and are mindful ˹of Him˺.",
    "For them is good news in this worldly life and the Hereafter. There is no change in the promise of Allah. That is ˹truly˺ the ultimate triumph.",
    "Do not let their words grieve you ˹O Prophet˺. Surely all honour and power belongs to Allah. He is the All-Hearing, All-Knowing.",
    "Certainly to Allah ˹alone˺ belong all those in the heavens and all those on the earth. And what do those who associate others with Allah really follow? They follow nothing but assumptions and do nothing but lie.",
    "He is the One Who has made the night for you to rest in and the day bright. Surely in this are signs for people who listen.",
    "They say, “Allah has offspring.” Glory be to Him! He is the Self-Sufficient. To Him belongs whatever is in the heavens and whatever is on the earth. You have no proof of this! Do you say about Allah what you do not know?",
    "Say, ˹O Prophet,˺ “Indeed, those who fabricate lies against Allah will never succeed.”",
    "˹It is only˺ a brief enjoyment in this world, then to Us is their return, then We will make them taste the severe punishment for their disbelief.",
    "Relate to them ˹O Prophet˺ the story of Noah when he said to his people, “O my People! If my presence and my reminders to you of Allah’s signs are unbearable to you, then ˹know that˺ I have put my trust in Allah. So devise a plot along with your associate-gods—and you do not have to be secretive about your plot—then carry it out against me without delay!",
    "And if you turn away, ˹remember˺ I have never demanded a reward from you ˹for delivering the message˺. My reward is only from Allah. And I have been commanded to be one of those who submit ˹to Allah˺.”",
    "But they still rejected him, so We saved him and those with him in the Ark and made them successors, and drowned those who rejected Our signs. See then what was the end of those who had been warned!",
    "Then after him We sent ˹other˺ messengers to their ˹own˺ people and they came to them with clear proofs. But they would not believe in what they had rejected before. This is how We seal the hearts of the transgressors.",
    "Then after these ˹messengers˺ We sent Moses and Aaron to Pharaoh and his chiefs with Our signs. But they behaved arrogantly and were a wicked people.",
    "When the truth came to them from Us, they said, “This is certainly pure magic!”",
    "Moses responded, “Is this what you say about the truth when it has come to you? Is this magic? Magicians will never succeed.”",
    "They argued, “Have you come to turn us away from the faith of our forefathers so that the two of you may become supreme in the land? We will never believe in you!”",
    "Pharaoh demanded, “Bring me every skilled magician.”",
    "When the magicians came, Moses said to them, “Cast whatever you wish to cast!”",
    "When they did, Moses said, “What you have produced is mere magic, Allah will surely make it useless, for Allah certainly does not set right the work of the corruptors.",
    "And Allah establishes the truth by His Words—even to the dismay of the wicked.”",
    "But no one believed in Moses except a few youths of his people, while fearing that Pharaoh and their own chiefs might persecute them. And certainly Pharaoh was a tyrant in the land, and he was truly a transgressor.",
    "Moses said, “O my people! If you do believe in Allah and submit ˹to His Will˺, then put your trust in Him.”",
    "They replied, “In Allah we trust. Our Lord! Do not subject us to the persecution of the oppressive people",
    "and deliver us by Your mercy from the disbelieving people.”",
    "We revealed to Moses and his brother, “Appoint houses for your people in Egypt. Turn these houses into places of worship, establish prayer, and give good news to the believers!”",
    "Moses prayed, “Our Lord! You have granted Pharaoh and his chiefs luxuries and riches in this worldly life, ˹which they abused˺ to lead people astray from Your Way! Our Lord, destroy their riches and harden their hearts so that they will not believe until they see the painful punishment.”",
    "Allah responded ˹to Moses and Aaron˺, “Your prayer is answered! So be steadfast and do not follow the way of those who do not know.”",
    "We brought the Children of Israel across the sea. Then Pharaoh and his soldiers pursued them unjustly and oppressively. But as Pharaoh was drowning, he cried out, “I believe that there is no god except that in whom the Children of Israel believe, and I am ˹now˺ one of those who submit.”",
    "˹He was told,˺ “Now ˹you believe˺? But you always disobeyed and were one of the corruptors.",
    "Today We will preserve your corpse so that you may become an example for those who come after you. And surely most people are heedless of Our examples!”",
    "Indeed, We settled the Children of Israel in a blessed land, and granted them good, lawful provisions. They did not differ until knowledge came to them. Surely your Lord will judge between them on the Day of Judgment regarding their differences.",
    "If you ˹O Prophet˺ are in doubt about ˹these stories˺ that We have revealed to you, then ask those who read the Scripture before you. The truth has certainly come to you from your Lord, so do not be one of those who doubt",
    "and do not be one of those who deny Allah’s signs or you will be one of the losers.",
    "Indeed, those against whom Allah’s decree ˹of torment˺ is justified will not believe—",
    "even if every sign were to come to them—until they see the painful punishment.",
    "If only there had been a society which believed ˹before seeing the torment˺ and, therefore, benefited from its belief, like the people of Jonah. When they believed, We lifted from them the torment of disgrace in this world and allowed them enjoyment for a while.",
    "Had your Lord so willed ˹O Prophet˺, all ˹people˺ on earth would have certainly believed, every single one of them! Would you then force people to become believers?",
    "It is not for any soul to believe except by Allah’s leave, and He will bring His wrath upon those who are unmindful.",
    "Say, ˹O Prophet,˺ “Consider all that is in the heavens and the earth!” Yet neither signs nor warners are of any benefit to those who refuse to believe.",
    "Are they waiting for ˹anything˺ except the same torments that befell those before them? Say, “Keep waiting then! I too am waiting with you.”",
    "Then We saved Our messengers and those who believed. For it is Our duty to save the believers.",
    "Say, ˹O Prophet,˺ “O humanity! If you are in doubt of my faith, then ˹know that˺ I do not worship those ˹idols˺ you worship instead of Allah. But I worship Allah, Who has the power to cause your death. And I have been commanded, ‘Be one of the believers,’",
    "and, ‘Be steadfast in faith in all uprightness, and do not be one of the polytheists,’",
    "and ‘Do not invoke, instead of Allah, what can neither benefit nor harm you—for if you do, then you will certainly be one of the wrongdoers,’",
    "and ‘If Allah touches you with harm, none can undo it except Him. And if He intends good for you, none can withhold His bounty. He grants it to whoever He wills of His servants. And He is the All-Forgiving, Most Merciful.’”",
    "Say, ˹O Prophet,˺ “O humanity! The truth has surely come to you from your Lord. So whoever chooses to be guided, it is only for their own good. And whoever chooses to stray, it is only to their own loss. And I am not a keeper over you.”",
    "And follow what is revealed to you, and be patient until Allah passes His judgment. For He is the Best of Judges."
  ],
  "arabic1": [
    "الٓرٰ ۫ تِلْكَ اٰیٰتُ الْكِتٰبِ الْحَكِیْمِ",
    "اَكَانَ لِلنَّاسِ عَجَبًا اَنْ اَوْحَیْنَاۤ اِلٰی رَجُلٍ مِّنْهُمْ اَنْ اَنْذِرِ النَّاسَ وَبَشِّرِ الَّذِیْنَ اٰمَنُوْۤا اَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ قَالَ الْكٰفِرُوْنَ اِنَّ هٰذَا لَسٰحِرٌ مُّبِیْنٌ",
    "اِنَّ رَبَّكُمُ اللّٰهُ الَّذِیْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ فِیْ سِتَّةِ اَیَّامٍ ثُمَّ اسْتَوٰی عَلَی الْعَرْشِ یُدَبِّرُ الْاَمْرَ مَا مِنْ شَفِیْعٍ اِلَّا مِنْ بَعْدِ اِذْنِهٖ ذٰلِكُمُ اللّٰهُ رَبُّكُمْ فَاعْبُدُوْهُ اَفَلَا تَذَكَّرُوْنَ",
    "اِلَیْهِ مَرْجِعُكُمْ جَمِیْعًا وَعْدَ اللّٰهِ حَقًّا اِنَّهٗ یَبْدَؤُا الْخَلْقَ ثُمَّ یُعِیْدُهٗ لِیَجْزِیَ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ بِالْقِسْطِ وَالَّذِیْنَ كَفَرُوْا لَهُمْ شَرَابٌ مِّنْ حَمِیْمٍ وَّعَذَابٌ اَلِیْمٌ بِمَا كَانُوْا یَكْفُرُوْنَ",
    "هُوَ الَّذِیْ جَعَلَ الشَّمْسَ ضِیَآءً وَّالْقَمَرَ نُوْرًا وَّقَدَّرَهٗ مَنَازِلَ لِتَعْلَمُوْا عَدَدَ السِّنِیْنَ وَالْحِسَابَ مَا خَلَقَ اللّٰهُ ذٰلِكَ اِلَّا بِالْحَقِّ یُفَصِّلُ الْاٰیٰتِ لِقَوْمٍ یَّعْلَمُوْنَ",
    "اِنَّ فِی اخْتِلَافِ الَّیْلِ وَالنَّهَارِ وَمَا خَلَقَ اللّٰهُ فِی السَّمٰوٰتِ وَالْاَرْضِ لَاٰیٰتٍ لِّقَوْمٍ یَّتَّقُوْنَ",
    "اِنَّ الَّذِیْنَ لَا یَرْجُوْنَ لِقَآءَنَا وَرَضُوْا بِالْحَیٰوةِ الدُّنْیَا وَاطْمَاَنُّوْا بِهَا وَالَّذِیْنَ هُمْ عَنْ اٰیٰتِنَا غٰفِلُوْنَ",
    "اُولٰٓىِٕكَ مَاْوٰىهُمُ النَّارُ بِمَا كَانُوْا یَكْسِبُوْنَ",
    "اِنَّ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ یَهْدِیْهِمْ رَبُّهُمْ بِاِیْمَانِهِمْ تَجْرِیْ مِنْ تَحْتِهِمُ الْاَنْهٰرُ فِیْ جَنّٰتِ النَّعِیْمِ",
    "دَعْوٰىهُمْ فِیْهَا سُبْحٰنَكَ اللّٰهُمَّ وَتَحِیَّتُهُمْ فِیْهَا سَلٰمٌ وَاٰخِرُ دَعْوٰىهُمْ اَنِ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِیْنَ",
    "وَلَوْ یُعَجِّلُ اللّٰهُ لِلنَّاسِ الشَّرَّ اسْتِعْجَالَهُمْ بِالْخَیْرِ لَقُضِیَ اِلَیْهِمْ اَجَلُهُمْ فَنَذَرُ الَّذِیْنَ لَا یَرْجُوْنَ لِقَآءَنَا فِیْ طُغْیَانِهِمْ یَعْمَهُوْنَ",
    "وَاِذَا مَسَّ الْاِنْسَانَ الضُّرُّ دَعَانَا لِجَنْۢبِهٖۤ اَوْ قَاعِدًا اَوْ قَآىِٕمًا فَلَمَّا كَشَفْنَا عَنْهُ ضُرَّهٗ مَرَّ كَاَنْ لَّمْ یَدْعُنَاۤ اِلٰی ضُرٍّ مَّسَّهٗ كَذٰلِكَ زُیِّنَ لِلْمُسْرِفِیْنَ مَا كَانُوْا یَعْمَلُوْنَ",
    "وَلَقَدْ اَهْلَكْنَا الْقُرُوْنَ مِنْ قَبْلِكُمْ لَمَّا ظَلَمُوْا وَجَآءَتْهُمْ رُسُلُهُمْ بِالْبَیِّنٰتِ وَمَا كَانُوْا لِیُؤْمِنُوْا كَذٰلِكَ نَجْزِی الْقَوْمَ الْمُجْرِمِیْنَ",
    "ثُمَّ جَعَلْنٰكُمْ خَلٰٓىِٕفَ فِی الْاَرْضِ مِنْ بَعْدِهِمْ لِنَنْظُرَ كَیْفَ تَعْمَلُوْنَ",
    "وَاِذَا تُتْلٰی عَلَیْهِمْ اٰیَاتُنَا بَیِّنٰتٍ قَالَ الَّذِیْنَ لَا یَرْجُوْنَ لِقَآءَنَا ائْتِ بِقُرْاٰنٍ غَیْرِ هٰذَاۤ اَوْ بَدِّلْهُ قُلْ مَا یَكُوْنُ لِیْۤ اَنْ اُبَدِّلَهٗ مِنْ تِلْقَآئِ نَفْسِیْ اِنْ اَتَّبِعُ اِلَّا مَا یُوْحٰۤی اِلَیَّ اِنِّیْۤ اَخَافُ اِنْ عَصَیْتُ رَبِّیْ عَذَابَ یَوْمٍ عَظِیْمٍ",
    "قُلْ لَّوْ شَآءَ اللّٰهُ مَا تَلَوْتُهٗ عَلَیْكُمْ وَلَاۤ اَدْرٰىكُمْ بِهٖ ۖ فَقَدْ لَبِثْتُ فِیْكُمْ عُمُرًا مِّنْ قَبْلِهٖ اَفَلَا تَعْقِلُوْنَ",
    "فَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰی عَلَی اللّٰهِ كَذِبًا اَوْ كَذَّبَ بِاٰیٰتِهٖ اِنَّهٗ لَا یُفْلِحُ الْمُجْرِمُوْنَ",
    "وَیَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ مَا لَا یَضُرُّهُمْ وَلَا یَنْفَعُهُمْ وَیَقُوْلُوْنَ هٰۤؤُلَآءِ شُفَعَآؤُنَا عِنْدَ اللّٰهِ قُلْ اَتُنَبِّـُٔوْنَ اللّٰهَ بِمَا لَا یَعْلَمُ فِی السَّمٰوٰتِ وَلَا فِی الْاَرْضِ سُبْحٰنَهٗ وَتَعٰلٰی عَمَّا یُشْرِكُوْنَ",
    "وَمَا كَانَ النَّاسُ اِلَّاۤ اُمَّةً وَّاحِدَةً فَاخْتَلَفُوْا وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ لَقُضِیَ بَیْنَهُمْ فِیْمَا فِیْهِ یَخْتَلِفُوْنَ",
    "وَیَقُوْلُوْنَ لَوْلَاۤ اُنْزِلَ عَلَیْهِ اٰیَةٌ مِّنْ رَّبِّهٖ فَقُلْ اِنَّمَا الْغَیْبُ لِلّٰهِ فَانْتَظِرُوْا اِنِّیْ مَعَكُمْ مِّنَ الْمُنْتَظِرِیْنَ",
    "وَاِذَاۤ اَذَقْنَا النَّاسَ رَحْمَةً مِّنْ بَعْدِ ضَرَّآءَ مَسَّتْهُمْ اِذَا لَهُمْ مَّكْرٌ فِیْۤ اٰیَاتِنَا قُلِ اللّٰهُ اَسْرَعُ مَكْرًا اِنَّ رُسُلَنَا یَكْتُبُوْنَ مَا تَمْكُرُوْنَ",
    "هُوَ الَّذِیْ یُسَیِّرُكُمْ فِی الْبَرِّ وَالْبَحْرِ حَتّٰۤی اِذَا كُنْتُمْ فِی الْفُلْكِ وَجَرَیْنَ بِهِمْ بِرِیْحٍ طَیِّبَةٍ وَّفَرِحُوْا بِهَا جَآءَتْهَا رِیْحٌ عَاصِفٌ وَّجَآءَهُمُ الْمَوْجُ مِنْ كُلِّ مَكَانٍ وَّظَنُّوْۤا اَنَّهُمْ اُحِیْطَ بِهِمْ دَعَوُا اللّٰهَ مُخْلِصِیْنَ لَهُ الدِّیْنَ لَىِٕنْ اَنْجَیْتَنَا مِنْ هٰذِهٖ لَنَكُوْنَنَّ مِنَ الشّٰكِرِیْنَ",
    "فَلَمَّاۤ اَنْجٰىهُمْ اِذَا هُمْ یَبْغُوْنَ فِی الْاَرْضِ بِغَیْرِ الْحَقِّ یٰۤاَیُّهَا النَّاسُ اِنَّمَا بَغْیُكُمْ عَلٰۤی اَنْفُسِكُمْ مَّتَاعَ الْحَیٰوةِ الدُّنْیَا ثُمَّ اِلَیْنَا مَرْجِعُكُمْ فَنُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ",
    "اِنَّمَا مَثَلُ الْحَیٰوةِ الدُّنْیَا كَمَآءٍ اَنْزَلْنٰهُ مِنَ السَّمَآءِ فَاخْتَلَطَ بِهٖ نَبَاتُ الْاَرْضِ مِمَّا یَاْكُلُ النَّاسُ وَالْاَنْعَامُ حَتّٰۤی اِذَاۤ اَخَذَتِ الْاَرْضُ زُخْرُفَهَا وَازَّیَّنَتْ وَظَنَّ اَهْلُهَاۤ اَنَّهُمْ قٰدِرُوْنَ عَلَیْهَاۤ اَتٰىهَاۤ اَمْرُنَا لَیْلًا اَوْ نَهَارًا فَجَعَلْنٰهَا حَصِیْدًا كَاَنْ لَّمْ تَغْنَ بِالْاَمْسِ كَذٰلِكَ نُفَصِّلُ الْاٰیٰتِ لِقَوْمٍ یَّتَفَكَّرُوْنَ",
    "وَاللّٰهُ یَدْعُوْۤا اِلٰی دَارِ السَّلٰمِ وَیَهْدِیْ مَنْ یَّشَآءُ اِلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "لِلَّذِیْنَ اَحْسَنُوا الْحُسْنٰی وَزِیَادَةٌ وَلَا یَرْهَقُ وُجُوْهَهُمْ قَتَرٌ وَّلَا ذِلَّةٌ اُولٰٓىِٕكَ اَصْحٰبُ الْجَنَّةِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "وَالَّذِیْنَ كَسَبُوا السَّیِّاٰتِ جَزَآءُ سَیِّئَةٍ بِمِثْلِهَا وَتَرْهَقُهُمْ ذِلَّةٌ مَا لَهُمْ مِّنَ اللّٰهِ مِنْ عَاصِمٍ كَاَنَّمَاۤ اُغْشِیَتْ وُجُوْهُهُمْ قِطَعًا مِّنَ الَّیْلِ مُظْلِمًا اُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "وَیَوْمَ نَحْشُرُهُمْ جَمِیْعًا ثُمَّ نَقُوْلُ لِلَّذِیْنَ اَشْرَكُوْا مَكَانَكُمْ اَنْتُمْ وَشُرَكَآؤُكُمْ فَزَیَّلْنَا بَیْنَهُمْ وَقَالَ شُرَكَآؤُهُمْ مَّا كُنْتُمْ اِیَّانَا تَعْبُدُوْنَ",
    "فَكَفٰی بِاللّٰهِ شَهِیْدًا بَیْنَنَا وَبَیْنَكُمْ اِنْ كُنَّا عَنْ عِبَادَتِكُمْ لَغٰفِلِیْنَ",
    "هُنَالِكَ تَبْلُوْا كُلُّ نَفْسٍ مَّاۤ اَسْلَفَتْ وَرُدُّوْۤا اِلَی اللّٰهِ مَوْلٰىهُمُ الْحَقِّ وَضَلَّ عَنْهُمْ مَّا كَانُوْا یَفْتَرُوْنَ",
    "قُلْ مَنْ یَّرْزُقُكُمْ مِّنَ السَّمَآءِ وَالْاَرْضِ اَمَّنْ یَّمْلِكُ السَّمْعَ وَالْاَبْصَارَ وَمَنْ یُّخْرِجُ الْحَیَّ مِنَ الْمَیِّتِ وَیُخْرِجُ الْمَیِّتَ مِنَ الْحَیِّ وَمَنْ یُّدَبِّرُ الْاَمْرَ فَسَیَقُوْلُوْنَ اللّٰهُ فَقُلْ اَفَلَا تَتَّقُوْنَ",
    "فَذٰلِكُمُ اللّٰهُ رَبُّكُمُ الْحَقُّ فَمَاذَا بَعْدَ الْحَقِّ اِلَّا الضَّلٰلُ فَاَنّٰی تُصْرَفُوْنَ",
    "كَذٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَی الَّذِیْنَ فَسَقُوْۤا اَنَّهُمْ لَا یُؤْمِنُوْنَ",
    "قُلْ هَلْ مِنْ شُرَكَآىِٕكُمْ مَّنْ یَّبْدَؤُا الْخَلْقَ ثُمَّ یُعِیْدُهٗ قُلِ اللّٰهُ یَبْدَؤُا الْخَلْقَ ثُمَّ یُعِیْدُهٗ فَاَنّٰی تُؤْفَكُوْنَ",
    "قُلْ هَلْ مِنْ شُرَكَآىِٕكُمْ مَّنْ یَّهْدِیْۤ اِلَی الْحَقِّ قُلِ اللّٰهُ یَهْدِیْ لِلْحَقِّ اَفَمَنْ یَّهْدِیْۤ اِلَی الْحَقِّ اَحَقُّ اَنْ یُّتَّبَعَ اَمَّنْ لَّا یَهِدِّیْۤ اِلَّاۤ اَنْ یُّهْدٰی فَمَا لَكُمْ ۫ كَیْفَ تَحْكُمُوْنَ",
    "وَمَا یَتَّبِعُ اَكْثَرُهُمْ اِلَّا ظَنًّا اِنَّ الظَّنَّ لَا یُغْنِیْ مِنَ الْحَقِّ شَیْـًٔا اِنَّ اللّٰهَ عَلِیْمٌۢ بِمَا یَفْعَلُوْنَ",
    "وَمَا كَانَ هٰذَا الْقُرْاٰنُ اَنْ یُّفْتَرٰی مِنْ دُوْنِ اللّٰهِ وَلٰكِنْ تَصْدِیْقَ الَّذِیْ بَیْنَ یَدَیْهِ وَتَفْصِیْلَ الْكِتٰبِ لَا رَیْبَ فِیْهِ مِنْ رَّبِّ الْعٰلَمِیْنَ ۫",
    "اَمْ یَقُوْلُوْنَ افْتَرٰىهُ قُلْ فَاْتُوْا بِسُوْرَةٍ مِّثْلِهٖ وَادْعُوْا مَنِ اسْتَطَعْتُمْ مِّنْ دُوْنِ اللّٰهِ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "بَلْ كَذَّبُوْا بِمَا لَمْ یُحِیْطُوْا بِعِلْمِهٖ وَلَمَّا یَاْتِهِمْ تَاْوِیْلُهٗ كَذٰلِكَ كَذَّبَ الَّذِیْنَ مِنْ قَبْلِهِمْ فَانْظُرْ كَیْفَ كَانَ عَاقِبَةُ الظّٰلِمِیْنَ",
    "وَمِنْهُمْ مَّنْ یُّؤْمِنُ بِهٖ وَمِنْهُمْ مَّنْ لَّا یُؤْمِنُ بِهٖ وَرَبُّكَ اَعْلَمُ بِالْمُفْسِدِیْنَ",
    "وَاِنْ كَذَّبُوْكَ فَقُلْ لِّیْ عَمَلِیْ وَلَكُمْ عَمَلُكُمْ اَنْتُمْ بَرِیْٓـُٔوْنَ مِمَّاۤ اَعْمَلُ وَاَنَا بَرِیْٓءٌ مِّمَّا تَعْمَلُوْنَ",
    "وَمِنْهُمْ مَّنْ یَّسْتَمِعُوْنَ اِلَیْكَ اَفَاَنْتَ تُسْمِعُ الصُّمَّ وَلَوْ كَانُوْا لَا یَعْقِلُوْنَ",
    "وَمِنْهُمْ مَّنْ یَّنْظُرُ اِلَیْكَ اَفَاَنْتَ تَهْدِی الْعُمْیَ وَلَوْ كَانُوْا لَا یُبْصِرُوْنَ",
    "اِنَّ اللّٰهَ لَا یَظْلِمُ النَّاسَ شَیْـًٔا وَّلٰكِنَّ النَّاسَ اَنْفُسَهُمْ یَظْلِمُوْنَ",
    "وَیَوْمَ یَحْشُرُهُمْ كَاَنْ لَّمْ یَلْبَثُوْۤا اِلَّا سَاعَةً مِّنَ النَّهَارِ یَتَعَارَفُوْنَ بَیْنَهُمْ قَدْ خَسِرَ الَّذِیْنَ كَذَّبُوْا بِلِقَآءِ اللّٰهِ وَمَا كَانُوْا مُهْتَدِیْنَ",
    "وَاِمَّا نُرِیَنَّكَ بَعْضَ الَّذِیْ نَعِدُهُمْ اَوْ نَتَوَفَّیَنَّكَ فَاِلَیْنَا مَرْجِعُهُمْ ثُمَّ اللّٰهُ شَهِیْدٌ عَلٰی مَا یَفْعَلُوْنَ",
    "وَلِكُلِّ اُمَّةٍ رَّسُوْلٌ فَاِذَا جَآءَ رَسُوْلُهُمْ قُضِیَ بَیْنَهُمْ بِالْقِسْطِ وَهُمْ لَا یُظْلَمُوْنَ",
    "وَیَقُوْلُوْنَ مَتٰی هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "قُلْ لَّاۤ اَمْلِكُ لِنَفْسِیْ ضَرًّا وَّلَا نَفْعًا اِلَّا مَا شَآءَ اللّٰهُ لِكُلِّ اُمَّةٍ اَجَلٌ اِذَا جَآءَ اَجَلُهُمْ فَلَا یَسْتَاْخِرُوْنَ سَاعَةً وَّلَا یَسْتَقْدِمُوْنَ",
    "قُلْ اَرَءَیْتُمْ اِنْ اَتٰىكُمْ عَذَابُهٗ بَیَاتًا اَوْ نَهَارًا مَّاذَا یَسْتَعْجِلُ مِنْهُ الْمُجْرِمُوْنَ",
    "اَثُمَّ اِذَا مَا وَقَعَ اٰمَنْتُمْ بِهٖ آٰلْـٰٔنَ وَقَدْ كُنْتُمْ بِهٖ تَسْتَعْجِلُوْنَ",
    "ثُمَّ قِیْلَ لِلَّذِیْنَ ظَلَمُوْا ذُوْقُوْا عَذَابَ الْخُلْدِ هَلْ تُجْزَوْنَ اِلَّا بِمَا كُنْتُمْ تَكْسِبُوْنَ",
    "وَیَسْتَنْۢبِـُٔوْنَكَ اَحَقٌّ هُوَ قُلْ اِیْ وَرَبِّیْۤ اِنَّهٗ لَحَقٌّ وَمَاۤ اَنْتُمْ بِمُعْجِزِیْنَ",
    "وَلَوْ اَنَّ لِكُلِّ نَفْسٍ ظَلَمَتْ مَا فِی الْاَرْضِ لَافْتَدَتْ بِهٖ وَاَسَرُّوا النَّدَامَةَ لَمَّا رَاَوُا الْعَذَابَ وَقُضِیَ بَیْنَهُمْ بِالْقِسْطِ وَهُمْ لَا یُظْلَمُوْنَ",
    "اَلَاۤ اِنَّ لِلّٰهِ مَا فِی السَّمٰوٰتِ وَالْاَرْضِ اَلَاۤ اِنَّ وَعْدَ اللّٰهِ حَقٌّ وَّلٰكِنَّ اَكْثَرَهُمْ لَا یَعْلَمُوْنَ",
    "هُوَ یُحْیٖ وَیُمِیْتُ وَاِلَیْهِ تُرْجَعُوْنَ",
    "یٰۤاَیُّهَا النَّاسُ قَدْ جَآءَتْكُمْ مَّوْعِظَةٌ مِّنْ رَّبِّكُمْ وَشِفَآءٌ لِّمَا فِی الصُّدُوْرِ وَهُدًی وَّرَحْمَةٌ لِّلْمُؤْمِنِیْنَ",
    "قُلْ بِفَضْلِ اللّٰهِ وَبِرَحْمَتِهٖ فَبِذٰلِكَ فَلْیَفْرَحُوْا هُوَ خَیْرٌ مِّمَّا یَجْمَعُوْنَ",
    "قُلْ اَرَءَیْتُمْ مَّاۤ اَنْزَلَ اللّٰهُ لَكُمْ مِّنْ رِّزْقٍ فَجَعَلْتُمْ مِّنْهُ حَرَامًا وَّحَلٰلًا قُلْ آٰللّٰهُ اَذِنَ لَكُمْ اَمْ عَلَی اللّٰهِ تَفْتَرُوْنَ",
    "وَمَا ظَنُّ الَّذِیْنَ یَفْتَرُوْنَ عَلَی اللّٰهِ الْكَذِبَ یَوْمَ الْقِیٰمَةِ اِنَّ اللّٰهَ لَذُوْ فَضْلٍ عَلَی النَّاسِ وَلٰكِنَّ اَكْثَرَهُمْ لَا یَشْكُرُوْنَ",
    "وَمَا تَكُوْنُ فِیْ شَاْنٍ وَّمَا تَتْلُوْا مِنْهُ مِنْ قُرْاٰنٍ وَّلَا تَعْمَلُوْنَ مِنْ عَمَلٍ اِلَّا كُنَّا عَلَیْكُمْ شُهُوْدًا اِذْ تُفِیْضُوْنَ فِیْهِ وَمَا یَعْزُبُ عَنْ رَّبِّكَ مِنْ مِّثْقَالِ ذَرَّةٍ فِی الْاَرْضِ وَلَا فِی السَّمَآءِ وَلَاۤ اَصْغَرَ مِنْ ذٰلِكَ وَلَاۤ اَكْبَرَ اِلَّا فِیْ كِتٰبٍ مُّبِیْنٍ",
    "اَلَاۤ اِنَّ اَوْلِیَآءَ اللّٰهِ لَا خَوْفٌ عَلَیْهِمْ وَلَا هُمْ یَحْزَنُوْنَ",
    "الَّذِیْنَ اٰمَنُوْا وَكَانُوْا یَتَّقُوْنَ",
    "لَهُمُ الْبُشْرٰی فِی الْحَیٰوةِ الدُّنْیَا وَفِی الْاٰخِرَةِ لَا تَبْدِیْلَ لِكَلِمٰتِ اللّٰهِ ذٰلِكَ هُوَ الْفَوْزُ الْعَظِیْمُ",
    "وَلَا یَحْزُنْكَ قَوْلُهُمْ اِنَّ الْعِزَّةَ لِلّٰهِ جَمِیْعًا هُوَ السَّمِیْعُ الْعَلِیْمُ",
    "اَلَاۤ اِنَّ لِلّٰهِ مَنْ فِی السَّمٰوٰتِ وَمَنْ فِی الْاَرْضِ وَمَا یَتَّبِعُ الَّذِیْنَ یَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ شُرَكَآءَ اِنْ یَّتَّبِعُوْنَ اِلَّا الظَّنَّ وَاِنْ هُمْ اِلَّا یَخْرُصُوْنَ",
    "هُوَ الَّذِیْ جَعَلَ لَكُمُ الَّیْلَ لِتَسْكُنُوْا فِیْهِ وَالنَّهَارَ مُبْصِرًا اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّقَوْمٍ یَّسْمَعُوْنَ",
    "قَالُوا اتَّخَذَ اللّٰهُ وَلَدًا سُبْحٰنَهٗ هُوَ الْغَنِیُّ لَهٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ اِنْ عِنْدَكُمْ مِّنْ سُلْطٰنٍ بِهٰذَا اَتَقُوْلُوْنَ عَلَی اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "قُلْ اِنَّ الَّذِیْنَ یَفْتَرُوْنَ عَلَی اللّٰهِ الْكَذِبَ لَا یُفْلِحُوْنَ",
    "مَتَاعٌ فِی الدُّنْیَا ثُمَّ اِلَیْنَا مَرْجِعُهُمْ ثُمَّ نُذِیْقُهُمُ الْعَذَابَ الشَّدِیْدَ بِمَا كَانُوْا یَكْفُرُوْنَ",
    "وَاتْلُ عَلَیْهِمْ نَبَاَ نُوْحٍ اِذْ قَالَ لِقَوْمِهٖ یٰقَوْمِ اِنْ كَانَ كَبُرَ عَلَیْكُمْ مَّقَامِیْ وَتَذْكِیْرِیْ بِاٰیٰتِ اللّٰهِ فَعَلَی اللّٰهِ تَوَكَّلْتُ فَاَجْمِعُوْۤا اَمْرَكُمْ وَشُرَكَآءَكُمْ ثُمَّ لَا یَكُنْ اَمْرُكُمْ عَلَیْكُمْ غُمَّةً ثُمَّ اقْضُوْۤا اِلَیَّ وَلَا تُنْظِرُوْنِ",
    "فَاِنْ تَوَلَّیْتُمْ فَمَا سَاَلْتُكُمْ مِّنْ اَجْرٍ اِنْ اَجْرِیَ اِلَّا عَلَی اللّٰهِ وَاُمِرْتُ اَنْ اَكُوْنَ مِنَ الْمُسْلِمِیْنَ",
    "فَكَذَّبُوْهُ فَنَجَّیْنٰهُ وَمَنْ مَّعَهٗ فِی الْفُلْكِ وَجَعَلْنٰهُمْ خَلٰٓىِٕفَ وَاَغْرَقْنَا الَّذِیْنَ كَذَّبُوْا بِاٰیٰتِنَا فَانْظُرْ كَیْفَ كَانَ عَاقِبَةُ الْمُنْذَرِیْنَ",
    "ثُمَّ بَعَثْنَا مِنْ بَعْدِهٖ رُسُلًا اِلٰی قَوْمِهِمْ فَجَآءُوْهُمْ بِالْبَیِّنٰتِ فَمَا كَانُوْا لِیُؤْمِنُوْا بِمَا كَذَّبُوْا بِهٖ مِنْ قَبْلُ كَذٰلِكَ نَطْبَعُ عَلٰی قُلُوْبِ الْمُعْتَدِیْنَ",
    "ثُمَّ بَعَثْنَا مِنْ بَعْدِهِمْ مُّوْسٰی وَهٰرُوْنَ اِلٰی فِرْعَوْنَ وَمَلَاۡىِٕهٖ بِاٰیٰتِنَا فَاسْتَكْبَرُوْا وَكَانُوْا قَوْمًا مُّجْرِمِیْنَ",
    "فَلَمَّا جَآءَهُمُ الْحَقُّ مِنْ عِنْدِنَا قَالُوْۤا اِنَّ هٰذَا لَسِحْرٌ مُّبِیْنٌ",
    "قَالَ مُوْسٰۤی اَتَقُوْلُوْنَ لِلْحَقِّ لَمَّا جَآءَكُمْ اَسِحْرٌ هٰذَا وَلَا یُفْلِحُ السّٰحِرُوْنَ",
    "قَالُوْۤا اَجِئْتَنَا لِتَلْفِتَنَا عَمَّا وَجَدْنَا عَلَیْهِ اٰبَآءَنَا وَتَكُوْنَ لَكُمَا الْكِبْرِیَآءُ فِی الْاَرْضِ وَمَا نَحْنُ لَكُمَا بِمُؤْمِنِیْنَ",
    "وَقَالَ فِرْعَوْنُ ائْتُوْنِیْ بِكُلِّ سٰحِرٍ عَلِیْمٍ",
    "فَلَمَّا جَآءَ السَّحَرَةُ قَالَ لَهُمْ مُّوْسٰۤی اَلْقُوْا مَاۤ اَنْتُمْ مُّلْقُوْنَ",
    "فَلَمَّاۤ اَلْقَوْا قَالَ مُوْسٰی مَا جِئْتُمْ بِهِ السِّحْرُ اِنَّ اللّٰهَ سَیُبْطِلُهٗ اِنَّ اللّٰهَ لَا یُصْلِحُ عَمَلَ الْمُفْسِدِیْنَ",
    "وَیُحِقُّ اللّٰهُ الْحَقَّ بِكَلِمٰتِهٖ وَلَوْ كَرِهَ الْمُجْرِمُوْنَ",
    "فَمَاۤ اٰمَنَ لِمُوْسٰۤی اِلَّا ذُرِّیَّةٌ مِّنْ قَوْمِهٖ عَلٰی خَوْفٍ مِّنْ فِرْعَوْنَ وَمَلَاۡىِٕهِمْ اَنْ یَّفْتِنَهُمْ وَاِنَّ فِرْعَوْنَ لَعَالٍ فِی الْاَرْضِ وَاِنَّهٗ لَمِنَ الْمُسْرِفِیْنَ",
    "وَقَالَ مُوْسٰی یٰقَوْمِ اِنْ كُنْتُمْ اٰمَنْتُمْ بِاللّٰهِ فَعَلَیْهِ تَوَكَّلُوْۤا اِنْ كُنْتُمْ مُّسْلِمِیْنَ",
    "فَقَالُوْا عَلَی اللّٰهِ تَوَكَّلْنَا رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظّٰلِمِیْنَ",
    "وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكٰفِرِیْنَ",
    "وَاَوْحَیْنَاۤ اِلٰی مُوْسٰی وَاَخِیْهِ اَنْ تَبَوَّاٰ لِقَوْمِكُمَا بِمِصْرَ بُیُوْتًا وَّاجْعَلُوْا بُیُوْتَكُمْ قِبْلَةً وَّاَقِیْمُوا الصَّلٰوةَ وَبَشِّرِ الْمُؤْمِنِیْنَ",
    "وَقَالَ مُوْسٰی رَبَّنَاۤ اِنَّكَ اٰتَیْتَ فِرْعَوْنَ وَمَلَاَهٗ زِیْنَةً وَّاَمْوَالًا فِی الْحَیٰوةِ الدُّنْیَا رَبَّنَا لِیُضِلُّوْا عَنْ سَبِیْلِكَ رَبَّنَا اطْمِسْ عَلٰۤی اَمْوَالِهِمْ وَاشْدُدْ عَلٰی قُلُوْبِهِمْ فَلَا یُؤْمِنُوْا حَتّٰی یَرَوُا الْعَذَابَ الْاَلِیْمَ",
    "قَالَ قَدْ اُجِیْبَتْ دَّعْوَتُكُمَا فَاسْتَقِیْمَا وَلَا تَتَّبِعٰٓنِّ سَبِیْلَ الَّذِیْنَ لَا یَعْلَمُوْنَ",
    "وَجٰوَزْنَا بِبَنِیْۤ اِسْرَآءِیْلَ الْبَحْرَ فَاَتْبَعَهُمْ فِرْعَوْنُ وَجُنُوْدُهٗ بَغْیًا وَّعَدْوًا حَتّٰۤی اِذَاۤ اَدْرَكَهُ الْغَرَقُ قَالَ اٰمَنْتُ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا الَّذِیْۤ اٰمَنَتْ بِهٖ بَنُوْۤا اِسْرَآءِیْلَ وَاَنَا مِنَ الْمُسْلِمِیْنَ",
    "آٰلْـٰٔنَ وَقَدْ عَصَیْتَ قَبْلُ وَكُنْتَ مِنَ الْمُفْسِدِیْنَ",
    "فَالْیَوْمَ نُنَجِّیْكَ بِبَدَنِكَ لِتَكُوْنَ لِمَنْ خَلْفَكَ اٰیَةً وَاِنَّ كَثِیْرًا مِّنَ النَّاسِ عَنْ اٰیٰتِنَا لَغٰفِلُوْنَ",
    "وَلَقَدْ بَوَّاْنَا بَنِیْۤ اِسْرَآءِیْلَ مُبَوَّاَ صِدْقٍ وَّرَزَقْنٰهُمْ مِّنَ الطَّیِّبٰتِ فَمَا اخْتَلَفُوْا حَتّٰی جَآءَهُمُ الْعِلْمُ اِنَّ رَبَّكَ یَقْضِیْ بَیْنَهُمْ یَوْمَ الْقِیٰمَةِ فِیْمَا كَانُوْا فِیْهِ یَخْتَلِفُوْنَ",
    "فَاِنْ كُنْتَ فِیْ شَكٍّ مِّمَّاۤ اَنْزَلْنَاۤ اِلَیْكَ فَسْـَٔلِ الَّذِیْنَ یَقْرَءُوْنَ الْكِتٰبَ مِنْ قَبْلِكَ لَقَدْ جَآءَكَ الْحَقُّ مِنْ رَّبِّكَ فَلَا تَكُوْنَنَّ مِنَ الْمُمْتَرِیْنَ",
    "وَلَا تَكُوْنَنَّ مِنَ الَّذِیْنَ كَذَّبُوْا بِاٰیٰتِ اللّٰهِ فَتَكُوْنَ مِنَ الْخٰسِرِیْنَ",
    "اِنَّ الَّذِیْنَ حَقَّتْ عَلَیْهِمْ كَلِمَتُ رَبِّكَ لَا یُؤْمِنُوْنَ",
    "وَلَوْ جَآءَتْهُمْ كُلُّ اٰیَةٍ حَتّٰی یَرَوُا الْعَذَابَ الْاَلِیْمَ",
    "فَلَوْلَا كَانَتْ قَرْیَةٌ اٰمَنَتْ فَنَفَعَهَاۤ اِیْمَانُهَاۤ اِلَّا قَوْمَ یُوْنُسَ لَمَّاۤ اٰمَنُوْا كَشَفْنَا عَنْهُمْ عَذَابَ الْخِزْیِ فِی الْحَیٰوةِ الدُّنْیَا وَمَتَّعْنٰهُمْ اِلٰی حِیْنٍ",
    "وَلَوْ شَآءَ رَبُّكَ لَاٰمَنَ مَنْ فِی الْاَرْضِ كُلُّهُمْ جَمِیْعًا اَفَاَنْتَ تُكْرِهُ النَّاسَ حَتّٰی یَكُوْنُوْا مُؤْمِنِیْنَ",
    "وَمَا كَانَ لِنَفْسٍ اَنْ تُؤْمِنَ اِلَّا بِاِذْنِ اللّٰهِ وَیَجْعَلُ الرِّجْسَ عَلَی الَّذِیْنَ لَا یَعْقِلُوْنَ",
    "قُلِ انْظُرُوْا مَاذَا فِی السَّمٰوٰتِ وَالْاَرْضِ وَمَا تُغْنِی الْاٰیٰتُ وَالنُّذُرُ عَنْ قَوْمٍ لَّا یُؤْمِنُوْنَ",
    "فَهَلْ یَنْتَظِرُوْنَ اِلَّا مِثْلَ اَیَّامِ الَّذِیْنَ خَلَوْا مِنْ قَبْلِهِمْ قُلْ فَانْتَظِرُوْۤا اِنِّیْ مَعَكُمْ مِّنَ الْمُنْتَظِرِیْنَ",
    "ثُمَّ نُنَجِّیْ رُسُلَنَا وَالَّذِیْنَ اٰمَنُوْا كَذٰلِكَ حَقًّا عَلَیْنَا نُنْجِ الْمُؤْمِنِیْنَ",
    "قُلْ یٰۤاَیُّهَا النَّاسُ اِنْ كُنْتُمْ فِیْ شَكٍّ مِّنْ دِیْنِیْ فَلَاۤ اَعْبُدُ الَّذِیْنَ تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ وَلٰكِنْ اَعْبُدُ اللّٰهَ الَّذِیْ یَتَوَفّٰىكُمْ وَاُمِرْتُ اَنْ اَكُوْنَ مِنَ الْمُؤْمِنِیْنَ",
    "وَاَنْ اَقِمْ وَجْهَكَ لِلدِّیْنِ حَنِیْفًا وَلَا تَكُوْنَنَّ مِنَ الْمُشْرِكِیْنَ",
    "وَلَا تَدْعُ مِنْ دُوْنِ اللّٰهِ مَا لَا یَنْفَعُكَ وَلَا یَضُرُّكَ فَاِنْ فَعَلْتَ فَاِنَّكَ اِذًا مِّنَ الظّٰلِمِیْنَ",
    "وَاِنْ یَّمْسَسْكَ اللّٰهُ بِضُرٍّ فَلَا كَاشِفَ لَهٗۤ اِلَّا هُوَ وَاِنْ یُّرِدْكَ بِخَیْرٍ فَلَا رَآدَّ لِفَضْلِهٖ یُصِیْبُ بِهٖ مَنْ یَّشَآءُ مِنْ عِبَادِهٖ وَهُوَ الْغَفُوْرُ الرَّحِیْمُ",
    "قُلْ یٰۤاَیُّهَا النَّاسُ قَدْ جَآءَكُمُ الْحَقُّ مِنْ رَّبِّكُمْ فَمَنِ اهْتَدٰی فَاِنَّمَا یَهْتَدِیْ لِنَفْسِهٖ وَمَنْ ضَلَّ فَاِنَّمَا یَضِلُّ عَلَیْهَا وَمَاۤ اَنَا عَلَیْكُمْ بِوَكِیْلٍ",
    "وَاتَّبِعْ مَا یُوْحٰۤی اِلَیْكَ وَاصْبِرْ حَتّٰی یَحْكُمَ اللّٰهُ وَهُوَ خَیْرُ الْحٰكِمِیْنَ"
  ],
  "bengali": [
    "আলিফ্-লাম-রা। এগুলো প্রজ্ঞাপূর্ণ কিতাবের আয়াত।",
    "এটা কি মানুষের জন্য আশ্চর্যের বিষয় যে, আমি তাদের মধ্য থেকে এক ব্যক্তির নিকট ওহী প্রেরণ করেছি যে, তুমি মানুষকে সতর্ক কর এবং মুমিনদেরকে সুসংবাদ প্রদান কর যে, তাদের রবের নিকট তাদের জন্য রয়েছে উচ্চ মর্যাদা। কাফিররা বলে, ‘এ তো স্পষ্ট যাদুকর’।",
    "নিশ্চয় তোমাদের রব আল্লাহ। যিনি আসমানসমূহ ও যমীন সৃষ্টি করেছেন ছয় দিনে, তারপর আরশে উঠেছেন। তিনি সব বিষয় পরিচালনা করেন। তার অনুমতি ছাড়া সুপারিশ করার কেউ নেই। তিনিই আল্লাহ, তোমাদের রব। সুতরাং তোমরা তাঁর ইবাদাত কর। তারপরও কি তোমরা উপদেশ গ্রহণ করবে না?",
    "তাঁরই কাছে তোমাদের সকলের প্রত্যাবর্তন। আল্লাহর ওয়াদা সত্য। নিশ্চয় তিনি সৃষ্টির সূচনা করেন। তারপর তার পুনরাবর্তন ঘটান। যারা ঈমান এনেছে এবং সৎকাজ করেছে তাদেরকে ইনসাফপূর্ণ প্রতিদান দেয়ার জন্য। আর যারা কুফরী করেছে, তাদের জন্য রয়েছে উত্তপ্ত পানীয় এবং বেদনাদায়ক আযাব। এ কারণে যে তারা কুফরী করত।",
    "তিনিই সূর্যকে করেছেন দীপ্তিময় এবং চাঁদকে আলোময় আর তার জন্য নির্ধারণ করেছেন বিভিন্ন মনযিল, যাতে তোমরা জানতে পার বছরের গণনা এবং (সময়ের) হিসাব। আল্লাহ এগুলো অবশ্যই যথার্থভাবে সৃষ্টি করেছেন। জ্ঞানী সম্প্রদায়ের জন্য তিনি আয়াতসমূহ বিস্তারিতভাবে বর্ণনা করেন।",
    "নিশ্চয় রাত ও দিবসের বিবর্তনে এবং আসমানসমূহ ও যমীনে যা আল্লাহ সৃষ্টি করেছেন, তাতে বহু নিদর্শন রয়েছে এমন কওমের জন্য, যারা তাকওয়া অবলম্বন করে।",
    "নিশ্চয় যারা আমার সাক্ষাতের আশা রাখে না এবং দুনিয়ার জীবন নিয়ে সন্তুষ্ট আছে ও তা নিয়ে পরিতৃপ্ত রয়েছে। আর যারা আমার নিদর্শনাবলী হতে গাফেল ।",
    "তারা যা উপার্জন করত, তার কারণে আগুনই হবে তাদের ঠিকানা।",
    "নিশ্চয় যারা ঈমান আনে এবং নেক আমল করে, তাদের রব ঈমানের কারণে তাদেরকে পথ দেখাবেন, আরামদায়ক জান্নাতসমূহে যার তলদেশে নহরসমূহ প্রবাহিত।",
    "সেখানে তাদের কথা হবে, ‘হে আল্লাহ, তুমি পবিত্র মহান’ এবং তাদের অভিবাদন হবে, ‘সালাম’। আর তাদের শেষ কথা হবে যে, ‘সকল প্রশংসা আল্লাহর, যিনি সকল সৃষ্টির রব’।",
    "আর আল্লাহ যদি মানুষের অকল্যাণ (প্রার্থনায় সাড়া দিতে) তাড়াতাড়ি করতেন যেভাবে তিনি তাদের কল্যাণ (প্রার্থনায় সাড়া দিতে) তাড়াতাড়ি করেন, তাহলে অবশ্যই তাদের সময় ফুরিয়ে যেত। সুতরাং যারা আমার সাক্ষাতের আশা রাখে না, আমি তাদেরকে তাদের অবাধ্যতায় দিশেহারা হয়ে ঘুরতে ছেড়ে দেই।",
    "আর যখন মানুষকে বিপদ স্পর্শ করে, তখন সে শুয়ে, বসে বা দাঁড়িয়ে আমাকে ডাকে। অতঃপর আমি যখন তার বিপদ দূর করে দেই, তখন সে এমনভাবে চলতে থাকে মনে হয় যেন তাকে কোন বিপদ স্পর্শ করার কারণে সে আমাকে ডাকেনি। এভাবেই সীমালঙ্ঘনকারীদের জন্য তারা যা আমল করত তা শোভিত করে দেয়া হয়েছে।",
    "আর অবশ্যই আমি তোমাদের পূর্বে বহু প্রজন্মকে ধ্বংস করেছি, যখন তারা যুলম করেছে। আর তাদের নিকট তাদের রাসূলগণ প্রমাণাদিসহ আগমন করেছিল, কিন্তু তারা ঈমান আনার ছিল না। এভাবে আমি অপরাধী কওমকে শাস্তি প্রদান করি।",
    "তারপর আমি তোমাদেরকে যমীনে তাদের পরে স্থলাভিষিক্ত করেছি, যাতে আমি দেখি তোমরা কেমন আমল কর।",
    "আর যখন তাদের সামনে আমার আয়াতসমূহ সুস্পষ্টরূপে পাঠ করা হয়, তখন, যারা আমার সাক্ষাতের আশা রাখে না, তারা বলে, ‘এটি ছাড়া অন্য কুরআন নিয়ে এসো। অথবা একে বদলাও’। বল, ‘আমার নিজের পক্ষ থেকে এতে কোন পরিবর্তনের অধিকার নেই। আমিতো শুধু আমার প্রতি অবতীর্ণ ওহীর অনুসরণ করি। নিশ্চয় আমি যদি রবের অবাধ্য হই তবে ভয় করি কঠিন দিনের আযাবের’।",
    "বল, ‘যদি আল্লাহ চাইতেন, আমি তোমাদের উপর তা পাঠ করতাম না। আর তিনি তোমাদেরকে এ সম্পর্কে অবহিত করতেন না। কেননা, ইতঃপূর্বে আমি তোমাদের মধ্যে দীর্ঘ জীবন অতিবাহিত করেছি। তবে কি তোমরা বুঝ না’?",
    "অতএব যে আল্লাহর উপর মিথ্যা রটনা করে অথবা তাঁর আয়াতসমূহকে মিথ্যা বলে, তার চেয়ে বড় যালিম কে ? নিশ্চয় অপরাধীরা সফল হবে না।",
    "আর তারা আল্লাহ ছাড়া এমন কিছুর ইবাদত করছে, যা তাদের ক্ষতি করতে পারে না এবং উপকারও করতে পারে না। আর তারা বলে, ‘এরা আল্লাহর নিকট আমাদের সুপারিশকারী’। বল, ‘তোমরা কি আল্লাহকে আসমানসমূহ ও যমীনে থাকা এমন বিষয়ে সংবাদ দিচ্ছ যা তিনি অবগত নন’? তিনি পবিত্র মহান এবং তারা যা শরীক করে, তা থেকে তিনি অনেক ঊর্ধ্বে।",
    "আর মানুষ তো এক উম্মতই ছিল। পরে তারা বিভক্ত হয়ে পড়ল। আর তোমার রবের পক্ষ থেকে বাণী বিগত না হলে তাদের মধ্যে মীমাংসা হয়ে যেত, যা নিয়ে তারা মতবিরোধ করে।",
    "আর তারা বলে, ‘তাঁর রবের পক্ষ থেকে তার উপর কোন নিদর্শন কেন নাযিল করা হয় না’? বল, ‘গায়েবের জ্ঞান তো কেবল আল্লাহরই। অতএব তোমরা অপেক্ষা কর, আমিও তোমাদের সাথে অপেক্ষায় রয়েছি’।",
    "আর যখন আমি মানুষকে দুঃখ-দুর্দশা স্পর্শ করার পর রহমতের স্বাদ আস্বাদন করাই, তখন তারা আমার আয়াতসমূহের ব্যাপারে কূট-কৌশলের আশ্রয় নেয়। বল, ‘আল্লাহ কৌশলকারী হিসেবে অধিক দ্রুত’। নিশ্চয় আমার ফেরেশতারা তোমাদের কুট-কৌশল লিখে রাখে।",
    "তিনিই তোমাদেরকে স্থলে ও সমুদ্রে ভ্রমণ করান। এমনকি যখন তোমরা নৌকায় থাক, আর তা তাদেরকে নিয়ে চলতে থাকে অনুকুল হাওয়ায় এবং তারা তা নিয়ে আনন্দিত হয়, (এ সময়) তাকে পেয়ে বসে ঝড়ো হাওয়া, আর চারদিক থেকে ধেয়ে আসে তরঙ্গ এবং তাদের নিশ্চিত ধারণা হয় যে, তাদেরকে পরিবেষ্টন করা হয়েছে। তখন তারা আল্লাহকে ডাকতে থাকে তাঁর জন্য দীনকে একনিষ্ঠ করে, ‘যদি আপনি এ থেকে আমাদেরকে নাজাত দেন, তাহলে আমরা অবশ্যই কৃতজ্ঞদের অন্তর্ভুক্ত হব’।",
    "অতঃপর যখন তিনি তাদেরকে নাজাত দেন, তখন তারা অন্যায়ভাবে যমীনে সীমালঙ্ঘন করে। হে মানুষ, তোমাদের সীমালঙ্ঘন তোমাদের বিরুদ্ধেই, এ সব কিছু দুনিয়ার ভোগ। অতঃপর আমার নিকটই তোমাদের প্রত্যাবর্তন। সুতরাং তখন আমি তোমাদেরকে তোমাদের কৃতকর্ম সম্পর্কে জানাব।",
    "নিশ্চয় দুনিয়ার জীবনের তুলনা তো পানির ন্যায় যা আমি আকাশ থেকে নাযিল করি, অতঃপর তার সাথে যমীনের উদ্ভিদের মিশ্রণ ঘটে, যা মানুষ ও চতুষ্পদ জন্তু ভোগ করে। অবশেষে যখন যমীন শোভিত ও সজ্জিত হয় এবং তার অধিবাসীরা মনে করে যমীনে উৎপন্ন ফসল করায়ত্ব করতে তারা সক্ষম, তখন তাতে রাতে কিংবা দিনে আমার আদেশ চলে আসে। অতঃপর আমি সেগুলোকে বানিয়ে দেই কর্তিত ফসল, মনে হয় গতকালও এখানে কিছু ছিল না। এভাবে আমি চিন্তাশীল লোকদের জন্য নিদর্শনসমূহ বিস্তারিতভাবে বর্ণনা করি।",
    "আর আল্লাহ শান্তির আবাসের দিকে আহবান করেন এবং যাকে ইচ্ছা হিদায়াত দেন সরল পথের দিকে।",
    "যারা ভালো কাজ করে তাদের জন্য রয়েছে শুভ পরিণাম (জান্নাত) এবং আরও বেশি। আর ধূলোমলিনতা ও লাঞ্ছনা তাদের চেহারাগুলোকে আচ্ছন্ন করবে না। তারাই জান্নাতবাসী। তারা তাতে স্থায়ী হবে।",
    "আর যারা মন্দ উপার্জন করবে, প্রতিটি মন্দের প্রতিদান হবে তারই অনুরূপ; আর লাঞ্ছনা তাদেরকে আচ্ছন্ন করবে। আল্লাহর পাকড়াও থেকে তাদের কোন রক্ষাকারী নেই। যেন অন্ধকার রাতের এক অংশ দিয়ে তাদের চেহারাগুলো ঢেকে দেয়া হয়েছে। তারাই আগুনের অধিবাসী, তারা তাতে স্থায়ী হবে।",
    "আর যেদিন আমি তাদের সকলকে একত্র করব, অতঃপর যারা শিরক করেছে, তাদেরকে বলব, ‘থাম, তোমরা ও তোমাদের শরীকরা’। অতঃপর আমি তাদের মধ্যে বিচ্ছেদ ঘটাব। আর তাদের শরীকরা’ বলবে, ‘তোমরা তো আমাদের ইবাদাত করতে না’।",
    "‘সুতরাং আল্লাহই আমাদের ও তোমাদের মধ্যে সাক্ষী হিসেবে যথেষ্ট। আমরা নিশ্চয় তোমাদের ইবাদাত সম্পর্কে গাফেল ছিলাম’।",
    "এখানে প্রত্যেকে ইতিপূর্বে যা করেছে, সে সম্পর্কে জানতে পারবে। আর তাদেরকে তাদের প্রকৃত অভিভাবক আল্লাহর কাছে ফিরিয়ে দেয়া হবে এবং তারা যা মিথ্যা রটাতো তা তাদের থেকে হারিয়ে যাবে।",
    "বল, ‘আসমান ও যমীন থেকে কে তোমাদের রিয্ক দেন? অথবা কে (তোমাদের) শ্রবণ ও দৃষ্টিসমূহের মালিক? আর কে মৃত থেকে জীবিতকে বের করেন আর জীবিত থেকে মৃতকে বের করেন? কে সব বিষয় পরিচালনা করেন’? তখন তারা অবশ্যই বলবে, ‘আল্লাহ’। সুতরাং, তুমি বল, ‘তারপরও কি তোমরা তাকওয়া অবলম্বন করবে না’?",
    "অতএব, তিনিই আল্লাহ, তোমাদের প্রকৃত রব। অতঃপর সত্যের পর ভ্রষ্টতা ছাড়া কী থাকে? অতএব কোথায় তোমাদেরকে ঘুরানো হচ্ছে?",
    "এমনিভাবে তোমার রবের বাণী সত্য বলে সাব্যস্ত হয়েছে তাদের উপর, যারা অবাধ্য হয়েছে, যে তারা ঈমান আনবে না।",
    "বল, ‘তোমাদের শরীকদের কেউ কি আছে, যে প্রথম সৃষ্টি করবে, অতঃপর তার পুনরাবৃত্তি ঘটাবে’? বল, ‘আল্লাহই প্রথম সৃষ্টি করেন অতঃপর তার পুনরাবৃত্তি ঘটান’। অতএব তোমাদেরকে কোথায় ফিরানো হচ্ছে?",
    "বল, ‘তোমাদের শরীকদের কেউ কি আছে, যে সত্যের পথ দেখাবে’? বল, ‘আল্লাহই সত্যের পথ দেখান। যিনি সত্যের পথ দেখান, তিনিই কি অনুসরণ করার অধিক হকদার, নাকি সে, যে পথ দেখানো ছাড়া পথ পায় না। সুতরাং তোমাদের কী হল? তোমরা কেমন বিচার করছ’।",
    "আর তাদের অধিকাংশ কেবল ধারণার অনুসরণ করে। নিশ্চয় সত্যের বিপরীতে ধারণা কোন কার্যকারিতা রাখে না । নিশ্চয় আল্লাহ তারা যা করে সে সম্পর্কে সম্যক অবগত।",
    "এ কুরআন তো এমন নয় যে, আল্লাহ ছাড়া কেউ তা রচনা করতে পারবে; বরং এটি যা তার সামনে রয়েছে, তার সত্যায়ন এবং কিতাবের বিস্তারিত ব্যাখ্যা, যাতে কোন সন্দেহ নেই, যা সৃষ্টিকুলের রবের পক্ষ থেকে।",
    "নাকি তারা বলে, ‘সে তা বানিয়েছে’? বল, ‘তবে তোমরা তার মত একটি সূরা (বানিয়ে) নিয়ে আস এবং আল্লাহ ছাড়া যাকে পারো ডাক, যদি তোমরা সত্যবাদী হও’।",
    "বরং তারা যে ব্যাপারে পূর্ণ জ্ঞান লাভ করেনি, তা তারা অস্বীকার করেছে এবং এখনও তার পরিণতি তাদের কাছে আসেনি। এভাবেই তারা অস্বীকার করেছিল, যারা ছিল তাদের পূর্বে। সুতরাং তুমি লক্ষ্য কর, কেমন ছিল যালিমদের পরিণাম।",
    "আর তাদের মধ্যে কেউ এর প্রতি ঈমান আনে এবং কেউ তাতে ঈমান আনে না। আর তোমার রব ফাসাদকারীদের ব্যাপারে অধিক জ্ঞাত।",
    "আর তারা যদি তোমাকে মিথ্যাবাদী বলে, তবে তুমি বল, ‘আমার কর্ম আমার, আর তোমাদের কর্ম তোমাদের। আমি যা আমল করি তোমরা তা থেকে মুক্ত এবং তোমরা যা আমল কর আমি তা থেকে মুক্ত’।",
    "আর তাদের মধ্যে কিছু আছে, যারা তোমার প্রতি মনোযোগ দিয়ে শুনে। তবে কি তুমি বধিরকে শোনাবে, তারা না বুঝলেও?",
    "আর তাদের মধ্যে কেউ আছে এমন, যে তোমার দিকে তাকায়। তবে কি তুমি অন্ধকে পথ দেখাবে, তারা না দেখলেও?",
    "নিশ্চয় আল্লাহ মানুষের প্রতি কিছুমাত্র যুলম করেন না; বরং মানুষই নিজদের উপর যুলম করে।",
    "আর যেদিন তিনি তাদেরকে একত্র করবেন, যেন তারা দিবসের মুহূর্তকালমাত্র অবস্থান করেছে। তারা একে অপরকে চিনতে পারবে। তারা অবশ্যই ক্ষতিগ্রস্ত হয়েছে, যারা আল্লাহর সাক্ষাৎ অস্বীকার করেছে, আর তারা হিদায়াতপ্রাপ্ত ছিল না।",
    "আর আমি তাদেরকে যে প্রতিশ্রুতি দিয়েছি, তার কিছু যদি তোমাকে দেখিয়ে দেই, অথবা তোমাকে মৃত্যু দেই, তবে আমার কাছেই তাদের প্রত্যাবর্তন। তারপর তারা যা করে আল্লাহ তার সাক্ষী।",
    "আর প্রত্যেক উম্মতের জন্য রয়েছে রাসূল। তারপর যখন তাদের রাসূল আসে, তাদের মধ্যে তখন ন্যায়ভিত্তিক ফয়সালা করা হয় এবং তাদের যুলম করা হয় না।",
    "আর তারা বলে, ‘কখন এই প্রতিশ্রুতি (পূর্ণ হবে), যদি তোমরা সত্যবাদী হও’?",
    "বল, ‘আমি নিজের ক্ষতি বা উপকারের অধিকার রাখি না, তবে আল্লাহ যা ইচ্ছা করেন’। প্রত্যেক উম্মতের রয়েছে নির্দিষ্ট একটি সময়। যখন এসে যায় তাদের সময়, তখন এক মুহূর্ত পিছাতে পারে না এবং এগোতেও পারে না।",
    "বল, ‘তোমাদের কি মনে হয় যে, যদি তোমাদের নিকট তাঁর আযাব রাতে কিংবা দিনে এসে পড়ে, তবে অপরাধীরা তার কোন্ অংশটি তাড়াতাড়ি চায়’?",
    "তবে কি যখন তা ঘটবে, তখন তোমরা তাতে ঈমান আনবে? এখন? অথচ তোমরা এর জন্যই তাড়াহুড়া করতে।",
    "তারপর যারা যুলম করেছে তাদের বলা হবে, স্থায়ী আযাব আস্বাদন কর। তোমরা যা অর্জন করতে তোমাদেরকে কেবল তারই প্রতিদান দেয়া হচ্ছে।",
    "আর তারা তোমার কাছে জানতে চায়, ‘তা কি সত্য’? বল, ‘হ্যাঁ, আমার রবের কসম! নিশ্চয় তা সত্য এবং তোমরা পরাস্তকারী নও’।",
    "আর যমীনে যা রয়েছে, তা যদি যুলম করেছে এমন প্রত্যেক ব্যক্তির হয়ে যায়, তবে তা সে মুক্তিপণ হিসেবে দিয়ে দেবে এবং তারা লজ্জা গোপন করবে, যখন তারা আযাব দেখবে। আর তাদের মধ্যে ন্যায়ভিত্তিক ফয়সালা করা হবে এবং তাদেরকে যুলম করা হবে না।",
    "জেনে রাখ, নিশ্চয় আসমানসমূহ ও যমীনে যা আছে, তা আল্লাহরই। জেনে রাখ, নিশ্চয় আল্লাহর ওয়াদা সত্য, কিন্তু তাদের অধিকাংশই জানে না।",
    "তিনিই জীবন দান করেন এবং মৃত্যু ঘটান এবং তাঁর কাছেই তোমাদের প্রত্যাবর্তন হবে।",
    "হে মানুষ, তোমাদের রবের পক্ষ থেকে তোমাদের কাছে এসেছে উপদেশ এবং অন্তরসমূহে যা থাকে তার শিফা, আর মুমিনদের জন্য হিদায়াত ও রহমত।",
    "বল, ‘আল্লাহর অনুগ্রহ ও রহমতে। সুতরাং এ নিয়েই যেন তারা খুশি হয়’। এটি যা তারা জমা করে তা থেকে উত্তম।",
    "বল, ‘তোমরা কি ভেবে দেখেছ, আল্লাহ তোমাদের জন্য যে রিয্ক নাযিল করেছেন, পরে তোমরা তার কিছু বানিয়েছ হারাম ও হালাল’। বল, ‘আল্লাহ কি তোমাদেরকে অনুমতি দিয়েছেন, নাকি আল্লাহর উপর তোমরা মিথ্যা রটাচ্ছ’?",
    "আর যারা আল্লাহর নামে মিথ্যা রটাচ্ছে, তাদের কী ধারণা, কিয়ামতের দিন (তাদের পরিণতি) সম্পর্কে? নিশ্চয় আল্লাহ মানুষের উপর অনুগ্রহশীল; কিন্তু তাদের অধিকাংশ শোকর করে না।",
    "আর তুমি যে অবস্থাতেই থাক না কেন আর যা কিছু তিলাওয়াত কর না কেন আল্লাহর পক্ষ হতে কুরআন থেকে এবং তোমরা যে আমলই কর না কেন, আমি তোমাদের উপর সাক্ষী থাকি, যখন তোমরা তাতে নিমগ্ন হও। তোমার রব থেকে গোপন থাকে না যমীনের বা আসমানের অণু পরিমাণ কিছুই এবং তা থেকে ছোট বা বড়, তবে (এর সব কিছুই) রয়েছে সুস্পষ্ট কিতাবে।",
    "শুনে রাখ, নিশ্চয় আল্লাহর বন্ধুদের কোন ভয় নেই, আর তারা পেরেশানও হবে না।",
    "যারা ঈমান এনেছে এবং তাকওয়া অবলম্বন করত।",
    "তাদের জন্যই সুসংবাদ দুনিয়াবী জীবনে এবং আখিরাতে। আল্লাহর বাণীসমূহের কোন পরিবর্তন নেই। এটিই মহাসফলতা।",
    "আর তাদের কথা যেন তোমাকে দুঃখ না দেয়। নিশ্চয় সকল মর্যাদা আল্লাহর। তিনি সর্বশ্রোতা, সর্বজ্ঞানী।",
    "জেনে রাখ, নিশ্চয় আসমানসমূহে যারা আছে এবং যমীনে যারা আছে সব আল্লাহরই এবং যারা আল্লাহ ছাড়া অন্যদের ডাকে, তারা মূলত শরীকদের অনুসরণ করে না, তারা তো কেবল ধারণার অনুসরণ করে। তারা তো শুধু মিথ্যাই বলে।",
    "তিনিই সে সত্তা, যিনি তোমাদের জন্য রাতকে সৃষ্টি করেছেন, যেন তোমরা তাতে বিশ্রাম নাও এবং দিনকে করেছেন আলোকময়। নিশ্চয় এতে রয়েছে নিদর্শনাবলি এমন কওমের জন্য যারা শুনে।",
    "তারা বলে, ‘আল্লাহ সন্তান গ্রহণ করেছেন’। তিনি পবিত্র মহান। তিনি অমুখাপেক্ষী। আসমানসমূহ ও যমীনে যা রয়েছে তা তাঁরই। তোমাদের কাছে এ ব্যাপারে কোন প্রমাণ নেই। তোমরা কি আল্লাহর উপর এমন কিছু বলছ, যা তোমরা জান না?",
    "বল, ‘নিশ্চয় যারা আল্লাহর নামে মিথ্যা রটায়, তারা সফল হবে না’।",
    "(তাদের জন্য) দুনিয়াতে রয়েছে ভোগসামগ্রী। অতঃপর আমারই কাছে তাদের প্রত্যাবর্তন। তারপর আমি তাদেরকে কঠিন আযাব আস্বাদন করাব, তারা যে কুফরী করত তার কারণে ।",
    "আর তাদেরকে নূহের সংবাদ পড়ে শুনাও, যখন সে তার কওমকে বলল, ‘হে আমার কওম, আমার অবস্থান এবং আল্লাহর আয়াতসমূহের মাধ্যমে আমার উপদেশ দান যদি তোমাদের কাছে ভারী মনে হয়, তবে আমি আল্লাহর উপরই তাওয়াক্কুল করলাম। সুতরাং তোমরা অভিন্ন সিদ্ধান্ত গ্রহণ কর এবং (সাথে নাও) তোমাদের শরীকদের। তারপর তোমাদের বিষয়টি যেন তোমাদের নিকট অস্পষ্ট না থাকে। এরপর আমার ব্যাপারে সিদ্ধান্ত চূড়ান্ত কর এবং আমাকে অবকাশ দিও না’।",
    "‘অতঃপর তোমরা যদি বিমুখ হও, তবে আমি তোমাদের কাছে কোন প্রতিদান চাই না। আমার প্রতিদান তো কেবল আল্লাহর দায়িত্বে। আর আমি আদিষ্ট হয়েছি মুসলিমদের অন্তর্ভুক্ত হওয়ার’।",
    "অতঃপর তারা তাকে মিথ্যাবাদী বলল। তাই আমি তাকে ও নৌকাতে যারা তার সাথে ছিল তাদেরকে নাজাত দিলাম এবং আমি তাদেরকে করেছি স্থলাভিষিক্ত। আর ডুবিয়ে দিলাম তাদেরকে, যারা আমার আয়াতসমূহকে অস্বীকার করেছে। অতএব দেখ, কেমন ছিল তাদের পরিণতি যাদেরকে সতর্ক করা হয়েছে।",
    "অতঃপর আমি তাঁর পরে অনেক রাসূলকে তাদের কওমের নিকট পাঠিয়েছি এবং তারা তাদের নিকট সুস্পষ্ট প্রমাণাদি নিয়ে এসেছিল; কিন্তু তারা ইতঃপূর্বে অস্বীকার করার কারণে ঈমান আনার ছিল না। এমনিভাবে আমি সীমালঙ্ঘনকারীদের অন্তরে মোহর এঁটে দেই।",
    "অতঃপর তাদের পরে আমি মূসা ও হারূনকে ফিরআউন ও তার পারিষদবর্গের কাছে আমার আয়াতসমূহ দিয়ে পাঠিয়েছি। কিন্তু তারা অহঙ্কার করেছে। আর তারা ছিল অপরাধী কওম।",
    "অতঃপর যখন তাদের কাছে আমার পক্ষ থেকে সত্য এল, তারা বলল, ‘নিশ্চয় এটি সুস্পষ্ট যাদু’।",
    "মূসা বলল, ‘তোমরা কি সত্যকে এ রকম (যাদু) বলছ, যখন তা তোমাদের কাছে এল? এ কি যাদু? অথচ যাদুকররা সফল হয় না’।",
    "তারা বলল, ‘তুমি কি এসেছ আমরা আমাদের পিতৃপুরুষদেরকে যাতে পেয়েছি তা থেকে আমাদেরকে ফেরাতে এবং যেন যমীনে তোমাদের প্রতিপত্তি প্রতিষ্ঠিত হয়? আর আমরা তো তোমাদের প্রতি বিশ্বাসী নই’।",
    "এবং ফির‘আউন বলল, ‘তোমরা প্রত্যেক বিজ্ঞ যাদুকরদেরকে আমার কাছে নিয়ে আস’।",
    "অতঃপর যখন যাদুকররা এল, মূসা তাদেরকে বলল, ‘তোমরা যা ফেলবার ফেল’।",
    "অতঃপর যখন তারা (তাদের রশি ও লাঠি) ফেলল, তখন মূসা বলল, ‘তোমরা যা আনলে, তা যাদু। নিশ্চয় আল্লাহ তা বাতিল করে দেবেন। নিশ্চয় আল্লাহ ফাসাদকারীদের আমল পরিশুদ্ধ করেন না’।",
    "আর আল্লাহ তাঁর বাণীসমূহের মাধ্যমে সত্যকে প্রতিষ্ঠিত করেন, যদিও অপরাধীরা তা অপছন্দ করে।",
    "বস্তুতঃ মূসার প্রতি তার স্বগোত্রীয় লোকদের মধ্যে (প্রথমে) শুধু অল্প সংখ্যক লোকই ঈমান আনল, তাও ফির‘আউন ও তার প্রধানবর্গের এই ভয়ে যে, তারা তাদেরকে নির্যাতন করে; আর বাস্তবিক পক্ষে ফির‘আউন সেই দেশে (রাজ্য) ক্ষমতা রাখত, আর এটাও ছিল যে, সে (ন্যায়ের) সীমাতিক্রম করে ফেলতো।",
    "আর মূসা বলল, ‘হে আমার কওম, তোমরা যদি আল্লাহর প্রতি ঈমান এনে থাক, তবে তাঁরই উপর তাওয়াক্কুল কর, যদি তোমরা মুসলিম হয়ে থাক’।",
    "তখন তারা বলল, ‘আমরা আল্লাহর উপরই তাওয়াক্কুল করলাম। হে আমাদের রব, আপনি আমাদেরকে যালিম কওমের ফিতনার পাত্র বানাবেন না’।",
    "‘আর আমাদেরকে আপনার অনুগ্রহে কাফির কওম থেকে নাজাত দিন’।",
    "আর আমি মূসা ও তার ভাইয়ের কাছে ওহী পাঠালাম যে, ‘তোমরা তোমাদের কওমের জন্য মিসরে গৃহ তৈরী কর এবং তোমাদের গৃহগুলোকে কিবলা বানাও আর সালাত কায়েম কর এবং মুমিনদের সুসংবাদ দাও’।",
    "আর মূসা বলল, ‘হে আমাদের রব, আপনি ফির‘আউন ও তার পারিষদবর্গকে দুনিয়াবী জীবনে সৌন্দর্য ও ধন-সম্পদ দান করেছেন। হে আমাদের রব, যাতে তারা আপনার পথ থেকে গোমরাহ করতে পারে। হে আমাদের রব, তাদের ধন-সম্পদ নিশ্চি‎হ্ন করে দিন, তাদের অন্তরসমূহকে কঠোর করে দিন। ফলে তারা ঈমান আনবে না, যতক্ষণ না যন্ত্রণাদায়ক আযাব দেখে’।",
    "তিনি বললেন, ‘তোমাদের দো‘আ কবূল করা হয়েছে। সুতরাং তোমরা দৃঢ় থাক এবং যারা জানে না তাদের পথ অনুসরণ করো না’।",
    "আর আমি বনী ইসরাঈলকে সমুদ্র পার করিয়ে নিলাম। আর ফির‘আউন ও তার সৈন্যবাহিনী ঔদ্ধত্য প্রকাশ ও সীমালঙ্ঘনকারী হয়ে তাদের পিছু নিল। অবশেষে যখন সে ডুবে যেতে লাগল, তখন বলল, ‘আমি ঈমান এনেছি যে, সে সত্তা ছাড়া কোন ইলাহ নেই, যার প্রতি বনী ইসরাঈল ঈমান এনেছে। আর আমি মুসলিমদের অন্তর্ভুক্ত’।",
    "‘এখন অথচ ইতঃপূর্বে তুমি নাফরমানী করেছ, আর তুমি ছিলে ফাসাদকারীদের অন্তর্ভুক্ত’।",
    "‘সুতরাং আজ আমি তোমার দেহটি রক্ষা করব, যাতে তুমি তোমার পরবর্তীদের জন্য নিদর্শন হয়ে থাক। আর নিশ্চয় অনেক মানুষ আমার নিদর্শনসমূহের ব্যাপারে গাফেল’।",
    "আর অবশ্যই আমি বনী ইসরাঈলকে উত্তম বাসভূমিতে আবাস দিলাম এবং তাদেরকে উত্তম রিয্ক দিলাম। অতঃপর তারা মতবিরোধ করেনি, যতক্ষণ না তাদের নিকট জ্ঞান এল। নিশ্চয় তোমার রব কিয়ামতের দিন সে বিষয়ে ফয়সালা করবেন যা নিয়ে তারা মতবিরোধ করত।",
    "সুতরাং আমি তোমার নিকট যা নাযিল করেছি, তা নিয়ে তুমি যদি সন্দেহে থাক, তাহলে যারা তোমার পূর্ব থেকেই কিতাব পাঠ করছে তাদেরকে জিজ্ঞাসা কর। অবশ্যই তোমার নিকট তোমার রবের পক্ষ থেকে সত্য এসেছে। সুতরাং তুমি সন্দেহ পোষণকারীদের অন্তর্ভুক্ত হয়ো না।",
    "আর তুমি তাদের অন্তর্ভুক্ত হয়ো না, যারা আল্লাহর আয়াতসমূহ অস্বীকার করেছে। তাহলে তুমি ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হবে।",
    "নিশ্চয় যাদের উপর তোমার রবের বাণী সত্য হয়েছে, তারা ঈমান আনবে না;",
    "যদিও তাদের নিকট সকল নিদর্শন এসে উপস্থিত হয়, যতক্ষণ না তারা যন্ত্রণাদায়ক আযাব প্রত্যক্ষ করে।",
    "সুতরাং কেন হল না এমন এক জনপদ, যে ঈমান এনেছে এবং তার ঈমান তার উপকারে এসেছে? তবে ইউনুসের কওম ছাড়া যখন তারা ঈমান আনল, তখন আমি তাদের থেকে দুনিয়ার জীবনের লাঞ্ছনাকর আযাব সরিয়ে দিলাম এবং আমি তাদেরকে একটি সময় পর্যন্ত ভোগ করতে দিলাম।",
    "আর যদি তোমার রব চাইতেন, তবে যমীনের সকলেই ঈমান আনত। তবে কি তুমি মানুষকে বাধ্য করবে, যাতে তারা মুমিন হয় ?",
    "আর কারও পক্ষে সম্ভব নয় যে, আললাহর অনুমতি ছাড়া ঈমান আনবে এবং যারা বুঝে না তিনি আযাব চাপিয়ে দেবেন তাদের উপর।",
    "বল, ‘আসমানসমূহ ও যমীনে কী আছে তা তাকিয়ে দেখ। আর নিদর্শনসমূহ ও সতর্ককারীগণ এমন কওমের কাজে আসে না, যারা ঈমান আনে না’।",
    "তবে কি তারা কেবল তাদের পূর্বে বিগত লোকদের অনুরূপ দিনগুলোরই অপেক্ষা করছে? বল, ‘তবে তোমরা অপেক্ষা কর, আমিও তোমাদের সাথে অপেক্ষমান’।",
    "তারপর আমি নাজাত দেই আমার রাসূলদেরকে এবং তাদেরকেও যারা ঈমান এনেছে। এটা আমার দায়িত্ব যে, মুমিনদের নাজাত দেই।",
    "বল, ‘হে মানুষ, তোমরা যদি আমার দীনের ব্যাপারে সন্দেহে থাক, তবে আল্লাহ ছাড়া তোমরা যার ইবাদাত কর আমি তার ইবাদাত করি না, বরং আমি ইবাদাত করি আল্লাহর, যিনি তোমাদের মৃত্যু দেন। আর আমি আদিষ্ট হয়েছি মুমিনদের অন্তর্ভুক্ত হওয়ার’।",
    "আর (এ নির্দেশ) যে, ‘তুমি নিজেকে দীনের উপর প্রতিষ্ঠিত রাখ একনিষ্ঠভাবে এবং মুশরিকদের অন্তর্ভুক্ত হয়ো না’।",
    "‘আর আল্লাহ ছাড়া এমন কিছুকে ডেকো না, যা তোমার উপকার করতে পারে না এবং তোমার ক্ষতিও করতে পারে না। অতএব তুমি যদি কর, তাহলে নিশ্চয় তুমি যালিমদের অন্তর্ভুক্ত হবে।",
    "‘আর আল্লাহ যদি তোমাকে কোন ক্ষতি পৌঁছান, তবে তিনি ছাড়া তা দূর করার কেউ নেই। আর তিনি যদি তোমার কল্যাণ চান, তবে তাঁর অনুগ্রহের কোন প্রতিরোধকারী নেই। তিনি তার বান্দাদের যাকে ইচ্ছা তাকে তা দেন। আর তিনি পরম ক্ষমাশীল, অতি দয়ালু’।",
    "বল, ‘হে মানুষ’, তোমাদের রবের পক্ষ থেকে তোমাদের নিকট সত্য এসেছে। সুতরাং যে হিদায়াত গ্রহণ করবে, সে নিজের জন্যই হিদায়াত গ্রহণ করবে। আর যে পথভ্রষ্ট হবে, সে নিজের ক্ষতির জন্য পথভ্রষ্ট হবে। আর আমি তোমাদের অভিভাবক নই।",
    "আর তোমার নিকট যে ওহী পাঠানো হচ্ছে, তুমি তার অনুসরণ কর এবং সবর কর, যতক্ষণ না আল্লাহ ফয়সালা করেন। আর তিনিই উত্তম ফয়সালাকারী।"
  ]
}