{
  "surahName": "Hud",
  "surahNameArabic": "هود",
  "surahNameArabicLong": "سورة هود",
  "surahNameTranslation": "Hud",
  "revelationPlace": "Mecca",
  "totalAyah": 123,
  "surahNo": 11,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/11.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/011.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/11.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/011.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/11.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/011.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/11.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/011.mp3"
    }
  },
  "english": [
    "Alif-Lãm-Ra. ˹This is˺ a Book whose verses are well perfected and then fully explained. ˹It is˺ from the One ˹Who is˺ All-Wise, All-Aware.",
    "˹Tell them, O  Prophet,˺ “Worship none but Allah. Surely I am a warner and deliverer of good news to you from Him.",
    "And seek your Lord’s forgiveness and turn to Him in repentance. He will grant you a good provision for an appointed term and graciously reward the doers of good. But if you turn away, then I truly fear for you the torment of a formidable Day.",
    "To Allah is your return. And He is Most Capable of everything.”",
    "Indeed, they enfold ˹what is in˺ their hearts, ˹trying˺ to hide it from Him! But even when they cover themselves with their clothes, He knows what they conceal and what they reveal. Surely He knows best what is ˹hidden˺ in the heart.",
    "There is no moving creature on earth whose provision is not guaranteed by Allah. And He knows where it lives and where it is laid to rest. All is ˹written˺ in a perfect Record.",
    "He is the One Who created the heavens and the earth in six Days—and His Throne was upon the waters—in order to test which of you is best in deeds. And if you ˹O Prophet˺ say, “Surely you will ˹all˺ be raised up after death,” the disbelievers will certainly say, “That is nothing but pure magic!”",
    "And if We delay their punishment until an appointed time, they will definitely say, “What is holding it back?” Indeed, on the Day it overtakes them, it will not be averted from them, and they will be overwhelmed by what they used to ridicule.",
    "If We give people a taste of Our mercy then take it away from them, they become utterly desperate, ungrateful.",
    "But if We give them a taste of prosperity after being touched with adversity, they say, “My ills are gone,” and become totally prideful and boastful",
    "except those who patiently endure and do good. It is they who will have forgiveness and a mighty reward.",
    "Perhaps you ˹O Prophet˺ may wish to give up some of what is revealed to you and may be distressed by it because they say, “If only a treasure had been sent down to him, or an angel had come with him!” You are only a warner, and Allah is the Trustee of All Affairs.",
    "Or do they say, “He has fabricated this ˹Quran˺!”? Say, ˹O Prophet,˺ “Produce ten fabricated sûrahs like it and seek help from whoever you can—other than Allah—if what you say is true!”",
    "But if your helpers fail you, then know that it has been revealed with the knowledge of Allah, and that there is no god ˹worthy of worship˺ except Him! Will you ˹not˺ then submit ˹to Allah˺?",
    "Whoever desires ˹only˺ this worldly life and its luxuries, We will pay them in full for their deeds in this life—nothing will be left out.",
    "It is they who will have nothing in the Hereafter except the Fire. Their efforts in this life will be fruitless and their deeds will be useless.",
    "˹Can these people be compared to˺ those ˹believers˺ who stand on clear proof from their Lord, backed by ˹the Quran as˺ a witness from Him, and preceded by the Book of Moses ˹which was revealed˺ as a guide and mercy? It is those ˹believers˺ who have faith in it. But whoever from the ˹disbelieving˺ groups rejects it, the Fire will be their destiny. So do not be in doubt of it. It is certainly the truth from your Lord, but most people do not believe.",
    "Who does more wrong than those who fabricate lies against Allah? They will be brought before their Lord, and the witnesses will say, “These are the ones who lied against their Lord.” Surely Allah’s condemnation is upon the wrongdoers",
    "who hinder ˹others˺ from Allah’s Path, striving to make it ˹appear˺ crooked, and disbelieve in the Hereafter.",
    "They will never frustrate Allah on earth, and they will have no protector besides Allah. Their punishment will be multiplied, for they failed to hear or see ˹the truth˺.",
    "It is they who have ruined themselves, and whatever ˹gods˺ they fabricated will fail them.",
    "Without a doubt, they will be the worst losers in the Hereafter.",
    "Surely those who believe, do good, and humble themselves before their Lord will be the residents of Paradise. They will be there forever.",
    "The example of these two parties is that of the blind and the deaf, compared to the seeing and the hearing. Can the two be equal? Will you not then be mindful?",
    "Surely We sent Noah to his people. ˹He said,˺ “Indeed, I am sent to you with a clear warning",
    "that you should worship none but Allah. I truly fear for you the torment of a painful Day.”",
    "The disbelieving chiefs of his people said, “We see you only as a human being like ourselves, and we see that no one follows you except the lowliest among us, who do so ˹hastily˺ without thinking. We do not see anything that makes ˹all of˺ you any better than us. In fact, we think you are liars.”",
    "He said, “O my people! Consider if I stand on a clear proof from my Lord and He has blessed me with a mercy from Himself, which you fail to see. Should we ˹then˺ force it on you against your will?",
    "O  my people! I do not ask you for a payment for this ˹message˺. My reward is only from Allah. And I will never dismiss the believers, for they will surely meet their Lord. But I can see that you are a people acting ignorantly.",
    "O  my people! Who would protect me from Allah if I were to dismiss them? Will you not then be mindful?",
    "I do not say to you that I possess Allah’s treasuries or know the unseen, nor do I claim to be an angel, nor do I say that Allah will never grant goodness to those you look down upon. Allah knows best what is ˹hidden˺ within them. ˹If I did,˺ then I would truly be one of the wrongdoers.”",
    "They protested, “O Noah! You have argued with us far too much, so bring upon us what you threaten us with, if what you say is true.”",
    "He responded, “It is Allah Who can bring it upon you if He wills, and then you will have no escape!",
    "My advice will not benefit you—no matter how hard I try—if Allah wills ˹for˺ you to stray. He is your Lord, and to Him you will ˹all˺ be returned.”",
    "Or do they say, “He has fabricated this ˹Quran˺!”? Say, ˹O Prophet,˺ “If I have done so, then I bear the burden of that sin! But I am free from your sinful accusation.”",
    "And it was revealed to Noah, “None of your people will believe except those who already have. So do not be distressed by what they have been doing.",
    "And build the Ark under Our ˹watchful˺ Eyes and directions, and do not plead with Me for those who have done wrong, for they will surely be drowned.”",
    "So he began to build the Ark, and whenever some of the chiefs of his people passed by, they mocked him. He said, “If you laugh at us, we will ˹soon˺ laugh at you similarly.",
    "You will soon come to know who will be visited by a humiliating torment ˹in this life˺ and overwhelmed by an everlasting punishment ˹in the next˺.”",
    "And when Our command came and the oven burst ˹with water˺, We said ˹to Noah˺, “Take into the Ark a pair from every species along with your family—except those against whom the decree ˹to drown˺ has already been passed—and those who believe.” But none believed with him except for a few.",
    "And he said, “Board it! In the Name of Allah it will sail and cast anchor. Surely my Lord is All-Forgiving, Most Merciful.”",
    "And ˹so˺ the Ark sailed with them through waves like mountains. Noah called out to his son, who stood apart, “O my dear son! Come aboard with us and do not be with the disbelievers.”",
    "He replied, “I will take refuge on a mountain, which will protect me from the water.” Noah cried, “Today no one is protected from Allah’s decree except those to whom He shows mercy!” And the waves came between them, and his son was among the drowned.",
    "And it was said, “O earth! Swallow up your water. And O  sky! Withhold ˹your rain˺.” The floodwater receded and the decree was carried out. The Ark rested on Mount Judi, and it was said, “Away with the wrongdoing people!”",
    "Noah called out to his Lord, saying, “My Lord! Certainly my son is ˹also˺ of my family, Your promise is surely true, and You are the most just of all judges!”",
    "Allah replied, “O Noah! He is certainly not of your family—he was entirely of unrighteous conduct. So do not ask Me about what you have no knowledge of! I warn you so you do not fall into ignorance.”",
    "Noah pleaded, “My Lord, I seek refuge in You from asking You about what I have no knowledge of, and unless You forgive me and have mercy on me, I will be one of the losers.”",
    "It was said, “O Noah! Disembark with Our peace and blessings on you and some of the descendants of those with you. As for the others, We will allow them ˹a brief˺ enjoyment, then they will be touched with a painful punishment from Us.”",
    "This is one of the stories of the unseen, which we reveal to you ˹O Prophet˺. Neither you nor your people knew it before this. So be patient! Surely the ultimate outcome belongs ˹only˺ to the righteous.",
    "And to the people of ’Âd We sent their brother Hûd. He said, “O my people! Worship Allah. You have no god other than Him. You do nothing but fabricate lies ˹against Allah˺.",
    "O  my people! I do not ask you for any reward for this ˹message˺. My reward is only from the One Who created me. Will you not then understand?",
    "And O  my people! Seek your Lord’s forgiveness and turn to Him in repentance. He will shower you with rain in abundance, and add strength to your strength. So do not turn away, persisting in wickedness.”",
    "They argued, “O Hûd! You have not given us any clear proof, and we will never abandon our gods upon your word, nor will we believe in you.",
    "All we can say is that some of our gods have possessed you with evil.” He said, “I call Allah to witness, and you too bear witness, that I ˹totally˺ reject whatever you associate",
    "with Him ˹in worship˺. So let all of you plot against me without delay!",
    "I have put my trust in Allah—my Lord and your Lord. There is no living creature that is not completely under His control. Surely my Lord’s Way is perfect justice.",
    "But if you turn away, I have already delivered to you what I have been sent with. My Lord will replace you with others. You are not harming Him in the least. Indeed, my Lord is a ˹vigilant˺ Keeper over all things.”",
    "When Our command came, We rescued Hûd and those who believed with him by a mercy from Us, saving them from a harsh torment.",
    "That was ’Âd. They denied the signs of their Lord, disobeyed His messengers, and followed the command of every stubborn tyrant.",
    "They were followed by a curse in this world, as they will be on the Day of Judgment. Surely ’Âd denied their Lord. So away with ’Âd, the people of Hûd.",
    "And to the people of Thamûd We sent their brother Ṣâliḥ. He said, “O my people! Worship Allah. You have no god other than Him. He ˹is the One Who˺ produced you from the earth and settled you on it. So seek His forgiveness and turn to Him in repentance. Surely my Lord is Ever Near, All-Responsive ˹to prayers˺.”",
    "They argued, “O Ṣâliḥ! We truly had high hopes in you before this. How dare you forbid us to worship what our forefathers had worshipped? We are certainly in alarming doubt about what you are inviting us to.”",
    "He responded, “O my people! Consider if I stand on a clear proof from my Lord and He has blessed me with a mercy from Him. Who could help me against Allah if I were to disobey Him? You would only contribute to my doom.",
    "And O  my people! This she-camel of Allah is a sign for you. So leave her to graze ˹freely˺ on Allah’s earth and do her no harm, or a swift punishment will overtake you!”",
    "But they killed her, so he warned ˹them˺, “You have ˹only˺ three ˹more˺ days to enjoy life in your homes—this is an unfailing promise!”",
    "When Our command came, We saved Ṣâliḥ and those who believed with him by a mercy from Us and spared them the disgrace of that Day. Surely your Lord ˹alone˺ is the All-Powerful, Almighty.",
    "And the ˹mighty˺ blast overtook the wrongdoers, so they fell lifeless in their homes",
    "as if they had never lived there. Surely Thamûd denied their Lord, so away with Thamûd!",
    "And surely Our messenger-angels came to Abraham with good news ˹of a son˺. They greeted ˹him with˺, “Peace!” And he replied, “Peace ˹be upon you˺!” Then it was not long before he brought ˹them˺ a ˹fat,˺ roasted calf.",
    "And when he saw that their hands did not reach for the food, he became suspicious and fearful of them. They reassured ˹him˺, “Do not be afraid! We are ˹angels˺ sent ˹only˺ against the people of Lot.”",
    "And his wife was standing by, so she laughed, then We gave her good news of ˹the birth of˺ Isaac, and, after him, Jacob.",
    "She wondered, “Oh, my! How can I have a child in this old age, and my husband here is an old man? This is truly an astonishing thing!”",
    "They responded, “Are you astonished by Allah’s decree? May Allah’s mercy and blessings be upon you, O  people of this house. Indeed, He is Praiseworthy, All-Glorious.”",
    "Then after the fear had left Abraham, and the good news had reached him, he began to plead with Us for the people of Lot.",
    "Truly, Abraham was forbearing, tender-hearted, and ever turning ˹to his Lord˺.",
    "˹The angels said,˺ “O Abraham! Plead no more! Your Lord’s decree has already come, and they will certainly be afflicted with a punishment that cannot be averted!”",
    "When Our messenger-angels came to Lot, he was distressed and worried by their arrival. He said, “This is a terrible day.”",
    "And ˹the men of˺ his people—who were used to shameful deeds—came to him rushing. He pleaded, “O my people! Here are my daughters ˹for marriage˺—they are pure for you. So fear Allah, and do not humiliate me by disrespecting my guests. Is there not ˹even˺ a single right-minded man among you?”",
    "They argued, “You certainly know that we have no need for your daughters. You already know what we desire!”",
    "He responded, “If only I had the strength ˹to resist you˺ or could rely on a strong supporter.”",
    "The angels said, “O Lot! We are the messengers of your Lord. They will never reach you. So travel with your family in the dark of night, and do not let any of you look back, except your wife. She will certainly suffer the fate of the others. Their appointed time is the morning. Is the morning not near?”",
    "When Our command came, We turned the cities upside down and rained down on them clustered stones of baked clay",
    "marked by your Lord ˹O Prophet˺. And these stones are not far from the ˹pagan˺ wrongdoers!",
    "And to the people of Midian We sent their brother Shu’aib. He said, “O my people! Worship Allah. You have no god other than Him. And do not give short measure and weight. I do see you in prosperity now, but I truly fear for you the torment of an overwhelming Day.",
    "O  my people! Give full measure and weigh with justice. Do not defraud people of their property, nor go about spreading corruption in the land.",
    "What is left ˹as a lawful gain˺ by Allah is far better for you if you are ˹truly˺ believers. And I am not a keeper over you.”",
    "They asked ˹sarcastically˺, “O Shu’aib! Does your prayer command you that we should abandon what our forefathers worshipped or give up managing our wealth as we please? Indeed, you are such a tolerant, sensible man!”",
    "He said, “O my people! Consider if I stand on a clear proof from my Lord and He has blessed me with a good provision from Him. I do not want to do what I am forbidding you from. I only intend reform to the best of my ability. My success comes only through Allah. In Him I trust and to Him I turn.",
    "O  my people! Do not let your opposition to me lead you to a fate similar to that of the people of Noah, or Hûd, or Ṣâliḥ. And the people of Lot are not far from you.",
    "So seek your Lord’s forgiveness and turn to Him in repentance. Surely my Lord is Most Merciful, All-Loving.”",
    "They threatened, “O Shu’aib! We do not comprehend much of what you say, and surely we see you powerless among us. Were it not for your clan, we would have certainly stoned you, for you are nothing to us.”",
    "He said, “O my people! Do you have more regard for my clan than for Allah, turning your back on Him entirely? Surely my Lord is Fully Aware of what you do.",
    "O  my people! Persist in your ways, for I ˹too˺ will persist in mine. You will soon come to know who will be visited by a humiliating torment and is a liar! And watch! I too am watching with you!”",
    "When Our command came, We saved Shu’aib and those who believed with him by a mercy from Us. And the ˹mighty˺ blast overtook the wrongdoers, so they fell lifeless in their homes",
    "as if they had never lived there. So away with Midian as it was with Thamûd!",
    "Indeed, We sent Moses with Our signs and compelling proof",
    "to Pharaoh and his chiefs, but they followed the command of Pharaoh, and Pharaoh’s command was not well guided.",
    "He will be before his people on the Day of Judgment and will lead them into the Fire. What an evil place to be led into!",
    "They were followed by a curse in this ˹life˺ and ˹will receive another˺ on the Day of Judgment. What an evil gift to receive!",
    "These are accounts, We relate to you ˹O Prophet˺, of the ˹destroyed˺ cities. Some are still standing ˹barren˺, while others have been mowed down.",
    "We did not wrong them, rather they wronged themselves. The gods they invoked beside Allah were of no help at all when the command of your Lord came, and only contributed to their ruin.",
    "Such is the ˹crushing˺ grip of your Lord when He seizes the societies entrenched in wrongdoing. Indeed, His grip is ˹terribly˺ painful and severe.",
    "Surely in this is a sign for those who fear the torment of the Hereafter. That is a Day for which humanity will be gathered and a Day ˹that will be˺ witnessed ˹by all˺.",
    "We only delay it for a fixed term.",
    "When that Day arrives, no one will dare speak except with His permission. Some of them will be miserable, others joyful.",
    "As for those bound for misery, they will be in the Fire, where they will be sighing and gasping",
    "staying there forever, as long as the heavens and the earth will endure, except what your Lord wills. Surely your Lord does what He intends.",
    "And as for those destined to joy, they will be in Paradise, staying there forever, as long as the heavens and the earth will endure, except what your Lord wills—a ˹generous˺ giving, without end.",
    "So do not be in doubt ˹O Prophet˺ about what those ˹pagans˺ worship. They worship nothing except what their forefathers worshipped before ˹them˺. And We will certainly give them their share ˹of punishment˺ in full, without any reduction.",
    "Indeed, We had given Moses the Scripture, but differences arose regarding it. Had it not been for a prior decree from your Lord, their differences would have been settled ˹at once˺. They are truly in alarming doubt about it.",
    "And surely your Lord will fully pay all for their deeds. He is certainly All-Aware of what they do.",
    "So be steadfast as you are commanded ˹O Prophet˺, along with those who turn ˹in submission to Allah˺ with you. And do not transgress. Surely He is All-Seeing of what you ˹believers˺ do.",
    "And do not be inclined to the wrongdoers or you will be touched by the Fire. For then you would have no protectors other than Allah, nor would you be helped.",
    "Establish prayer ˹O Prophet˺ at both ends of the day and in the early part of the night. Surely good deeds wipe out evil deeds. That is a reminder for the mindful.",
    "And be patient! Certainly Allah does not discount the reward of the good-doers.",
    "If only there had been among the ˹destroyed˺ peoples before you, ˹O believers,˺ virtuous individuals who forbade corruption in the land—other than the few We had saved ˹from the torment˺. But the wrongdoers ˹only˺ pursued their ˹worldly˺ pleasures, becoming wicked.",
    "And your Lord ˹O Prophet˺ would never destroy a society unjustly while its people were acting rightly.",
    "Had your Lord so willed, He would have certainly made humanity one single community ˹of believers˺, but they will always ˹choose to˺ differ—",
    "except those shown mercy by your Lord—and so He created them ˹to choose freely˺. And so the Word of your Lord will be fulfilled: “I will surely fill up Hell with jinn and humans all together.”",
    "And We relate to you ˹O Prophet˺ the stories of the messengers to reassure your heart. And there has come to you in this ˹sûrah˺ the truth, a warning ˹to the disbelievers˺, and a reminder to the believers.",
    "Say to those who disbelieve, “Persist in your ways; we will certainly persist in ours.",
    "And wait! Surely we ˹too˺ are waiting.”",
    "To Allah ˹alone˺ belongs the knowledge of what is hidden in the heavens and the earth. And to Him all matters are returned. So worship Him and put your trust in Him. And your Lord is never unaware of what you do."
  ],
  "arabic1": [
    "الٓرٰ ۫ كِتٰبٌ اُحْكِمَتْ اٰیٰتُهٗ ثُمَّ فُصِّلَتْ مِنْ لَّدُنْ حَكِیْمٍ خَبِیْرٍ",
    "اَلَّا تَعْبُدُوْۤا اِلَّا اللّٰهَ اِنَّنِیْ لَكُمْ مِّنْهُ نَذِیْرٌ وَّبَشِیْرٌ",
    "وَّاَنِ اسْتَغْفِرُوْا رَبَّكُمْ ثُمَّ تُوْبُوْۤا اِلَیْهِ یُمَتِّعْكُمْ مَّتَاعًا حَسَنًا اِلٰۤی اَجَلٍ مُّسَمًّی وَّیُؤْتِ كُلَّ ذِیْ فَضْلٍ فَضْلَهٗ وَاِنْ تَوَلَّوْا فَاِنِّیْۤ اَخَافُ عَلَیْكُمْ عَذَابَ یَوْمٍ كَبِیْرٍ",
    "اِلَی اللّٰهِ مَرْجِعُكُمْ وَهُوَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "اَلَاۤ اِنَّهُمْ یَثْنُوْنَ صُدُوْرَهُمْ لِیَسْتَخْفُوْا مِنْهُ اَلَا حِیْنَ یَسْتَغْشُوْنَ ثِیَابَهُمْ یَعْلَمُ مَا یُسِرُّوْنَ وَمَا یُعْلِنُوْنَ اِنَّهٗ عَلِیْمٌۢ بِذَاتِ الصُّدُوْرِ",
    "وَمَا مِنْ دَآبَّةٍ فِی الْاَرْضِ اِلَّا عَلَی اللّٰهِ رِزْقُهَا وَیَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا كُلٌّ فِیْ كِتٰبٍ مُّبِیْنٍ",
    "وَهُوَ الَّذِیْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ فِیْ سِتَّةِ اَیَّامٍ وَّكَانَ عَرْشُهٗ عَلَی الْمَآءِ لِیَبْلُوَكُمْ اَیُّكُمْ اَحْسَنُ عَمَلًا وَلَىِٕنْ قُلْتَ اِنَّكُمْ مَّبْعُوْثُوْنَ مِنْ بَعْدِ الْمَوْتِ لَیَقُوْلَنَّ الَّذِیْنَ كَفَرُوْۤا اِنْ هٰذَاۤ اِلَّا سِحْرٌ مُّبِیْنٌ",
    "وَلَىِٕنْ اَخَّرْنَا عَنْهُمُ الْعَذَابَ اِلٰۤی اُمَّةٍ مَّعْدُوْدَةٍ لَّیَقُوْلُنَّ مَا یَحْبِسُهٗ اَلَا یَوْمَ یَاْتِیْهِمْ لَیْسَ مَصْرُوْفًا عَنْهُمْ وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ یَسْتَهْزِءُوْنَ",
    "وَلَىِٕنْ اَذَقْنَا الْاِنْسَانَ مِنَّا رَحْمَةً ثُمَّ نَزَعْنٰهَا مِنْهُ اِنَّهٗ لَیَـُٔوْسٌ كَفُوْرٌ",
    "وَلَىِٕنْ اَذَقْنٰهُ نَعْمَآءَ بَعْدَ ضَرَّآءَ مَسَّتْهُ لَیَقُوْلَنَّ ذَهَبَ السَّیِّاٰتُ عَنِّیْ اِنَّهٗ لَفَرِحٌ فَخُوْرٌ",
    "اِلَّا الَّذِیْنَ صَبَرُوْا وَعَمِلُوا الصّٰلِحٰتِ اُولٰٓىِٕكَ لَهُمْ مَّغْفِرَةٌ وَّاَجْرٌ كَبِیْرٌ",
    "فَلَعَلَّكَ تَارِكٌ بَعْضَ مَا یُوْحٰۤی اِلَیْكَ وَضَآىِٕقٌ بِهٖ صَدْرُكَ اَنْ یَّقُوْلُوْا لَوْلَاۤ اُنْزِلَ عَلَیْهِ كَنْزٌ اَوْ جَآءَ مَعَهٗ مَلَكٌ اِنَّمَاۤ اَنْتَ نَذِیْرٌ وَاللّٰهُ عَلٰی كُلِّ شَیْءٍ وَّكِیْلٌ",
    "اَمْ یَقُوْلُوْنَ افْتَرٰىهُ قُلْ فَاْتُوْا بِعَشْرِ سُوَرٍ مِّثْلِهٖ مُفْتَرَیٰتٍ وَّادْعُوْا مَنِ اسْتَطَعْتُمْ مِّنْ دُوْنِ اللّٰهِ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "فَاِلَّمْ یَسْتَجِیْبُوْا لَكُمْ فَاعْلَمُوْۤا اَنَّمَاۤ اُنْزِلَ بِعِلْمِ اللّٰهِ وَاَنْ لَّاۤ اِلٰهَ اِلَّا هُوَ فَهَلْ اَنْتُمْ مُّسْلِمُوْنَ",
    "مَنْ كَانَ یُرِیْدُ الْحَیٰوةَ الدُّنْیَا وَزِیْنَتَهَا نُوَفِّ اِلَیْهِمْ اَعْمَالَهُمْ فِیْهَا وَهُمْ فِیْهَا لَا یُبْخَسُوْنَ",
    "اُولٰٓىِٕكَ الَّذِیْنَ لَیْسَ لَهُمْ فِی الْاٰخِرَةِ اِلَّا النَّارُ ۖ وَحَبِطَ مَا صَنَعُوْا فِیْهَا وَبٰطِلٌ مَّا كَانُوْا یَعْمَلُوْنَ",
    "اَفَمَنْ كَانَ عَلٰی بَیِّنَةٍ مِّنْ رَّبِّهٖ وَیَتْلُوْهُ شَاهِدٌ مِّنْهُ وَمِنْ قَبْلِهٖ كِتٰبُ مُوْسٰۤی اِمَامًا وَّرَحْمَةً اُولٰٓىِٕكَ یُؤْمِنُوْنَ بِهٖ وَمَنْ یَّكْفُرْ بِهٖ مِنَ الْاَحْزَابِ فَالنَّارُ مَوْعِدُهٗ فَلَا تَكُ فِیْ مِرْیَةٍ مِّنْهُ اِنَّهُ الْحَقُّ مِنْ رَّبِّكَ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یُؤْمِنُوْنَ",
    "وَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰی عَلَی اللّٰهِ كَذِبًا اُولٰٓىِٕكَ یُعْرَضُوْنَ عَلٰی رَبِّهِمْ وَیَقُوْلُ الْاَشْهَادُ هٰۤؤُلَآءِ الَّذِیْنَ كَذَبُوْا عَلٰی رَبِّهِمْ اَلَا لَعْنَةُ اللّٰهِ عَلَی الظّٰلِمِیْنَ",
    "الَّذِیْنَ یَصُدُّوْنَ عَنْ سَبِیْلِ اللّٰهِ وَیَبْغُوْنَهَا عِوَجًا وَهُمْ بِالْاٰخِرَةِ هُمْ كٰفِرُوْنَ",
    "اُولٰٓىِٕكَ لَمْ یَكُوْنُوْا مُعْجِزِیْنَ فِی الْاَرْضِ وَمَا كَانَ لَهُمْ مِّنْ دُوْنِ اللّٰهِ مِنْ اَوْلِیَآءَ یُضٰعَفُ لَهُمُ الْعَذَابُ مَا كَانُوْا یَسْتَطِیْعُوْنَ السَّمْعَ وَمَا كَانُوْا یُبْصِرُوْنَ",
    "اُولٰٓىِٕكَ الَّذِیْنَ خَسِرُوْۤا اَنْفُسَهُمْ وَضَلَّ عَنْهُمْ مَّا كَانُوْا یَفْتَرُوْنَ",
    "لَا جَرَمَ اَنَّهُمْ فِی الْاٰخِرَةِ هُمُ الْاَخْسَرُوْنَ",
    "اِنَّ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَاَخْبَتُوْۤا اِلٰی رَبِّهِمْ اُولٰٓىِٕكَ اَصْحٰبُ الْجَنَّةِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "مَثَلُ الْفَرِیْقَیْنِ كَالْاَعْمٰی وَالْاَصَمِّ وَالْبَصِیْرِ وَالسَّمِیْعِ هَلْ یَسْتَوِیٰنِ مَثَلًا اَفَلَا تَذَكَّرُوْنَ",
    "وَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰی قَوْمِهٖۤ اِنِّیْ لَكُمْ نَذِیْرٌ مُّبِیْنٌ",
    "اَنْ لَّا تَعْبُدُوْۤا اِلَّا اللّٰهَ اِنِّیْۤ اَخَافُ عَلَیْكُمْ عَذَابَ یَوْمٍ اَلِیْمٍ",
    "فَقَالَ الْمَلَاُ الَّذِیْنَ كَفَرُوْا مِنْ قَوْمِهٖ مَا نَرٰىكَ اِلَّا بَشَرًا مِّثْلَنَا وَمَا نَرٰىكَ اتَّبَعَكَ اِلَّا الَّذِیْنَ هُمْ اَرَاذِلُنَا بَادِیَ الرَّاْیِ وَمَا نَرٰی لَكُمْ عَلَیْنَا مِنْ فَضْلٍۢ بَلْ نَظُنُّكُمْ كٰذِبِیْنَ",
    "قَالَ یٰقَوْمِ اَرَءَیْتُمْ اِنْ كُنْتُ عَلٰی بَیِّنَةٍ مِّنْ رَّبِّیْ وَاٰتٰىنِیْ رَحْمَةً مِّنْ عِنْدِهٖ فَعُمِّیَتْ عَلَیْكُمْ اَنُلْزِمُكُمُوْهَا وَاَنْتُمْ لَهَا كٰرِهُوْنَ",
    "وَیٰقَوْمِ لَاۤ اَسْـَٔلُكُمْ عَلَیْهِ مَالًا اِنْ اَجْرِیَ اِلَّا عَلَی اللّٰهِ وَمَاۤ اَنَا بِطَارِدِ الَّذِیْنَ اٰمَنُوْا اِنَّهُمْ مُّلٰقُوْا رَبِّهِمْ وَلٰكِنِّیْۤ اَرٰىكُمْ قَوْمًا تَجْهَلُوْنَ",
    "وَیٰقَوْمِ مَنْ یَّنْصُرُنِیْ مِنَ اللّٰهِ اِنْ طَرَدْتُّهُمْ اَفَلَا تَذَكَّرُوْنَ",
    "وَلَاۤ اَقُوْلُ لَكُمْ عِنْدِیْ خَزَآىِٕنُ اللّٰهِ وَلَاۤ اَعْلَمُ الْغَیْبَ وَلَاۤ اَقُوْلُ اِنِّیْ مَلَكٌ وَّلَاۤ اَقُوْلُ لِلَّذِیْنَ تَزْدَرِیْۤ اَعْیُنُكُمْ لَنْ یُّؤْتِیَهُمُ اللّٰهُ خَیْرًا اَللّٰهُ اَعْلَمُ بِمَا فِیْۤ اَنْفُسِهِمْ اِنِّیْۤ اِذًا لَّمِنَ الظّٰلِمِیْنَ",
    "قَالُوْا یٰنُوْحُ قَدْ جَادَلْتَنَا فَاَكْثَرْتَ جِدَالَنَا فَاْتِنَا بِمَا تَعِدُنَاۤ اِنْ كُنْتَ مِنَ الصّٰدِقِیْنَ",
    "قَالَ اِنَّمَا یَاْتِیْكُمْ بِهِ اللّٰهُ اِنْ شَآءَ وَمَاۤ اَنْتُمْ بِمُعْجِزِیْنَ",
    "وَلَا یَنْفَعُكُمْ نُصْحِیْۤ اِنْ اَرَدْتُّ اَنْ اَنْصَحَ لَكُمْ اِنْ كَانَ اللّٰهُ یُرِیْدُ اَنْ یُّغْوِیَكُمْ هُوَ رَبُّكُمْ ۫ وَاِلَیْهِ تُرْجَعُوْنَ",
    "اَمْ یَقُوْلُوْنَ افْتَرٰىهُ قُلْ اِنِ افْتَرَیْتُهٗ فَعَلَیَّ اِجْرَامِیْ وَاَنَا بَرِیْٓءٌ مِّمَّا تُجْرِمُوْنَ",
    "وَاُوْحِیَ اِلٰی نُوْحٍ اَنَّهٗ لَنْ یُّؤْمِنَ مِنْ قَوْمِكَ اِلَّا مَنْ قَدْ اٰمَنَ فَلَا تَبْتَىِٕسْ بِمَا كَانُوْا یَفْعَلُوْنَ",
    "وَاصْنَعِ الْفُلْكَ بِاَعْیُنِنَا وَوَحْیِنَا وَلَا تُخَاطِبْنِیْ فِی الَّذِیْنَ ظَلَمُوْا اِنَّهُمْ مُّغْرَقُوْنَ",
    "وَیَصْنَعُ الْفُلْكَ ۫ وَكُلَّمَا مَرَّ عَلَیْهِ مَلَاٌ مِّنْ قَوْمِهٖ سَخِرُوْا مِنْهُ قَالَ اِنْ تَسْخَرُوْا مِنَّا فَاِنَّا نَسْخَرُ مِنْكُمْ كَمَا تَسْخَرُوْنَ",
    "فَسَوْفَ تَعْلَمُوْنَ مَنْ یَّاْتِیْهِ عَذَابٌ یُّخْزِیْهِ وَیَحِلُّ عَلَیْهِ عَذَابٌ مُّقِیْمٌ",
    "حَتّٰۤی اِذَا جَآءَ اَمْرُنَا وَفَارَ التَّنُّوْرُ قُلْنَا احْمِلْ فِیْهَا مِنْ كُلٍّ زَوْجَیْنِ اثْنَیْنِ وَاَهْلَكَ اِلَّا مَنْ سَبَقَ عَلَیْهِ الْقَوْلُ وَمَنْ اٰمَنَ وَمَاۤ اٰمَنَ مَعَهٗۤ اِلَّا قَلِیْلٌ",
    "وَقَالَ ارْكَبُوْا فِیْهَا بِسْمِ اللّٰهِ مَجْرٖىهَا وَمُرْسٰىهَا اِنَّ رَبِّیْ لَغَفُوْرٌ رَّحِیْمٌ",
    "وَهِیَ تَجْرِیْ بِهِمْ فِیْ مَوْجٍ كَالْجِبَالِ ۫ وَنَادٰی نُوْحُ ١بْنَهٗ وَكَانَ فِیْ مَعْزِلٍ یّٰبُنَیَّ ارْكَبْ مَّعَنَا وَلَا تَكُنْ مَّعَ الْكٰفِرِیْنَ",
    "قَالَ سَاٰوِیْۤ اِلٰی جَبَلٍ یَّعْصِمُنِیْ مِنَ الْمَآءِ قَالَ لَا عَاصِمَ الْیَوْمَ مِنْ اَمْرِ اللّٰهِ اِلَّا مَنْ رَّحِمَ وَحَالَ بَیْنَهُمَا الْمَوْجُ فَكَانَ مِنَ الْمُغْرَقِیْنَ",
    "وَقِیْلَ یٰۤاَرْضُ ابْلَعِیْ مَآءَكِ وَیٰسَمَآءُ اَقْلِعِیْ وَغِیْضَ الْمَآءُ وَقُضِیَ الْاَمْرُ وَاسْتَوَتْ عَلَی الْجُوْدِیِّ وَقِیْلَ بُعْدًا لِّلْقَوْمِ الظّٰلِمِیْنَ",
    "وَنَادٰی نُوْحٌ رَّبَّهٗ فَقَالَ رَبِّ اِنَّ ابْنِیْ مِنْ اَهْلِیْ وَاِنَّ وَعْدَكَ الْحَقُّ وَاَنْتَ اَحْكَمُ الْحٰكِمِیْنَ",
    "قَالَ یٰنُوْحُ اِنَّهٗ لَیْسَ مِنْ اَهْلِكَ اِنَّهٗ عَمَلٌ غَیْرُ صَالِحٍ فَلَا تَسْـَٔلْنِ مَا لَیْسَ لَكَ بِهٖ عِلْمٌ اِنِّیْۤ اَعِظُكَ اَنْ تَكُوْنَ مِنَ الْجٰهِلِیْنَ",
    "قَالَ رَبِّ اِنِّیْۤ اَعُوْذُ بِكَ اَنْ اَسْـَٔلَكَ مَا لَیْسَ لِیْ بِهٖ عِلْمٌ وَاِلَّا تَغْفِرْ لِیْ وَتَرْحَمْنِیْۤ اَكُنْ مِّنَ الْخٰسِرِیْنَ",
    "قِیْلَ یٰنُوْحُ اهْبِطْ بِسَلٰمٍ مِّنَّا وَبَرَكٰتٍ عَلَیْكَ وَعَلٰۤی اُمَمٍ مِّمَّنْ مَّعَكَ وَاُمَمٌ سَنُمَتِّعُهُمْ ثُمَّ یَمَسُّهُمْ مِّنَّا عَذَابٌ اَلِیْمٌ",
    "تِلْكَ مِنْ اَنْۢبَآءِ الْغَیْبِ نُوْحِیْهَاۤ اِلَیْكَ مَا كُنْتَ تَعْلَمُهَاۤ اَنْتَ وَلَا قَوْمُكَ مِنْ قَبْلِ هٰذَا فَاصْبِرْ اِنَّ الْعَاقِبَةَ لِلْمُتَّقِیْنَ",
    "وَاِلٰی عَادٍ اَخَاهُمْ هُوْدًا قَالَ یٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَیْرُهٗ اِنْ اَنْتُمْ اِلَّا مُفْتَرُوْنَ",
    "یٰقَوْمِ لَاۤ اَسْـَٔلُكُمْ عَلَیْهِ اَجْرًا اِنْ اَجْرِیَ اِلَّا عَلَی الَّذِیْ فَطَرَنِیْ اَفَلَا تَعْقِلُوْنَ",
    "وَیٰقَوْمِ اسْتَغْفِرُوْا رَبَّكُمْ ثُمَّ تُوْبُوْۤا اِلَیْهِ یُرْسِلِ السَّمَآءَ عَلَیْكُمْ مِّدْرَارًا وَّیَزِدْكُمْ قُوَّةً اِلٰی قُوَّتِكُمْ وَلَا تَتَوَلَّوْا مُجْرِمِیْنَ",
    "قَالُوْا یٰهُوْدُ مَا جِئْتَنَا بِبَیِّنَةٍ وَّمَا نَحْنُ بِتَارِكِیْۤ اٰلِهَتِنَا عَنْ قَوْلِكَ وَمَا نَحْنُ لَكَ بِمُؤْمِنِیْنَ",
    "اِنْ نَّقُوْلُ اِلَّا اعْتَرٰىكَ بَعْضُ اٰلِهَتِنَا بِسُوْٓءٍ قَالَ اِنِّیْۤ اُشْهِدُ اللّٰهَ وَاشْهَدُوْۤا اَنِّیْ بَرِیْٓءٌ مِّمَّا تُشْرِكُوْنَ",
    "مِنْ دُوْنِهٖ فَكِیْدُوْنِیْ جَمِیْعًا ثُمَّ لَا تُنْظِرُوْنِ",
    "اِنِّیْ تَوَكَّلْتُ عَلَی اللّٰهِ رَبِّیْ وَرَبِّكُمْ مَا مِنْ دَآبَّةٍ اِلَّا هُوَ اٰخِذٌ بِنَاصِیَتِهَا اِنَّ رَبِّیْ عَلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "فَاِنْ تَوَلَّوْا فَقَدْ اَبْلَغْتُكُمْ مَّاۤ اُرْسِلْتُ بِهٖۤ اِلَیْكُمْ وَیَسْتَخْلِفُ رَبِّیْ قَوْمًا غَیْرَكُمْ وَلَا تَضُرُّوْنَهٗ شَیْـًٔا اِنَّ رَبِّیْ عَلٰی كُلِّ شَیْءٍ حَفِیْظٌ",
    "وَلَمَّا جَآءَ اَمْرُنَا نَجَّیْنَا هُوْدًا وَّالَّذِیْنَ اٰمَنُوْا مَعَهٗ بِرَحْمَةٍ مِّنَّا وَنَجَّیْنٰهُمْ مِّنْ عَذَابٍ غَلِیْظٍ",
    "وَتِلْكَ عَادٌ جَحَدُوْا بِاٰیٰتِ رَبِّهِمْ وَعَصَوْا رُسُلَهٗ وَاتَّبَعُوْۤا اَمْرَ كُلِّ جَبَّارٍ عَنِیْدٍ",
    "وَاُتْبِعُوْا فِیْ هٰذِهِ الدُّنْیَا لَعْنَةً وَّیَوْمَ الْقِیٰمَةِ اَلَاۤ اِنَّ عَادًا كَفَرُوْا رَبَّهُمْ اَلَا بُعْدًا لِّعَادٍ قَوْمِ هُوْدٍ",
    "وَاِلٰی ثَمُوْدَ اَخَاهُمْ صٰلِحًا قَالَ یٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَیْرُهٗ هُوَ اَنْشَاَكُمْ مِّنَ الْاَرْضِ وَاسْتَعْمَرَكُمْ فِیْهَا فَاسْتَغْفِرُوْهُ ثُمَّ تُوْبُوْۤا اِلَیْهِ اِنَّ رَبِّیْ قَرِیْبٌ مُّجِیْبٌ",
    "قَالُوْا یٰصٰلِحُ قَدْ كُنْتَ فِیْنَا مَرْجُوًّا قَبْلَ هٰذَاۤ اَتَنْهٰىنَاۤ اَنْ نَّعْبُدَ مَا یَعْبُدُ اٰبَآؤُنَا وَاِنَّنَا لَفِیْ شَكٍّ مِّمَّا تَدْعُوْنَاۤ اِلَیْهِ مُرِیْبٍ",
    "قَالَ یٰقَوْمِ اَرَءَیْتُمْ اِنْ كُنْتُ عَلٰی بَیِّنَةٍ مِّنْ رَّبِّیْ وَاٰتٰىنِیْ مِنْهُ رَحْمَةً فَمَنْ یَّنْصُرُنِیْ مِنَ اللّٰهِ اِنْ عَصَیْتُهٗ ۫ فَمَا تَزِیْدُوْنَنِیْ غَیْرَ تَخْسِیْرٍ",
    "وَیٰقَوْمِ هٰذِهٖ نَاقَةُ اللّٰهِ لَكُمْ اٰیَةً فَذَرُوْهَا تَاْكُلْ فِیْۤ اَرْضِ اللّٰهِ وَلَا تَمَسُّوْهَا بِسُوْٓءٍ فَیَاْخُذَكُمْ عَذَابٌ قَرِیْبٌ",
    "فَعَقَرُوْهَا فَقَالَ تَمَتَّعُوْا فِیْ دَارِكُمْ ثَلٰثَةَ اَیَّامٍ ذٰلِكَ وَعْدٌ غَیْرُ مَكْذُوْبٍ",
    "فَلَمَّا جَآءَ اَمْرُنَا نَجَّیْنَا صٰلِحًا وَّالَّذِیْنَ اٰمَنُوْا مَعَهٗ بِرَحْمَةٍ مِّنَّا وَمِنْ خِزْیِ یَوْمِىِٕذٍ اِنَّ رَبَّكَ هُوَ الْقَوِیُّ الْعَزِیْزُ",
    "وَاَخَذَ الَّذِیْنَ ظَلَمُوا الصَّیْحَةُ فَاَصْبَحُوْا فِیْ دِیَارِهِمْ جٰثِمِیْنَ",
    "كَاَنْ لَّمْ یَغْنَوْا فِیْهَا اَلَاۤ اِنَّ ثَمُوْدَاۡ كَفَرُوْا رَبَّهُمْ اَلَا بُعْدًا لِّثَمُوْدَ",
    "وَلَقَدْ جَآءَتْ رُسُلُنَاۤ اِبْرٰهِیْمَ بِالْبُشْرٰی قَالُوْا سَلٰمًا قَالَ سَلٰمٌ فَمَا لَبِثَ اَنْ جَآءَ بِعِجْلٍ حَنِیْذٍ",
    "فَلَمَّا رَاٰۤ اَیْدِیَهُمْ لَا تَصِلُ اِلَیْهِ نَكِرَهُمْ وَاَوْجَسَ مِنْهُمْ خِیْفَةً قَالُوْا لَا تَخَفْ اِنَّاۤ اُرْسِلْنَاۤ اِلٰی قَوْمِ لُوْطٍ",
    "وَامْرَاَتُهٗ قَآىِٕمَةٌ فَضَحِكَتْ فَبَشَّرْنٰهَا بِاِسْحٰقَ وَمِنْ وَّرَآءِ اِسْحٰقَ یَعْقُوْبَ",
    "قَالَتْ یٰوَیْلَتٰۤی ءَاَلِدُ وَاَنَا عَجُوْزٌ وَّهٰذَا بَعْلِیْ شَیْخًا اِنَّ هٰذَا لَشَیْءٌ عَجِیْبٌ",
    "قَالُوْۤا اَتَعْجَبِیْنَ مِنْ اَمْرِ اللّٰهِ رَحْمَتُ اللّٰهِ وَبَرَكٰتُهٗ عَلَیْكُمْ اَهْلَ الْبَیْتِ اِنَّهٗ حَمِیْدٌ مَّجِیْدٌ",
    "فَلَمَّا ذَهَبَ عَنْ اِبْرٰهِیْمَ الرَّوْعُ وَجَآءَتْهُ الْبُشْرٰی یُجَادِلُنَا فِیْ قَوْمِ لُوْطٍ",
    "اِنَّ اِبْرٰهِیْمَ لَحَلِیْمٌ اَوَّاهٌ مُّنِیْبٌ",
    "یٰۤاِبْرٰهِیْمُ اَعْرِضْ عَنْ هٰذَا اِنَّهٗ قَدْ جَآءَ اَمْرُ رَبِّكَ وَاِنَّهُمْ اٰتِیْهِمْ عَذَابٌ غَیْرُ مَرْدُوْدٍ",
    "وَلَمَّا جَآءَتْ رُسُلُنَا لُوْطًا سِیْٓءَ بِهِمْ وَضَاقَ بِهِمْ ذَرْعًا وَّقَالَ هٰذَا یَوْمٌ عَصِیْبٌ",
    "وَجَآءَهٗ قَوْمُهٗ یُهْرَعُوْنَ اِلَیْهِ وَمِنْ قَبْلُ كَانُوْا یَعْمَلُوْنَ السَّیِّاٰتِ قَالَ یٰقَوْمِ هٰۤؤُلَآءِ بَنَاتِیْ هُنَّ اَطْهَرُ لَكُمْ فَاتَّقُوا اللّٰهَ وَلَا تُخْزُوْنِ فِیْ ضَیْفِیْ اَلَیْسَ مِنْكُمْ رَجُلٌ رَّشِیْدٌ",
    "قَالُوْا لَقَدْ عَلِمْتَ مَا لَنَا فِیْ بَنَاتِكَ مِنْ حَقٍّ وَاِنَّكَ لَتَعْلَمُ مَا نُرِیْدُ",
    "قَالَ لَوْ اَنَّ لِیْ بِكُمْ قُوَّةً اَوْ اٰوِیْۤ اِلٰی رُكْنٍ شَدِیْدٍ",
    "قَالُوْا یٰلُوْطُ اِنَّا رُسُلُ رَبِّكَ لَنْ یَّصِلُوْۤا اِلَیْكَ فَاَسْرِ بِاَهْلِكَ بِقِطْعٍ مِّنَ الَّیْلِ وَلَا یَلْتَفِتْ مِنْكُمْ اَحَدٌ اِلَّا امْرَاَتَكَ اِنَّهٗ مُصِیْبُهَا مَاۤ اَصَابَهُمْ اِنَّ مَوْعِدَهُمُ الصُّبْحُ اَلَیْسَ الصُّبْحُ بِقَرِیْبٍ",
    "فَلَمَّا جَآءَ اَمْرُنَا جَعَلْنَا عَالِیَهَا سَافِلَهَا وَاَمْطَرْنَا عَلَیْهَا حِجَارَةً مِّنْ سِجِّیْلٍ مَّنْضُوْدٍ",
    "مُّسَوَّمَةً عِنْدَ رَبِّكَ وَمَا هِیَ مِنَ الظّٰلِمِیْنَ بِبَعِیْدٍ",
    "وَاِلٰی مَدْیَنَ اَخَاهُمْ شُعَیْبًا قَالَ یٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَیْرُهٗ وَلَا تَنْقُصُوا الْمِكْیَالَ وَالْمِیْزَانَ اِنِّیْۤ اَرٰىكُمْ بِخَیْرٍ وَّاِنِّیْۤ اَخَافُ عَلَیْكُمْ عَذَابَ یَوْمٍ مُّحِیْطٍ",
    "وَیٰقَوْمِ اَوْفُوا الْمِكْیَالَ وَالْمِیْزَانَ بِالْقِسْطِ وَلَا تَبْخَسُوا النَّاسَ اَشْیَآءَهُمْ وَلَا تَعْثَوْا فِی الْاَرْضِ مُفْسِدِیْنَ",
    "بَقِیَّتُ اللّٰهِ خَیْرٌ لَّكُمْ اِنْ كُنْتُمْ مُّؤْمِنِیْنَ وَمَاۤ اَنَا عَلَیْكُمْ بِحَفِیْظٍ",
    "قَالُوْا یٰشُعَیْبُ اَصَلٰوتُكَ تَاْمُرُكَ اَنْ نَّتْرُكَ مَا یَعْبُدُ اٰبَآؤُنَاۤ اَوْ اَنْ نَّفْعَلَ فِیْۤ اَمْوَالِنَا مَا نَشٰٓؤُا اِنَّكَ لَاَنْتَ الْحَلِیْمُ الرَّشِیْدُ",
    "قَالَ یٰقَوْمِ اَرَءَیْتُمْ اِنْ كُنْتُ عَلٰی بَیِّنَةٍ مِّنْ رَّبِّیْ وَرَزَقَنِیْ مِنْهُ رِزْقًا حَسَنًا وَمَاۤ اُرِیْدُ اَنْ اُخَالِفَكُمْ اِلٰی مَاۤ اَنْهٰىكُمْ عَنْهُ اِنْ اُرِیْدُ اِلَّا الْاِصْلَاحَ مَا اسْتَطَعْتُ وَمَا تَوْفِیْقِیْۤ اِلَّا بِاللّٰهِ عَلَیْهِ تَوَكَّلْتُ وَاِلَیْهِ اُنِیْبُ",
    "وَیٰقَوْمِ لَا یَجْرِمَنَّكُمْ شِقَاقِیْۤ اَنْ یُّصِیْبَكُمْ مِّثْلُ مَاۤ اَصَابَ قَوْمَ نُوْحٍ اَوْ قَوْمَ هُوْدٍ اَوْ قَوْمَ صٰلِحٍ وَمَا قَوْمُ لُوْطٍ مِّنْكُمْ بِبَعِیْدٍ",
    "وَاسْتَغْفِرُوْا رَبَّكُمْ ثُمَّ تُوْبُوْۤا اِلَیْهِ اِنَّ رَبِّیْ رَحِیْمٌ وَّدُوْدٌ",
    "قَالُوْا یٰشُعَیْبُ مَا نَفْقَهُ كَثِیْرًا مِّمَّا تَقُوْلُ وَاِنَّا لَنَرٰىكَ فِیْنَا ضَعِیْفًا وَلَوْلَا رَهْطُكَ لَرَجَمْنٰكَ وَمَاۤ اَنْتَ عَلَیْنَا بِعَزِیْزٍ",
    "قَالَ یٰقَوْمِ اَرَهْطِیْۤ اَعَزُّ عَلَیْكُمْ مِّنَ اللّٰهِ وَاتَّخَذْتُمُوْهُ وَرَآءَكُمْ ظِهْرِیًّا اِنَّ رَبِّیْ بِمَا تَعْمَلُوْنَ مُحِیْطٌ",
    "وَیٰقَوْمِ اعْمَلُوْا عَلٰی مَكَانَتِكُمْ اِنِّیْ عَامِلٌ سَوْفَ تَعْلَمُوْنَ مَنْ یَّاْتِیْهِ عَذَابٌ یُّخْزِیْهِ وَمَنْ هُوَ كَاذِبٌ وَارْتَقِبُوْۤا اِنِّیْ مَعَكُمْ رَقِیْبٌ",
    "وَلَمَّا جَآءَ اَمْرُنَا نَجَّیْنَا شُعَیْبًا وَّالَّذِیْنَ اٰمَنُوْا مَعَهٗ بِرَحْمَةٍ مِّنَّا وَاَخَذَتِ الَّذِیْنَ ظَلَمُوا الصَّیْحَةُ فَاَصْبَحُوْا فِیْ دِیَارِهِمْ جٰثِمِیْنَ",
    "كَاَنْ لَّمْ یَغْنَوْا فِیْهَا اَلَا بُعْدًا لِّمَدْیَنَ كَمَا بَعِدَتْ ثَمُوْدُ",
    "وَلَقَدْ اَرْسَلْنَا مُوْسٰی بِاٰیٰتِنَا وَسُلْطٰنٍ مُّبِیْنٍ",
    "اِلٰی فِرْعَوْنَ وَمَلَاۡىِٕهٖ فَاتَّبَعُوْۤا اَمْرَ فِرْعَوْنَ وَمَاۤ اَمْرُ فِرْعَوْنَ بِرَشِیْدٍ",
    "یَقْدُمُ قَوْمَهٗ یَوْمَ الْقِیٰمَةِ فَاَوْرَدَهُمُ النَّارَ وَبِئْسَ الْوِرْدُ الْمَوْرُوْدُ",
    "وَاُتْبِعُوْا فِیْ هٰذِهٖ لَعْنَةً وَّیَوْمَ الْقِیٰمَةِ بِئْسَ الرِّفْدُ الْمَرْفُوْدُ",
    "ذٰلِكَ مِنْ اَنْۢبَآءِ الْقُرٰی نَقُصُّهٗ عَلَیْكَ مِنْهَا قَآىِٕمٌ وَّحَصِیْدٌ",
    "وَمَا ظَلَمْنٰهُمْ وَلٰكِنْ ظَلَمُوْۤا اَنْفُسَهُمْ فَمَاۤ اَغْنَتْ عَنْهُمْ اٰلِهَتُهُمُ الَّتِیْ یَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ مِنْ شَیْءٍ لَّمَّا جَآءَ اَمْرُ رَبِّكَ وَمَا زَادُوْهُمْ غَیْرَ تَتْبِیْبٍ",
    "وَكَذٰلِكَ اَخْذُ رَبِّكَ اِذَاۤ اَخَذَ الْقُرٰی وَهِیَ ظَالِمَةٌ اِنَّ اَخْذَهٗۤ اَلِیْمٌ شَدِیْدٌ",
    "اِنَّ فِیْ ذٰلِكَ لَاٰیَةً لِّمَنْ خَافَ عَذَابَ الْاٰخِرَةِ ذٰلِكَ یَوْمٌ مَّجْمُوْعٌ لَّهُ النَّاسُ وَذٰلِكَ یَوْمٌ مَّشْهُوْدٌ",
    "وَمَا نُؤَخِّرُهٗۤ اِلَّا لِاَجَلٍ مَّعْدُوْدٍ",
    "یَوْمَ یَاْتِ لَا تَكَلَّمُ نَفْسٌ اِلَّا بِاِذْنِهٖ فَمِنْهُمْ شَقِیٌّ وَّسَعِیْدٌ",
    "فَاَمَّا الَّذِیْنَ شَقُوْا فَفِی النَّارِ لَهُمْ فِیْهَا زَفِیْرٌ وَّشَهِیْقٌ",
    "خٰلِدِیْنَ فِیْهَا مَا دَامَتِ السَّمٰوٰتُ وَالْاَرْضُ اِلَّا مَا شَآءَ رَبُّكَ اِنَّ رَبَّكَ فَعَّالٌ لِّمَا یُرِیْدُ",
    "وَاَمَّا الَّذِیْنَ سُعِدُوْا فَفِی الْجَنَّةِ خٰلِدِیْنَ فِیْهَا مَا دَامَتِ السَّمٰوٰتُ وَالْاَرْضُ اِلَّا مَا شَآءَ رَبُّكَ عَطَآءً غَیْرَ مَجْذُوْذٍ",
    "فَلَا تَكُ فِیْ مِرْیَةٍ مِّمَّا یَعْبُدُ هٰۤؤُلَآءِ مَا یَعْبُدُوْنَ اِلَّا كَمَا یَعْبُدُ اٰبَآؤُهُمْ مِّنْ قَبْلُ وَاِنَّا لَمُوَفُّوْهُمْ نَصِیْبَهُمْ غَیْرَ مَنْقُوْصٍ",
    "وَلَقَدْ اٰتَیْنَا مُوْسَی الْكِتٰبَ فَاخْتُلِفَ فِیْهِ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ لَقُضِیَ بَیْنَهُمْ وَاِنَّهُمْ لَفِیْ شَكٍّ مِّنْهُ مُرِیْبٍ",
    "وَاِنَّ كُلًّا لَّمَّا لَیُوَفِّیَنَّهُمْ رَبُّكَ اَعْمَالَهُمْ اِنَّهٗ بِمَا یَعْمَلُوْنَ خَبِیْرٌ",
    "فَاسْتَقِمْ كَمَاۤ اُمِرْتَ وَمَنْ تَابَ مَعَكَ وَلَا تَطْغَوْا اِنَّهٗ بِمَا تَعْمَلُوْنَ بَصِیْرٌ",
    "وَلَا تَرْكَنُوْۤا اِلَی الَّذِیْنَ ظَلَمُوْا فَتَمَسَّكُمُ النَّارُ وَمَا لَكُمْ مِّنْ دُوْنِ اللّٰهِ مِنْ اَوْلِیَآءَ ثُمَّ لَا تُنْصَرُوْنَ",
    "وَاَقِمِ الصَّلٰوةَ طَرَفَیِ النَّهَارِ وَزُلَفًا مِّنَ الَّیْلِ اِنَّ الْحَسَنٰتِ یُذْهِبْنَ السَّیِّاٰتِ ذٰلِكَ ذِكْرٰی لِلذّٰكِرِیْنَ",
    "وَاصْبِرْ فَاِنَّ اللّٰهَ لَا یُضِیْعُ اَجْرَ الْمُحْسِنِیْنَ",
    "فَلَوْلَا كَانَ مِنَ الْقُرُوْنِ مِنْ قَبْلِكُمْ اُولُوْا بَقِیَّةٍ یَّنْهَوْنَ عَنِ الْفَسَادِ فِی الْاَرْضِ اِلَّا قَلِیْلًا مِّمَّنْ اَنْجَیْنَا مِنْهُمْ وَاتَّبَعَ الَّذِیْنَ ظَلَمُوْا مَاۤ اُتْرِفُوْا فِیْهِ وَكَانُوْا مُجْرِمِیْنَ",
    "وَمَا كَانَ رَبُّكَ لِیُهْلِكَ الْقُرٰی بِظُلْمٍ وَّاَهْلُهَا مُصْلِحُوْنَ",
    "وَلَوْ شَآءَ رَبُّكَ لَجَعَلَ النَّاسَ اُمَّةً وَّاحِدَةً وَّلَا یَزَالُوْنَ مُخْتَلِفِیْنَ",
    "اِلَّا مَنْ رَّحِمَ رَبُّكَ وَلِذٰلِكَ خَلَقَهُمْ وَتَمَّتْ كَلِمَةُ رَبِّكَ لَاَمْلَـَٔنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ اَجْمَعِیْنَ",
    "وَكُلًّا نَّقُصُّ عَلَیْكَ مِنْ اَنْۢبَآءِ الرُّسُلِ مَا نُثَبِّتُ بِهٖ فُؤَادَكَ وَجَآءَكَ فِیْ هٰذِهِ الْحَقُّ وَمَوْعِظَةٌ وَّذِكْرٰی لِلْمُؤْمِنِیْنَ",
    "وَقُلْ لِّلَّذِیْنَ لَا یُؤْمِنُوْنَ اعْمَلُوْا عَلٰی مَكَانَتِكُمْ اِنَّا عٰمِلُوْنَ",
    "وَانْتَظِرُوْا اِنَّا مُنْتَظِرُوْنَ",
    "وَلِلّٰهِ غَیْبُ السَّمٰوٰتِ وَالْاَرْضِ وَاِلَیْهِ یُرْجَعُ الْاَمْرُ كُلُّهٗ فَاعْبُدْهُ وَتَوَكَّلْ عَلَیْهِ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ"
  ],
  "bengali": [
    "আলিফ-লাম-রা। এটি কিতাব যার আয়াতসমূহ সুস্থিত করা হয়েছে, অতঃপর বিস্তারিতভাবে বর্ণনা করা হয়েছে প্রজ্ঞাময়, সবিশেষ অবহিত সত্ত্বার পক্ষ থেকে।",
    "(এ মর্মে) যে, তোমরা আল্লাহ ছাড়া কারো ইবাদাত করো না। নিশ্চয় আমি তোমাদের জন্য তাঁর পক্ষ থেকে সতর্ককারী ও সুসংবাদদাতা।",
    "আর তোমরা তোমাদের রবের কাছে ক্ষমা চাও। তারপর তার কাছে ফিরে যাও, (তাহলে) তিনি তোমাদেরকে নির্ধারিত সময় পর্যন্ত উত্তম ভোগ-উপকরণ দেবেন এবং প্রর্তেক আনুগত্যশীলকে তাঁর আনুগত্য মুতাবিক দান করবেন। আর যদি তারা ফিরে যায়, তবে আমি নিশ্চয় তোমাদের উপর বড় এক দিনের আযাবের ভয় করছি।",
    "আল্লাহর নিকটই তোমাদের প্রত্যাবর্তন এবং তিনি সব কিছুর উপর ক্ষমতাশীল।",
    "জেনে রাখ, নিশ্চয় তারা তাদের বুক ফিরিয়ে নেয়, যাতে তারা তার থেকে আত্মগোপন করতে পারে। জেনে রাখ, যখন তারা কাপড় আবৃত হয়, তখন তিনি জানেন যা তারা গোপন করে এবং যা তারা প্রকাশ করে। নিশ্চয় তিনি অন্তর্যামী।",
    "আর যমীনে বিচরণকারী প্রতিটি প্রাণীর রিয্কের দায়িত্ব আল্লাহরই এবং তিনি জানেন তাদের আবাসস্থল ও সমাধিস্থল* । সব কিছু আছে স্পষ্ট কিতাবে**। \n* এখানে مستقر বা আবাসস্থল বলতে মাতৃগর্ভে অবস্থান মতান্তরে মৃত্যু পর্যন্ত দুনিয়ায় অবস্থানকে বুঝানো হয়েছে। আর مستودع দ্বারা কবরস্থ করার স্থান মতান্তরে জন্মের পূর্বে পিতৃমেরুদন্ডে অবস্থান কিংবা মৃত্যুর সময় বা স্থান বুঝানো হয়েছে।",
    "আর তিনিই আসমানসমূহ ও যমীন সৃষ্টি করেছেন ছয় দিনে, আর তাঁর আরশ ছিল পানির উপর, যাতে তিনি পরীক্ষা করেন, কে তোমাদের মধ্যে আমলে সর্বোত্তম। আর তুমি যদি বল, ‘মৃত্যুর পর নিশ্চয় তোমাদেরকে পুনরুজ্জীবিত করা হবে’, তবে কাফিররা অবশ্যই বলবে, ‘এতো শুধুই স্পষ্ট যাদু’।",
    "আর যদি আমি নির্দিষ্ট সময় পর্যন্ত তাদের থেকে আযাব বিলম্বিত করি, তবে তারা অবশ্যই বলবে, ‘কোন্ বস্তু তাকে ঠেকিয়ে রাখল’? সাবধান ! যেদিন তাদের উপর তা নেমে আসবে, সেদিন তাদের থেকে তা ফেরানো হবে না এবং তারা যা নিয়ে উপহাস করত, তাদেরকে তা ঘিরে ফেলবে।",
    "আর যদি আমি মানুষকে আমার পক্ষ থেকে রহমত আস্বাদন করাই, অতঃপর তার থেকে তা কেড়ে নেই, নিশ্চয় সে তখন (হয়ে পড়বে) নিরাশ, অকৃতজ্ঞ।",
    "আর দুঃখ-দুর্দশা স্পর্শ করার পর যদি আমি তাকে নিআমত আস্বাদন করাই, তাহলে সে অবশ্যই বলবে, ‘আমার থেকে বিপদ-আপদ দূর হয়ে গেছে, আর সে হবে অতি উৎফুল্ল, অহঙ্কারী।",
    "তবে যারা সবর করেছে এবং সৎকর্ম করেছে, তাদের জন্যই রয়েছে ক্ষমা ও মহা প্রতিদান।",
    "তাহলে সম্ভবত তুমি তোমার উপর অবতীর্ণ ওহীর কিছু বিষয় ছেড়ে দেবে এবং তোমার বুক সঙ্কুচিত হবে এ কারণে যে, তারা বলে, ‘কেন তার উপর ধন-ভান্ডার অবতীর্ণ হয়নি, কিংবা তার সাথে ফেরেশতা আসেনি’? তুমি তো শুধু সতর্ককারী আর আল্লাহ সব কিছুর তত্ত্বাবধায়ক।",
    "নাকি তারা বলে, ‘সে এটা রটনা করেছে’? বল, ‘তাহলে তোমরা এর অনুরূপ দশটি সূরা বানিয়ে নিয়ে আস এবং আল্লাহ ছাড়া যাকে পার ডেকে আন, যদি তোমরা সত্যবাদী হও’।",
    "অতঃপর তারা যদি তোমাদের আহবানে সাড়া না দেয়, তাহলে জেনে রাখ, এটা আল্লাহর জ্ঞান অনুসারেই নাযিল করা হয়েছে এবং তিনি ছাড়া কোন (সত্য) ইলাহ্ নেই। অতঃপর তোমরা কি অনুগত হবে?",
    "যে ব্যক্তি দুনিয়ার জীবন ও তার জৌলুস কামনা করে, আমি সেখানে তাদেরকে তাদের আমলের ফল পুরোপুরি দিয়ে দেই এবং সেখানে তাদেরকে কম দেয়া হবে না।",
    "এরাই তারা, আখিরাতে যাদের জন্য আগুন ছাড়া আর কিছুই নেই এবং তারা সেখানে যা করে তা বরবাদ হয়ে যাবে আর তারা যা করত, তা সম্পূর্ণ বাতিল।",
    "যারা তার রবের পক্ষ থেকে স্পষ্ট প্রমাণের উপর প্রতিষ্ঠিত এবং অনুসরণ করে তাঁর পক্ষ থেকে একজন সাক্ষী* এবং যার পূর্বে রয়েছে মূসার কিতাব পথপ্রদর্শক ও রহমতস্বরূপ,(তারা কি ঐ লোকদের মত, যারা দুনিয়া ও তার জৌলুস কামনায় বিভোর?) এরাই তার প্রতি ঈমান পোষণ করে। আর যে সকল দল তা অস্বীকার করে, আগুনই হবে তাদের প্রতিশ্রুত স্থান। সুতরাং তুমি এতে মোটেও সন্দেহের মধ্যে থেকো না, নিশ্চয় তা তোমার রবের পক্ষ থেকে প্রেরিত সত্য। কিন্তু অধিকাংশ মানুষ ঈমান আনে না। \n* সাক্ষী দ্বারা মুহাম্মাদ সা. কে বুঝানো হয়েছে।",
    "যারা আল্লাহর ব্যাপারে মিথ্যা রটনা করে, তাদের চেয়ে অধিক যালিম কে? তাদেরকে তাদের রবের সামনে উপস্থিত করা হবে এবং সাক্ষীগণ বলবে, ‘এরাই তাদের রবের ব্যাপারে মিথ্যারোপ করেছিল’। সাবধান, যালিমদের উপর আল্লাহর লা‘নত।",
    "যারা আল্লাহর পথ থেকে মানুষকে বাধা দেয় এবং তাকে বক্র করতে চায়। আর এরাই তো আখিরাত অস্বীকারকারী।",
    "তারা যমীনে (আল্লাহকে) অক্ষম করতে পারত না এবং আল্লাহ ছাড়া তাদের কোন সাহায্যকারী ছিল না, তাদের জন্য আযাব দ্বিগুণ করা হবে। তারা শুনতে সক্ষম ছিল না এবং দেখতেও পেত না।",
    "এরা তো নিজদেরই ক্ষতি করেছে, আর তারা যা রটিয়ে বেড়াত, তাদের থেকে তা হারিয়ে গেছে।",
    "নিঃসন্দেহে তারাই আখিরাতে সর্বাধিক ক্ষতিগ্রস্ত।",
    "নিশ্চয় যারা ঈমান এনেছে, সৎকর্ম করেছে এবং বিনীত হয়েছে তাদের রবের প্রতি, তারাই জান্নাতবাসী, তারা সেখানে স্থায়ী হবে।",
    "দল দু’টির উপমা হচ্ছে অন্ধ ও বধির এবং চক্ষুষ্মান ও শ্রবণশক্তিসম্পন্নের মত, তুলনায় উভয় দল কি সমান? এরপরও কি তোমরা উপদেশ গ্রহণ করবে না?",
    "আর অবশ্যই আমি নূহকে প্রেরণ করেছিলাম তার কওমের কাছে (এই বার্তা দিয়ে) যে, ‘আমি তোমাদের জন্য স্পষ্ট সতর্ককারী’।",
    "‘যেন তোমরা আল্লাহ ছাড়া কারো ইবাদাত না কর। নিশ্চয় আমি তোমাদের উপর যন্ত্রণাদায়ক দিবসের আযাবের ভয় করছি’।",
    "অতঃপর তার কওমের নেতৃস্থানীয়রা, যারা কুফরী করেছিল, তারা বলল, ‘আমরা তো তোমাকে আমাদের মত একজন মানুষ ছাড়া আর কিছু দেখছি না এবং আমরা দেখছি যে, কেবল আমাদের নীচু শ্রেণীর লোকেরাই বিবেচনাহীনভাবে তোমার অনুসরণ করেছে। আর আমাদের উপর তোমাদের কোন শ্রেষ্ঠত্ব আমরা দেখছি না; বরং আমরা তোমাদেরকে মিথ্যাবাদী মনে করছি’।",
    "সে বলল, ‘হে আমার কওম, তোমরা কি মনে কর, যদি আমি আমার রবের পক্ষ থেকে প্রেরিত প্রমাণের উপর প্রতিষ্ঠিত হই এবং তিনি আমাকে তাঁর পক্ষ থেকে রহমত দিয়ে থাকেন, আর তা তোমাদের কাছে গোপন রাখা হয়, তবে কি আমি তোমাদের উপর তোমাদের অপছন্দ হওয়া সত্ত্বেও তা চাপিয়ে দেব’?",
    "‘আর হে আমার কওম, এর বিনিময়ে আমি তোমাদের কাছে কোন সম্পদ চাই না। আমার প্রতিদান শুধু আল্লাহর কাছে। যারা ঈমান এনেছে, আমি তাদের তাড়িয়ে দিতে পারি না। নিশ্চয় তারা তাদের রবের সাথে সাক্ষাৎ করবে। কিন্তু আমি তো দেখছি তোমরা এক অজ্ঞ জাতি’।",
    "‘হে আমার কওম, যদি আমি তাদেরকে তাড়িয়ে দেই, তবে আল্লাহর আযাব থেকে কে আমাকে সাহায্য করবে? এরপরও কি তোমরা উপদেশ গ্রহণ করবে না’?",
    "‘আর আমি তোমাদের বলছি না যে, ‘আমার কাছে আল্লাহর ভান্ডারসমূহ আছে’ এবং আমি গায়েব জানি না আর আমি এও বলছি না যে, ‘আমি ফেরেশতা’। তোমাদের চোখে যারা হীন, তাদের সম্পর্কে আমি বলছি না যে, ‘আল্লাহ তাদেরকে কখনো কোন কল্যাণ দান করবেন না’। তাদের অন্তরে যা আছে, সে সম্পর্কে আল্লাহ অধিক অবগত। (যদি এরূপ উক্তি করি) তাহলে নিশ্চয় আমি যালিমদের অন্তর্ভুক্ত হব’।",
    "তারা বলল, ‘হে নূহ, তুমি আমাদের সাথে বাদানুবাদ করছ এবং আমাদের সাথে অতিমাত্রায় বিবাদ করেছ। অতএব যার প্রতিশ্রুতি তুমি আমাদেরকে দিচ্ছ, তা আমাদের কাছে নিয়ে আস, যদি তুমি সত্যবাদীদের অন্তর্ভুক্ত হও’।",
    "সে বলল, ‘আল্লাহই তো তোমাদের কাছে তা হাজির করবেন, যদি তিনি চান। আর তোমরা তাকে অক্ষম করতে পারবে না’।",
    "‘আর আমি তোমাদেরকে উপদেশ দিতে চাইলেও আমার উপদেশ তোমাদের কোন উপকারে আসবে না, যদি আল্লাহ তোমাদের বিভ্রান্ত করতে চান। তিনি তোমাদের রব এবং তাঁর কাছেই তোমাদেরকে ফিরিয়ে নেয়া হবে’।",
    "নাকি তারা বলে, ‘সে এটা রচনা করেছে’। বল, ‘যদি আমি তা রচনা করে থাকি, তবে আমার অপরাধ আমার উপরই বর্তাবে এবং তোমরা যে অপরাধ করছ, আমি তা থেকে মুক্ত’।",
    "আর নূহের কাছে ওহী পাঠানো হল যে, ‘যারা ঈমান এনেছে, তারা ছাড়া তোমার কওমের আর কেউ ঈমান আনবে না। সুতরাং তারা যা করে সে জন্য তুমি দুঃখিত হয়ো না’।",
    "‘আর তুমি আমার চোখের সামনে ও আমার ওহী অনুসারে নৌকা তৈরী কর। আর যারা যুলম করেছে, তাদের ব্যাপারে তুমি আমার কাছে কোন আবেদন করো না। নিশ্চয় তাদেরকে ডুবানো হবে’।",
    "আর সে নৌকা তৈরী করতে লাগল এবং যখনই তার কওমের নেতৃস্থানীয় কোন ব্যক্তি তার পাশ দিয়ে যেত, তাকে নিয়ে উপহাস করত। সে বলল, ‘যদি তোমরা আমাদের নিয়ে উপহাস কর, তবে আমরাও তোমাদের নিয়ে উপহাস করব, যেমন তোমরা উপহাস করছ’।",
    "অতএব, শীঘ্রই তোমরা জানতে পারবে, কার উপর সে আযাব আসবে যা তাকে লাঞ্ছিত করবে এবং কার উপর আপতিত হবে স্থায়ী আযাব।",
    "অবশেষে যখন আমার আদেশ আসল এবং চুলা উথলে উঠল*, আমি বললাম, ‘তুমি তাতে তুলে নাও প্রত্যেক শ্রেণী থেকে জোড়া জোড়া** এবং যাদের ব্যাপারে সিদ্ধান্ত হয়ে গিয়েছে তাদের ছাড়া তোমার পরিবারকে এবং যারা ঈমান এনেছে তাদেরকে। আর তার সাথে অল্পসংখ্যকই ঈমান এনেছিল। \n* التنور এর আরেকটি অর্থ হল ভূপৃষ্ঠ। প্লাবন শুরু হওয়ার আগে ভূপৃষ্ঠের সবখান দিয়ে পানি উৎসারিত হতে লাগল।",
    "আর সে বলল, ‘তোমরা এতে আরোহণ কর। এর চলা ও থামা হবে আল্লাহর নামে। নিশ্চয় আমার রব অতি ক্ষমাশীল, পরম দয়ালু।",
    "আর তা পাহাড়সম ঢেউয়ের মধ্যে তাদেরকে নিয়ে চলছিল এবং নূহ তার পুত্রকে ডাক দিল, আর সে ছিল আলাদা স্থানে- ‘হে আমার পুত্র, আমাদের সাথে আরোহণ কর এবং কাফিরদের সাথে থেকো না’।",
    "সে বলল, ‘অচিরেই আমি একটি পাহাড়ে আশ্রয় নেব, যা আমাকে পানি থেকে রক্ষা করবে’। সে (নূহ) বলল, ‘যার প্রতি আল্লাহ দয়া করেছেন সে ছাড়া আজ আল্লাহর আদেশ থেকে কোন রক্ষাকারী নেই’। এরপর তাদের উভয়ের মধ্যে ঢেউ অন্তরায় হয়ে গেল। অতঃপর সে নিমজ্জিতদের অন্তর্ভুক্ত হয়ে গেল ।",
    "আর বলা হল, ‘হে যমীন, তুমি তোমার পানি চুষে নাও, আর হে আসমান, বিরত হও’। অতঃপর পানি কমে গেল এবং (আল্লাহর) সিদ্ধান্ত বাস্তবায়িত হল, আর নৌকা জুদী পর্বতের উপর উঠল এবং ঘোষণা করা হল, ‘ধ্বংস যালিম কওমের জন্য’।",
    "আর নূহ তার রবকে ডাকল এবং বলল, ‘হে আমার রব, নিশ্চয় আমার সন্তান আমার পরিবারভুক্ত এবং আপনার ওয়াদা নিশ্চয় সত্য। আর আপনি বিচারকদের মধ্যে শ্রেষ্ঠ বিচারক’।",
    "তিনি বললেন, ‘হে নূহ, সে নিশ্চয় তোমার পরিবারভুক্ত নয়। সে অবশ্যই অসৎ কর্মপরায়ণ। সুতরাং যে বিষয়ে তোমার কোন জ্ঞান নেই, আমার কাছে তা চেয়ো না। আমি তোমাকে উপদেশ দিচ্ছি, যেন মূর্খদের অন্তর্ভুক্ত না হও’।",
    "সে বলল, ‘হে আমার রব, যে বিষয়ে আমার জ্ঞান নেই তা চাওয়া থেকে আমি অবশ্যই আপনার আশ্রয় চাই। আর যদি আপনি আমাকে মাফ না করেন এবং আমার প্রতি দয়া না করেন, তবে আমি ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হয়ে যাব’।",
    "বলা হল, ‘হে নূহ, তোমার ও তোমার সাথে যে উম্মত রয়েছে তাদের উপর আমার পক্ষ থেকে শান্তি ও বরকতসহ অবতরণ কর। আর আরো অনেক উম্মতকে আমি জীবন উপভোগ করতে দেব, তারপর আমার পক্ষ থেকে তাদেরকে স্পর্শ করবে যন্ত্রণাদায়ক আযাব’।",
    "এগুলো গায়েবের সংবাদ, আমি তোমাকে ওহীর মাধ্যমে তা জানাচ্ছি। ইতঃপূর্বে তা না তুমি জানতে এবং না তোমার কওম। সুতরাং তুমি সবর কর। নিশ্চয় শুভ পরিণাম কেবল মুত্তাকীদের জন্য।",
    "আর আদ জাতির কাছে (প্রেরণ করেছিলাম) তাদের ভাই হূদকে। সে বলেছিল, ‘হে আমার কওম, তোমরা আল্লাহর ইবাদাত কর। তিনি ছাড়া তোমাদের জন্য কোন (সত্য) ইলাহ নেই। তোমরা তো কেবল মিথ্যা রটনাকারী’।",
    "‘হে আমার কওম, আমি তোমাদের কাছে এর বিনিময়ে কোন প্রতিদান চাই না। আমার প্রতিদান তো কেবল তাঁরই কাছে যিনি আমাকে সৃষ্টি করেছেন। এরপরও কি তোমরা বুঝবে না’?",
    "‘হে আমার কওম, তোমরা তোমাদের রবের কাছে ক্ষমা চাও অতঃপর তার কাছে তাওবা কর, তাহলে তিনি তোমাদের উপর মুষলধারে বৃষ্টি পাঠাবেন এবং তোমাদের শক্তির সাথে আরো শক্তি বৃদ্ধি করবেন। আর তোমরা অপরাধী হয়ে বিমুখ হয়ো না’।",
    "তারা বলল, ‘হে হূদ, তুমি আমাদের কাছে কোন স্পষ্ট প্রমাণ নিয়ে আসনি, আর তোমার কথায় আমরা আমাদের উপাস্যদের ত্যাগ করব না এবং আমরা তোমার প্রতি বিশ্বাসীও নই’।",
    "‘আমরা তো কেবল বলছি যে, ‘আমাদের কোন কোন উপাস্য তোমাকে অমঙ্গল দ্বারা আক্রান্ত করেছে’। সে বলল, ‘নিশ্চয় আমি আল্লাহকে সাক্ষী রাখছি আর তোমরা সাক্ষী থাক যে, আমি অবশ্যই তা থেকে মুক্ত যাকে তোমরা শরীক কর,",
    "আল্লাহ ছাড়া। সুতরাং তোমরা সকলে আমার বিরুদ্ধে ষড়যন্ত্র কর তারপর আমাকে অবকাশ দিও না’।",
    "‘আমি অবশ্যই তাওয়াক্কুল করেছি আমার রব ও তোমাদের রব আল্লাহর উপর, প্রতিটি বিচরণশীল প্রাণীরই তিনি নিয়ন্ত্রণকারী। নিশ্চয় আমার রব সরল পথে আছেন’।",
    "‘অতঃপর তোমরা যদি বিমুখ হও, তবে যা নিয়ে আমি তোমাদের কাছে প্রেরিত হয়েছি তা তো তোমাদের কাছে পৌঁছে দিয়েছি। আর আমার রব তোমাদেরকে ছাড়া অন্য এক জাতিকে স্থলাভিষিক্ত করবেন। আর তোমরা তাঁর কোন ক্ষতি করতে পারবে না। নিশ্চয় আমার রব সব কিছুর হেফাযতকারী’।",
    "আর যখন আমার আদেশ আসল, আমি হূদকে ও যারা তার সাথে ঈমান এনেছিল তাদেরকে আমার পক্ষ থেকে রহমত দ্বারা রক্ষা করলাম এবং আমি কঠোর আযাব থেকে তাদেরকে নাজাত দিলাম।",
    "এই আদ জাতি, তারা তাদের রবের আয়াতসমূহ অস্বীকার করেছিল এবং অমান্য করেছিল তাঁর রাসূলদের, আর তারা অনুসরণ করেছিল প্রত্যেক উদ্ধত, হঠকারীর নির্দেশ।",
    "আর এই দুনিয়াতে লা‘নত তাদের পেছনে লাগিয়ে দেয়া হয়েছে এবং কিয়ামত দিবসেও। জেনে রাখ, নিশ্চয় আদ জাতি তাদের রবের সাথে কুফরী করেছে। জেনে রাখ, হূদের কওম আদ জাতির জন্য রয়েছে ধ্বংস।",
    "আর সামূদ জাতির প্রতি (পাঠিয়েছিলাম)তাদের ভাই সালিহকে। সে বলল,‘হে আমার কওম, তোমরা আল্লাহর ইবাদাত কর, তিনি ছাড়া তোমাদের কোন (সত্য) ইলাহ নেই, তিনি তোমাদেরকে সৃষ্টি করেছেন মাটি থেকে এবং সেখানে তোমাদের জন্য আবাদের* ব্যবস্থা করেছেন । সুতরাং তোমরা তাঁর কাছে ক্ষমা চাও, অতঃপর তাঁরই কাছে তাওবা কর। নিশ্চয়ই আমার রব নিকটে, সাড়াদানকারী’। \n* এখানে আবাদের ব্যবস্থা করেছেন বলতে বুঝানো হয়েছে তাদেরকে অধিবাসী করা অথবা আবাদকারী বানানো কিংবা তাদেরকে দীর্ঘজীবি করা।",
    "তারা বলল, ‘হে সালিহ, তুমি তো ইতঃপূর্বে আমাদের মধ্যে ছিলে প্রত্যাশিত। তুমি কি আমাদেরকে নিষেধ করছ তাদের ইবাদাত করতে আমাদের পিতৃপুরুষরা যাদের ইবাদাত করত? তুমি আমাদেরকে যার দিকে আহবান করছ, সে ব্যাপারে নিশ্চয় আমরা ঘোর সন্দেহের মধ্যে আছি’।",
    "সে বলল, ‘হে আমার কওম, তোমরা কী মনে কর, যদি আমি আমার রবের পক্ষ থেকে স্পষ্ট প্রমাণের উপর থাকি এবং তিনি আমাকে তাঁর পক্ষ থেকে রহমত দান করেন, তাহলে কে আমাকে আল্লাহর (আযাব) থেকে সাহায্য করবে, যদি আমি তাঁর অবাধ্য হই? সুতরাং তোমরা তো কেবল আমার ক্ষতিই বৃদ্ধি করছ’।",
    "‘আর হে আমার কওম, এটি আল্লাহর উট, তোমাদের জন্য নিদর্শনস্বরূপ। তাই তোমরা একে ছেড়ে দাও, সে আল্লাহর যমীনে (বিচরণ করে) খাবে এবং কোনরূপ মন্দভাবে তাকে স্পর্শ করো না, তাহলে তোমাদেরকে আশু আযাব পাকড়াও করবে’।",
    "অতঃপর তারা তাকে হত্যা করল। তাই সে বলল, ‘তোমরা তিন দিন নিজ নিজ গৃহে আনন্দে কাটাও। এ এমন এক ওয়াদা, যা মিথ্যা হবার নয়’।",
    "অতঃপর যখন আমার আদেশ এল, তখন সালিহ ও তার সাথে যারা ঈমান এনেছিল তাদেরকে আমার পক্ষ থেকে রহমত দ্বারা নাজাত দিলাম এবং (নাজাত দিলাম) সেই দিনের লাঞ্ছনা থেকে। নিশ্চয় তোমার রব, তিনি শক্তিশালী, পরাক্রমশালী।",
    "আর যারা যুলম করেছিল, বিকট আওয়াজ তাদেরকে পাকড়াও করল, ফলে তারা নিজদের গৃহে মুখ থুবড়ে পড়ে থাকল।",
    "যেন তারা সেগুলোতে বসবাসই করেনি। জেনে রাখ, নিশ্চয় সামূদ জাতি তাদের রবের সাথে কুফরী করেছে। জেনে রাখ, সামূদ জাতির জন্য রয়েছে ধ্বংস।",
    "আর অবশ্যই আমার ফেরেশতারা সুসংবাদ নিয়ে ইবরাহীমের কাছে আসল, তারা বলল, ‘সালাম’। সেও বলল, ‘সালাম’। বিলম্ব না করে সে একটি ভুনা গো বাছুর নিয়ে আসল।",
    "অতঃপর যখন সে দেখতে পেল, তাদের হাত এর প্রতি পৌঁছছে না, তখন তাদেরকে অস্বাভাবিক মনে করল এবং সে তাদের থেকে ভীতি অনুভব করল। তারা বলল, ‘ভয় করো না, নিশ্চয় আমরা লূতের কওমের কাছে প্রেরিত হয়েছি’।",
    "আর তার স্ত্রী দাঁড়ানো ছিল, সে হেসে উঠল। অতঃপর আমি তাকে সুসংবাদ দিলাম ইসহাকের ও ইসহাকের পরে ইয়া‘কূবের।",
    "সে বলল, ‘হায়, কী আশ্চর্য! আমি সন্তান প্রসব করব, অথচ আমি বৃদ্ধা, আর এ আমার স্বামী, বৃদ্ধ? এটা তো অবশ্যই এক আশ্চর্যজনক ব্যাপার’!",
    "তারা বলল, ‘আল্লাহর সিদ্ধান্তে তুমি আশ্চর্য হচ্ছ? হে নবী পরিবার, তোমাদের উপর আল্লাহর রহমত ও তাঁর বরকত। নিশ্চয় তিনি প্রশংসিত সম্মানিত’।",
    "অতঃপর যখন ইবরাহীম থেকে ভয় দূর হল এবং তার কাছে সুসংবাদ এল, তখন সে লূতের কওম সম্পর্কে আমার সাথে বাদানুবাদ করতে লাগল।",
    "নিশ্চয় ইবরাহীম অত্যন্ত সহনশীল, অধিক অনুনয় বিনয়কারী, আল্লাহমুখী।",
    "হে ইবরাহীম, তুমি এ থেকে বিরত হও। নিশ্চয় তোমার রবের সিদ্ধান্ত এসে গেছে এবং নিশ্চয় তাদের উপর আসবে আযাব, যা প্রতিহত হবার নয়।",
    "আর যখন লূতের কাছে আমার ফেরেশতা আসল, তখন তাদের (আগমনের) কারণে তার অস্বস্তিবোধ হল এবং তার অন্তর খুব সঙ্কুচিত হয়ে গেল। আর সে বলল, ‘এ তো কঠিন দিন’।",
    "আর তার কওম তার কাছে ছুটে আসল এবং ইতঃপূর্বে তারা মন্দ কাজ করত। সে বলল, ‘হে আমার কওম, এরা আমার মেয়ে, তারা তোমাদের জন্য পবিত্র। সুতরাং তোমরা আল্লাহকে ভয় কর এবং আমার মেহমানদের ব্যাপারে তোমরা আমাকে অপমানিত করো না। তোমাদের মধ্যে কি কোন সুবোধ ব্যক্তি নেই’?",
    "তারা বলল, ‘তুমি অবশ্যই জান, তোমার মেয়েদের ব্যাপারে আমাদের কোন প্রয়োজন নেই। আর আমরা কী চাই, তা তুমি নিশ্চয় জান’।",
    "সে বলল, ‘তোমাদের প্রতিরোধে যদি আমার কোন শক্তি থাকত অথবা আমি কোন সুদৃঢ় স্তম্ভের আশ্রয় নিতে পারতাম’*! \n*‘সুদৃঢ় স্তম্ভ’ বলতে শক্তিশালী সৈন্যসামন্ত কিংবা কওম অথবা গোত্র বুঝানো হয়েছে।",
    "তারা বলল, ‘হে লূত, আমরা তোমার রবের প্রেরিত ফেরেশতা, তারা কখনো তোমার কাছে পৌঁছতে পারবে না। সুতরাং তুমি তোমার পরিবার নিয়ে রাতের কোন এক অংশে রওয়ানা হও, আর তোমাদের কেউ পিছে তাকাবে না। তবে তোমার স্ত্রী (রওয়ানা হবে না), কেননা তাকে তা-ই আক্রান্ত করবে যা তাদেরকে আক্রান্ত করবে। নিশ্চয় তাদের (আযাবের) নির্ধারিত সময় হচ্ছে সকাল। সকাল কি নিকটে নয়’?",
    "অতঃপর যখন আমার আদেশ এসে গেল, তখন আমি জনপদের উপরকে নীচে উল্টে দিলাম এবং ক্রমাগত পোড়ামাটির পাথর বর্ষণ করলাম,",
    "যা চি‎‎হ্নত ছিল তোমার রবের কাছে। আর তা যালিমদের থেকে দূরে নয়।",
    "আর মাদইয়ানে আমি (পাঠিয়েছিলাম) তাদের ভাই শু‘আইবকে। সে বলল, ‘হে আমার কওম, তোমরা আল্লাহর ইবাদাত কর, তিনি ছাড়া তোমাদের কোন (সত্য) ইলাহ নেই এবং মাপ ও ওযন কম করো না; আমি তো তোমাদের প্রাচুর্যশীল দেখছি, কিন্তু আমি তোমাদের উপর এক সর্বগ্রাসী দিনের আযাবের ভয় করছি’।",
    "‘আর হে আমার কওম, মাপ ও ওযন পূর্ণ কর ইনসাফের সাথে এবং মানুষকে তাদের পণ্য কম দিও না; আর যমীনে ফাসাদ সৃষ্টি করে বেড়িও না,",
    "‘আল্লাহর দেয়া উদ্বৃত্ত লাভ তোমাদের জন্য কল্যাণকর, যদি তোমরা মুমিন হও। আর আমি তো তোমাদের হিফাযতকারী নই’।",
    "তারা বলল, ‘হে শু‘আইব, তোমার সালাত কি তোমাকে এই নির্দেশ প্রদান করে যে, আমাদের পিতৃপুরুষগণ যাদের ইবাদাত করত, আমরা তাদের ত্যাগ করি? অথবা আমাদের সম্পদে আমরা ইচ্ছামত যা করি তাও (ত্যাগ করি?) তুমি তো বেশ সহনশীল সুবোধ’!",
    "সে বলল, ‘হে আমার কওম, তোমরা কী মনে কর, আমি যদি আমার রবের পক্ষ থেকে স্পষ্ট প্রমাণের উপর থাকি এবং তিনি আমাকে তাঁর পক্ষ থেকে উত্তম রিয্ক দান করে থাকেন (তাহলে কী করে আমি আমার দায়িত্ব পরিত্যাগ করব)! যে কাজ থেকে আমি তোমাদেরকে নিষেধ করছি, তোমাদের বিরোধিতা করে সে কাজটি আমি করতে চাই না। আমি আমার সাধ্যমত সংশোধন চাই। আল্লাহর সহায়তা ছাড়া আমার কোন তওফীক নেই। আমি তাঁরই উপর তাওয়াক্কুল করেছি এবং তাঁরই কাছে ফিরে যাই’।",
    "‘আর হে আমার কওম, আমার সাথে বৈরিতা তোমাদেরকে যেন এমন কাজে প্ররোচিত না করে যার ফলে তোমাদের সেরূপ আযাব আসবে যেরূপ এসেছিল নূহের কওমের উপর অথবা হূদের কওমের উপর অথবা সালিহের কওমের উপর। আর লূতের কওম তো তোমাদের থেকে দূরে নয়’।",
    "‘আর তোমরা তোমাদের রবের কাছে ইস্তিগফার কর অতঃপর তাঁরই কাছে তাওবা কর। নিশ্চয় আমার রব পরম দয়ালু, অতীব ভালবাসা পোষণকারী’।",
    "তারা বলল, ‘হে শু‘আইব, তুমি যা বল, তার অনেক কিছুই আমরা বুঝি না। আর তোমাকে তো আমরা আমাদের মধ্যে দুর্বলই দেখতে পাচ্ছি। যদি তোমার আত্মীয়-স্বজন না থাকত, তবে আমরা তোমাকে অবশ্যই পাথর মেরে হত্যা করতাম। আর আমাদের উপর তুমি শক্তিশালী নও’।",
    "সে বলল, ‘হে আমার কওম! আমার স্বজনরা কি তোমাদের কাছে আল্লাহ অপেক্ষা অধিক সম্মানিত? আর তোমরা তাঁকে একেবারে পেছনে ঠেলে দিলে? তোমরা যা কর, নিশ্চয় আমার রব তা পরিবেষ্টন করে আছেন’।",
    "‘আর হে আমার কওম, তোমরা তোমাদের অবস্থানে কাজ করে যাও, আমিও কাজ করছি। অচিরেই তোমরা জানতে পারবে কার কাছে আসবে সে আযাব যা তাকে লাঞ্ছিত করবে এবং কে মিথ্যাবাদী। আর তোমরা অপেক্ষা কর, আমিও তোমাদের সাথে অপেক্ষমান।",
    "আর যখন আমার আদেশ আসল, তখন শু‘আইব ও তার সাথে যারা ঈমান এনেছে, তাদেরকে আমার পক্ষ থেকে রহমত দ্বারা নাজাত দিলাম এবং যারা যুলম করেছিল তাদেরকে পাকড়াও করল বিকট আওয়াজ। ফলে তারা নিজ নিজ গৃহে মুখ থুবড়ে পড়ে থাকল।",
    "যেন তারা সেখানে বসবাসই করেনি। জেনে রাখ, ধ্বংস মাদইয়ানের জন্য, যেরূপ ধ্বংস হয়েছে সামূদ জাতি।",
    "আর আমি মূসাকে আমার আয়াতসমূহ* ও স্পষ্ট প্রমাণ দিয়ে পাঠিয়েছি, \n* এখানে ‘আয়াত’ বলতে তাওরাতকে বুঝানো হয়েছে এবং স্পষ্ট প্রমাণ দ্বারা আল্লাহর দেয়া বিশেষ নিদর্শনসমূহ বুঝানো হয়েছে।",
    "ফির‘আউন ও তার নেতৃবৃন্দের কাছে। অতঃপর তারা ফির‘আউনের নির্দেশের অনুসরণ করল। আর ফির‘আউনের নির্দেশ সঠিক ছিল না।",
    "কিয়ামত দিবসে সে তার কওমের অগ্রভাগে থাকবে এবং তাদেরকে আগুনে উপনীত করে দেবে। যেখানে তারা উপনীত হবে সেটা উপনীত হওয়ার কতইনা নিকৃষ্ট স্থান!",
    "আর এখানে (দুনিয়ায়) লা‘নত তাদের পেছনে লাগিয়ে দেয়া হয়েছে এবং কিয়ামত দিবসেও। কি নিকৃষ্ট প্রতিদান, যা তাদের দেয়া হবে।",
    "এ হচ্ছে জনপদসমূহের কিছু সংবাদ, যা আমি তোমার কাছে বর্ণনা করছি। তা থেকে কিছু আছে বিদ্যমান এবং কিছু হয়েছে বিলুপ্ত।",
    "আর আমি তাদের উপর যুলম করিনি, বরং তারা নিজদের উপর যুলম করেছে। তারপর যখন তোমার রবের নির্দেশ আসল তখন আল্লাহ ছাড়া যে সব উপাস্যকে তারা ডাকত, তারা তাদের কোন উপকার করেনি এবং তারা ধ্বংস ছাড়া তাদের আর কিছুই বৃদ্ধি করেনি।",
    "আর এরূপই হয় তোমার রবের পাকড়াও যখন তিনি পাকড়াও করেন অত্যাচারী জনপদসমূহকে। নিঃসন্দেহে তাঁর পাকড়াও বড়ই যন্ত্রণাদায়ক, কঠোর।",
    "নিশ্চয় এতে রয়েছে নিদর্শন তার জন্য যে আখিরাতের আযাবকে ভয় করে। সেটি এমন একটি দিন, যেদিন সকল মানুষকে সমবেত করা হবে এবং সেটি এমন এক দিন, যেদিন সবাই হাযির হবে।",
    "আর নির্দিষ্ট কিছুকালের জন্যই আমি তা বিলম্বিত করছি।",
    "যেদিন তা আসবে সেদিন তাঁর অনুমতি ছাড়া কেউ কথা বলবে না। অতঃপর তাদের মধ্য থেকে কেউ দুর্ভাগা, আর কেউ সৌভাগ্যবান।",
    "অতঃপর যারা হয়েছে দুর্ভাগা, তারা থাকবে আগুনে। সেখানে থাকবে তাদের চীৎকার ও আর্তনাদ।",
    "সেখানে তারা স্থায়ী হবে, যতদিন পর্যন্ত আসমানসমূহ ও যমীন থাকবে*, অবশ্য তোমার রব যা চান**। নিশ্চয় তোমার রব তা-ই করে যা তিনি ইচ্ছা করেন। \n*‘যতদিন পর্যন্ত আসমানসমূহ ও যমীন থাকবে’- এ কথা দ্বারা আরবী ভাষায় চিরস্থায়ীত্বের উদাহরণ দেয়া হয়ে থাকে।",
    "আর যারা ভাগ্যবান হয়েছে, তারা জান্নাতে থাকবে, সেখানে তারা স্থায়ী হবে যতদিন পর্যন্ত আসমানসমূহ ও যমীন থাকবে, অবশ্য তোমার রব যা চান*, অব্যাহত প্রতিদানস্বরূপ। \n* অর্থাৎ আল্লাহ ইচ্ছা করলে তাদেরকে জান্নাত থেকে বের করে দিতে পারেন। তবে তিনি তা করবেন না। কেননা তিনি নিজেই তাদের স্থায়ীত্বের ঘোষণা দিয়েছেন।",
    "সুতরাং এরা যাদের উপাসনা করে, তুমি তাদের ব্যাপারে সংশয়ে থেকো না। তারা তো ইবাদাত করে, যেমন ইতঃপূর্বে ইবাদাত করত তাদের পিতৃপুরুষগণ। নিশ্চয় আমি তাদের অংশ হ্রাস না করে তাদেরকে পুরোপুরি দেব।",
    "আর অবশ্যই আমি মূসাকে কিতাব দিয়েছিলাম, অতঃপর তাতে মতবিরোধ করা হয়েছিল। যদি তোমার রবের পক্ষ থেকে পূর্ব সিদ্ধান্ত না থাকত*, তবে তাদের মধ্যে মীমাংসা হয়ে যেত। আর নিশ্চয় তারা এ ব্যাপারে ঘোর সন্দেহে রয়েছে। \n* অর্থাৎ অপরাধীকে শাস্তির ক্ষেত্রে আল্লাহ তাড়াহুড়া করবেন না, এই সিদ্ধান্ত না থাকলে তাদেরকে আল্লাহ ধ্বংস করে দিতেন।",
    "আর নিশ্চয় তোমার রব সবাইকে তাদের আমলের প্রতিদান পুরোপুরি দান করবেন। তারা যা আমল করে, অবশ্যই তিনি সে ব্যাপারে সবিশেষ অবহিত।",
    "সুতরাং যেভাবে তুমি নির্দেশিত হয়েছ সেভাবে তুমি ও তোমার সাথী যারা তাওবা করেছে, সকলে অবিচল থাক। আর সীমালঙ্ঘন করো না। তোমরা যা করছ নিশ্চয় তিনি তার সম্যক দ্রষ্টা।",
    "আর যারা যুলম করেছে তোমরা তাদের প্রতি ঝুঁকে পড়ো না; অন্যথায় আগুন তোমাদেরকে স্পর্শ করবে এবং আল্লাহ ছাড়া তোমাদের কোন অভিভাবক থাকবে না। অতঃপর তোমরা সাহায্যপ্রাপ্ত হবে না।",
    "আর তুমি সালাত কায়েম কর দিবসের দু’প্রান্তে এবং রাতের প্রথম অংশে*। নিশ্চয়ই ভালকাজ মন্দকাজকে মিটিয়ে দেয়। এটি উপদেশ গ্রহণকারীদের জন্য উপদেশ। \n* দিনের প্রথম প্রান্তে ফজরের সালাত, দ্বিতীয় প্রান্তে যোহর ও আসরের সালাত আর রাতের প্রথম অংশে মাগরিব ও ইশার সালাত। [তাফসীর ইবন কাসীর, তাইসীরু কারীমির রহমান]।",
    "তুমি সবর কর, নিশ্চয়ই আল্লাহ তাআলা ইহসানকারীদের প্রতিদান নষ্ট করেন না।",
    "অতএব তোমাদের পূর্বের প্রজন্মসমূহের মধ্যে এমন প্রজ্ঞাবান কেন হয়নি, যারা যমীনে ফাসাদ করা থেকে নিষেধ করত? অল্প সংখ্যক ছাড়া, যাদেরকে আমি তাদের মধ্য থেকে নাজাত দিয়েছিলাম। আর যারা যুলম করেছে, তারা বিলাসিতার পেছনে পড়ে ছিল এবং তারা ছিল অপরাধী।",
    "আর তোমার রব এমন নন যে, তিনি অন্যায়ভাবে জনপদসমূহ ধ্বংস করে দেবেন, অথচ তার অধিবাসীরা সংশোধনকারী।",
    "যদি তোমার রব চাইতেন, তবে সকল মানুষকে এক উম্মতে পরিণত করতেন, কিন্তু তারা পরস্পর মতবিরোধকারী রয়ে গেছে,",
    "তবে যাদেরকে তোমার রব দয়া করেছেন, তারা ছাড়া। আর এজন্যই তিনি তাদেরকে সৃষ্টি করেছেন এবং তোমার রবের কথা চূড়ান্ত হয়েছে যে, ‘নিশ্চয়ই আমি জাহান্নাম ভরে দেব জিন ও মানুষ দ্বারা একত্রে’।",
    "আর রাসূলদের এসকল সংবাদ আমি তোমার কাছে বর্ণনা করছি যার দ্বারা আমি তোমার মনকে স্থির করি আর এতে তোমার কাছে এসেছে সত্য এবং মুমিনদের জন্য উপদেশ ও স্মরণ।",
    "আর যারা ঈমান আনছে না তাদেরকে বল, ‘তোমরা স্ব স্ব অবস্থানে কাজ কর আমরাও কাজ করছি।",
    "এবং তোমরা অপেক্ষা কর আমরাও অপেক্ষমান’।",
    "আসমানসমূহ ও যমীনের গায়েব আল্লাহরই এবং তাঁরই কাছে সব বিষয় প্রত্যাবর্তিত হবে। সুতরাং তুমি তাঁর ইবাদাত কর এবং তাঁর উপর তাওয়াক্কুল কর। আর তোমরা যা কিছু কর সে ব্যাপারে তোমার রব গাফেল নন।"
  ]
}