{
  "surahName": "Aal-i-Imraan",
  "surahNameArabic": "آل عمران",
  "surahNameArabicLong": "سورة آل عمران",
  "surahNameTranslation": "The Family of Imraan",
  "revelationPlace": "Madina",
  "totalAyah": 200,
  "surahNo": 3,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/3.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/003.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/3.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/003.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/3.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/003.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/3.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/003.mp3"
    }
  },
  "english": [
    "Alif-Lãm-Mĩm.",
    "Allah! There is no god ˹worthy of worship˺ except Him—the Ever-Living, All-Sustaining.",
    "He has revealed to you ˹O Prophet˺ the Book in truth, confirming what came before it, as He revealed the Torah and the Gospel",
    "previously, as a guide for people, and ˹also˺ revealed the Standard ˹to distinguish between right and wrong˺. Surely those who reject Allah’s revelations will suffer a severe torment. For Allah is Almighty, capable of punishment.",
    "Surely nothing on earth or in the heavens is hidden from Allah.",
    "He is the One Who shapes you in the wombs of your mothers as He wills. There is no god ˹worthy of worship˺ except Him—the Almighty, All-Wise.",
    "He is the One Who has revealed to you ˹O Prophet˺ the Book, of which some verses are precise—they are the foundation of the Book—while others are elusive. Those with deviant hearts follow the elusive verses seeking ˹to spread˺ doubt through their ˹false˺ interpretations—but none grasps their ˹full˺ meaning except Allah. As for those well-grounded in knowledge, they say, “We believe in this ˹Quran˺—it is all from our Lord.” But none will be mindful ˹of this˺ except people of reason.",
    "˹They say,˺ “Our Lord! Do not let our hearts deviate after you have guided us. Grant us Your mercy. You are indeed the Giver ˹of all bounties˺.",
    "Our Lord! You will certainly gather all humanity for the ˹promised˺ Day—about which there is no doubt. Surely Allah does not break His promise.”",
    "Indeed, neither the wealth nor children of the disbelievers will be of any benefit to them against Allah—and they will be the fuel for the Fire.",
    "Their fate will be like that of the people of Pharaoh and those before them—they all rejected Our signs, so Allah seized them for their sins. And Allah is severe in punishment.",
    "˹O Prophet!˺ Tell the disbelievers, “Soon you will be overpowered and driven to Hell—what an evil place to rest!”",
    "Indeed, there was a sign for you in the two armies that met in battle—one fighting for the cause of Allah and the other in denial. The believers saw their enemy twice their number. But Allah supports with His victory whoever He wills. Surely in this is a lesson for people of insight.",
    "The enjoyment of ˹worldly˺ desires—women, children, treasures of gold and silver, fine horses, cattle, and fertile land—has been made appealing to people. These are the pleasures of this worldly life, but with Allah is the finest destination.",
    "Say, ˹O Prophet,˺ “Shall I inform you of what is better than ˹all of˺ this? Those mindful ˹of Allah˺ will have Gardens with their Lord under which rivers flow, to stay there forever, and pure spouses, along with Allah’s pleasure.” And Allah is All-Seeing of ˹His˺ servants",
    "who pray, “Our Lord! We have believed, so forgive our sins and protect us from the torment of the Fire.”",
    "˹It is they˺ who are patient, sincere, obedient, and charitable, and who pray for forgiveness before dawn.",
    "Allah ˹Himself˺ is a Witness that there is no god ˹worthy of worship˺ except Him—and so are the angels and people of knowledge. He is the Maintainer of justice. There is no god ˹worthy of worship˺ except Him—the Almighty, All-Wise.",
    "Certainly, Allah’s only Way is Islam. Those who were given the Scripture did not dispute ˹among themselves˺ out of mutual envy until knowledge came to them. Whoever denies Allah’s signs, then surely Allah is swift in reckoning.",
    "So if they argue with you ˹O Prophet˺, say, “I have submitted myself to Allah, and so have my followers.” And ask those who were given the Scripture and the illiterate ˹people˺, “Have you submitted yourselves ˹to Allah˺?” If they submit, they will be ˹rightly˺ guided. But if they turn away, then your duty is only to deliver ˹the message˺. And Allah is All-Seeing of ˹His˺ servants.",
    "Indeed, those who deny Allah’s signs, kill the prophets unjustly, and kill people who stand up for justice—give them good news of a painful punishment.",
    "They are the ones whose deeds are wasted in this world and the Hereafter. And they will have no helpers.",
    "Have you not seen those who were given a portion of the Scriptures? Yet when they are invited to the Book of Allah to settle their disputes, some of them turn away heedlessly.",
    "This is because they say, “The Fire will not touch us except for a few days.” They have been deceived in their faith by their wishful lying.",
    "But how ˹horrible˺ will it be when We gather them together on the Day about which there is no doubt—when every soul will be paid in full for what it has done, and none will be wronged!",
    "Say, ˹O Prophet,˺ “O Allah! Lord over all authorities! You give authority to whoever You please and remove it from who You please; You honour whoever You please and disgrace who You please—all good is in Your Hands. Surely You ˹alone˺ are Most Capable of everything.",
    "You cause the night to pass into the day and the day into the night. You bring forth the living from the dead and the dead from the living. And You provide for whoever You will without limit.”",
    "Believers should not take disbelievers as guardians instead of the believers—and whoever does so will have nothing to hope for from Allah—unless it is a precaution against their tyranny. And Allah warns you about Himself. And to Allah is the final return.",
    "Say, ˹O Prophet,˺ “Whether you conceal what is in your hearts or reveal it, it is known to Allah. For He knows whatever is in the heavens and whatever is on the earth. And Allah is Most Capable of everything.”",
    "˹Watch for˺ the Day when every soul will be presented with whatever good it has done. And it will wish that its misdeeds were far off. And Allah warns you about Himself. And Allah is Ever Gracious to ˹His˺ servants.",
    "Say, ˹O Prophet,˺ “If you ˹sincerely˺ love Allah, then follow me; Allah will love you and forgive your sins. For Allah is All-Forgiving, Most Merciful.”",
    "Say, ˹O Prophet,˺ “Obey Allah and His Messenger.” If they still turn away, then truly Allah does not like the disbelievers.",
    "Indeed, Allah chose Adam, Noah, the family of Abraham, and the family of ’Imrân above all people ˹of their time˺.",
    "They are descendants of one another. And Allah is All-Hearing, All-Knowing.",
    "˹Remember˺ when the wife of ’Imrân said, “My Lord! I dedicate what is in my womb entirely to Your service, so accept it from me. You ˹alone˺ are truly the All-Hearing, All-Knowing.”",
    "When she delivered, she said, “My Lord! I have given birth to a girl,”—and Allah fully knew what she had delivered—“and the male is not like the female. I have named her Mary, and I seek Your protection for her and her offspring from Satan, the accursed.”",
    "So her Lord accepted her graciously and blessed her with a pleasant upbringing—entrusting her to the care of Zachariah. Whenever Zachariah visited her in the sanctuary, he found her supplied with provisions. He exclaimed, “O Mary! Where did this come from?” She replied, “It is from Allah. Surely Allah provides for whoever He wills without limit.”",
    "Then and there Zachariah prayed to his Lord, saying, “My Lord! Grant me—by your grace—righteous offspring. You are certainly the Hearer of ˹all˺ prayers.”",
    "So the angels called out to him while he stood praying in the sanctuary, “Allah gives you good news of ˹the birth of˺ John who will confirm the Word of Allah and will be a great leader, chaste, and a prophet among the righteous.”",
    "Zachariah exclaimed, “My Lord! How can I have a son when I am very old and my wife is barren?” He replied, “So will it be. Allah does what He wills.”",
    "Zachariah said, “My Lord! Grant me a sign.” He said, “Your sign is that you will not ˹be able to˺ speak to people for three days except through gestures. Remember your Lord often and glorify ˹Him˺ morning and evening.”",
    "And ˹remember˺ when the angels said, “O Mary! Surely Allah has selected you, purified you, and chosen you over all women of the world.",
    "O  Mary! Be devout to your Lord, prostrate yourself ˹in prayer˺ and bow along with those who bow down.”",
    "This is news of the unseen that We reveal to you ˹O Prophet˺. You were not with them when they cast lots to decide who would be Mary’s guardian, nor were you there when they argued ˹about it˺.",
    "˹Remember˺ when the angels proclaimed, “O Mary! Allah gives you good news of a Word from Him, his name will be the Messiah, Jesus, son of Mary; honoured in this world and the Hereafter, and he will be one of those nearest ˹to Allah˺.",
    "And he will speak to people in ˹his˺ infancy and adulthood and will be one of the righteous.”",
    "Mary wondered, “My Lord! How can I have a child when no man has ever touched me?” An angel replied, “So will it be. Allah creates what He wills. When He decrees a matter, He simply tells it, ‘Be!’ And it is!",
    "And Allah will teach him writing and wisdom, the Torah and the Gospel",
    "and ˹make him˺ a messenger to the Children of Israel ˹to proclaim,˺ ‘I have come to you with a sign from your Lord: I will make for you a bird from clay, breathe into it, and it will become a ˹real˺ bird—by Allah’s Will. I will heal the blind and the leper and raise the dead to life—by Allah’s Will. And I will prophesize what you eat and store in your houses. Surely in this is a sign for you if you ˹truly˺ believe.",
    "And I will confirm the Torah revealed before me and legalize some of what had been forbidden to you. I have come to you with a sign from your Lord, so be mindful of Allah and obey me.",
    "Surely Allah is my Lord and your Lord. So worship Him ˹alone˺. This is the Straight Path.’”",
    "When Jesus sensed disbelief from his people, he asked, “Who will stand up with me for Allah?” The disciples replied, “We will stand up for Allah. We believe in Allah, so bear witness that we have submitted.”",
    "˹They prayed to Allah,˺ “Our Lord! We believe in Your revelations and follow the messenger, so count us among those who bear witness.”",
    "And the disbelievers made a plan ˹against Jesus˺, but Allah also planned—and Allah is the best of planners.",
    "˹Remember˺ when Allah said, “O Jesus! I will take you and raise you up to Myself. I will deliver you from those who disbelieve, and elevate your followers above the disbelievers until the Day of Judgment. Then to Me you will ˹all˺ return, and I will settle all your disputes.",
    "As for those who disbelieve, I will subject them to a severe punishment in this life and the Hereafter, and they will have no helpers.",
    "And as for those who believe and do good, they will be rewarded in full. And Allah does not like the wrongdoers.”",
    "We recite ˹all˺ this to you ˹O Prophet˺ as one of the signs and ˹as˺ a wise reminder.",
    "Indeed, the example of Jesus in the sight of Allah is like that of Adam. He created him from dust, then said to him, “Be!” And he was!",
    "This is the truth from your Lord, so do not be one of those who doubt.",
    "Now, whoever disputes with you ˹O Prophet˺ concerning Jesus after full knowledge has come to you, say, “Come! Let us gather our children and your children, our women and your women, ourselves and yourselves—then let us sincerely invoke Allah’s curse upon the liars.”",
    "Certainly, this is the true narrative, and there is no god ˹worthy of worship˺ except Allah. And indeed, Allah ˹alone˺ is the Almighty, All-Wise.",
    "If they turn away, then surely Allah has ˹perfect˺ knowledge of the corruptors.",
    "Say, ˹O Prophet,˺ “O People of the Book! Let us come to common terms: that we will worship none but Allah, associate none with Him, nor take one another as lords instead of Allah.” But if they turn away, then say, “Bear witness that we have submitted ˹to Allah alone˺.”",
    "O People of the Book! Why do you argue about Abraham, while the Torah and the Gospel were not revealed until long after him? Do you not understand?",
    "Here you are! You disputed about what you have ˹little˺ knowledge of, but why do you now argue about what you have no knowledge of? Allah knows and you do not know.",
    "Abraham was neither a Jew nor a Christian; he submitted in all uprightness and was not a polytheist.",
    "Indeed, those who have the best claim to Abraham are his followers, this Prophet, and the believers. And Allah is the Guardian of those who believe.",
    "Some of the People of the Book wish to mislead you ˹believers˺. They mislead none but themselves, yet they fail to perceive it.",
    "O  People of the Book! Why do you reject the signs of Allah while you bear witness ˹to their truth˺?",
    "O  People of the Book! Why do you mix the truth with falsehood and hide the truth knowingly?",
    "A group among the People of the Book said ˹to one another˺, “Believe in what has been revealed to the believers in the morning and reject it in the evening, so they may abandon their faith.",
    "And only believe those who follow your religion.” Say, ˹O Prophet,˺ “Surely, ˹the only˺ true guidance is Allah’s guidance.” ˹They also said,˺ “Do not believe that someone will receive ˹revealed˺ knowledge similar to yours or argue against you before your Lord.” Say, ˹O Prophet,˺ “Indeed, all bounty is in the Hands of Allah—He grants it to whoever He wills. And Allah is All-Bountiful, All-Knowing.”",
    "He chooses whoever He wills to receive His mercy. And Allah is the Lord of infinite bounty.",
    "There are some among the People of the Book who, if entrusted with a stack of gold, will readily return it. Yet there are others who, if entrusted with a single coin, will not repay it unless you constantly demand it. This is because they say, “We are not accountable for ˹exploiting˺ the Gentiles.” And ˹so˺ they attribute lies to Allah knowingly.",
    "Absolutely! Those who honour their trusts and shun evil—surely Allah loves those who are mindful ˹of Him˺.",
    "Indeed, those who trade Allah’s covenant and their oaths for a fleeting gain will have no share in the Hereafter. Allah will neither speak to them, nor look at them, nor purify them on the Day of Judgment. And they will suffer a painful punishment.",
    "There are some among them who distort the Book with their tongues to make you think this ˹distortion˺ is from the Book—but it is not what the Book says. They say, “It is from Allah”—but it is not from Allah. And ˹so˺ they attribute lies to Allah knowingly.",
    "It is not appropriate for someone who Allah has blessed with the Scripture, wisdom, and prophethood to say to people, “Worship me instead of Allah.” Rather, he would say, “Be devoted to the worship of your Lord ˹alone˺”—in accordance with what these prophets read in the Scripture and what they taught.",
    "And he would never ask you to take angels and prophets as lords. Would he ask you to disbelieve after you have submitted?",
    "˹Remember˺ when Allah made a covenant with the prophets, ˹saying,˺ “Now that I have given you the Book and wisdom, if there comes to you a messenger confirming what you have, you must believe in him and support him.” He added, “Do you affirm this covenant and accept this commitment?” They said, “Yes, we do.” Allah said, “Then bear witness, and I too am a Witness.”",
    "Whoever turns back after this, they will be the rebellious.",
    "Do they desire a way other than Allah’s—knowing that all those in the heavens and the earth submit to His Will, willingly or unwillingly, and to Him they will ˹all˺ be returned?",
    "Say, ˹O Prophet,˺ “We believe in Allah and what has been revealed to us and what was revealed to Abraham, Ishmael, Isaac, Jacob, and his descendants; and what was given to Moses, Jesus, and other prophets from their Lord—we make no distinction between any of them, and to Him we ˹fully˺ submit.”",
    "Whoever seeks a way other than Islam, it will never be accepted from them, and in the Hereafter they will be among the losers.",
    "How will Allah guide a people who chose to disbelieve after they had believed, acknowledged the Messenger to be true, and received clear proofs? For Allah does not guide the wrongdoing people.",
    "Their reward is that they will be condemned by Allah, the angels, and all of humanity.",
    "They will be in Hell forever. Their punishment will not be lightened, nor will they be delayed ˹from it˺.",
    "As for those who repent afterwards and mend their ways, then surely Allah is All-Forgiving, Most Merciful.",
    "Indeed, those who disbelieve after having believed then increase in disbelief, their repentance will never be accepted. It is they who are astray.",
    "Indeed, if each of those who disbelieve then die as disbelievers were to offer a ransom of enough gold to fill the whole world, it would never be accepted from them. It is they who will suffer a painful punishment, and they will have no helpers.",
    "You will never achieve righteousness until you donate some of what you cherish. And whatever you give is certainly well known to Allah.",
    "All food was lawful for the children of Israel, except what Israel made unlawful for himself before the Torah was revealed. Say, ˹O Prophet,˺ “Bring the Torah and read it, if your claims are true.”",
    "Then whoever still fabricates lies about Allah, they will be the ˹true˺ wrongdoers.",
    "Say, ˹O Prophet,˺ “Allah has declared the truth. So follow the Way of Abraham, the upright—who was not a polytheist.”",
    "Surely the first House ˹of worship˺ established for humanity is the one at Bakkah—a blessed sanctuary and a guide for ˹all˺ people.",
    "In it are clear signs and the standing-place of Abraham. Whoever enters it should be safe. Pilgrimage to this House is an obligation by Allah upon whoever is able among the people. And whoever disbelieves, then surely Allah is not in need of ˹any of His˺ creation.",
    "Say, ˹O Prophet,˺ “O People of the Book! Why do you deny the revelations of Allah, when Allah is a Witness to what you do?”",
    "Say, “O People of the Book! Why do you turn the believers away from the Way of Allah—striving to make it ˹appear˺ crooked, while you are witnesses ˹to its truth˺? And Allah is never unaware of what you do.”",
    "O believers! If you were to yield to a group of those who were given the Scripture, they would turn you back from belief to disbelief.",
    "How can you disbelieve when Allah’s revelations are recited to you and His Messenger is in your midst? Whoever holds firmly to Allah is surely guided to the Straight Path.",
    "O believers! Be mindful of Allah in the way He deserves, and do not die except in ˹a state of full˺ submission ˹to Him˺.",
    "And hold firmly to the rope of Allah and do not be divided. Remember Allah’s favour upon you when you were enemies, then He united your hearts, so you—by His grace—became brothers. And you were at the brink of a fiery pit and He saved you from it. This is how Allah makes His revelations clear to you, so that you may be ˹rightly˺ guided.",
    "Let there be a group among you who call ˹others˺ to goodness, encourage what is good, and forbid what is evil—it is they who will be successful.",
    "And do not be like those who split ˹into sects˺ and differed after clear proofs had come to them. It is they who will suffer a tremendous punishment.",
    "On that Day some faces will be bright while others gloomy. To the gloomy-faced it will be said, “Did you disbelieve after having believed? So taste the punishment for your disbelief.”",
    "As for the bright-faced, they will be in Allah’s mercy, where they will remain forever.",
    "These are Allah’s revelations We recite to you ˹O Prophet˺ in truth. And Allah desires no injustice to ˹His˺ creation.",
    "To Allah ˹alone˺ belongs whatever is in the heavens and whatever is on the earth. And to Allah ˹all˺ matters will be returned ˹for judgment˺.",
    "You are the best community ever raised for humanity—you encourage good, forbid evil, and believe in Allah. Had the People of the Book believed, it would have been better for them. Some of them are faithful, but most are rebellious.",
    "They can never inflict harm on you, except a little annoyance. But if they meet you in battle, they will flee and they will have no helpers.",
    "They will be stricken with disgrace wherever they go, unless they are protected by a covenant with Allah or a treaty with the people. They have invited the displeasure of Allah and have been branded with misery for rejecting Allah’s revelations and murdering ˹His˺ prophets unjustly. This is ˹a fair reward˺ for their disobedience and violations.",
    "Yet they are not all alike: there are some among the People of the Book who are upright, who recite Allah’s revelations throughout the night, prostrating ˹in prayer˺.",
    "They believe in Allah and the Last Day, encourage good and forbid evil, and race with one another in doing good. They are ˹truly˺ among the righteous.",
    "They will never be denied the reward for any good they have done. And Allah has ˹perfect˺ knowledge of those mindful ˹of Him˺.",
    "Indeed, neither the wealth nor children of the disbelievers will be of any benefit to them against Allah. It is they who will be the residents of the Fire. They will be there forever.",
    "The good they do in this worldly life is like the harvest of an evil people struck by a bitter wind, destroying it ˹completely˺. Allah never wronged them, but they wronged themselves.",
    "O believers! Do not associate closely with others who would not miss a chance to harm you. Their only desire is to see you suffer. Their prejudice has become evident from what they say—and what their hearts hide is far worse. We have made Our revelations clear to you, if only you understood.",
    "Here you are! You love them but they do not love you, and you believe in all Scriptures. When they meet you they say, “We believe.” But when alone, they bite their fingertips in rage. Say, ˹O Prophet,˺ “˹May you˺ die of your rage!” Surely Allah knows best what is ˹hidden˺ in the heart.",
    "When you ˹believers˺ are touched with good, they grieve; but when you are afflicted with evil, they rejoice. ˹Yet,˺ if you are patient and mindful ˹of Allah˺, their schemes will not harm you in the least. Surely Allah is Fully Aware of what they do.",
    "˹Remember, O  Prophet,˺ when you left your home in the early morning to position the believers in the battlefield. And Allah is All-Hearing, All-Knowing.",
    "˹Remember˺ when two groups among you ˹believers˺ were about to cower, then Allah reassured them. So in Allah let the believers put their trust.",
    "Indeed, Allah made you victorious at Badr when you were ˹vastly˺ outnumbered. So be mindful of Allah, perhaps you will be grateful.",
    "˹Remember, O  Prophet,˺ when you said to the believers, “Is it not enough that your Lord will send down a reinforcement of three thousand angels for your aid?”",
    "Most certainly, if you ˹believers˺ are firm and mindful ˹of Allah˺ and the enemy launches a sudden attack on you, Allah will reinforce you with five thousand angels designated ˹for battle˺.",
    "Allah ordained this ˹reinforcement˺ only as good news for you and reassurance for your hearts. And victory comes only from Allah—the Almighty, All-Wise—",
    "to destroy a group of the disbelievers and humble the rest, causing them to withdraw in disappointment.",
    "You ˹O Prophet˺ have no say in the matter. It is up to Allah to turn to them in mercy or punish them, for indeed they are wrongdoers.",
    "To Allah ˹alone˺ belongs whatever is in the heavens and whatever is on the earth. He forgives whoever He wills, and punishes whoever He wills. And Allah is All-Forgiving, Most Merciful.",
    "O believers! Do not consume interest, multiplying it many times over. And be mindful of Allah, so you may prosper.",
    "Guard yourselves against the Fire prepared for the disbelievers.",
    "Obey Allah and the Messenger, so you may be shown mercy.",
    "And hasten towards forgiveness from your Lord and a Paradise as vast as the heavens and the earth, prepared for those mindful ˹of Allah˺.",
    "˹They are˺ those who donate in prosperity and adversity, control their anger, and pardon others. And Allah loves the good-doers.",
    "˹They are˺ those who, upon committing an evil deed or wronging themselves, remember Allah and seek forgiveness and do not knowingly persist in sin—and who forgives sins except Allah?",
    "Their reward is forgiveness from their Lord and Gardens under which rivers flow, staying there forever. How excellent is the reward for those who work ˹righteousness˺!",
    "Similar situations came to pass before you, so travel throughout the land and see the fate of the deniers.",
    "This is an insight to humanity—a guide and a lesson to the God-fearing.",
    "Do not falter or grieve, for you will have the upper hand, if you are ˹true˺ believers.",
    "If you have suffered injuries ˹at Uḥud˺, they suffered similarly ˹at Badr˺. We alternate these days ˹of victory and defeat˺ among people so that Allah may reveal the ˹true˺ believers, choose martyrs from among you—and Allah does not like the wrongdoers—",
    "and distinguish the ˹true˺ believers and destroy the disbelievers.",
    "Do you think you will enter Paradise without Allah proving which of you ˹truly˺ struggled ˹for His cause˺ and patiently endured?",
    "You certainly wished ˹for the opportunity˺ for martyrdom before encountering it, now you have seen it with your own eyes.",
    "Muḥammad is no more than a messenger; other messengers have gone before him. If he were to die or to be killed, would you regress into disbelief? Those who do so will not harm Allah whatsoever. And Allah will reward those who are grateful.",
    "No soul can ever die without Allah’s Will at the destined time. Those who desire worldly gain, We will let them have it, and those who desire heavenly reward, We will grant it to them. And We will reward those who are grateful.",
    "˹Imagine˺ how many devotees fought along with their prophets and never faltered despite whatever ˹losses˺ they suffered in the cause of Allah, nor did they weaken or give in! Allah loves those who persevere.",
    "And all they said was, “Our Lord! Forgive our sins and excesses, make our steps firm, and grant us victory over the disbelieving people.”",
    "So Allah gave them the reward of this world and the excellent reward of the Hereafter. For Allah loves the good-doers.",
    "O believers! If you yield to the disbelievers, they will drag you back to disbelief—and you will become losers.",
    "But no! Allah is your Guardian, and He is the best Helper.",
    "We will cast horror into the hearts of the disbelievers for associating ˹false gods˺ with Allah—a practice He has never authorized. The Fire will be their home—what an evil place for the wrongdoers to stay!",
    "Indeed, Allah fulfilled His promise to you when you ˹initially˺ swept them away by His Will, then your courage weakened and you disputed about the command and disobeyed, after Allah had brought victory within your reach. Some of you were after worldly gain while others desired a heavenly reward. He denied you victory over them as a test, yet He has pardoned you. And Allah is Gracious to the believers.",
    "˹Remember˺ when you were running far away ˹in panic˺—not looking at anyone—while the Messenger was calling to you from behind! So Allah rewarded your disobedience with distress upon distress. Now, do not grieve over the victory you were denied or the injury you suffered. And Allah is All-Aware of what you do.",
    "Then after distress, He sent down serenity in the form of drowsiness overcoming some of you, while others were disturbed by evil thoughts about Allah—the thoughts of ˹pre-Islamic˺ ignorance. They ask, “Do we have a say in the matter?” Say, ˹O Prophet,˺ “All matters are destined by Allah.” They conceal in their hearts what they do not reveal to you. They say ˹to themselves˺, “If we had any say in the matter, none of us would have come to die here.” Say, ˹O Prophet,˺ “Even if you were to remain in your homes, those among you who were destined to be killed would have met the same fate.” Through this, Allah tests what is within you and purifies what is in your hearts. And Allah knows best what is ˹hidden˺ in the heart.",
    "Indeed, those ˹believers˺ who fled on the day when the two armies met were made to slip by Satan because of their misdeeds. But Allah has pardoned them. Surely Allah is All-Forgiving, Most Forbearing.",
    "O believers! Do not be like the unfaithful who say about their brothers who travel throughout the land or engage in battle, “If they had stayed with us, they would not have died or been killed.” Allah makes such thinking a cause of agony in their hearts. It is Allah who gives life and causes death. And Allah is All-Seeing of what you do.",
    "Should you be martyred or die in the cause of Allah, then His forgiveness and mercy are far better than whatever ˹wealth˺ those ˹who stay behind˺ accumulate.",
    "Whether you die or are martyred—all of you will be gathered before Allah.",
    "It is out of Allah’s mercy that you ˹O Prophet˺ have been lenient with them. Had you been cruel or hard-hearted, they would have certainly abandoned you. So pardon them, ask Allah’s forgiveness for them, and consult with them in ˹conducting˺ matters. Once you make a decision, put your trust in Allah. Surely Allah loves those who trust in Him.",
    "If Allah helps you, none can defeat you. But if He denies you help, then who else can help you? So in Allah let the believers put their trust.",
    "It is not appropriate for a prophet to illegally withhold spoils of war. And whoever does so, it will be held against them on the Day of Judgment. Then every soul will be paid in full for what it has done, and none will be wronged.",
    "Are those who seek Allah’s pleasure like those who deserve Allah’s wrath? Hell is their home. What an evil destination!",
    "They ˹each˺ have varying degrees in the sight of Allah. And Allah is All-Seeing of what they do.",
    "Indeed, Allah has done the believers a ˹great˺ favour by raising a messenger from among them—reciting to them His revelations, purifying them, and teaching them the Book and wisdom. For indeed they had previously been clearly astray.",
    "Why is it when you suffered casualties ˹at Uḥud˺—although you had made your enemy suffer twice as much ˹at Badr˺—you protested, “How could this be?”? Say, ˹O Prophet,˺ “It is because of your disobedience.” Surely Allah is Most Capable of everything.",
    "So what you suffered on the day the two armies met was by Allah’s Will, so that He might distinguish the ˹true˺ believers",
    "and expose the hypocrites. When it was said to them, “Come fight in the cause of Allah or ˹at least˺ defend yourselves,” they replied, “If we had known there was fighting, we would have definitely gone with you.” They were closer to disbelief than to belief on that day—for saying with their mouths what was not in their hearts. Allah is All-Knowing of what they hide.",
    "Those who sat at home, saying about their brothers, “Had they listened to us, they would not have been killed.” Say, ˹O Prophet,˺ “Try not to die if what you say is true!”",
    "Never think of those martyred in the cause of Allah as dead. In fact, they are alive with their Lord, well provided for—",
    "rejoicing in Allah’s bounties and being delighted for those yet to join them. There will be no fear for them, nor will they grieve.",
    "They are joyful for receiving Allah’s grace and bounty, and that Allah does not deny the reward of the believers.",
    "˹As for˺ those who responded to the call of Allah and His Messenger after their injury, those of them who did good and were mindful ˹of Allah˺ will have a great reward.",
    "Those who were warned, “Your enemies have mobilized their forces against you, so fear them,” the warning only made them grow stronger in faith and they replied, “Allah ˹alone˺ is sufficient ˹as an aid˺ for us and ˹He˺ is the best Protector.”",
    "So they returned with Allah’s favours and grace, suffering no harm. For they sought to please Allah. And surely Allah is ˹the˺ Lord of infinite bounty.",
    "That ˹warning˺ was only ˹from˺ Satan, trying to prompt you to fear his followers. So do not fear them; fear Me if you are ˹true˺ believers.",
    "˹O Prophet!˺ Do not grieve for those who race to disbelieve—surely they will not harm Allah in the least. It is Allah’s Will to disallow them a share in the Hereafter, and they will suffer a tremendous punishment.",
    "Those who trade belief for disbelief will never harm Allah in the least, and they will suffer a painful punishment.",
    "Those who disbelieve should not think that living longer is good for them. They are only given more time to increase in sin, and they will suffer a humiliating punishment.",
    "Allah would not leave the believers in the condition you were in, until He distinguished the good from the evil ˹among you˺. Nor would Allah ˹directly˺ reveal to you the unseen, but He chooses whoever He wills as a messenger. So believe in Allah and His messengers. And if you are faithful and mindful ˹of Allah˺, you will receive a great reward.",
    "And do not let those who ˹greedily˺ withhold Allah’s bounties think it is good for them—in fact, it is bad for them! They will be leashed ˹by their necks˺ on the Day of Judgment with whatever ˹wealth˺ they used to withhold. And Allah is the ˹sole˺ inheritor of the heavens and the earth. And Allah is All-Aware of what you do.",
    "Indeed, Allah has heard those ˹among the Jews˺ who said, “Allah is poor; we are rich!” We have certainly recorded their slurs and their killing of prophets unjustly. Then We will say, “Taste the torment of burning!",
    "This is ˹the reward˺ for what your hands have done. And Allah is never unjust to ˹His˺ creation.”",
    "Those ˹are the same people˺ who say, “Allah has commanded us not to believe in any messenger unless he brings us an offering to be consumed by fire ˹from the sky˺.” Say, ˹O Prophet,˺ “Other prophets did in fact come to you before me with clear proofs and ˹even˺ what you demanded—why then did you kill them, if what you say is true?”",
    "If you are rejected by them, so too were messengers before you who came with clear proofs, divine Books, and enlightening Scriptures.",
    "Every soul will taste death. And you will only receive your full reward on the Day of Judgment. Whoever is spared from the Fire and is admitted into Paradise will ˹indeed˺ triumph, whereas the life of this world is no more than the delusion of enjoyment.",
    "You ˹believers˺ will surely be tested in your wealth and yourselves, and you will certainly hear many hurtful words from those who were given the Scripture before you and ˹from˺ the polytheists. But if you are patient and mindful ˹of Allah˺—surely this is a resolve to aspire to.",
    "˹Remember, O  Prophet,˺ when Allah took the covenant of those who were given the Scripture to make it known to people and not hide it, yet they cast it behind their backs and traded it for a fleeting gain. What a miserable profit!",
    "Do not let those who rejoice in their misdeeds and love to take credit for what they have not done think they will escape torment. They will suffer a painful punishment.",
    "To Allah ˹alone˺ belongs the kingdom of the heavens and the earth. And Allah is Most Capable of everything.",
    "Indeed, in the creation of the heavens and the earth and the alternation of the day and night there are signs for people of reason.",
    "˹They are˺ those who remember Allah while standing, sitting, and lying on their sides, and reflect on the creation of the heavens and the earth ˹and pray˺, “Our Lord! You have not created ˹all of˺ this without purpose. Glory be to You! Protect us from the torment of the Fire.",
    "Our Lord! Indeed, those You commit to the Fire will be ˹completely˺ disgraced! And the wrongdoers will have no helpers.",
    "Our Lord! We have heard the caller to ˹true˺ belief, ˹proclaiming,˺ ‘Believe in your Lord ˹alone˺,’ so we believed. Our Lord! Forgive our sins, absolve us of our misdeeds, and allow us ˹each˺ to die as one of the virtuous.",
    "Our Lord! Grant us what You have promised us through Your messengers and do not put us to shame on Judgment Day—for certainly You never fail in Your promise.”",
    "So their Lord responded to them: “I will never deny any of you—male or female—the reward of your deeds. Both are equal in reward. Those who migrated or were expelled from their homes, and were persecuted for My sake and fought and ˹some˺ were martyred—I will certainly forgive their sins and admit them into Gardens under which rivers flow, as a reward from Allah. And with Allah is the finest reward!”",
    "Do not be deceived by the prosperity of the disbelievers throughout the land.",
    "It is only a brief enjoyment. Then Hell will be their home—what an evil place to rest!",
    "But those who are mindful of their Lord will be in Gardens under which rivers flow, to stay there forever—as an accommodation from Allah. And what is with Allah is best for the virtuous.",
    "Indeed, there are some among the People of the Book who truly believe in Allah and what has been revealed to you ˹believers˺ and what was revealed to them. They humble themselves before Allah—never trading Allah’s revelations for a fleeting gain. Their reward is with their Lord. Surely Allah is swift in reckoning.",
    "O believers! Patiently endure, persevere, stand on guard, and be mindful of Allah, so you may be successful."
  ],
  "arabic1": [
    "الٓمَّٓ",
    "اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الْحَیُّ الْقَیُّوْمُ",
    "نَزَّلَ عَلَیْكَ الْكِتٰبَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَیْنَ یَدَیْهِ وَاَنْزَلَ التَّوْرٰىةَ وَالْاِنْجِیْلَ",
    "مِنْ قَبْلُ هُدًی لِّلنَّاسِ وَاَنْزَلَ الْفُرْقَانَ اِنَّ الَّذِیْنَ كَفَرُوْا بِاٰیٰتِ اللّٰهِ لَهُمْ عَذَابٌ شَدِیْدٌ وَاللّٰهُ عَزِیْزٌ ذُو انْتِقَامٍ",
    "اِنَّ اللّٰهَ لَا یَخْفٰی عَلَیْهِ شَیْءٌ فِی الْاَرْضِ وَلَا فِی السَّمَآءِ",
    "هُوَ الَّذِیْ یُصَوِّرُكُمْ فِی الْاَرْحَامِ كَیْفَ یَشَآءُ لَاۤ اِلٰهَ اِلَّا هُوَ الْعَزِیْزُ الْحَكِیْمُ",
    "هُوَ الَّذِیْۤ اَنْزَلَ عَلَیْكَ الْكِتٰبَ مِنْهُ اٰیٰتٌ مُّحْكَمٰتٌ هُنَّ اُمُّ الْكِتٰبِ وَاُخَرُ مُتَشٰبِهٰتٌ فَاَمَّا الَّذِیْنَ فِیْ قُلُوْبِهِمْ زَیْغٌ فَیَتَّبِعُوْنَ مَا تَشَابَهَ مِنْهُ ابْتِغَآءَ الْفِتْنَةِ وَابْتِغَآءَ تَاْوِیْلِهٖ وَمَا یَعْلَمُ تَاْوِیْلَهٗۤ اِلَّا اللّٰهُ ؐ وَالرّٰسِخُوْنَ فِی الْعِلْمِ یَقُوْلُوْنَ اٰمَنَّا بِهٖ كُلٌّ مِّنْ عِنْدِ رَبِّنَا وَمَا یَذَّكَّرُ اِلَّاۤ اُولُوا الْاَلْبَابِ",
    "رَبَّنَا لَا تُزِغْ قُلُوْبَنَا بَعْدَ اِذْ هَدَیْتَنَا وَهَبْ لَنَا مِنْ لَّدُنْكَ رَحْمَةً اِنَّكَ اَنْتَ الْوَهَّابُ",
    "رَبَّنَاۤ اِنَّكَ جَامِعُ النَّاسِ لِیَوْمٍ لَّا رَیْبَ فِیْهِ اِنَّ اللّٰهَ لَا یُخْلِفُ الْمِیْعَادَ",
    "اِنَّ الَّذِیْنَ كَفَرُوْا لَنْ تُغْنِیَ عَنْهُمْ اَمْوَالُهُمْ وَلَاۤ اَوْلَادُهُمْ مِّنَ اللّٰهِ شَیْـًٔا وَاُولٰٓىِٕكَ هُمْ وَقُوْدُ النَّارِ",
    "كَدَاْبِ اٰلِ فِرْعَوْنَ وَالَّذِیْنَ مِنْ قَبْلِهِمْ كَذَّبُوْا بِاٰیٰتِنَا فَاَخَذَهُمُ اللّٰهُ بِذُنُوْبِهِمْ وَاللّٰهُ شَدِیْدُ الْعِقَابِ",
    "قُلْ لِّلَّذِیْنَ كَفَرُوْا سَتُغْلَبُوْنَ وَتُحْشَرُوْنَ اِلٰی جَهَنَّمَ وَبِئْسَ الْمِهَادُ",
    "قَدْ كَانَ لَكُمْ اٰیَةٌ فِیْ فِئَتَیْنِ الْتَقَتَا فِئَةٌ تُقَاتِلُ فِیْ سَبِیْلِ اللّٰهِ وَاُخْرٰی كَافِرَةٌ یَّرَوْنَهُمْ مِّثْلَیْهِمْ رَاْیَ الْعَیْنِ وَاللّٰهُ یُؤَیِّدُ بِنَصْرِهٖ مَنْ یَّشَآءُ اِنَّ فِیْ ذٰلِكَ لَعِبْرَةً لِّاُولِی الْاَبْصَارِ",
    "زُیِّنَ لِلنَّاسِ حُبُّ الشَّهَوٰتِ مِنَ النِّسَآءِ وَالْبَنِیْنَ وَالْقَنَاطِیْرِ الْمُقَنْطَرَةِ مِنَ الذَّهَبِ وَالْفِضَّةِ وَالْخَیْلِ الْمُسَوَّمَةِ وَالْاَنْعَامِ وَالْحَرْثِ ذٰلِكَ مَتَاعُ الْحَیٰوةِ الدُّنْیَا وَاللّٰهُ عِنْدَهٗ حُسْنُ الْمَاٰبِ",
    "قُلْ اَؤُنَبِّئُكُمْ بِخَیْرٍ مِّنْ ذٰلِكُمْ لِلَّذِیْنَ اتَّقَوْا عِنْدَ رَبِّهِمْ جَنّٰتٌ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِیْنَ فِیْهَا وَاَزْوَاجٌ مُّطَهَّرَةٌ وَّرِضْوَانٌ مِّنَ اللّٰهِ وَاللّٰهُ بَصِیْرٌ بِالْعِبَادِ",
    "اَلَّذِیْنَ یَقُوْلُوْنَ رَبَّنَاۤ اِنَّنَاۤ اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَقِنَا عَذَابَ النَّارِ",
    "اَلصّٰبِرِیْنَ وَالصّٰدِقِیْنَ وَالْقٰنِتِیْنَ وَالْمُنْفِقِیْنَ وَالْمُسْتَغْفِرِیْنَ بِالْاَسْحَارِ",
    "شَهِدَ اللّٰهُ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا هُوَ وَالْمَلٰٓىِٕكَةُ وَاُولُوا الْعِلْمِ قَآىِٕمًا بِالْقِسْطِ لَاۤ اِلٰهَ اِلَّا هُوَ الْعَزِیْزُ الْحَكِیْمُ",
    "اِنَّ الدِّیْنَ عِنْدَ اللّٰهِ الْاِسْلَامُ ۫ وَمَا اخْتَلَفَ الَّذِیْنَ اُوْتُوا الْكِتٰبَ اِلَّا مِنْ بَعْدِ مَا جَآءَهُمُ الْعِلْمُ بَغْیًا بَیْنَهُمْ وَمَنْ یَّكْفُرْ بِاٰیٰتِ اللّٰهِ فَاِنَّ اللّٰهَ سَرِیْعُ الْحِسَابِ",
    "فَاِنْ حَآجُّوْكَ فَقُلْ اَسْلَمْتُ وَجْهِیَ لِلّٰهِ وَمَنِ اتَّبَعَنِ وَقُلْ لِّلَّذِیْنَ اُوْتُوا الْكِتٰبَ وَالْاُمِّیّٖنَ ءَاَسْلَمْتُمْ فَاِنْ اَسْلَمُوْا فَقَدِ اهْتَدَوْا وَاِنْ تَوَلَّوْا فَاِنَّمَا عَلَیْكَ الْبَلٰغُ وَاللّٰهُ بَصِیْرٌ بِالْعِبَادِ",
    "اِنَّ الَّذِیْنَ یَكْفُرُوْنَ بِاٰیٰتِ اللّٰهِ وَیَقْتُلُوْنَ النَّبِیّٖنَ بِغَیْرِ حَقٍّ وَّیَقْتُلُوْنَ الَّذِیْنَ یَاْمُرُوْنَ بِالْقِسْطِ مِنَ النَّاسِ فَبَشِّرْهُمْ بِعَذَابٍ اَلِیْمٍ",
    "اُولٰٓىِٕكَ الَّذِیْنَ حَبِطَتْ اَعْمَالُهُمْ فِی الدُّنْیَا وَالْاٰخِرَةِ وَمَا لَهُمْ مِّنْ نّٰصِرِیْنَ",
    "اَلَمْ تَرَ اِلَی الَّذِیْنَ اُوْتُوْا نَصِیْبًا مِّنَ الْكِتٰبِ یُدْعَوْنَ اِلٰی كِتٰبِ اللّٰهِ لِیَحْكُمَ بَیْنَهُمْ ثُمَّ یَتَوَلّٰی فَرِیْقٌ مِّنْهُمْ وَهُمْ مُّعْرِضُوْنَ",
    "ذٰلِكَ بِاَنَّهُمْ قَالُوْا لَنْ تَمَسَّنَا النَّارُ اِلَّاۤ اَیَّامًا مَّعْدُوْدٰتٍ وَّغَرَّهُمْ فِیْ دِیْنِهِمْ مَّا كَانُوْا یَفْتَرُوْنَ",
    "فَكَیْفَ اِذَا جَمَعْنٰهُمْ لِیَوْمٍ لَّا رَیْبَ فِیْهِ ۫ وَوُفِّیَتْ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا یُظْلَمُوْنَ",
    "قُلِ اللّٰهُمَّ مٰلِكَ الْمُلْكِ تُؤْتِی الْمُلْكَ مَنْ تَشَآءُ وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشَآءُ وَتُعِزُّ مَنْ تَشَآءُ وَتُذِلُّ مَنْ تَشَآءُ بِیَدِكَ الْخَیْرُ اِنَّكَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "تُوْلِجُ الَّیْلَ فِی النَّهَارِ وَتُوْلِجُ النَّهَارَ فِی الَّیْلِ وَتُخْرِجُ الْحَیَّ مِنَ الْمَیِّتِ وَتُخْرِجُ الْمَیِّتَ مِنَ الْحَیِّ وَتَرْزُقُ مَنْ تَشَآءُ بِغَیْرِ حِسَابٍ",
    "لَا یَتَّخِذِ الْمُؤْمِنُوْنَ الْكٰفِرِیْنَ اَوْلِیَآءَ مِنْ دُوْنِ الْمُؤْمِنِیْنَ وَمَنْ یَّفْعَلْ ذٰلِكَ فَلَیْسَ مِنَ اللّٰهِ فِیْ شَیْءٍ اِلَّاۤ اَنْ تَتَّقُوْا مِنْهُمْ تُقٰىةً وَیُحَذِّرُكُمُ اللّٰهُ نَفْسَهٗ وَاِلَی اللّٰهِ الْمَصِیْرُ",
    "قُلْ اِنْ تُخْفُوْا مَا فِیْ صُدُوْرِكُمْ اَوْ تُبْدُوْهُ یَعْلَمْهُ اللّٰهُ وَیَعْلَمُ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَاللّٰهُ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "یَوْمَ تَجِدُ كُلُّ نَفْسٍ مَّا عَمِلَتْ مِنْ خَیْرٍ مُّحْضَرًا وَّمَا عَمِلَتْ مِنْ سُوْٓءٍ تَوَدُّ لَوْ اَنَّ بَیْنَهَا وَبَیْنَهٗۤ اَمَدًاۢ بَعِیْدًا وَیُحَذِّرُكُمُ اللّٰهُ نَفْسَهٗ وَاللّٰهُ رَءُوْفٌۢ بِالْعِبَادِ",
    "قُلْ اِنْ كُنْتُمْ تُحِبُّوْنَ اللّٰهَ فَاتَّبِعُوْنِیْ یُحْبِبْكُمُ اللّٰهُ وَیَغْفِرْ لَكُمْ ذُنُوْبَكُمْ وَاللّٰهُ غَفُوْرٌ رَّحِیْمٌ",
    "قُلْ اَطِیْعُوا اللّٰهَ وَالرَّسُوْلَ فَاِنْ تَوَلَّوْا فَاِنَّ اللّٰهَ لَا یُحِبُّ الْكٰفِرِیْنَ",
    "اِنَّ اللّٰهَ اصْطَفٰۤی اٰدَمَ وَنُوْحًا وَّاٰلَ اِبْرٰهِیْمَ وَاٰلَ عِمْرٰنَ عَلَی الْعٰلَمِیْنَ",
    "ذُرِّیَّةً بَعْضُهَا مِنْ بَعْضٍ وَاللّٰهُ سَمِیْعٌ عَلِیْمٌ",
    "اِذْ قَالَتِ امْرَاَتُ عِمْرٰنَ رَبِّ اِنِّیْ نَذَرْتُ لَكَ مَا فِیْ بَطْنِیْ مُحَرَّرًا فَتَقَبَّلْ مِنِّیْ اِنَّكَ اَنْتَ السَّمِیْعُ الْعَلِیْمُ",
    "فَلَمَّا وَضَعَتْهَا قَالَتْ رَبِّ اِنِّیْ وَضَعْتُهَاۤ اُ وَاللّٰهُ اَعْلَمُ بِمَا وَضَعَتْ وَلَیْسَ الذَّكَرُ كَالْاُ وَاِنِّیْ سَمَّیْتُهَا مَرْیَمَ وَاِنِّیْۤ اُعِیْذُهَا بِكَ وَذُرِّیَّتَهَا مِنَ الشَّیْطٰنِ الرَّجِیْمِ",
    "فَتَقَبَّلَهَا رَبُّهَا بِقَبُوْلٍ حَسَنٍ وَّاَنْۢبَتَهَا نَبَاتًا حَسَنًا وَّكَفَّلَهَا زَكَرِیَّا كُلَّمَا دَخَلَ عَلَیْهَا زَكَرِیَّا الْمِحْرَابَ وَجَدَ عِنْدَهَا رِزْقًا قَالَ یٰمَرْیَمُ اَنّٰی لَكِ هٰذَا قَالَتْ هُوَ مِنْ عِنْدِ اللّٰهِ اِنَّ اللّٰهَ یَرْزُقُ مَنْ یَّشَآءُ بِغَیْرِ حِسَابٍ",
    "هُنَالِكَ دَعَا زَكَرِیَّا رَبَّهٗ قَالَ رَبِّ هَبْ لِیْ مِنْ لَّدُنْكَ ذُرِّیَّةً طَیِّبَةً اِنَّكَ سَمِیْعُ الدُّعَآءِ",
    "فَنَادَتْهُ الْمَلٰٓىِٕكَةُ وَهُوَ قَآىِٕمٌ یُّصَلِّیْ فِی الْمِحْرَابِ اَنَّ اللّٰهَ یُبَشِّرُكَ بِیَحْیٰی مُصَدِّقًا بِكَلِمَةٍ مِّنَ اللّٰهِ وَسَیِّدًا وَّحَصُوْرًا وَّنَبِیًّا مِّنَ الصّٰلِحِیْنَ",
    "قَالَ رَبِّ اَنّٰی یَكُوْنُ لِیْ غُلٰمٌ وَّقَدْ بَلَغَنِیَ الْكِبَرُ وَامْرَاَتِیْ عَاقِرٌ قَالَ كَذٰلِكَ اللّٰهُ یَفْعَلُ مَا یَشَآءُ",
    "قَالَ رَبِّ اجْعَلْ لِّیْۤ اٰیَةً قَالَ اٰیَتُكَ اَلَّا تُكَلِّمَ النَّاسَ ثَلٰثَةَ اَیَّامٍ اِلَّا رَمْزًا وَاذْكُرْ رَّبَّكَ كَثِیْرًا وَّسَبِّحْ بِالْعَشِیِّ وَالْاِبْكَارِ",
    "وَاِذْ قَالَتِ الْمَلٰٓىِٕكَةُ یٰمَرْیَمُ اِنَّ اللّٰهَ اصْطَفٰىكِ وَطَهَّرَكِ وَاصْطَفٰىكِ عَلٰی نِسَآءِ الْعٰلَمِیْنَ",
    "یٰمَرْیَمُ اقْنُتِیْ لِرَبِّكِ وَاسْجُدِیْ وَارْكَعِیْ مَعَ الرّٰكِعِیْنَ",
    "ذٰلِكَ مِنْ اَنْۢبَآءِ الْغَیْبِ نُوْحِیْهِ اِلَیْكَ وَمَا كُنْتَ لَدَیْهِمْ اِذْ یُلْقُوْنَ اَقْلَامَهُمْ اَیُّهُمْ یَكْفُلُ مَرْیَمَ وَمَا كُنْتَ لَدَیْهِمْ اِذْ یَخْتَصِمُوْنَ",
    "اِذْ قَالَتِ الْمَلٰٓىِٕكَةُ یٰمَرْیَمُ اِنَّ اللّٰهَ یُبَشِّرُكِ بِكَلِمَةٍ مِّنْهُ اسْمُهُ الْمَسِیْحُ عِیْسَی ابْنُ مَرْیَمَ وَجِیْهًا فِی الدُّنْیَا وَالْاٰخِرَةِ وَمِنَ الْمُقَرَّبِیْنَ",
    "وَیُكَلِّمُ النَّاسَ فِی الْمَهْدِ وَكَهْلًا وَّمِنَ الصّٰلِحِیْنَ",
    "قَالَتْ رَبِّ اَنّٰی یَكُوْنُ لِیْ وَلَدٌ وَّلَمْ یَمْسَسْنِیْ بَشَرٌ قَالَ كَذٰلِكِ اللّٰهُ یَخْلُقُ مَا یَشَآءُ اِذَا قَضٰۤی اَمْرًا فَاِنَّمَا یَقُوْلُ لَهٗ كُنْ فَیَكُوْنُ",
    "وَیُعَلِّمُهُ الْكِتٰبَ وَالْحِكْمَةَ وَالتَّوْرٰىةَ وَالْاِنْجِیْلَ",
    "وَرَسُوْلًا اِلٰی بَنِیْۤ اِسْرَآءِیْلَ اَنِّیْ قَدْ جِئْتُكُمْ بِاٰیَةٍ مِّنْ رَّبِّكُمْ اَنِّیْۤ اَخْلُقُ لَكُمْ مِّنَ الطِّیْنِ كَهَیْـَٔةِ الطَّیْرِ فَاَنْفُخُ فِیْهِ فَیَكُوْنُ طَیْرًا بِاِذْنِ اللّٰهِ وَاُبْرِئُ الْاَكْمَهَ وَالْاَبْرَصَ وَاُحْیِ الْمَوْتٰی بِاِذْنِ اللّٰهِ وَاُنَبِّئُكُمْ بِمَا تَاْكُلُوْنَ وَمَا تَدَّخِرُوْنَ فِیْ بُیُوْتِكُمْ اِنَّ فِیْ ذٰلِكَ لَاٰیَةً لَّكُمْ اِنْ كُنْتُمْ مُّؤْمِنِیْنَ",
    "وَمُصَدِّقًا لِّمَا بَیْنَ یَدَیَّ مِنَ التَّوْرٰىةِ وَلِاُحِلَّ لَكُمْ بَعْضَ الَّذِیْ حُرِّمَ عَلَیْكُمْ وَجِئْتُكُمْ بِاٰیَةٍ مِّنْ رَّبِّكُمْ ۫ فَاتَّقُوا اللّٰهَ وَاَطِیْعُوْنِ",
    "اِنَّ اللّٰهَ رَبِّیْ وَرَبُّكُمْ فَاعْبُدُوْهُ هٰذَا صِرَاطٌ مُّسْتَقِیْمٌ",
    "فَلَمَّاۤ اَحَسَّ عِیْسٰی مِنْهُمُ الْكُفْرَ قَالَ مَنْ اَنْصَارِیْۤ اِلَی اللّٰهِ قَالَ الْحَوَارِیُّوْنَ نَحْنُ اَنْصَارُ اللّٰهِ اٰمَنَّا بِاللّٰهِ وَاشْهَدْ بِاَنَّا مُسْلِمُوْنَ",
    "رَبَّنَاۤ اٰمَنَّا بِمَاۤ اَنْزَلْتَ وَاتَّبَعْنَا الرَّسُوْلَ فَاكْتُبْنَا مَعَ الشّٰهِدِیْنَ",
    "وَمَكَرُوْا وَمَكَرَ اللّٰهُ وَاللّٰهُ خَیْرُ الْمٰكِرِیْنَ",
    "اِذْ قَالَ اللّٰهُ یٰعِیْسٰۤی اِنِّیْ مُتَوَفِّیْكَ وَرَافِعُكَ اِلَیَّ وَمُطَهِّرُكَ مِنَ الَّذِیْنَ كَفَرُوْا وَجَاعِلُ الَّذِیْنَ اتَّبَعُوْكَ فَوْقَ الَّذِیْنَ كَفَرُوْۤا اِلٰی یَوْمِ الْقِیٰمَةِ ثُمَّ اِلَیَّ مَرْجِعُكُمْ فَاَحْكُمُ بَیْنَكُمْ فِیْمَا كُنْتُمْ فِیْهِ تَخْتَلِفُوْنَ",
    "فَاَمَّا الَّذِیْنَ كَفَرُوْا فَاُعَذِّبُهُمْ عَذَابًا شَدِیْدًا فِی الدُّنْیَا وَالْاٰخِرَةِ وَمَا لَهُمْ مِّنْ نّٰصِرِیْنَ",
    "وَاَمَّا الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فَیُوَفِّیْهِمْ اُجُوْرَهُمْ وَاللّٰهُ لَا یُحِبُّ الظّٰلِمِیْنَ",
    "ذٰلِكَ نَتْلُوْهُ عَلَیْكَ مِنَ الْاٰیٰتِ وَالذِّكْرِ الْحَكِیْمِ",
    "اِنَّ مَثَلَ عِیْسٰی عِنْدَ اللّٰهِ كَمَثَلِ اٰدَمَ خَلَقَهٗ مِنْ تُرَابٍ ثُمَّ قَالَ لَهٗ كُنْ فَیَكُوْنُ",
    "اَلْحَقُّ مِنْ رَّبِّكَ فَلَا تَكُنْ مِّنَ الْمُمْتَرِیْنَ",
    "فَمَنْ حَآجَّكَ فِیْهِ مِنْ بَعْدِ مَا جَآءَكَ مِنَ الْعِلْمِ فَقُلْ تَعَالَوْا نَدْعُ اَبْنَآءَنَا وَاَبْنَآءَكُمْ وَنِسَآءَنَا وَنِسَآءَكُمْ وَاَنْفُسَنَا وَاَنْفُسَكُمْ ۫ ثُمَّ نَبْتَهِلْ فَنَجْعَلْ لَّعْنَتَ اللّٰهِ عَلَی الْكٰذِبِیْنَ",
    "اِنَّ هٰذَا لَهُوَ الْقَصَصُ الْحَقُّ وَمَا مِنْ اِلٰهٍ اِلَّا اللّٰهُ وَاِنَّ اللّٰهَ لَهُوَ الْعَزِیْزُ الْحَكِیْمُ",
    "فَاِنْ تَوَلَّوْا فَاِنَّ اللّٰهَ عَلِیْمٌۢ بِالْمُفْسِدِیْنَ",
    "قُلْ یٰۤاَهْلَ الْكِتٰبِ تَعَالَوْا اِلٰی كَلِمَةٍ سَوَآءٍ بَیْنَنَا وَبَیْنَكُمْ اَلَّا نَعْبُدَ اِلَّا اللّٰهَ وَلَا نُشْرِكَ بِهٖ شَیْـًٔا وَّلَا یَتَّخِذَ بَعْضُنَا بَعْضًا اَرْبَابًا مِّنْ دُوْنِ اللّٰهِ فَاِنْ تَوَلَّوْا فَقُوْلُوا اشْهَدُوْا بِاَنَّا مُسْلِمُوْنَ",
    "یٰۤاَهْلَ الْكِتٰبِ لِمَ تُحَآجُّوْنَ فِیْۤ اِبْرٰهِیْمَ وَمَاۤ اُنْزِلَتِ التَّوْرٰىةُ وَالْاِنْجِیْلُ اِلَّا مِنْ بَعْدِهٖ اَفَلَا تَعْقِلُوْنَ",
    "هٰۤاَنْتُمْ هٰۤؤُلَآءِ حَاجَجْتُمْ فِیْمَا لَكُمْ بِهٖ عِلْمٌ فَلِمَ تُحَآجُّوْنَ فِیْمَا لَیْسَ لَكُمْ بِهٖ عِلْمٌ وَاللّٰهُ یَعْلَمُ وَاَنْتُمْ لَا تَعْلَمُوْنَ",
    "مَا كَانَ اِبْرٰهِیْمُ یَهُوْدِیًّا وَّلَا نَصْرَانِیًّا وَّلٰكِنْ كَانَ حَنِیْفًا مُّسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِیْنَ",
    "اِنَّ اَوْلَی النَّاسِ بِاِبْرٰهِیْمَ لَلَّذِیْنَ اتَّبَعُوْهُ وَهٰذَا النَّبِیُّ وَالَّذِیْنَ اٰمَنُوْا وَاللّٰهُ وَلِیُّ الْمُؤْمِنِیْنَ",
    "وَدَّتْ طَّآىِٕفَةٌ مِّنْ اَهْلِ الْكِتٰبِ لَوْ یُضِلُّوْنَكُمْ وَمَا یُضِلُّوْنَ اِلَّاۤ اَنْفُسَهُمْ وَمَا یَشْعُرُوْنَ",
    "یٰۤاَهْلَ الْكِتٰبِ لِمَ تَكْفُرُوْنَ بِاٰیٰتِ اللّٰهِ وَاَنْتُمْ تَشْهَدُوْنَ",
    "یٰۤاَهْلَ الْكِتٰبِ لِمَ تَلْبِسُوْنَ الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُوْنَ الْحَقَّ وَاَنْتُمْ تَعْلَمُوْنَ",
    "وَقَالَتْ طَّآىِٕفَةٌ مِّنْ اَهْلِ الْكِتٰبِ اٰمِنُوْا بِالَّذِیْۤ اُنْزِلَ عَلَی الَّذِیْنَ اٰمَنُوْا وَجْهَ النَّهَارِ وَاكْفُرُوْۤا اٰخِرَهٗ لَعَلَّهُمْ یَرْجِعُوْنَ ۖ",
    "وَلَا تُؤْمِنُوْۤا اِلَّا لِمَنْ تَبِعَ دِیْنَكُمْ قُلْ اِنَّ الْهُدٰی هُدَی اللّٰهِ اَنْ یُّؤْتٰۤی اَحَدٌ مِّثْلَ مَاۤ اُوْتِیْتُمْ اَوْ یُحَآجُّوْكُمْ عِنْدَ رَبِّكُمْ قُلْ اِنَّ الْفَضْلَ بِیَدِ اللّٰهِ یُؤْتِیْهِ مَنْ یَّشَآءُ وَاللّٰهُ وَاسِعٌ عَلِیْمٌ",
    "یَّخْتَصُّ بِرَحْمَتِهٖ مَنْ یَّشَآءُ وَاللّٰهُ ذُو الْفَضْلِ الْعَظِیْمِ",
    "وَمِنْ اَهْلِ الْكِتٰبِ مَنْ اِنْ تَاْمَنْهُ بِقِنْطَارٍ یُّؤَدِّهٖۤ اِلَیْكَ وَمِنْهُمْ مَّنْ اِنْ تَاْمَنْهُ بِدِیْنَارٍ لَّا یُؤَدِّهٖۤ اِلَیْكَ اِلَّا مَا دُمْتَ عَلَیْهِ قَآىِٕمًا ذٰلِكَ بِاَنَّهُمْ قَالُوْا لَیْسَ عَلَیْنَا فِی الْاُمِّیّٖنَ سَبِیْلٌ وَیَقُوْلُوْنَ عَلَی اللّٰهِ الْكَذِبَ وَهُمْ یَعْلَمُوْنَ",
    "بَلٰی مَنْ اَوْفٰی بِعَهْدِهٖ وَاتَّقٰی فَاِنَّ اللّٰهَ یُحِبُّ الْمُتَّقِیْنَ",
    "اِنَّ الَّذِیْنَ یَشْتَرُوْنَ بِعَهْدِ اللّٰهِ وَاَیْمَانِهِمْ ثَمَنًا قَلِیْلًا اُولٰٓىِٕكَ لَا خَلَاقَ لَهُمْ فِی الْاٰخِرَةِ وَلَا یُكَلِّمُهُمُ اللّٰهُ وَلَا یَنْظُرُ اِلَیْهِمْ یَوْمَ الْقِیٰمَةِ وَلَا یُزَكِّیْهِمْ وَلَهُمْ عَذَابٌ اَلِیْمٌ",
    "وَاِنَّ مِنْهُمْ لَفَرِیْقًا یَّلْوٗنَ اَلْسِنَتَهُمْ بِالْكِتٰبِ لِتَحْسَبُوْهُ مِنَ الْكِتٰبِ وَمَا هُوَ مِنَ الْكِتٰبِ وَیَقُوْلُوْنَ هُوَ مِنْ عِنْدِ اللّٰهِ وَمَا هُوَ مِنْ عِنْدِ اللّٰهِ وَیَقُوْلُوْنَ عَلَی اللّٰهِ الْكَذِبَ وَهُمْ یَعْلَمُوْنَ",
    "مَا كَانَ لِبَشَرٍ اَنْ یُّؤْتِیَهُ اللّٰهُ الْكِتٰبَ وَالْحُكْمَ وَالنُّبُوَّةَ ثُمَّ یَقُوْلَ لِلنَّاسِ كُوْنُوْا عِبَادًا لِّیْ مِنْ دُوْنِ اللّٰهِ وَلٰكِنْ كُوْنُوْا رَبّٰنِیّٖنَ بِمَا كُنْتُمْ تُعَلِّمُوْنَ الْكِتٰبَ وَبِمَا كُنْتُمْ تَدْرُسُوْنَ",
    "وَلَا یَاْمُرَكُمْ اَنْ تَتَّخِذُوا الْمَلٰٓىِٕكَةَ وَالنَّبِیّٖنَ اَرْبَابًا اَیَاْمُرُكُمْ بِالْكُفْرِ بَعْدَ اِذْ اَنْتُمْ مُّسْلِمُوْنَ",
    "وَاِذْ اَخَذَ اللّٰهُ مِیْثَاقَ النَّبِیّٖنَ لَمَاۤ اٰتَیْتُكُمْ مِّنْ كِتٰبٍ وَّحِكْمَةٍ ثُمَّ جَآءَكُمْ رَسُوْلٌ مُّصَدِّقٌ لِّمَا مَعَكُمْ لَتُؤْمِنُنَّ بِهٖ وَلَتَنْصُرُنَّهٗ قَالَ ءَاَقْرَرْتُمْ وَاَخَذْتُمْ عَلٰی ذٰلِكُمْ اِصْرِیْ قَالُوْۤا اَقْرَرْنَا قَالَ فَاشْهَدُوْا وَاَنَا مَعَكُمْ مِّنَ الشّٰهِدِیْنَ",
    "فَمَنْ تَوَلّٰی بَعْدَ ذٰلِكَ فَاُولٰٓىِٕكَ هُمُ الْفٰسِقُوْنَ",
    "اَفَغَیْرَ دِیْنِ اللّٰهِ یَبْغُوْنَ وَلَهٗۤ اَسْلَمَ مَنْ فِی السَّمٰوٰتِ وَالْاَرْضِ طَوْعًا وَّكَرْهًا وَّاِلَیْهِ یُرْجَعُوْنَ",
    "قُلْ اٰمَنَّا بِاللّٰهِ وَمَاۤ اُنْزِلَ عَلَیْنَا وَمَاۤ اُنْزِلَ عَلٰۤی اِبْرٰهِیْمَ وَاِسْمٰعِیْلَ وَاِسْحٰقَ وَیَعْقُوْبَ وَالْاَسْبَاطِ وَمَاۤ اُوْتِیَ مُوْسٰی وَعِیْسٰی وَالنَّبِیُّوْنَ مِنْ رَّبِّهِمْ لَا نُفَرِّقُ بَیْنَ اَحَدٍ مِّنْهُمْ وَنَحْنُ لَهٗ مُسْلِمُوْنَ",
    "وَمَنْ یَّبْتَغِ غَیْرَ الْاِسْلَامِ دِیْنًا فَلَنْ یُّقْبَلَ مِنْهُ وَهُوَ فِی الْاٰخِرَةِ مِنَ الْخٰسِرِیْنَ",
    "كَیْفَ یَهْدِی اللّٰهُ قَوْمًا كَفَرُوْا بَعْدَ اِیْمَانِهِمْ وَشَهِدُوْۤا اَنَّ الرَّسُوْلَ حَقٌّ وَّجَآءَهُمُ الْبَیِّنٰتُ وَاللّٰهُ لَا یَهْدِی الْقَوْمَ الظّٰلِمِیْنَ",
    "اُولٰٓىِٕكَ جَزَآؤُهُمْ اَنَّ عَلَیْهِمْ لَعْنَةَ اللّٰهِ وَالْمَلٰٓىِٕكَةِ وَالنَّاسِ اَجْمَعِیْنَ",
    "خٰلِدِیْنَ فِیْهَا لَا یُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ یُنْظَرُوْنَ",
    "اِلَّا الَّذِیْنَ تَابُوْا مِنْ بَعْدِ ذٰلِكَ وَاَصْلَحُوْا ۫ فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِیْمٌ",
    "اِنَّ الَّذِیْنَ كَفَرُوْا بَعْدَ اِیْمَانِهِمْ ثُمَّ ازْدَادُوْا كُفْرًا لَّنْ تُقْبَلَ تَوْبَتُهُمْ وَاُولٰٓىِٕكَ هُمُ الضَّآلُّوْنَ",
    "اِنَّ الَّذِیْنَ كَفَرُوْا وَمَاتُوْا وَهُمْ كُفَّارٌ فَلَنْ یُّقْبَلَ مِنْ اَحَدِهِمْ مِّلْءُ الْاَرْضِ ذَهَبًا وَّلَوِ افْتَدٰی بِهٖ اُولٰٓىِٕكَ لَهُمْ عَذَابٌ اَلِیْمٌ وَّمَا لَهُمْ مِّنْ نّٰصِرِیْنَ",
    "لَنْ تَنَالُوا الْبِرَّ حَتّٰی تُنْفِقُوْا مِمَّا تُحِبُّوْنَ وَمَا تُنْفِقُوْا مِنْ شَیْءٍ فَاِنَّ اللّٰهَ بِهٖ عَلِیْمٌ",
    "كُلُّ الطَّعَامِ كَانَ حِلًّا لِّبَنِیْۤ اِسْرَآءِیْلَ اِلَّا مَا حَرَّمَ اِسْرَآءِیْلُ عَلٰی نَفْسِهٖ مِنْ قَبْلِ اَنْ تُنَزَّلَ التَّوْرٰىةُ قُلْ فَاْتُوْا بِالتَّوْرٰىةِ فَاتْلُوْهَاۤ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "فَمَنِ افْتَرٰی عَلَی اللّٰهِ الْكَذِبَ مِنْ بَعْدِ ذٰلِكَ فَاُولٰٓىِٕكَ هُمُ الظّٰلِمُوْنَ",
    "قُلْ صَدَقَ اللّٰهُ ۫ فَاتَّبِعُوْا مِلَّةَ اِبْرٰهِیْمَ حَنِیْفًا وَمَا كَانَ مِنَ الْمُشْرِكِیْنَ",
    "اِنَّ اَوَّلَ بَیْتٍ وُّضِعَ لِلنَّاسِ لَلَّذِیْ بِبَكَّةَ مُبٰرَكًا وَّهُدًی لِّلْعٰلَمِیْنَ",
    "فِیْهِ اٰیٰتٌۢ بَیِّنٰتٌ مَّقَامُ اِبْرٰهِیْمَ وَمَنْ دَخَلَهٗ كَانَ اٰمِنًا وَلِلّٰهِ عَلَی النَّاسِ حِجُّ الْبَیْتِ مَنِ اسْتَطَاعَ اِلَیْهِ سَبِیْلًا وَمَنْ كَفَرَ فَاِنَّ اللّٰهَ غَنِیٌّ عَنِ الْعٰلَمِیْنَ",
    "قُلْ یٰۤاَهْلَ الْكِتٰبِ لِمَ تَكْفُرُوْنَ بِاٰیٰتِ اللّٰهِ ۖ وَاللّٰهُ شَهِیْدٌ عَلٰی مَا تَعْمَلُوْنَ",
    "قُلْ یٰۤاَهْلَ الْكِتٰبِ لِمَ تَصُدُّوْنَ عَنْ سَبِیْلِ اللّٰهِ مَنْ اٰمَنَ تَبْغُوْنَهَا عِوَجًا وَّاَنْتُمْ شُهَدَآءُ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اِنْ تُطِیْعُوْا فَرِیْقًا مِّنَ الَّذِیْنَ اُوْتُوا الْكِتٰبَ یَرُدُّوْكُمْ بَعْدَ اِیْمَانِكُمْ كٰفِرِیْنَ",
    "وَكَیْفَ تَكْفُرُوْنَ وَاَنْتُمْ تُتْلٰی عَلَیْكُمْ اٰیٰتُ اللّٰهِ وَفِیْكُمْ رَسُوْلُهٗ وَمَنْ یَّعْتَصِمْ بِاللّٰهِ فَقَدْ هُدِیَ اِلٰی صِرَاطٍ مُّسْتَقِیْمٍ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوا اتَّقُوا اللّٰهَ حَقَّ تُقٰتِهٖ وَلَا تَمُوْتُنَّ اِلَّا وَاَنْتُمْ مُّسْلِمُوْنَ",
    "وَاعْتَصِمُوْا بِحَبْلِ اللّٰهِ جَمِیْعًا وَّلَا تَفَرَّقُوْا وَاذْكُرُوْا نِعْمَتَ اللّٰهِ عَلَیْكُمْ اِذْ كُنْتُمْ اَعْدَآءً فَاَلَّفَ بَیْنَ قُلُوْبِكُمْ فَاَصْبَحْتُمْ بِنِعْمَتِهٖۤ اِخْوَانًا وَكُنْتُمْ عَلٰی شَفَا حُفْرَةٍ مِّنَ النَّارِ فَاَنْقَذَكُمْ مِّنْهَا كَذٰلِكَ یُبَیِّنُ اللّٰهُ لَكُمْ اٰیٰتِهٖ لَعَلَّكُمْ تَهْتَدُوْنَ",
    "وَلْتَكُنْ مِّنْكُمْ اُمَّةٌ یَّدْعُوْنَ اِلَی الْخَیْرِ وَیَاْمُرُوْنَ بِالْمَعْرُوْفِ وَیَنْهَوْنَ عَنِ الْمُنْكَرِ وَاُولٰٓىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "وَلَا تَكُوْنُوْا كَالَّذِیْنَ تَفَرَّقُوْا وَاخْتَلَفُوْا مِنْ بَعْدِ مَا جَآءَهُمُ الْبَیِّنٰتُ وَاُولٰٓىِٕكَ لَهُمْ عَذَابٌ عَظِیْمٌ",
    "یَّوْمَ تَبْیَضُّ وُجُوْهٌ وَّتَسْوَدُّ وُجُوْهٌ فَاَمَّا الَّذِیْنَ اسْوَدَّتْ وُجُوْهُهُمْ ۫ اَكَفَرْتُمْ بَعْدَ اِیْمَانِكُمْ فَذُوْقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُوْنَ",
    "وَاَمَّا الَّذِیْنَ ابْیَضَّتْ وُجُوْهُهُمْ فَفِیْ رَحْمَةِ اللّٰهِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "تِلْكَ اٰیٰتُ اللّٰهِ نَتْلُوْهَا عَلَیْكَ بِالْحَقِّ وَمَا اللّٰهُ یُرِیْدُ ظُلْمًا لِّلْعٰلَمِیْنَ",
    "وَلِلّٰهِ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَاِلَی اللّٰهِ تُرْجَعُ الْاُمُوْرُ",
    "كُنْتُمْ خَیْرَ اُمَّةٍ اُخْرِجَتْ لِلنَّاسِ تَاْمُرُوْنَ بِالْمَعْرُوْفِ وَتَنْهَوْنَ عَنِ الْمُنْكَرِ وَتُؤْمِنُوْنَ بِاللّٰهِ وَلَوْ اٰمَنَ اَهْلُ الْكِتٰبِ لَكَانَ خَیْرًا لَّهُمْ مِنْهُمُ الْمُؤْمِنُوْنَ وَاَكْثَرُهُمُ الْفٰسِقُوْنَ",
    "لَنْ یَّضُرُّوْكُمْ اِلَّاۤ اَذًی وَاِنْ یُّقَاتِلُوْكُمْ یُوَلُّوْكُمُ الْاَدْبَارَ ۫ ثُمَّ لَا یُنْصَرُوْنَ",
    "ضُرِبَتْ عَلَیْهِمُ الذِّلَّةُ اَیْنَ مَا ثُقِفُوْۤا اِلَّا بِحَبْلٍ مِّنَ اللّٰهِ وَحَبْلٍ مِّنَ النَّاسِ وَبَآءُوْ بِغَضَبٍ مِّنَ اللّٰهِ وَضُرِبَتْ عَلَیْهِمُ الْمَسْكَنَةُ ذٰلِكَ بِاَنَّهُمْ كَانُوْا یَكْفُرُوْنَ بِاٰیٰتِ اللّٰهِ وَیَقْتُلُوْنَ الْاَنْۢبِیَآءَ بِغَیْرِ حَقٍّ ذٰلِكَ بِمَا عَصَوْا وَّكَانُوْا یَعْتَدُوْنَ ۗ",
    "لَیْسُوْا سَوَآءً مِنْ اَهْلِ الْكِتٰبِ اُمَّةٌ قَآىِٕمَةٌ یَّتْلُوْنَ اٰیٰتِ اللّٰهِ اٰنَآءَ الَّیْلِ وَهُمْ یَسْجُدُوْنَ",
    "یُؤْمِنُوْنَ بِاللّٰهِ وَالْیَوْمِ الْاٰخِرِ وَیَاْمُرُوْنَ بِالْمَعْرُوْفِ وَیَنْهَوْنَ عَنِ الْمُنْكَرِ وَیُسَارِعُوْنَ فِی الْخَیْرٰتِ وَاُولٰٓىِٕكَ مِنَ الصّٰلِحِیْنَ",
    "وَمَا یَفْعَلُوْا مِنْ خَیْرٍ فَلَنْ یُّكْفَرُوْهُ وَاللّٰهُ عَلِیْمٌۢ بِالْمُتَّقِیْنَ",
    "اِنَّ الَّذِیْنَ كَفَرُوْا لَنْ تُغْنِیَ عَنْهُمْ اَمْوَالُهُمْ وَلَاۤ اَوْلَادُهُمْ مِّنَ اللّٰهِ شَیْـًٔا وَاُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِیْهَا خٰلِدُوْنَ",
    "مَثَلُ مَا یُنْفِقُوْنَ فِیْ هٰذِهِ الْحَیٰوةِ الدُّنْیَا كَمَثَلِ رِیْحٍ فِیْهَا صِرٌّ اَصَابَتْ حَرْثَ قَوْمٍ ظَلَمُوْۤا اَنْفُسَهُمْ فَاَهْلَكَتْهُ وَمَا ظَلَمَهُمُ اللّٰهُ وَلٰكِنْ اَنْفُسَهُمْ یَظْلِمُوْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا تَتَّخِذُوْا بِطَانَةً مِّنْ دُوْنِكُمْ لَا یَاْلُوْنَكُمْ خَبَالًا وَدُّوْا مَا عَنِتُّمْ قَدْ بَدَتِ الْبَغْضَآءُ مِنْ اَفْوَاهِهِمْ وَمَا تُخْفِیْ صُدُوْرُهُمْ اَكْبَرُ قَدْ بَیَّنَّا لَكُمُ الْاٰیٰتِ اِنْ كُنْتُمْ تَعْقِلُوْنَ",
    "هٰۤاَنْتُمْ اُولَآءِ تُحِبُّوْنَهُمْ وَلَا یُحِبُّوْنَكُمْ وَتُؤْمِنُوْنَ بِالْكِتٰبِ كُلِّهٖ وَاِذَا لَقُوْكُمْ قَالُوْۤا اٰمَنَّا ۖۗ وَاِذَا خَلَوْا عَضُّوْا عَلَیْكُمُ الْاَنَامِلَ مِنَ الْغَیْظِ قُلْ مُوْتُوْا بِغَیْظِكُمْ اِنَّ اللّٰهَ عَلِیْمٌۢ بِذَاتِ الصُّدُوْرِ",
    "اِنْ تَمْسَسْكُمْ حَسَنَةٌ تَسُؤْهُمْ وَاِنْ تُصِبْكُمْ سَیِّئَةٌ یَّفْرَحُوْا بِهَا وَاِنْ تَصْبِرُوْا وَتَتَّقُوْا لَا یَضُرُّكُمْ كَیْدُهُمْ شَیْـًٔا اِنَّ اللّٰهَ بِمَا یَعْمَلُوْنَ مُحِیْطٌ",
    "وَاِذْ غَدَوْتَ مِنْ اَهْلِكَ تُبَوِّئُ الْمُؤْمِنِیْنَ مَقَاعِدَ لِلْقِتَالِ وَاللّٰهُ سَمِیْعٌ عَلِیْمٌ",
    "اِذْ هَمَّتْ طَّآىِٕفَتٰنِ مِنْكُمْ اَنْ تَفْشَلَا وَاللّٰهُ وَلِیُّهُمَا وَعَلَی اللّٰهِ فَلْیَتَوَكَّلِ الْمُؤْمِنُوْنَ",
    "وَلَقَدْ نَصَرَكُمُ اللّٰهُ بِبَدْرٍ وَّاَنْتُمْ اَذِلَّةٌ فَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تَشْكُرُوْنَ",
    "اِذْ تَقُوْلُ لِلْمُؤْمِنِیْنَ اَلَنْ یَّكْفِیَكُمْ اَنْ یُّمِدَّكُمْ رَبُّكُمْ بِثَلٰثَةِ اٰلٰفٍ مِّنَ الْمَلٰٓىِٕكَةِ مُنْزَلِیْنَ",
    "بَلٰۤی اِنْ تَصْبِرُوْا وَتَتَّقُوْا وَیَاْتُوْكُمْ مِّنْ فَوْرِهِمْ هٰذَا یُمْدِدْكُمْ رَبُّكُمْ بِخَمْسَةِ اٰلٰفٍ مِّنَ الْمَلٰٓىِٕكَةِ مُسَوِّمِیْنَ",
    "وَمَا جَعَلَهُ اللّٰهُ اِلَّا بُشْرٰی لَكُمْ وَلِتَطْمَىِٕنَّ قُلُوْبُكُمْ بِهٖ وَمَا النَّصْرُ اِلَّا مِنْ عِنْدِ اللّٰهِ الْعَزِیْزِ الْحَكِیْمِ",
    "لِیَقْطَعَ طَرَفًا مِّنَ الَّذِیْنَ كَفَرُوْۤا اَوْ یَكْبِتَهُمْ فَیَنْقَلِبُوْا خَآىِٕبِیْنَ",
    "لَیْسَ لَكَ مِنَ الْاَمْرِ شَیْءٌ اَوْ یَتُوْبَ عَلَیْهِمْ اَوْ یُعَذِّبَهُمْ فَاِنَّهُمْ ظٰلِمُوْنَ",
    "وَلِلّٰهِ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ یَغْفِرُ لِمَنْ یَّشَآءُ وَیُعَذِّبُ مَنْ یَّشَآءُ وَاللّٰهُ غَفُوْرٌ رَّحِیْمٌ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا تَاْكُلُوا الرِّبٰۤوا اَضْعَافًا مُّضٰعَفَةً وَّاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُفْلِحُوْنَ",
    "وَاتَّقُوا النَّارَ الَّتِیْۤ اُعِدَّتْ لِلْكٰفِرِیْنَ",
    "وَاَطِیْعُوا اللّٰهَ وَالرَّسُوْلَ لَعَلَّكُمْ تُرْحَمُوْنَ",
    "وَسَارِعُوْۤا اِلٰی مَغْفِرَةٍ مِّنْ رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمٰوٰتُ وَالْاَرْضُ اُعِدَّتْ لِلْمُتَّقِیْنَ",
    "الَّذِیْنَ یُنْفِقُوْنَ فِی السَّرَّآءِ وَالضَّرَّآءِ وَالْكٰظِمِیْنَ الْغَیْظَ وَالْعَافِیْنَ عَنِ النَّاسِ وَاللّٰهُ یُحِبُّ الْمُحْسِنِیْنَ",
    "وَالَّذِیْنَ اِذَا فَعَلُوْا فَاحِشَةً اَوْ ظَلَمُوْۤا اَنْفُسَهُمْ ذَكَرُوا اللّٰهَ فَاسْتَغْفَرُوْا لِذُنُوْبِهِمْ۫ وَمَنْ یَّغْفِرُ الذُّنُوْبَ اِلَّا اللّٰهُ ۫ وَلَمْ یُصِرُّوْا عَلٰی مَا فَعَلُوْا وَهُمْ یَعْلَمُوْنَ",
    "اُولٰٓىِٕكَ جَزَآؤُهُمْ مَّغْفِرَةٌ مِّنْ رَّبِّهِمْ وَجَنّٰتٌ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِیْنَ فِیْهَا وَنِعْمَ اَجْرُ الْعٰمِلِیْنَ",
    "قَدْ خَلَتْ مِنْ قَبْلِكُمْ سُنَنٌ فَسِیْرُوْا فِی الْاَرْضِ فَانْظُرُوْا كَیْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِیْنَ",
    "هٰذَا بَیَانٌ لِّلنَّاسِ وَهُدًی وَّمَوْعِظَةٌ لِّلْمُتَّقِیْنَ",
    "وَلَا تَهِنُوْا وَلَا تَحْزَنُوْا وَاَنْتُمُ الْاَعْلَوْنَ اِنْ كُنْتُمْ مُّؤْمِنِیْنَ",
    "اِنْ یَّمْسَسْكُمْ قَرْحٌ فَقَدْ مَسَّ الْقَوْمَ قَرْحٌ مِّثْلُهٗ وَتِلْكَ الْاَیَّامُ نُدَاوِلُهَا بَیْنَ النَّاسِ وَلِیَعْلَمَ اللّٰهُ الَّذِیْنَ اٰمَنُوْا وَیَتَّخِذَ مِنْكُمْ شُهَدَآءَ وَاللّٰهُ لَا یُحِبُّ الظّٰلِمِیْنَ",
    "وَلِیُمَحِّصَ اللّٰهُ الَّذِیْنَ اٰمَنُوْا وَیَمْحَقَ الْكٰفِرِیْنَ",
    "اَمْ حَسِبْتُمْ اَنْ تَدْخُلُوا الْجَنَّةَ وَلَمَّا یَعْلَمِ اللّٰهُ الَّذِیْنَ جٰهَدُوْا مِنْكُمْ وَیَعْلَمَ الصّٰبِرِیْنَ",
    "وَلَقَدْ كُنْتُمْ تَمَنَّوْنَ الْمَوْتَ مِنْ قَبْلِ اَنْ تَلْقَوْهُ فَقَدْ رَاَیْتُمُوْهُ وَاَنْتُمْ تَنْظُرُوْنَ",
    "وَمَا مُحَمَّدٌ اِلَّا رَسُوْلٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ اَفَاۡىِٕنْ مَّاتَ اَوْ قُتِلَ انْقَلَبْتُمْ عَلٰۤی اَعْقَابِكُمْ وَمَنْ یَّنْقَلِبْ عَلٰی عَقِبَیْهِ فَلَنْ یَّضُرَّ اللّٰهَ شَیْـًٔا وَسَیَجْزِی اللّٰهُ الشّٰكِرِیْنَ",
    "وَمَا كَانَ لِنَفْسٍ اَنْ تَمُوْتَ اِلَّا بِاِذْنِ اللّٰهِ كِتٰبًا مُّؤَجَّلًا وَمَنْ یُّرِدْ ثَوَابَ الدُّنْیَا نُؤْتِهٖ مِنْهَا وَمَنْ یُّرِدْ ثَوَابَ الْاٰخِرَةِ نُؤْتِهٖ مِنْهَا وَسَنَجْزِی الشّٰكِرِیْنَ",
    "وَكَاَیِّنْ مِّنْ نَّبِیٍّ قٰتَلَ مَعَهٗ رِبِّیُّوْنَ كَثِیْرٌ فَمَا وَهَنُوْا لِمَاۤ اَصَابَهُمْ فِیْ سَبِیْلِ اللّٰهِ وَمَا ضَعُفُوْا وَمَا اسْتَكَانُوْا وَاللّٰهُ یُحِبُّ الصّٰبِرِیْنَ",
    "وَمَا كَانَ قَوْلَهُمْ اِلَّاۤ اَنْ قَالُوْا رَبَّنَا اغْفِرْ لَنَا ذُنُوْبَنَا وَاِسْرَافَنَا فِیْۤ اَمْرِنَا وَثَبِّتْ اَقْدَامَنَا وَانْصُرْنَا عَلَی الْقَوْمِ الْكٰفِرِیْنَ",
    "فَاٰتٰىهُمُ اللّٰهُ ثَوَابَ الدُّنْیَا وَحُسْنَ ثَوَابِ الْاٰخِرَةِ وَاللّٰهُ یُحِبُّ الْمُحْسِنِیْنَ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْۤا اِنْ تُطِیْعُوا الَّذِیْنَ كَفَرُوْا یَرُدُّوْكُمْ عَلٰۤی اَعْقَابِكُمْ فَتَنْقَلِبُوْا خٰسِرِیْنَ",
    "بَلِ اللّٰهُ مَوْلٰىكُمْ وَهُوَ خَیْرُ النّٰصِرِیْنَ",
    "سَنُلْقِیْ فِیْ قُلُوْبِ الَّذِیْنَ كَفَرُوا الرُّعْبَ بِمَاۤ اَشْرَكُوْا بِاللّٰهِ مَا لَمْ یُنَزِّلْ بِهٖ سُلْطٰنًا وَمَاْوٰىهُمُ النَّارُ وَبِئْسَ مَثْوَی الظّٰلِمِیْنَ",
    "وَلَقَدْ صَدَقَكُمُ اللّٰهُ وَعْدَهٗۤ اِذْ تَحُسُّوْنَهُمْ بِاِذْنِهٖ حَتّٰۤی اِذَا فَشِلْتُمْ وَتَنَازَعْتُمْ فِی الْاَمْرِ وَعَصَیْتُمْ مِّنْ بَعْدِ مَاۤ اَرٰىكُمْ مَّا تُحِبُّوْنَ مِنْكُمْ مَّنْ یُّرِیْدُ الدُّنْیَا وَمِنْكُمْ مَّنْ یُّرِیْدُ الْاٰخِرَةَ ثُمَّ صَرَفَكُمْ عَنْهُمْ لِیَبْتَلِیَكُمْ وَلَقَدْ عَفَا عَنْكُمْ وَاللّٰهُ ذُوْ فَضْلٍ عَلَی الْمُؤْمِنِیْنَ",
    "اِذْ تُصْعِدُوْنَ وَلَا تَلْوٗنَ عَلٰۤی اَحَدٍ وَّالرَّسُوْلُ یَدْعُوْكُمْ فِیْۤ اُخْرٰىكُمْ فَاَثَابَكُمْ غَمًّا بِغَمٍّ لِّكَیْلَا تَحْزَنُوْا عَلٰی مَا فَاتَكُمْ وَلَا مَاۤ اَصَابَكُمْ وَاللّٰهُ خَبِیْرٌ بِمَا تَعْمَلُوْنَ",
    "ثُمَّ اَنْزَلَ عَلَیْكُمْ مِّنْ بَعْدِ الْغَمِّ اَمَنَةً نُّعَاسًا یَّغْشٰی طَآىِٕفَةً مِّنْكُمْ وَطَآىِٕفَةٌ قَدْ اَهَمَّتْهُمْ اَنْفُسُهُمْ یَظُنُّوْنَ بِاللّٰهِ غَیْرَ الْحَقِّ ظَنَّ الْجَاهِلِیَّةِ یَقُوْلُوْنَ هَلْ لَّنَا مِنَ الْاَمْرِ مِنْ شَیْءٍ قُلْ اِنَّ الْاَمْرَ كُلَّهٗ لِلّٰهِ یُخْفُوْنَ فِیْۤ اَنْفُسِهِمْ مَّا لَا یُبْدُوْنَ لَكَ یَقُوْلُوْنَ لَوْ كَانَ لَنَا مِنَ الْاَمْرِ شَیْءٌ مَّا قُتِلْنَا هٰهُنَا قُلْ لَّوْ كُنْتُمْ فِیْ بُیُوْتِكُمْ لَبَرَزَ الَّذِیْنَ كُتِبَ عَلَیْهِمُ الْقَتْلُ اِلٰی مَضَاجِعِهِمْ وَلِیَبْتَلِیَ اللّٰهُ مَا فِیْ صُدُوْرِكُمْ وَلِیُمَحِّصَ مَا فِیْ قُلُوْبِكُمْ وَاللّٰهُ عَلِیْمٌۢ بِذَاتِ الصُّدُوْرِ",
    "اِنَّ الَّذِیْنَ تَوَلَّوْا مِنْكُمْ یَوْمَ الْتَقَی الْجَمْعٰنِ اِنَّمَا اسْتَزَلَّهُمُ الشَّیْطٰنُ بِبَعْضِ مَا كَسَبُوْا وَلَقَدْ عَفَا اللّٰهُ عَنْهُمْ اِنَّ اللّٰهَ غَفُوْرٌ حَلِیْمٌ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا تَكُوْنُوْا كَالَّذِیْنَ كَفَرُوْا وَقَالُوْا لِاِخْوَانِهِمْ اِذَا ضَرَبُوْا فِی الْاَرْضِ اَوْ كَانُوْا غُزًّی لَّوْ كَانُوْا عِنْدَنَا مَا مَاتُوْا وَمَا قُتِلُوْا لِیَجْعَلَ اللّٰهُ ذٰلِكَ حَسْرَةً فِیْ قُلُوْبِهِمْ وَاللّٰهُ یُحْیٖ وَیُمِیْتُ وَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِیْرٌ",
    "وَلَىِٕنْ قُتِلْتُمْ فِیْ سَبِیْلِ اللّٰهِ اَوْ مُتُّمْ لَمَغْفِرَةٌ مِّنَ اللّٰهِ وَرَحْمَةٌ خَیْرٌ مِّمَّا یَجْمَعُوْنَ",
    "وَلَىِٕنْ مُّتُّمْ اَوْ قُتِلْتُمْ لَاۡاِلَی اللّٰهِ تُحْشَرُوْنَ",
    "فَبِمَا رَحْمَةٍ مِّنَ اللّٰهِ لِنْتَ لَهُمْ وَلَوْ كُنْتَ فَظًّا غَلِیْظَ الْقَلْبِ لَانْفَضُّوْا مِنْ حَوْلِكَ فَاعْفُ عَنْهُمْ وَاسْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِی الْاَمْرِ فَاِذَا عَزَمْتَ فَتَوَكَّلْ عَلَی اللّٰهِ اِنَّ اللّٰهَ یُحِبُّ الْمُتَوَكِّلِیْنَ",
    "اِنْ یَّنْصُرْكُمُ اللّٰهُ فَلَا غَالِبَ لَكُمْ وَاِنْ یَّخْذُلْكُمْ فَمَنْ ذَا الَّذِیْ یَنْصُرُكُمْ مِّنْ بَعْدِهٖ وَعَلَی اللّٰهِ فَلْیَتَوَكَّلِ الْمُؤْمِنُوْنَ",
    "وَمَا كَانَ لِنَبِیٍّ اَنْ یَّغُلَّ وَمَنْ یَّغْلُلْ یَاْتِ بِمَا غَلَّ یَوْمَ الْقِیٰمَةِ ثُمَّ تُوَفّٰی كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا یُظْلَمُوْنَ",
    "اَفَمَنِ اتَّبَعَ رِضْوَانَ اللّٰهِ كَمَنْ بَآءَ بِسَخَطٍ مِّنَ اللّٰهِ وَمَاْوٰىهُ جَهَنَّمُ وَبِئْسَ الْمَصِیْرُ",
    "هُمْ دَرَجٰتٌ عِنْدَ اللّٰهِ وَاللّٰهُ بَصِیْرٌ بِمَا یَعْمَلُوْنَ",
    "لَقَدْ مَنَّ اللّٰهُ عَلَی الْمُؤْمِنِیْنَ اِذْ بَعَثَ فِیْهِمْ رَسُوْلًا مِّنْ اَنْفُسِهِمْ یَتْلُوْا عَلَیْهِمْ اٰیٰتِهٖ وَیُزَكِّیْهِمْ وَیُعَلِّمُهُمُ الْكِتٰبَ وَالْحِكْمَةَ وَاِنْ كَانُوْا مِنْ قَبْلُ لَفِیْ ضَلٰلٍ مُّبِیْنٍ",
    "اَوَلَمَّاۤ اَصَابَتْكُمْ مُّصِیْبَةٌ قَدْ اَصَبْتُمْ مِّثْلَیْهَا قُلْتُمْ اَنّٰی هٰذَا قُلْ هُوَ مِنْ عِنْدِ اَنْفُسِكُمْ اِنَّ اللّٰهَ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "وَمَاۤ اَصَابَكُمْ یَوْمَ الْتَقَی الْجَمْعٰنِ فَبِاِذْنِ اللّٰهِ وَلِیَعْلَمَ الْمُؤْمِنِیْنَ",
    "وَلِیَعْلَمَ الَّذِیْنَ نَافَقُوْا وَقِیْلَ لَهُمْ تَعَالَوْا قَاتِلُوْا فِیْ سَبِیْلِ اللّٰهِ اَوِ ادْفَعُوْا قَالُوْا لَوْ نَعْلَمُ قِتَالًا لَّاتَّبَعْنٰكُمْ هُمْ لِلْكُفْرِ یَوْمَىِٕذٍ اَقْرَبُ مِنْهُمْ لِلْاِیْمَانِ یَقُوْلُوْنَ بِاَفْوَاهِهِمْ مَّا لَیْسَ فِیْ قُلُوْبِهِمْ وَاللّٰهُ اَعْلَمُ بِمَا یَكْتُمُوْنَ",
    "اَلَّذِیْنَ قَالُوْا لِاِخْوَانِهِمْ وَقَعَدُوْا لَوْ اَطَاعُوْنَا مَا قُتِلُوْا قُلْ فَادْرَءُوْا عَنْ اَنْفُسِكُمُ الْمَوْتَ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "وَلَا تَحْسَبَنَّ الَّذِیْنَ قُتِلُوْا فِیْ سَبِیْلِ اللّٰهِ اَمْوَاتًا بَلْ اَحْیَآءٌ عِنْدَ رَبِّهِمْ یُرْزَقُوْنَ",
    "فَرِحِیْنَ بِمَاۤ اٰتٰىهُمُ اللّٰهُ مِنْ فَضْلِهٖ وَیَسْتَبْشِرُوْنَ بِالَّذِیْنَ لَمْ یَلْحَقُوْا بِهِمْ مِّنْ خَلْفِهِمْ اَلَّا خَوْفٌ عَلَیْهِمْ وَلَا هُمْ یَحْزَنُوْنَ",
    "یَسْتَبْشِرُوْنَ بِنِعْمَةٍ مِّنَ اللّٰهِ وَفَضْلٍ وَّاَنَّ اللّٰهَ لَا یُضِیْعُ اَجْرَ الْمُؤْمِنِیْنَ",
    "اَلَّذِیْنَ اسْتَجَابُوْا لِلّٰهِ وَالرَّسُوْلِ مِنْ بَعْدِ مَاۤ اَصَابَهُمُ الْقَرْحُ لِلَّذِیْنَ اَحْسَنُوْا مِنْهُمْ وَاتَّقَوْا اَجْرٌ عَظِیْمٌ",
    "اَلَّذِیْنَ قَالَ لَهُمُ النَّاسُ اِنَّ النَّاسَ قَدْ جَمَعُوْا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ اِیْمَانًا ۖ وَّقَالُوْا حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِیْلُ",
    "فَانْقَلَبُوْا بِنِعْمَةٍ مِّنَ اللّٰهِ وَفَضْلٍ لَّمْ یَمْسَسْهُمْ سُوْٓءٌ وَّاتَّبَعُوْا رِضْوَانَ اللّٰهِ وَاللّٰهُ ذُوْ فَضْلٍ عَظِیْمٍ",
    "اِنَّمَا ذٰلِكُمُ الشَّیْطٰنُ یُخَوِّفُ اَوْلِیَآءَهٗ فَلَا تَخَافُوْهُمْ وَخَافُوْنِ اِنْ كُنْتُمْ مُّؤْمِنِیْنَ",
    "وَلَا یَحْزُنْكَ الَّذِیْنَ یُسَارِعُوْنَ فِی الْكُفْرِ اِنَّهُمْ لَنْ یَّضُرُّوا اللّٰهَ شَیْـًٔا یُرِیْدُ اللّٰهُ اَلَّا یَجْعَلَ لَهُمْ حَظًّا فِی الْاٰخِرَةِ وَلَهُمْ عَذَابٌ عَظِیْمٌ",
    "اِنَّ الَّذِیْنَ اشْتَرَوُا الْكُفْرَ بِالْاِیْمَانِ لَنْ یَّضُرُّوا اللّٰهَ شَیْـًٔا وَلَهُمْ عَذَابٌ اَلِیْمٌ",
    "وَلَا یَحْسَبَنَّ الَّذِیْنَ كَفَرُوْۤا اَنَّمَا نُمْلِیْ لَهُمْ خَیْرٌ لِّاَنْفُسِهِمْ اِنَّمَا نُمْلِیْ لَهُمْ لِیَزْدَادُوْۤا اِثْمًا وَلَهُمْ عَذَابٌ مُّهِیْنٌ",
    "مَا كَانَ اللّٰهُ لِیَذَرَ الْمُؤْمِنِیْنَ عَلٰی مَاۤ اَنْتُمْ عَلَیْهِ حَتّٰی یَمِیْزَ الْخَبِیْثَ مِنَ الطَّیِّبِ وَمَا كَانَ اللّٰهُ لِیُطْلِعَكُمْ عَلَی الْغَیْبِ وَلٰكِنَّ اللّٰهَ یَجْتَبِیْ مِنْ رُّسُلِهٖ مَنْ یَّشَآءُ فَاٰمِنُوْا بِاللّٰهِ وَرُسُلِهٖ وَاِنْ تُؤْمِنُوْا وَتَتَّقُوْا فَلَكُمْ اَجْرٌ عَظِیْمٌ",
    "وَلَا یَحْسَبَنَّ الَّذِیْنَ یَبْخَلُوْنَ بِمَاۤ اٰتٰىهُمُ اللّٰهُ مِنْ فَضْلِهٖ هُوَ خَیْرًا لَّهُمْ بَلْ هُوَ شَرٌّ لَّهُمْ سَیُطَوَّقُوْنَ مَا بَخِلُوْا بِهٖ یَوْمَ الْقِیٰمَةِ وَلِلّٰهِ مِیْرَاثُ السَّمٰوٰتِ وَالْاَرْضِ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِیْرٌ",
    "لَقَدْ سَمِعَ اللّٰهُ قَوْلَ الَّذِیْنَ قَالُوْۤا اِنَّ اللّٰهَ فَقِیْرٌ وَّنَحْنُ اَغْنِیَآءُ سَنَكْتُبُ مَا قَالُوْا وَقَتْلَهُمُ الْاَنْۢبِیَآءَ بِغَیْرِ حَقٍّ وَّنَقُوْلُ ذُوْقُوْا عَذَابَ الْحَرِیْقِ",
    "ذٰلِكَ بِمَا قَدَّمَتْ اَیْدِیْكُمْ وَاَنَّ اللّٰهَ لَیْسَ بِظَلَّامٍ لِّلْعَبِیْدِ",
    "اَلَّذِیْنَ قَالُوْۤا اِنَّ اللّٰهَ عَهِدَ اِلَیْنَاۤ اَلَّا نُؤْمِنَ لِرَسُوْلٍ حَتّٰی یَاْتِیَنَا بِقُرْبَانٍ تَاْكُلُهُ النَّارُ قُلْ قَدْ جَآءَكُمْ رُسُلٌ مِّنْ قَبْلِیْ بِالْبَیِّنٰتِ وَبِالَّذِیْ قُلْتُمْ فَلِمَ قَتَلْتُمُوْهُمْ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "فَاِنْ كَذَّبُوْكَ فَقَدْ كُذِّبَ رُسُلٌ مِّنْ قَبْلِكَ جَآءُوْ بِالْبَیِّنٰتِ وَالزُّبُرِ وَالْكِتٰبِ الْمُنِیْرِ",
    "كُلُّ نَفْسٍ ذَآىِٕقَةُ الْمَوْتِ وَاِنَّمَا تُوَفَّوْنَ اُجُوْرَكُمْ یَوْمَ الْقِیٰمَةِ فَمَنْ زُحْزِحَ عَنِ النَّارِ وَاُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ وَمَا الْحَیٰوةُ الدُّنْیَاۤ اِلَّا مَتَاعُ الْغُرُوْرِ",
    "لَتُبْلَوُنَّ فِیْۤ اَمْوَالِكُمْ وَاَنْفُسِكُمْ ۫ وَلَتَسْمَعُنَّ مِنَ الَّذِیْنَ اُوْتُوا الْكِتٰبَ مِنْ قَبْلِكُمْ وَمِنَ الَّذِیْنَ اَشْرَكُوْۤا اَذًی كَثِیْرًا وَاِنْ تَصْبِرُوْا وَتَتَّقُوْا فَاِنَّ ذٰلِكَ مِنْ عَزْمِ الْاُمُوْرِ",
    "وَاِذْ اَخَذَ اللّٰهُ مِیْثَاقَ الَّذِیْنَ اُوْتُوا الْكِتٰبَ لَتُبَیِّنُنَّهٗ لِلنَّاسِ وَلَا تَكْتُمُوْنَهٗ فَنَبَذُوْهُ وَرَآءَ ظُهُوْرِهِمْ وَاشْتَرَوْا بِهٖ ثَمَنًا قَلِیْلًا فَبِئْسَ مَا یَشْتَرُوْنَ",
    "لَا تَحْسَبَنَّ الَّذِیْنَ یَفْرَحُوْنَ بِمَاۤ اَتَوْا وَّیُحِبُّوْنَ اَنْ یُّحْمَدُوْا بِمَا لَمْ یَفْعَلُوْا فَلَا تَحْسَبَنَّهُمْ بِمَفَازَةٍ مِّنَ الْعَذَابِ وَلَهُمْ عَذَابٌ اَلِیْمٌ",
    "وَلِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَاللّٰهُ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ",
    "اِنَّ فِیْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِ وَاخْتِلَافِ الَّیْلِ وَالنَّهَارِ لَاٰیٰتٍ لِّاُولِی الْاَلْبَابِ ۖ",
    "الَّذِیْنَ یَذْكُرُوْنَ اللّٰهَ قِیٰمًا وَّقُعُوْدًا وَّعَلٰی جُنُوْبِهِمْ وَیَتَفَكَّرُوْنَ فِیْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِ رَبَّنَا مَا خَلَقْتَ هٰذَا بَاطِلًا سُبْحٰنَكَ فَقِنَا عَذَابَ النَّارِ",
    "رَبَّنَاۤ اِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ اَخْزَیْتَهٗ وَمَا لِلظّٰلِمِیْنَ مِنْ اَنْصَارٍ",
    "رَبَّنَاۤ اِنَّنَا سَمِعْنَا مُنَادِیًا یُّنَادِیْ لِلْاِیْمَانِ اَنْ اٰمِنُوْا بِرَبِّكُمْ فَاٰمَنَّا ۖ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَكَفِّرْ عَنَّا سَیِّاٰتِنَا وَتَوَفَّنَا مَعَ الْاَبْرَارِ",
    "رَبَّنَا وَاٰتِنَا مَا وَعَدْتَّنَا عَلٰی رُسُلِكَ وَلَا تُخْزِنَا یَوْمَ الْقِیٰمَةِ اِنَّكَ لَا تُخْلِفُ الْمِیْعَادَ",
    "فَاسْتَجَابَ لَهُمْ رَبُّهُمْ اَنِّیْ لَاۤ اُضِیْعُ عَمَلَ عَامِلٍ مِّنْكُمْ مِّنْ ذَكَرٍ اَوْ اُ بَعْضُكُمْ مِّنْ بَعْضٍ فَالَّذِیْنَ هَاجَرُوْا وَاُخْرِجُوْا مِنْ دِیَارِهِمْ وَاُوْذُوْا فِیْ سَبِیْلِیْ وَقٰتَلُوْا وَقُتِلُوْا لَاُكَفِّرَنَّ عَنْهُمْ سَیِّاٰتِهِمْ وَلَاُدْخِلَنَّهُمْ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ ثَوَابًا مِّنْ عِنْدِ اللّٰهِ وَاللّٰهُ عِنْدَهٗ حُسْنُ الثَّوَابِ",
    "لَا یَغُرَّنَّكَ تَقَلُّبُ الَّذِیْنَ كَفَرُوْا فِی الْبِلَادِ",
    "مَتَاعٌ قَلِیْلٌ ۫ ثُمَّ مَاْوٰىهُمْ جَهَنَّمُ وَبِئْسَ الْمِهَادُ",
    "لٰكِنِ الَّذِیْنَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنّٰتٌ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِیْنَ فِیْهَا نُزُلًا مِّنْ عِنْدِ اللّٰهِ وَمَا عِنْدَ اللّٰهِ خَیْرٌ لِّلْاَبْرَارِ",
    "وَاِنَّ مِنْ اَهْلِ الْكِتٰبِ لَمَنْ یُّؤْمِنُ بِاللّٰهِ وَمَاۤ اُنْزِلَ اِلَیْكُمْ وَمَاۤ اُنْزِلَ اِلَیْهِمْ خٰشِعِیْنَ لِلّٰهِ لَا یَشْتَرُوْنَ بِاٰیٰتِ اللّٰهِ ثَمَنًا قَلِیْلًا اُولٰٓىِٕكَ لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ اِنَّ اللّٰهَ سَرِیْعُ الْحِسَابِ",
    "یٰۤاَیُّهَا الَّذِیْنَ اٰمَنُوا اصْبِرُوْا وَصَابِرُوْا وَرَابِطُوْا ۫ وَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُفْلِحُوْنَ"
  ],
  "bengali": [
    "আলিফ-লাম-মীম।",
    "আল্লাহ, তিনি ছাড়া কোন ইলাহ নেই, তিনি চিরঞ্জীব, চিরপ্রতিষ্ঠিত ধারক।",
    "তিনি তোমার উপর কিতাব নাযিল করেছেন যথাযথভাবে, এর পূর্বে যা এসেছে তার সত্যায়নকারী হিসেবে এবং নাযিল করেছেন তাওরাত ও ইনজীল।",
    "ইতঃপূর্বে মানুষের জন্য হিদায়াতস্বরূপ। আর তিনি ফুরকান নাযিল করেছেন। নিশ্চয় যারা অস্বীকার করে আল্লাহর আয়াতসমূহ, তাদের জন্যই রয়েছে কঠিন আযাব। আর আল্লাহ পরাক্রমশালী, প্রতিশোধগ্রহণকারী।",
    "নিশ্চয় আল্লাহ, তাঁর নিকট গোপন থাকে না কোন কিছু যমীনে এবং না আসমানে ।",
    "তিনিই মাতৃগর্ভে তোমাদেরকে আকৃতি দান করেন যেভাবে তিনি চান। তিনি ছাড়া কোন (সত্য) ইলাহ নেই; তিনি পরাক্রমশালী, প্রজ্ঞাময়।",
    "তিনিই তোমার উপর কিতাব নাযিল করেছেন, তার মধ্যে আছে মুহকাম আয়াতসমূহ। সেগুলো কিতাবের মূল, আর অন্যগুলো মুতাশাবিহ্। ফলে যাদের অন্তরে রয়েছে সত্যবিমুখ প্রবণতা, তারা ফিতনার উদ্দেশ্যে এবং ভুল ব্যাখ্যার অনুসন্ধানে মুতাশাবিহ্ আয়াতগুলোর পেছনে লেগে থাকে। অথচ আল্লাহ ছাড়া কেউ এর ব্যাখ্যা জানে না। আর যারা জ্ঞানে পরিপক্ক, তারা বলে, আমরা এগুলোর প্রতি ঈমান আনলাম, সবগুলো আমাদের রবের পক্ষ থেকে। আর বিবেক সম্পন্নরাই উপদেশ গ্রহণ করে।",
    "হে আমাদের রব, আপনি হিদায়াত দেয়ার পর আমাদের অন্তরসমূহ বক্র করবেন না এবং আপনার পক্ষ থেকে আমাদেরকে রহমত দান করুন। নিশ্চয় আপনি মহাদাতা।",
    "হে আমাদের রব, নিশ্চয় আপনি মানুষকে সমবেত করবেন এমন একদিন, যাতে কোন সন্দেহ নেই। নিশ্চয় আল্লাহ প্রতিশ্রুতি ভঙ্গ করেন না।",
    "নিশ্চয় যারা কুফরী করে, তাদের মাল-সম্পদ ও সন্তান-সন্ততি আল্লাহর আযাব থেকে কখনও কোন কাজে আসবে না এবং তারাই আগুনের জ্বালানি।",
    "ফির‘আউন সম্প্রদায় ও তাদের পূর্বের লোকদের স্বভাবের ন্যায়, তারা আমার আয়াতসমূহ অস্বীকার করেছে। ফলে তাদের পাপের কারণে আল্লাহ তাদরেকে পাকড়াও করেছেন। আর আল্লাহ শাস্তি দানে কঠোর।",
    "তুমি কাফিরদেরকে বল, ‘তোমরা অচিরেই পরাজিত হবে এবং তোমাদেরকে জাহান্নামের দিকে সমবেত করা হবে। আর সেটি কতইনা নিকৃষ্ট আবাসস্থল’!",
    "নিশ্চয় তোমাদের জন্য নিদর্শন রয়েছে দু’টি দলের মধ্যে, যারা পরস্পর মুখোমুখি হয়েছিল। একটি দল লড়াই করছিল আল্লাহর পথে এবং অপর দলটি কাফির। তারা বাহ্যিক দৃষ্টিতে তাদেরকে ওদের দ্বিগুণ দেখছিল। আর আল্লাহ নিজ সাহায্য দ্বারা যাকে চান শক্তিশালী করেন। নিশ্চয় এতে রয়েছে চক্ষুষ্মানদের জন্য শিক্ষা।",
    "মানুষের জন্য সুশোভিত করা হয়েছে প্রবৃত্তির ভালবাসা- নারী, সন্তানাদি, রাশি রাশি সোনা-রূপা, চি‎‎হ্নত ঘোড়া, গবাদি পশু ও শস্যক্ষেত। এগুলো দুনিয়ার জীবনের ভোগসামগ্রী। আর আল্লাহ, তাঁর নিকট রয়েছে উত্তম প্রত্যাবর্তনস্থল।",
    "বল, ‘আমি কি তোমাদেরকে এর চেয়েও উত্তম বস্তুর সংবাদ দেব? যারা তাকওয়া অর্জন করে, তাদের জন্য রয়েছে তাদের রবের নিকট জান্নাত, যার তলদেশ দিয়ে প্রবাহিত হয় নহরসমূহ। সেখানে তারা স্থায়ী হবে। আর পবিত্র স্ত্রীগণ ও আল্লাহর পক্ষ থেকে সন্তুষ্টি’। আর আল্লাহ বান্দাদের সম্পর্কে সম্যক দ্রষ্টা।",
    "যারা বলে, ‘হে আমাদের রব, নিশ্চয় আমরা ঈমান আনলাম। অতএব, আমাদের পাপসমূহ ক্ষমা করুন এবং আমাদেরকে আগুনের আযাব থেকে রক্ষা করুন’।",
    "যারা ধৈর্যশীল, সত্যবাদী, আনুগত্যশীল ও ব্যয়কারী এবং শেষ রাতে ক্ষমাপ্রার্থনাকারী।",
    "আল্লাহ সাক্ষ্য দেন যে, তিনি ছাড়া কোন (সত্য) ইলাহ নেই, আর ফেরেশতা ও জ্ঞানীগণও। তিনি ন্যায় দ্বারা প্রতিষ্ঠিত। তিনি ছাড়া কোন (সত্য) ইলাহ নেই। তিনি পরাক্রমশালী, প্রজ্ঞাময়।",
    "নিশ্চয় আল্লাহর নিকট দীন হচ্ছে ইসলাম। আর যাদেরকে কিতাব দেয়া হয়েছে, তাদের নিকট জ্ঞান আসার পরই তারা মতানৈক্য করেছে, পরস্পর বিদ্বেষবশত। আর যে ব্যক্তি আল্লাহর আয়াতসমূহের সাথে কুফরী করে, নিশ্চয় আল্লাহ হিসাব গ্রহণে দ্রুত।",
    "যদি তারা তোমার সাথে বিতর্ক করে, তবে তুমি বল, ‘আমি আল্লাহর নিকট আত্মসমর্পণ করলাম এবং আমার অনুসারীরাও’। আর যাদেরকে কিতাব দেয়া হয়েছে তাদেরকে এবং নিরক্ষরদেরকে বল, ‘তোমরা কি ইসলাম গ্রহণ করেছ’? তখন যদি তারা ইসলাম গ্রহণ করে, তাহলে তারা অবশ্যই হিদায়াতপ্রাপ্ত হবে। আর যদি ফিরে যায়, তাহলে তোমার দায়িত্ব শুধু পৌঁছিয়ে দেয়া। আর আল্লাহ বান্দাদের সম্পর্কে সম্যক দ্রষ্টা।",
    "নিশ্চয় যারা আল্লাহর আয়াতসমূহের সাথে কুফরী করে এবং অন্যায়ভাবে নবীদেরকে হত্যা করে, আর মানুষের মধ্য থেকে যারা ন্যায়-পরায়ণতার নির্দেশ দেয় তাদেরকে হত্যা করে, তুমি তাদেরকে যন্ত্রণাদায়ক আযাবের সুসংবাদ দাও।",
    "ওরাই, যাদের আমলসমূহ দুনিয়া ও আখিরাতে নিষ্ফল হয়েছে এবং তাদের কোন সাহায্যকারী নেই।",
    "তুমি কি তাদের প্রতি লক্ষ্য করনি? যাদেরকে কিতাবের অংশবিশেষ দেয়া হয়েছে, তাদেরকে আল্লাহর কিতাবের দিকে আহবান করা হচ্ছে, যাতে তা তাদের মধ্যে মীমাংসা করে। অতঃপর তাদের একদল ফিরে যাচ্ছে বিমুখ হয়ে।",
    "এর কারণ হল, তারা বলে, ‘গুটি কয়েকদিন ছাড়া আগুন আমাদেরকে কখনই স্পর্শ করবে না’। আর তারা যা মিথ্যা রচনা করত, তা তাদেরকে তাদের দীনের ব্যাপারে প্রতারিত করেছে।",
    "সুতরাং কী অবস্থা হবে? যখন আমি তাদেরকে এমন দিনে সমবেত করব, যাতে কোন সন্দেহ নেই। আর প্রত্যেককে তার কৃতকর্মের প্রতিদান পূর্ণভাবে দেয়া হবে এবং তাদেরকে যুলম করা হবে না।",
    "বল, ‘হে আল্লাহ, রাজত্বের মালিক, আপনি যাকে চান রাজত্ব দান করেন, আর যার থেকে চান রাজত্ব কেড়ে নেন এবং আপনি যাকে চান সম্মান দান করেন। আর যাকে চান অপমানিত করেন, আপনার হাতেই কল্যাণ। নিশ্চয় আপনি সব কিছুর উপর ক্ষমতাবান’।",
    "‘আপনি রাতকে দিনের মধ্যে প্রবেশ করান এবং দিনকে রাতের মধ্যে প্রবেশ করান। আর মৃত থেকে জীবিতকে বের করেন এবং জীবিত থেকে মৃতকে বের করেন। আর যাকে চান বিনা হিসাবে রিয্ক দান করেন’।",
    "মুমিনরা যেন মুমিনদের ছাড়া কাফিরদেরকে বন্ধু না বানায়। আর যে কেউ এরূপ করবে, আল্লাহর সাথে তার কোন সম্পর্ক নেই। তবে যদি তাদের পক্ষ থেকে তোমাদের কোন ভয়ের আশঙ্কা থাকে। আর আল্লাহ তোমাদেরকে তাঁর নিজের ব্যাপারে সতর্ক করছেন এবং আল্লাহর নিকটই প্রত্যাবর্তন।",
    "বল, ‘তোমরা যদি তোমাদের অন্তরসমূহে যা আছে তা গোপন কর অথবা প্রকাশ কর, আল্লাহ তা জানেন। আর আসমানসমূহে যা কিছু আছে ও যমীনে যা আছে, তাও তিনি জানেন। আল্লাহ সব কিছুর উপর ক্ষমতাবান’।",
    "যেদিন প্রত্যেকে উপস্থিত পাবে যে ভাল আমল সে করেছে এবং যে মন্দ আমল সে করেছে তা। তখন সে কামনা করবে, যদি মন্দ কাজ ও তার মধ্যে বহুদূর ব্যবধান হত! আর আল্লাহ তোমাদেরকে তার নিজের ব্যাপারে সাবধান করছেন এবং আল্লাহ বান্দাদের প্রতি অত্যন্ত স্নেহশীল।",
    "বল, ‘যদি তোমরা আল্লাহকে ভালবাস, তাহলে আমার অনুসরণ কর, আল্লাহ তোমাদেরকে ভালবাসবেন এবং তোমাদের পাপসমূহ ক্ষমা করে দেবেন। আর আল্লাহ অত্যন্ত ক্ষমাশীল, পরম দয়ালু’।",
    "বল, ‘তোমরা আল্লাহ ও তাঁর রাসূলের আনুগত্য কর’। তারপর যদি তারা মুখ ফিরিয়ে নেয়, তবে নিশ্চয়ই আল্লাহ কাফিরদেরকে ভালবাসেন না।",
    "নিশ্চয়ই আল্লাহ আদম, নূহ ও ইবরাহীমের পরিবারকে এবং ইমরানের পরিবারকে সৃষ্টিজগতের উপর মনোনীত করেছেন।",
    "তারা একে অপরের বংশধর। আর আল্লাহ সর্বশ্রোতা, সর্বজ্ঞ।",
    "যখন ইমরানের স্ত্রী বলেছিল, ‘হে আমার রব, আমার গর্ভে যা আছে, নিশ্চয় আমি তা খালেসভাবে আপনার জন্য মানত করলাম। অতএব, আপনি আমার পক্ষ থেকে তা কবুল করুন। নিশ্চয় আপনি শ্রবণকারী, সর্বজ্ঞ’।",
    "অতঃপর সে যখন তা প্রসব করল, বলল, ‘হে আমার রব, নিশ্চয় আমি তা প্রসব করেছি কন্যারূপে’। আর আল্লাহই ভাল জানেন সে যা প্রসব করেছে তা সম্পর্কে। ‘আর পুত্র সন্তান কন্যা সন্তানের মত নয় এবং নিশ্চয় আমি তার নাম রেখেছি মারইয়াম। আর নিশ্চয় আমি তাকে ও তার সন্তানদেরকে বিতাড়িত শয়তান থেকে আপনার আশ্রয় দিচ্ছি’।",
    "অতঃপর তার রব তাকে উত্তমভাবে কবুল করলেন এবং তাকে উত্তমভাবে গড়ে তুললেন। আর তাকে যাকারিয়্যার দায়িত্বে দিলেন। যখনই যাকারিয়্যা তার কাছে তার কক্ষে প্রবেশ করত, তখনই তার নিকট খাদ্যসামগ্রী পেত। সে বলত, ‘হে মারইয়াম, কোথা থেকে তোমার জন্য এটি’? সে বলত, ‘এটি আল্লাহর পক্ষ থেকে। নিশ্চয় আল্লাহ যাকে চান বিনা হিসাবে রিয্ক দান করেন’।",
    "সেখানে যাকারিয়্যা তার রবের কাছে প্রার্থনা করেছিল, সে বলল, ‘হে আমর রব, আমাকে আপনার পক্ষ থেকে উত্তম সন্তান দান করুন। নিশ্চয় আপনি প্রার্থনা শ্রবণকারী’।",
    "অতঃপর ফেরেশতারা তাকে ডেকে বলল, সে যখন কক্ষে দাঁড়িয়ে সালাত আদায় করছিল, ‘নিশ্চয় আল্লাহ তোমাকে ইয়াহইয়া সম্পর্কে সুসংবাদ দিচ্ছেন, যে হবে আল্লাহর পক্ষ থেকে বাণীর সত্যায়নকারী, নেতা ও নারী সম্ভোগমুক্ত এবং নেককারদের মধ্য থেকে একজন নবী’।",
    "সে বলল, ‘হে আমার রব, কীভাবে আমার পুত্র হবে? অথচ আমার তো বার্ধক্য এসে গিয়েছে, আর আমার স্ত্রী বন্ধা’। তিনি বললেন, ‘এভাবেই আল্লাহ যা ইচ্ছা তা করেন’।",
    "সে বলল, ‘হে আমার রব, আমাকে দেন একটি নিদর্শন’। তিনি বললেন, ‘তোমার নিদর্শন হল, তুমি তিন দিন পর্যন্ত মানুষের সাথে ইশারা ছাড়া কথা বলবে না। আর তোমার রবকে অধিক স্মরণ কর এবং সকাল-সন্ধ্যা তার তাসবীহ পাঠ কর’।",
    "আর স্মরণ কর, যখন ফেরেশতারা বলল, ‘হে মারইয়াম, নিশ্চয় আল্লাহ তোমাকে মনোনীত করেছেন ও পবিত্র করেছেন এবং নির্বাচিত করেছেন তোমাকে বিশ্বজগতের নারীদের উপর’ ।",
    "‘হে মারইয়াম, তোমার রবের জন্য অনুগত হও। আর সিজদা কর এবং রুকূকারীদের সাথে রুকূ কর’।",
    "এটি গায়েবের সংবাদসমূহের অন্তর্ভুক্ত, যা আমি তোমার প্রতি ওহী পাঠাচ্ছি। আর তুমি তাদের নিকট ছিলে না, যখন তারা তাদের কলম নিক্ষেপ করছিল, তাদের মধ্যে কে মারইয়ামের দায়িত্ব নেবে? আর তুমি তাদের নিকট ছিলে না, যখন তারা বিতর্ক করছিল ।",
    "স্মরণ কর, যখন ফেরেশতারা বলল, ‘হে মারইয়াম, নিশ্চয় আল্লাহ তোমাকে তাঁর পক্ষ থেকে একটি কালেমার সুসংবাদ দিচ্ছেন, যার নাম মসীহ ঈসা ইবনে মারইয়াম, যে দুনিয়া ও আখিরাতে সম্মানিত এবং নৈকট্যপ্রাপ্তদের অন্তর্ভুক্ত’।",
    "আর সে মানুষের সাথে কথা বলবে দোলনায় ও পরিণত বয়সে এবং সে নেককারদের অন্তর্ভুক্ত।",
    "মারইয়াম বলল, ‘হে আমার রব, কিভাবে আমার সন্তান হবে? অথচ কোন মানুষ আমাকে স্পর্শ করেনি’! আল্লাহ বললেন, ‘এভাবেই’ আল্লাহ যা চান সৃষ্টি করেন। তিনি যখন কোন বিষয়ের সিদ্ধান্ত নেন, তখন তাকে শুধু বলেন, ‘হও’। ফলে তা হয়ে যায়।",
    "‘আর তিনি তাকে কিতাব, হিকমাত, তাওরাত ও ইনজীল শিক্ষা দেবেন’।",
    "আর বনী ইসরাঈলদের রাসূল বানাবেন (সে বলবে) ‘নিশ্চয় আমি তোমাদের নিকট তোমাদের রবের পক্ষ থেকে নিদর্শন নিয়ে এসেছি যে, অবশ্যই আমি তোমাদের জন্য কাদামাটি দিয়ে পাখির আকৃতি বানাব, অতঃপর আমি তাতে ফুঁক দেব। ফলে আল্লাহর হুকুমে সেটি পাখি হয়ে যাবে। আর আমি আল্লাহর হুকুমে জন্মান্ধ ও কুষ্ঠ রুগীকে সুস্থ করব এবং মৃতকে জীবিত করব। আর তোমরা যা আহার কর এবং তোমাদের ঘরে যা জমা করে রাখ তা আমি তোমাদেরকে জানিয়ে দেব। নিশ্চয় এতে তোমাদের জন্য নিদর্শন রয়েছে, যদি তোমরা মুমিন হও’।",
    "‘আর আমার সামনে পূর্ববর্তী কিতাব তাওরাতের যা রয়েছে তার সত্যায়নকারীরূপে এবং তোমাদের উপর যা হারাম করা হয়েছিল তার কিছু তোমাদের জন্য হালাল করতে এবং আমি তোমাদের নিকট এসেছি তোমাদের রবের পক্ষ থেকে নিদর্শন নিয়ে। অতএব, তোমরা আল্লাহর তাকওয়া অবলম্বন কর এবং আমার আনুগত্য কর’।",
    "‘নিশ্চয় আল্লাহ আমার রব ও তোমাদের রব। অতএব তোমরা তাঁর ইবাদাত কর। এটি সরল পথ’।",
    "অতঃপর যখন ঈসা তাদের পক্ষ হতে কুফরী উপলব্ধি করল, তখন বলল, ‘কে আল্লাহর জন্য আমার সাহায্যকারী হবে’? হাওয়ারীগণ বলল, ‘আমরা আল্লাহর সাহায্যকারী। আমরা আল্লাহর প্রতি ঈমান এনেছি। আর তুমি সাক্ষী থাক যে, নিশ্চয় আমরা মুসলিম’।",
    "হে আমাদের রব, আপনি যা নাযিল করেছেন তার প্রতি আমরা ঈমান এনেছি এবং আমরা রাসূলের অনুসরণ করেছি। অতএব, আমাদেরকে সাক্ষ্যদাতাদের তালিকাভুক্ত করুন’।",
    "আর তারা কুটকৌশল করেছে এবং আল্লাহ কৌশল করেছেন। আর আল্লাহ উত্তম কৌশলকারী।",
    "স্মরণ কর, যখন আল্লাহ বললেন, ‘হে ঈসা, নিশ্চয় আমি তোমাকে পরিগ্রহণ করব, তোমাকে আমার দিকে উঠিয়ে নেব এবং কাফিরদের থেকে তোমাকে পবিত্র করব। আর যারা তোমার আনুগত্য করেছে তাদেরকে কিয়ামত পর্যন্ত অবিশ্বাসীদের উপরে প্রাধান্য দেব। অতঃপর আমার নিকটই তোমাদের প্রত্যাবর্তন হবে। তখন আমি তোমাদের মধ্যে মীমাংসা করে দেব, যে ব্যাপারে তোমরা মতবিরোধ করতে’ ।",
    "অতঃপর যারা কুফরী করেছে, আমি তাদেরকে কঠিন আযাব দেব দুনিয়া ও আখিরাতে, আর তাদের কোন সাহায্যকারী নেই।",
    "আর যারা ঈমান এনেছে এবং নেক আমল করেছে, তিনি তাদেরকে পরিপূর্ণ প্রতিদান দেবেন। আর আল্লাহ যালিমদেরকে ভালবাসেন না।",
    "এটি আমি তোমার উপর তিলাওয়াত করছি, আয়াতসমূহ ও প্রজ্ঞাপূর্ণ উপদেশ থেকে।",
    "নিশ্চয় আল্লাহর নিকট ঈসার দৃষ্টান্ত আদমের মত, তিনি তাকে মাটি দ্বারা সৃষ্টি করেছেন। অতঃপর তাকে বললেন, ‘হও’, ফলে সে হয়ে গেল।",
    "সত্য তোমার রবের পক্ষ থেকে, সুতরাং তুমি সন্দেহ পোষণকারীদের অন্তর্ভুক্ত হয়ো না।",
    "অতঃপর তোমার নিকট জ্ঞান আসার পর যে তোমার সাথে এ বিষয়ে ঝগড়া করে, তবে তুমি তাকে বল, ‘এস আমরা ডেকে নেই আমাদের সন্তানদেরকে ও তোমাদের সন্তানদেরকে। আর আমাদের নারীদেরকে ও তোমাদের নারীদেরকে এবং আমাদের নিজদেরকে ও তোমাদের নিজদেরকে, তারপর আমরা বিনীত প্রার্থনা করি, ‘মিথ্যাবাদীদের উপর আল্লাহর লা’নত করি’।",
    "নিশ্চয় এটি সত্য বিবরণ। আর আল্লাহ ছাড়া কোন (সত্য) ইলাহ নেই এবং নিশ্চয় আল্লাহ, তিনিই হলেন পরাক্রমশালী, প্রজ্ঞাপূর্ণ।",
    "তবুও যদি তারা উপেক্ষা করে, তবে নিশ্চয় আল্লাহ ফাসাদ সৃষ্টিকারীদের সম্পর্কে অবগত।",
    "বল, ‘হে কিতাবীগণ, তোমরা এমন কথার দিকে আস, যেটি আমাদের মধ্যে ও তোমাদের মধ্যে সমান যে, আমরা একমাত্র আল্লাহ ছাড়া কারো ইবাদাত না করি। আর তার সাথে কোন কিছুকে শরীক না করি এবং আমাদের কেউ কাউকে আল্লাহ ছাড়া রব হিসাবে গ্রহণ না করি’। তারপর যদি তারা বিমুখ হয় তবে বল, ‘তোমরা সাক্ষী থাক যে, নিশ্চয় আমরা মুসলিম’।",
    "হে কিতাবীগণ, তোমরা ইবরাহীমের ব্যাপারে কেন বিতর্ক কর? অথচ তাওরাত ও ইনজীল তো তার পরই অবতীর্ণ হয়েছে। সুতরাং তোমরা কি বুঝবে না?",
    "সাবধান! তোমরা তো সেসব লোক, বিতর্ক করলে এমন বিষয়ে, যার জ্ঞান তোমাদের রয়েছে। তবে কেন তোমরা বিতর্ক করছ সে বিষয়ে যার জ্ঞান তোমাদের নেই? আর আল্লাহ জানেন এবং তোমরা জান না।",
    "ইবরাহীম ইয়াহূদীও ছিল না, নাসারাও ছিল না; বরং সে ছিল একনিষ্ঠ মুসলিম। আর সে মুশরিকদের অন্তর্ভুক্ত ছিল না।",
    "নিশ্চয় মানুষের মধ্যে ইবরাহীমের সবচেয়ে নিকটবর্তী তারা, যারা তার অনুসরণ করেছে এবং এই নবী ও মুমিনগণ। আর আল্লাহ মুমিনদের অভিভাবক।",
    "কিতাবীরা একদল কামনা করে, যদি তারা তোমাদেরকে বিপথগামী করতে পারত! কিন্তু তারা নিজদেরকে ছাড়া অন্য কাউকে বিপথগামী করছে না। অথচ তারা অনুভব করতে পারে না।",
    "হে কিতাবীরা, তোমরা কেন আল্লাহর নিদর্শনসমূহের সাথে কুফরী করছ, অথচ তোমরাই তার সাক্ষ্য দিচ্ছ?",
    "হে কিতাবীরা, কেন তোমরা সত্যকে মিথ্যার সাথে মিশ্রিত করছ এবং সত্যকে গোপন করছ, অথচ তোমরা তা জান?",
    "আর কিতাবীদের একদল বলে, ‘মুমিনদের উপর যা নাযিল করা হয়েছে, তোমরা তার প্রতি দিনের প্রথমভাগে ঈমান আন, আর শেষ ভাগে তা কুফরী কর; যাতে তারা ফিরে আসে’।",
    "‘আর তোমরা কেবল তাদেরকে বিশ্বাস কর, যারা তোমাদের দীনের অনুসরণ করে’। বল, ‘নিশ্চয় আল্লাহর হিদায়াতই হিদায়াত। এটা এ জন্য যে, কোন ব্যক্তিকে দেয়া হবে যেরূপ তোমাদেরকে দেয়া হয়েছে। অথবা তারা তোমাদের রবের নিকট তোমাদের সাথে বিতর্ক করবে’। বল, ‘নিশ্চয় অনুগ্রহ আল্লাহর হাতে, তিনি যাকে চান, তা দান করেন। আর আল্লাহ প্রাচুর্যময়, সর্বজ্ঞ’।",
    "তিনি যাকে চান, তাঁর রহমত দ্বারা একান্ত করে নেন। আর আল্লাহ মহা অনুগ্রহের অধিকারী।",
    "আর কিতাবীদের মধ্যে এমন ব্যক্তি আছে, যদি তার নিকট তুমি অঢেল সম্পদ আমানত রাখ, তবুও সে তা তোমার নিকট আদায় করে দেবে এবং তাদের মধ্যে এমন ব্যক্তিও আছে, যদি তুমি তার নিকট এক দীনার আমানত রাখ, তবে সর্বোচ্চ তাগাদা ছাড়া সে তা তোমাকে ফেরত দেবে না। এটি এ কারণে যে, তারা বলে, ‘উম্মীদের ব্যাপারে আমাদের উপর কোন পাপ নেই’। আর তারা জেনে-শুনে আল্লাহর প্রতি মিথ্যা বলে।",
    "হ্যাঁ, অবশ্যই যে নিজ প্রতিশ্রুতি পূর্ণ করে এবং তাকওয়া অবলম্বন করে, তবে নিশ্চয় আল্লাহ মুত্তাকীদেরকে ভালবাসেন।",
    "নিশ্চয় যারা আল্লাহর অঙ্গীকার ও তাদের শপথের বিনিময়ে খরিদ করে তুচ্ছ মূল্য, পরকালে এদের জন্য কোন অংশ নেই। আর আল্লাহ তাদের সাথে কথা বলবেন না এবং কিয়ামতের দিন তাদের দিকে তাকাবেন না, আর তাদেরকে পবিত্রও করবেন না এবং তাদের জন্যই রয়েছে মর্মন্তুদ আযাব।",
    "তাদের মধ্যে একদল রয়েছে, যারা নিজদের জিহবা দ্বারা বিকৃত করে কিতাব পাঠ করে, যাতে তোমরা সেটা কিতাবের অংশ মনে কর, অথচ সেটি কিতাবের অংশ নয়। তারা বলে, ‘এটি আল্লাহর পক্ষ থেকে’, অথচ তা আল্লাহর পক্ষ থেকে নয়। আর তারা আল্লাহর উপর মিথ্যা বলে, অথচ তারা জানে।",
    "কোন মানুষের জন্য সংগত নয় যে, আল্লাহ তাকে কিতাব, হিকমাত ও নবুওয়াত দান করার পর সে মানুষকে বলবে, ‘তোমরা আল্লাহকে ছেড়ে আমার বান্দা হয়ে যাও’। বরং সে বলবে, ‘তোমরা রববানী হও। যেহেতু তোমরা কিতাব শিক্ষা দিতে এবং তা অধ্যয়ন করতে’।",
    "আর তিনি তোমাদেরকে নির্দেশ করেন না যে, তোমরা ফেরেশতা ও নবীদেরকে রব রূপে গ্রহণ কর। তোমরা মুসলিম হওয়ার পর তিনি কি তোমাদেরকে কুফরীর নির্দেশ দিবেন?",
    "আর স্মরণ কর, যখন আল্লাহ নবীদের অঙ্গীকার নিয়েছেন- আমি তোমাদেরকে যে কিতাব ও হিকমাত দিয়েছি, অতঃপর তোমাদের সাথে যা আছে তা সত্যায়নকারীরূপে একজন রাসূল তোমাদের কাছে আসবে- তখন অবশ্যই তোমরা তার প্রতি ঈমান আনবে এবং তাকে সাহায্য করবে। তিনি বললেন, ‘তোমরা কি স্বীকার করেছ এবং এর উপর আমার প্রতিশ্রুতি গ্রহণ করেছ’? তারা বলল, ‘আমরা স্বীকার করলাম’। আল্লাহ বললেন, ‘তবে তোমরা সাক্ষী থাক এবং আমিও তোমাদের সাথে সাক্ষী রইলাম’।",
    "সুতরাং এরপর যারা ফিরে যাবে, তারা তো ফাসিক।",
    "তারা কি আল্লাহর দীনের পরিবর্তে অন্য কিছু তালাশ করছে? অথচ আসমানসমূহ ও যমীনে যা আছে তা তাঁরই আনুগত্য করে ইচ্ছায় কিংবা অনিচ্ছায় এবং তাদেরকে তাঁরই নিকট প্রত্যাবর্তন করা হবে।",
    "বল, ‘আমরা ঈমান এনেছি আল্লাহর প্রতি এবং যা নাযিল করা হয়েছে আমাদের উপর, আর যা নাযিল হয়েছে ইবরাহীম, ইসমাঈল, ইসহাক, ইয়াকূব ও তাদের সন্তানদের উপর। আর যা দেয়া হয়েছে মূসা, ঈসা ও অন্যান্য নবীকে তাদের রবের পক্ষ থেকে, আমরা তাদের কারো মধ্যে পার্থক্য করি না এবং আমরা তারই প্রতি আত্মসমর্পণকারী’।",
    "আর যে ইসলাম ছাড়া অন্য কোন দীন চায় তবে তার কাছ থেকে তা কখনো গ্রহণ করা হবে না এবং সে আখিরাতে ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হবে।",
    "কেমন করে আল্লাহ সে কওমকে হিদায়াত দেবেন, যারা ঈমান আনার পর কুফরী করেছে, আর তারা সাক্ষ্য দিয়েছে যে, নিশ্চয় রাসূল সত্য এবং তাদের নিকট স্পষ্ট প্রমাণ এসেছে। আর আল্লাহ যালিম কওমকে হিদায়াত দেন না।",
    "এরাই তারা, যাদের প্রতিদান হল, নিশ্চয় তাদের উপর আল্লাহর, ফেরেশতাদের ও সকল মানুষের লা’নত।",
    "তারা তাতে স্থায়ী হবে, তাদের থেকে আযাব শিথিল করা হবে না এবং তাদেরকে অবকাশও দেয়া হবে না।",
    "কিন্তু তারা ছাড়া যারা এরপরে তাওবা করেছে এবং শুধরে নিয়েছে তবে নিশ্চয় আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "নিশ্চয় যারা কুফরী করেছে ঈমান আনার পর, তারপর তারা কুফরীতে বেড়ে গিয়েছে, তাদের তাওবা কখনো কবুল করা হবে না। আর তারাই পথভ্রষ্ট।",
    "নিশ্চয় যারা কুফরী করেছে এবং কাফের অবস্থায় মারা গেছে, তাদের কারো কাছ থেকে যমীন ভরা স্বর্ণ বিনিময়স্বরূপ প্রদান করলেও গ্রহণ করা হবে না, তাদের জন্যই রয়েছে বেদনাদায়ক আযাব, আর তাদের জন্য কোন সাহায্যকারী নেই।",
    "তোমরা কখনো সওয়াব অর্জন করতে পারবে না, যতক্ষণ না ব্যয় করবে তা থেকে, যা তোমরা ভালবাস। আর যা কিছু তোমরা ব্যয় করবে, তবে নিশ্চয় আল্লাহ সে বিষয়ে সম্যক জ্ঞাত।",
    "সকল খাবার বনী ইসরাঈলের জন্য হালাল ছিল। তবে ইসরাঈল তার নিজের উপর যা হারাম করেছিল তাওরাত অবতীর্ণ হওয়ার পূর্বে। বল, ‘তাহলে তোমরা তাওরাত নিয়ে আস, অতঃপর তা তিলাওয়াত কর, যদি তোমরা সত্যবাদী হও’।",
    "অতএব যারা এরপরও আল্লাহর ব্যাপারে মিথ্যা রটনা করে, তারা অবশ্যই যালিম।",
    "বল, ‘আল্লাহ সত্য বলেছেন। সুতরাং তোমরা ইবরাহীমের মিল্লাতের অনুসরণ কর একনিষ্ঠভাবে। আর সে মুশরিকদের অন্তর্ভুক্ত ছিল না’।",
    "নিশ্চয় প্রথম ঘর, যা মানুষের জন্য স্থাপন করা হয়েছে, তা মক্কায়। যা বরকতময় ও হিদায়াত বিশ্ববাসীর জন্য।",
    "তাতে রয়েছে স্পষ্ট নির্দশনসমূহ, মাকামে ইবরাহীম। আর যে তাতে প্রবেশ করবে, সে নিরাপদ হয়ে যাবে এবং সামর্থ্যবান মানুষের উপর আল্লাহর জন্য বায়তুল্লাহর হজ্জ করা ফরয। আর যে কুফরী করে, তবে আল্লাহ তো নিশ্চয় সৃষ্টিকুল থেকে অমুখাপেক্ষী।",
    "বল, ‘হে আহলে কিতাব, তোমরা কেন আল্লাহর নিদর্শনসমূহকে অস্বীকার করছ ? আর আল্লাহ তোমরা যা করছ সে ব্যাপারে সাক্ষী।",
    "বল, ‘হে আহলে কিতাব, তোমরা কেন আল্লাহর পথ থেকে বাধা দিচ্ছ তাদেরকে, যারা ঈমান এনেছে? তোমরা তাতে বক্রতা অনুসন্ধান কর, অথচ তোমরা সাক্ষী। আর তোমরা যা কর, তা থেকে আল্লাহ গাফেল নন’।",
    "হে মুমিনগণ, যাদেরকে কিতাব দেয়া হয়েছে, তোমরা যদি তাদের একটি দলের আনুগত্য কর, তারা তোমাদের ঈমানের পর তোমাদেরকে কাফির অবস্থায় ফিরিয়ে নেবে।",
    "আর কিভাবে তোমরা কুফরী কর, অথচ তোমাদের কাছে আল্লাহর আয়াতসমূহ তিলাওয়াত করা হচ্ছে এবং তোমাদের মধ্যে রয়েছে তাঁর রাসূল। আর যে ব্যক্তি আল্লাহকে দৃঢ়ভাবে ধারণ করবে তাকে অবশ্যই সরল পথের দিশা দেয়া হবে।",
    "হে মুমিনগণ, তোমরা আল্লাহকে ভয় কর, যথাযথ ভয়। আর তোমরা মুসলমান হওয়া ছাড়া মারা যেও না।",
    "আর তোমরা সকলে আল্লাহর রজ্জুকে দৃঢ়ভাবে ধারণ কর এবং বিভক্ত হয়ো না। আর তোমরা তোমাদের উপর আল্লাহর নিয়ামতকে স্মরণ কর, যখন তোমরা পরস্পরে শত্রু ছিলে। তারপর আল্লাহ তোমাদের অন্তরে ভালবাসার সঞ্চার করেছেন। অতঃপর তাঁর অনুগ্রহে তোমরা ভাই-ভাই হয়ে গেল। আর তোমরা ছিলে আগুনের গর্তের কিনারায়, অতঃপর তিনি তোমাদেরকে তা থেকে রক্ষা করেছেন। এভাবেই আল্লাহ তোমাদের জন্য তাঁর আয়াতসমূহ বয়ান করেন, যাতে তোমরা হিদায়াতপ্রাপ্ত হও।",
    "আর যেন তোমাদের মধ্য থেকে এমন একটি দল হয়, যারা কল্যাণের প্রতি আহবান করবে, ভাল কাজের আদেশ দেবে এবং মন্দ কাজ থেকে নিষেধ করবে। আর তারাই সফলকাম।",
    "আর তোমরা তাদের মত হয়ো না, যারা বিভক্ত হয়েছে এবং মতবিরোধ করেছে তাদের নিকট স্পষ্ট নিদর্শনসমূহ আসার পর। আর তাদের জন্যই রয়েছে কঠোর আযাব।",
    "সেদিন কতক চেহারা সাদা হবে এবং কতক চেহারা হবে কালো। আর যাদের চেহারা কালো হবে (তাদেরকে বলা হবে) ‘তোমরা কি ঈমান আনার পর কুফরী করেছিলে? সুতরাং তোমরা আযাব আস্বাদন কর। কারণ তোমরা কুফরী করতে’।",
    "আর যাদের চেহারা সাদা হবে, তারা তো আল্লাহর রহমতে থাকবে। তারা সেখানে স্থায়ী হবে।",
    "এগুলো আল্লাহর নির্দশন, যা আমি তোমার উপর যথাযথভাবে তিলাওয়াত করছি। আর আল্লাহ সৃষ্টিকুলের প্রতি যুলম করতে চান না।",
    "আর আসমানসমূহ ও যমীনে যা রয়েছে, তা আল্লাহর জন্যই এবং আল্লাহর দিকেই যাবতীয় কর্মকান্ড প্রত্যাবর্তিত হবে।",
    "তোমরাই হলে সর্বোত্তম উম্মত,যাদেরকে মানুষের জন্য বের করা হয়েছে। তোমরা ভাল কাজের আদেশ দেবে এবং মন্দ কাজ থেকে বারণ করবে, আর আল্লাহর প্রতি ঈমান পোষণ করবে। আর যদি আহলে কিতাব ঈমান আনত, তবে অবশ্যই তা তাদের জন্য কল্যাণকর হত। তাদের কতক ঈমানদার। তাদের অধিকাংশই ফাসিক।",
    "তারা তোমাদের কোন ক্ষতি করতে পারবে না কষ্ট দেয়া ছাড়া। আর যদি তারা তোমাদের সাথে লড়াই করে, তবে তারা তোমাদেরকে পৃষ্ঠপ্রদর্শন করে পালাবে, তারপর তাদেরকে সাহায্য করা হবে না।",
    "তারা যেখানেই থাকুক না কেন, তাদের উপর নির্ধারণ করে দেয়া হয়েছে লাঞ্ছনা, তবে আল্লাহর পক্ষ থেকে কোন প্রতিশ্রুতি এবং মানুষের পক্ষ থেকে প্রতিশ্রুতি থাকলে আলাদা কথা। আর তারা আল্লাহর পক্ষ থেকে গযব নিয়ে ফিরে এসেছে। আর তাদের উপর দারিদ্র্য নির্ধারণ করে দেয়া হয়েছে। তা এ কারণে যে, তারা আল্লাহর আয়াতসমূহকে অস্বীকার করত এবং নবীদেরকে অন্যায়ভাবে হত্যা করত। তা এ জন্য যে, তারা নাফরমানী করেছে, আর তারা সীমালঙ্ঘন করত।",
    "তারা সমান নয়। আহলে কিতাবের মধ্যে একদল ন্যায়ের উপর প্রতিষ্ঠিত রয়েছে। তারা রাতের বেলায় আল্লাহর আয়াতসমূহ তিলাওয়াত করে এবং তারা সিজদা করে।",
    "তারা আল্লাহ ও শেষ দিনের প্রতি ঈমান রাখে এবং তারা ভাল কাজের আদেশ দেয় ও মন্দ কাজ থেকে নিষেধ করে। আর তারা কল্যাণকর কাজে দ্রুত ধাবিত হয় এবং তারা নেককারদের অন্তর্ভুক্ত।",
    "আর তারা যে ভাল কাজ করে, তা কখনো অস্বীকার করা হবে না। আর আল্লাহ মুত্তাকীদের সম্পর্কে সম্যক জ্ঞাত।",
    "নিশ্চয় যারা কুফরী করে, আল্লাহর বিপক্ষে তাদের ধন-সম্পদ না তাদের কোন কাজে আসবে, আর না তাদের সন্তানাদি। আর তারা আগুনের অধিবাসী। তারা সেখানে স্থায়ী হবে।",
    "তারা দুনিয়ার জীবনে যা ব্যয় করে, তার উপমা সেই বাতাসের ন্যায়, যাতে রয়েছে প্রচন্ড ঠান্ডা, যা পৌঁছে এমন কওমের শস্যক্ষেতে, যারা নিজদের উপর যুলম করেছিল। অতঃপর তা শস্যক্ষেতকে ধ্বংস করে দেয়। আর আল্লাহ তাদের উপর যুলম করেননি, বরং তারা নিজেরাই নিজদের উপর যুলম করে।",
    "হে মুমিনগণ, তোমরা তোমাদের ছাড়া অন্য কাউকে অন্তরঙ্গ বন্ধুরূপে গ্রহণ করো না। তারা তোমাদের সর্বনাশ করতে ত্রুটি করবে না। তারা তোমাদের মারাত্মক ক্ষতি কামনা করে। তাদের মুখ থেকে তো শত্রুতা প্রকাশ পেয়ে গিয়েছে। আর তাদের অন্তরসমূহ যা গোপন করে তা অধিক ভয়াবহ। অবশ্যই আমি তোমাদের জন্য আয়াতসমূহ স্পষ্ট বর্ণনা করেছি। যদি তোমরা উপলব্ধি করতে।",
    "শোন, তোমরাই তো তাদেরকে ভালবাস এবং তারা তোমাদেরকে ভালবাসে না। অথচ তোমরা সব কিতাবের প্রতি ঈমান রাখ। আর যখন তারা তোমাদের সাথে সাক্ষাৎ করে, তখন বলে, ‘আমরা ঈমান এনেছি’। আর যখন তারা একান্তে মিলিত হয়, তোমাদের উপর রাগে আঙ্গুল কামড়ায়। বল, ‘তোমরা তোমাদের রাগ নিয়ে মর’! নিশ্চয় আল্লাহ অন্তরের গোপন বিষয় সম্পর্কে পূর্ণ জ্ঞাত।",
    "যদি তোমাদেরকে কোন কল্যাণ স্পর্শ করে, তখন তাদের কষ্ট হয়। আর যদি তোমাদেরকে মন্দ স্পর্শ করে, তখন তারা তাতে খুশি হয়। আর যদি তোমরা ধৈর্য ধর এবং তাকওয়া অবলম্বন কর, তাহলে তাদের ষড়যন্ত্র তোমাদের কিছু ক্ষতি করবে না। নিশ্চয় আল্লাহ তারা যা করে, তা পরিবেষ্টনকারী।",
    "আর স্মরণ কর, যখন তুমি তোমার পরিবার পরিজন থেকে সকাল বেলায় বের হয়ে মুমিনদেরকে লড়াইয়ের স্থানসমূহে বিন্যস্ত করেছিলে; আর আল্লাহ সর্বশ্রোতা, সর্বজ্ঞ।",
    "যখন তোমাদের মধ্য থেকে দু’দল* পিছু হটার ইচ্ছা করল, অথচ আল্লাহ তাদের উভয়ের অভিভাবক। আর আল্লাহর উপরই যেন মুমিনগণ তাওয়াক্কুল করে। \n*উহুদ যুদ্ধের সময় মুনাফিক সর্দার আবদুল্লাহ ইবনে উবাইয়ের সাথে তিনশত জন সৈন্য যুদ্ধের ময়দান থেকে ফেরৎ চলে যায়। এদের দেখাদেখি বনু সালামা ও বনূ হারেছার লোকেরাও চলে যেতে চেয়েছিল। কিন্তু আল্লাহর রহমতে তারা যায়নি।",
    "আর অবশ্যই আল্লাহ তোমাদেরকে বদরে সাহায্য করেছেন অথচ তোমরা ছিলে হীনবল। অতএব তোমরা আল্লাহকে ভয় কর, আশা করা যায়, তোমরা শোকরগুজার হবে।",
    "স্মরণ কর, যখন তুমি মুমিনদেরকে বলছিলে, ‘তোমাদের জন্য কি যথেষ্ট নয় যে, তোমাদের রব তোমাদেরকে তিন হাজার নাযিলকৃত ফেরেশতা দ্বারা সাহায্য করবেন’?",
    "হ্যাঁ, যদি তোমরা ধৈর্য ধর এবং তাকওয়া অবলম্বন কর, আর তারা হঠাৎ তোমাদের মুখোমুখি এসে যায়, তবে তোমাদের রব পাঁচ হাজার চি‎‎হ্নত ফেরেশতা দ্বারা তোমাদেরকে সাহায্য করবেন।",
    "আর আল্লাহ তোমাদের জন্য তা কেবল সুসংবাদস্বরূপ নির্ধারণ করেছেন এবং যাতে তোমাদের অন্তরসমূহ এর দ্বারা প্রশান্ত হয়। আর সাহায্য কেবল পরাক্রমশালী প্রজ্ঞাময় আল্লাহর পক্ষ থেকে।",
    "যাতে তিনি কাফিরদের একটি অংশকে নিশ্চি‎হ্ন করেন অথবা তাদেরকে লাঞ্ছিত করেন। ফলে তারা নিরাশ হয়ে ফিরে যাবে।",
    "এ বিষয়ে তোমার কোন অধিকার নেই- হয়তো তিনি তাদেরকে ক্ষমা করবেন অথবা তিনি তাদেরকে আযাব দেবেন। কারণ নিশ্চয় তারা যালিম।",
    "আর আল্লাহর জন্যই যা আছে আসমানসমূহে এবং যা আছে যমীনে । তিনি যাকে ইচ্ছা ক্ষমা করেন, আর যাকে ইচ্ছা আযাব দেন। আর আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
    "হে মুমিনগণ, তোমরা সুদ খাবে না বহুগুণ বৃদ্ধি করে। আর তোমরা আল্লাহকে ভয় কর, যাতে তোমরা সফল হও।",
    "আর তোমরা আগুনকে ভয় কর, যা কাফিরদের জন্য তৈরি করা হয়েছে।",
    "আর তোমরা আনুগত্য কর আল্লাহ ও রাসূলের, যাতে তোমাদেরকে দয়া করা হয়।",
    "আর তোমরা দ্রুত অগ্রসর হও তোমাদের রবের পক্ষ থেকে মাগফিরাত ও জান্নাতের দিকে, যার পরিধি আসমানসমূহ ও যমীনের সমান, যা মুত্তাকীদের জন্য প্রস্তুত করা হয়েছে।",
    "যারা সুসময়ে ও দুঃসময়ে ব্যয় করে এবং ক্রোধ সংবরণ করে ও মানুষকে ক্ষমা করে। আর আল্লাহ সৎকর্মশীলদের ভালবাসেন।",
    "আর যারা কোন অশ্লীল কাজ করলে অথবা নিজদের প্রতি যুলম করলে আল্লাহকে স্মরণ করে, অতঃপর তাদের গুনাহের জন্য ক্ষমা চায়। আর আল্লাহ ছাড়া কে গুনাহ ক্ষমা করবে ? আর তারা যা করেছে, জেনে শুনে তা তারা বার বার করে না।",
    "এরাই তারা, যাদের প্রতিদান তাদের রবের পক্ষ থেকে মাগফিরাত ও জান্নাতসমূহ যার তলদেশে প্রবাহিত রয়েছে নহরসমূহ। সেখানে তারা স্থায়ী হবে। আর আমলকারীদের প্রতিদান কতই না উত্তম!",
    "অবশ্যই তোমাদের পূর্বে অনেক রীতি-নীতি অতিবাহিত হয়েছে, অতএব তোমরা যমীনে ভ্রমণ কর, দেখ অস্বীকারকারীদের পরিণতি কিরূপ হয়েছিল।",
    "এটা মানুষের জন্য স্পষ্ট বর্ণনা ও হিদায়াত এবং উপদেশ মুত্তাকীদের জন্য।",
    "আর তোমরা দুর্বল হয়ো না এবং দুঃখিত হয়ো না, আর তোমরাই বিজয়ী যদি মুমিন হয়ে থাক।",
    "যদি তোমাদেরকে কোন আঘাত স্পর্শ করে থাকে তবে তার অনুরূপ আঘাত উক্ত কওমকেও স্পর্শ করেছে। আর এইসব দিন আমি মানুষের মধ্যে পালাক্রমে আবর্তন করি এবং যাতে আল্লাহ ঈমানদারদেরকে জেনে নেন এবং তোমাদের মধ্য থেকে শহীদদেরকে গ্রহণ করেন। আর আল্লাহ যালিমদেরকে ভালবাসেন না।",
    "আর যাতে আল্লাহ পরিশুদ্ধ করেন ঈমানদারদেরকে এবং ধ্বংস করে দেন কাফিরদেরকে।",
    "তোমরা কি মনে কর যে, তোমরা জান্নাতে প্রবেশ করবে? অথচ আল্লাহ এখনো জানেননি তাদেরকে যারা তোমাদের মধ্য থেকে জিহাদ করেছে এবং জানেননি ধৈর্যশীলদেরকে।",
    "আর তোমরা অবশ্যই মৃত্যু কামনা করতে, তার সাথে সাক্ষাতের পূর্বে। অতএব তোমরা তো তা দেখেছই এমতাবস্থায় যে, তোমরা তাকাচ্ছিলে ।",
    "আর মুহাম্মাদ কেবল একজন রাসূল। তার পূর্বে নিশ্চয় অনেক রাসূল বিগত হয়েছে। যদি সে মারা যায় অথবা তাকে হত্যা করা হয়, তবে তোমরা কি তোমাদের পেছনে ফিরে যাবে ? আর যে ব্যক্তি পেছনে ফিরে যায়, সে কখনো আল্লাহর কোন ক্ষতি করতে পারে না। আর আল্লাহ অচিরেই কৃতজ্ঞদের প্রতিদান দেবেন।",
    "আর কোন প্রাণী আল্লাহর অনুমতি ছাড়া মারা যায় না, তা নির্দিষ্টভাবে লিখিত আছে। আর যে দুনিয়ার প্রতিদান চায়, আমি তা থেকে তাকে দিয়ে দেই, আর যে আখিরাতের বিনিময় চায়, আমি তা থেকে তাকেও দেই এবং আমি অচিরেই কৃতজ্ঞদের প্রতিদান দেব।",
    "আর কত নবী ছিল, যার সাথে থেকে অনেক আল্লাহওয়ালা লড়াই করেছে। তবে আল্লাহর পথে তাদের উপর যা আপতিত হয়েছে তার জন্য তারা হতোদ্যম হয়নি। আর তারা দুর্বল হয়নি এবং তারা নত হয়নি। আর আল্লাহ ধৈর্যশীলদেরকে ভালবাসেন।",
    "আর তাদের কথা শুধু এই ছিল যে, তারা বলল, ‘হে আমাদের রব, আমাদের পাপ ও আমাদের কর্মে আমাদের সীমালঙঘন ক্ষমা করুন এবং অবিচল রাখুন আমাদের পাসমূহকে, আর কাফির কওমের উপর আমাদেরকে সাহায্য করুন’।",
    "অতঃপর আল্লাহ তাদেরকে দিলেন দুনিয়ার প্রতিদান এবং আখিরাতের উত্তম সওয়াব। আর আল্লাহ সৎকর্মশীলদেরকে ভালবাসেন।",
    "হে মুমিনগণ, যদি তোমরা কাফিরদের আনুগত্য কর, তারা তোমাদেরকে তোমাদের পূর্বাবস্থায় ফিরিয়ে নিয়ে যাবে। ফলে তোমরা ক্ষতিগ্রস্ত হয়ে ফিরে যাবে।",
    "বরং আল্লাহ তোমাদের অভিভাবক এবং তিনি উত্তম সাহায্যকারী।",
    "অচিরেই আমি কাফিরদের অন্তরসমূহে আতঙ্ক ঢেলে দেব। কারণ তারা আল্লাহর সাথে শরীক করেছে, যে সম্পর্কে আল্লাহ কোন প্রমাণ নাযিল করেননি। আর তাদের আশ্রয়স্থল হল আগুন এবং যালিমদের ঠিকানা কতই না নিকৃষ্ট!",
    "আর আল্লাহ তোমাদের কাছে তাঁর ওয়াদা সত্যে পরিণত করেন, যখন তোমরা তাদেরকে হত্যা করছিলে তাঁর নির্দেশে। অবশেষে যখন তোমরা দুর্বল হয়ে গেলে এবং নির্দেশ সম্পর্কে বিবাদ করলে আর তোমরা অবাধ্য হলে তোমরা যা ভালবাসতে তা তোমাদেরকে দেখানোর পর। তোমাদের মধ্যে কেউ দুনিয়া চায় আর কেউ চায় আখিরাত। তারপর আল্লাহ তোমাদেরকে তাদের থেকে ফিরিয়ে দিলেন যাতে তিনি তোমাদেরকে পরীক্ষা করেন। আর অবশ্যই আল্লাহ তোমাদেরকে ক্ষমা করে দিয়েছেন এবং আল্লাহ মুমিনদের উপর অনুগ্রহশীল।",
    "স্মরণ কর, যখন তোমরা উপরে উঠছিলে এবং কারো দিকে ফিরে দেখছিলে না, আর রাসূল তোমাদেরকে ডাকছিল তোমাদের পেছন থেকে। ফলে তিনি তোমাদেরকে দুশ্চিন্তার পর দুশ্চিন্তা দিয়েছিলেন, যাতে তোমাদের যা হারিয়ে গিয়েছে এবং তোমাদের উপর যা আপতিত হয়েছে তার জন্য দুঃখ না কর। আর তোমরা যা কর সে সম্পর্কে আল্লাহ সম্যক অবগত।",
    "তারপর তিনি তোমাদের উপর দুশ্চিন্তার পর নাযিল করলেন প্রশান্ত তন্দ্রা, যা তোমাদের মধ্য থেকে একদলকে ঢেকে ফেলেছিল, আর অপরদল নিজরাই নিজদেরকে চিন্তাগ্রস্ত করেছিল। তারা আল্লাহ সম্পর্কে জাহিলী ধারণার ন্যায় অসত্য ধারণা পোষণ করছিল। তারা বলছিল, ‘আমাদের কি কোন বিষয়ে অধিকার আছে’? বল, ‘নিশ্চয় সব বিষয় আল্লাহর’। তারা তাদের অন্তরে লুকিয়ে রাখে এমন বিষয় যা তোমার কাছে প্রকাশ করে না। তারা বলে, ‘যদি কোন বিষয়ে আমাদের অধিকার থাকত, তাহলে আমাদেরকে এখানে হত্যা করা হত না’। বল, ‘তোমরা যদি তোমাদের ঘরে থাকতে তাহলেও যাদের ব্যাপারে নিহত হওয়া অবধারিত রয়েছে, অবশ্যই তারা তাদের নিহত হওয়ার স্থলের দিকে বের হয়ে যেত। আর যাতে তোমাদের মনে যা আছে আল্লাহ তা পরীক্ষা করেন এবং তোমাদের অন্তরসমূহে যা আছে তা পরিষ্কার করেন। আর আল্লাহ তোমাদের অন্তরের বিষয় সম্পর্কে পূর্ণ জ্ঞাত’।",
    "নিশ্চয়ই তোমাদের মধ্য থেকে যারা পিছু হটে গিয়েছিল সেদিন, যেদিন দু’দল মুখোমুখি হয়েছিল, শয়তানই তাদের কিছু কৃতকর্মের ফলে তাদেরকে পদস্খলিত করেছিল। আর অবশ্যই আল্লাহ তাদেরকে ক্ষমা করেছেন। নিশ্চয় আল্লাহ পরম ক্ষমাশীল, সহনশীল।",
    "হে মুমিনগণ, তোমরা তাদের মত হয়ো না, যারা কুফরী করেছে এবং তাদের ভাইদেরকে বলেছে- যখন তারা যমীনে সফরে বের হয়েছিল অথবা তারা ছিল যোদ্ধা (অতঃপর নিহত হয়েছিল)-‘যদি তারা আমাদের কাছে থাকত, তবে তারা মারা যেত না এবং তাদেরকে হত্যা করা হত না’। যাতে আল্লাহ তা তাদের অন্তরে আক্ষেপে পরিণত করেন এবং আল্লাহ জীবন দান করেন ও মৃত্যু দেন। আর তোমরা যা কর আল্লাহ সে বিষয়ে সম্যক দ্রষ্টা।",
    "আর তোমাদেরকে যদি আল্লাহর রাস্তায় হত্যা করা হয় অথবা তোমরা মারা যাও, তাহলে অবশ্যই আল্লাহর পক্ষ থেকে ক্ষমা ও দয়া তারা যা জমা করে তা থেকে উত্তম।",
    "আর যদি তোমরা মারা যাও অথবা তোমাদেরকে হত্যা করা হয়, তবে তোমাদেরকে আল্লাহর নিকটই সমবেত করা হবে।",
    "অতঃপর আল্লাহর পক্ষ থেকে রহমতের কারণে তুমি তাদের জন্য নম্র হয়েছিলে। আর যদি তুমি কঠোর স্বভাবের, কঠিন হৃদয়সম্পন্ন হতে, তবে তারা তোমার আশপাশ থেকে সরে পড়ত। সুতরাং তাদেরকে ক্ষমা কর এবং তাদের জন্য ক্ষমা প্রার্থনা কর। আর কাজে-কর্মে তাদের সাথে পরার্মশ কর। অতঃপর যখন সংকল্প করবে তখন আল্লাহর উপর তাওয়াক্কুল করবে। নিশ্চয় আল্লাহ তাওয়াক্কুলকারীদেরকে ভালবাসেন।",
    "যদি আল্লাহ তোমাদেরকে সাহায্য করেন তবে তোমাদের উপর বিজয়ী কেউ নেই। আর যদি তিনি তোমাদেরকে লাঞ্ছিত করেন তবে কে এমন আছে যে, তোমাদেরকে এর পরে সাহায্য করবে? আর আল্লাহর উপরই যেন মুমিনগণ তাওয়াক্কুল করে।",
    "আর কোন নবীর জন্য উচিত নয় যে, সে খিয়ানত করবে। আর যে খিয়ানত করবে, কিয়ামতের দিনে উপস্থিত হবে তা নিয়ে যা সে খিয়ানত করেছে। অতঃপর প্রত্যেক ব্যক্তিকে পুরোপুরি দেয়া হবে যা সে উপার্জন করেছে এবং তাদেরকে যুলম করা হবে না।",
    "যে আল্লাহর সন্তুষ্টির অনুসরণ করেছে সেকি তার মত যে আল্লাহর ক্রোধ নিয়ে ফিরে এসেছে ? আর তার আশ্রয়স্থল জাহান্নাম এবং তা কতই না মন্দ প্রত্যাবর্তনস্থল!",
    "তারা আল্লাহর নিকট বিভিন্ন মর্যাদার। আর তারা যা করে, আল্লাহ তার সম্যক দ্রষ্টা।",
    "অবশ্যই আল্লাহ মুমিনদের উপর অনুগ্রহ করেছেন, যখন তিনি তাদের মধ্য থেকে তাদের প্রতি একজন রাসূল পাঠিয়েছেন, যে তাদের কাছে তাঁর আয়াতসমূহ তিলাওয়াত করে এবং তাদেরকে পরিশুদ্ধ করে আর তাদেরকে কিতাব ও হিকমাত শিক্ষা দেয়। যদিও তারা ইতঃপূর্বে স্পষ্ট ভ্রান্তিতে ছিল।",
    "আর যখন তোমাদের উপর বিপদ এল, (অথচ) তোমরা তো এর দ্বিগুণ বিপদে আক্রান্ত হলে (বদর যুদ্ধে)। তোমরা বলেছিলে এটা কোত্থেকে? বল, ‘তা তোমাদের নিজদের থেকে’। নিশ্চয় আল্লাহ সব কিছুর উপর ক্ষমতাবান।",
    "আর তোমাদের উপর যে বিপদ এসেছিল দুই দল মুখোমুখি হওয়ার দিন তা আল্লাহর অনুমতিক্রমে এবং যাতে তিনি মুমিনদেরকে জেনে নেন।",
    "আর যাতে তিনি জেনে নেন মুনাফিকদেরকে। আর তাদেরকে বলা হয়েছিল, ‘এসো, আল্লাহর পথে লড়াই কর অথবা প্রতিরোধ কর’। তারা বলেছিল, ‘যদি আমরা লড়াই হবে জানতাম* তবে অবশ্যই তোমাদেরকে অনুসরণ করতাম’। সেদিন তারা কুফরীর বেশি কাছাকাছি ছিল তাদের ঈমানের তুলনায়। তারা তাদের মুখে বলে, যা তাদের অন্তরসমূহে নেই। আর তারা যা গোপন করে সে সম্পর্কে আল্লাহ অধিক অবগত। \n*এর দু’টি অর্থ হতে পারে- যদি আমরা লড়াই করতে জানতাম অথবা লড়াই সংঘটিত হবে বলে জানতাম।",
    "যারা তাদের ভাইদেরকে বলেছিল এবং বসেছিল, ‘যদি তারা আমাদের অনুকরণ করত, তারা নিহত হত না’। বল, ‘তাহলে তোমরা তোমাদের নিজ থেকে মৃত্যুকে দূরে সরাও যদি তোমরা সত্যবাদী হও’।",
    "আর যারা আল্লাহর পথে জীবন দিয়েছে, তাদেরকে তুমি মৃত মনে করো না, বরং তারা তাদের রবের নিকট জীবিত। তাদেরকে রিয্ক দেয়া হয়।",
    "আল্লাহ তাদেরকে যে অনুগ্রহ করেছেন, তাতে তারা খুশি। আর তারা উৎফুল¬ হয়, পরবর্তীদের থেকে যারা এখনো তাদের সাথে মিলিত হয়নি তাদের বিষয়ে। এজন্য যে, তাদের কোন ভয় নেই এবং তারা দুঃখিতও হবে না।",
    "তারা আল্লাহর পক্ষ থেকে নিআমত ও অনুগ্রহ লাভে খুশি হয়। আর নিশ্চয় আল্লাহ মুমিনদের প্রতিদান নষ্ট করেন না।",
    "যারা আল্লাহ ও রাসূলের ডাকে সাড়া দিয়েছে যখমপ্রাপ্ত হওয়ার পরও, তাদের মধ্য থেকে যারা সৎকর্ম করেছে এবং তাকওয়া অবলম্বন করেছে তাদের জন্য রয়েছে মহাপুরস্কার।",
    "যাদেরকে মানুষেরা বলেছিল যে, ‘নিশ্চয় লোকেরা তোমাদের বিরুদ্ধে সমবেত হয়েছে। সুতরাং তাদেরকে ভয় কর’। কিন্তু তা তাদের ঈমান বাড়িয়ে দিয়েছিল এবং তারা বলেছিল, ‘আল্লাহই আমাদের জন্য যথেষ্ট এবং তিনি কতই না উত্তম কর্মবিধায়ক’!",
    "অতঃপর তারা ফিরে এসেছে আল্লাহর পক্ষ থেকে নিআমত ও অনুগ্রহসহ। কোন মন্দ তাদেরকে স্পর্শ করেনি এবং তারা আল্লাহর সন্তুষ্টির অনুসরণ করেছিল। আর আল্লাহ মহা অনুগ্রহশীল।",
    "সে তো শয়তান। সে তোমাদেরকে তার বন্ধুদের ভয় দেখায়। তোমরা তাদেরকে ভয় করো না, বরং আমাকে ভয় কর, যদি তোমরা মুমিন হও।",
    "যারা কুফরীতে দ্রুত ধাবিত হয় তারা যেন তোমাকে দুঃশ্চিন্তাগ্রস্ত না করে, নিশ্চয় তারা আল্লাহর কোন ক্ষতি করতে পারবে না। আল্লাহ চান যে, তাদের জন্য আখিরাতে কোন অংশ রাখবেন না। আর তাদের জন্য রয়েছে মহাআযাব।",
    "নিশ্চয় যারা ঈমানের বিনিময়ে কুফরী ক্রয় করেছে, তারা কখনোই আল্লাহর কোন ক্ষতি করতে পারবে না। আর তাদের জন্য রয়েছে যন্ত্রণাদায়ক আযাব।",
    "আর যারা কুফরী করেছে তারা যেন মনে না করে যে, আমি তাদের জন্য যে অবকাশ দেই, তা তাদের নিজদের জন্য উত্তম। আমি তো তাদেরকে অবকাশ দেই যাতে তারা পাপ বৃদ্ধি করে। আর তাদের জন্য রয়েছে অপমানজনক আযাব।",
    "আল্লাহ এমন নন যে, তিনি মুমিনদেরকে (এমন অবস্থায়) ছেড়ে দেবেন যার উপর তোমরা আছ। যতক্ষণ না তিনি পৃথক করবেন অপবিত্রকে পবিত্র থেকে। আর আল্লাহ এমন নন যে, তিনি তোমাদেরকে গায়েব সম্পর্কে জানাবেন। তবে আল্লাহ তাঁর রাসূলদের মধ্য থেকে যাকে চান বেছে নেন। সুতরাং তোমরা আল্লাহ ও তাঁর রাসূলের প্রতি ঈমান আন। আর যদি তোমরা ঈমান আন এবং তাকওয়া অবলম্বন কর তবে তোমাদের জন্য রয়েছে মহাপ্রতিদান।",
    "আর আল্লাহ যাদেরকে তাঁর অনুগ্রহ থেকে যা দান করেছেন তা নিয়ে যারা কৃপণতা করে তারা যেন ধারণা না করে যে, তা তাদের জন্য কল্যাণকর। বরং তা তাদের জন্য অকল্যাণকর। যা নিয়ে তারা কৃপণতা করেছিল, কিয়ামত দিবসে তা দিয়ে তাদের বেড়ি পরানো হবে। আর আসমানসমূহ ও যমীনের উত্তরাধিকার আল্লাহরই জন্য। আর তোমরা যা আমল কর সে ব্যাপারে আল্লাহ সম্যক জ্ঞাত।",
    "নিশ্চয় আল্লাহ তাদের কথা শুনেছেন, যারা বলেছে, ‘নিশ্চয় আল্লাহ দরিদ্র এবং আমরা ধনী’। অচিরেই আমি লিখে রাখব তারা যা বলেছে এবং নবীদেরকে তাদের অন্যায়ভাবে হত্যার বিষয়টিও এবং আমি বলব, ‘তোমরা উত্তপ্ত আযাব আস্বাদন কর’।",
    "এ হল তোমাদের হাত যা আগাম পেশ করেছে এটা সে কারণে। আর নিশ্চয় আল্লাহ বান্দাদের প্রতি যালিম নন।",
    "যারা বলে, ‘নিশ্চয় আল্লাহ আমাদেরকে অঙ্গীকার দিয়েছিলেন যে, আমরা যেন কোন রাসূলের প্রতি বিশ্বাস না করি, যতক্ষণ না সে আমাদের নিকট নিয়ে আসে এমন কুরবানী যাকে আগুন খেয়ে ফেলবে’। বল, ‘আমার পূর্বে রাসূলগণ তোমাদের নিকট এসেছে স্পষ্ট প্রমাণসমূহ নিয়ে এবং তোমরা যা বলছ তা নিয়ে। সুতরাং তোমরা তাদেরকে কেন হত্যা করেছিলে যদি তোমরা সত্যবাদী হয়ে থাক’?",
    "অতএব যদি তারা তোমাকে মিথ্যাবাদী বলে, তবে তোমার পূর্বে রাসূলগণকে মিথ্যাবাদী বলা হয়েছিল। তারা স্পষ্ট প্রমাণসমূহ, সহীফা ও আলোকময় কিতাবসহ এসেছিল।",
    "প্রতিটি প্রাণী মৃত্যুর স্বাদ গ্রহণ করবে। আর ‘অবশ্যই কিয়ামতের দিনে তাদের প্রতিদান পরিপূর্ণভাবে দেয়া হবে। সুতরাং যাকে জাহান্নাম থেকে দূরে রাখা হবে এবং জান্নাতে প্রবেশ করানো হবে সে-ই সফলতা পাবে। আর দুনিয়ার জীবন শুধু ধোঁকার সামগ্রী।",
    "অবশ্যই তোমাদেরকে তোমাদের ধন-সম্পদ ও তোমাদের নিজ জীবন সম্পর্কে পরীক্ষা করা হবে। আর অবশ্যই তোমরা শুনবে তোমাদের পূর্বে যাদের কিতাব দেয়া হয়েছে তাদের পক্ষ থেকে এবং মুশরিকদের পক্ষ থেকে অনেক কষ্টদায়ক কথা। আর যদি তোমরা ধৈর্য ধর এবং তাকওয়া অবলম্বন কর তবে নিশ্চয় তা হবে দৃঢ় সংকল্পের কাজ।",
    "আর স্মরণ কর, যখন আল্লাহ কিতাবপ্রাপ্তদের অঙ্গীকার নিয়েছিলেন যে, ‘অবশ্যই তোমরা তা মানুষের নিকট স্পষ্টভাবে বর্ণনা করবে এবং তা গোপন করবে না’। কিন্তু তারা তা তাদের পেছনে ফেলে দেয় এবং তা বিক্রি করে তুচ্ছ মূল্যে। অতএব তারা যা ক্রয় করে, তা কতইনা মন্দ!",
    "যারা তাদের কৃতকর্মের প্রতি খুশী হয় এবং যা তারা করেনি তা নিয়ে প্রশংসিত হতে পছন্দ করে, তুমি তাদেরকে আযাব থেকে মুক্ত মনে করো না। আর তাদের জন্যই রয়েছে যন্ত্রণাদায়ক আযাব।",
    "আর আল্লাহর জন্যই আসমান ও যমীনের রাজত্ব। আর আল্লাহ সব কিছুর উপর ক্ষমতাবান।",
    "নিশ্চয় আসমানসমূহ ও যমীনের সৃষ্টি এবং রাত ও দিনের বিবর্তনের মধ্যে রয়েছে বিবেকসম্পন্নদের জন্য বহু নির্দশন।",
    "যারা আল্লাহকে স্মরণ করে দাঁড়িয়ে, বসে ও কাত হয়ে এবং আসমানসমূহ ও যমীনের সৃষ্টি সম্পর্কে চিন্তা করে। (বলে) ‘হে আমাদের রব, তুমি এসব অনর্থক সৃষ্টি করনি। তুমি পবিত্র মহান। সুতরাং তুমি আমাদেরকে আগুনের আযাব থেকে রক্ষা কর’।",
    "‘হে আমাদের রব, নিশ্চয় তুমি যাকে আগুনে প্রবেশ করাবে, অবশ্যই তাকে তুমি অপমান করবে। আর যালিমদের জন্য কোন সাহায্যকারী নেই’।",
    "‘হে আমাদের রব, নিশ্চয় আমরা শুনেছিলাম একজন আহবানকারীকে, যে ঈমানের দিকে আহবান করে যে, ‘তোমরা তোমাদের রবের প্রতি ঈমান আন’। তাই আমরা ঈমান এনেছি। হে আমাদের রব আমাদের গুনাহসমূহ ক্ষমা করুন এবং বিদূরিত করুন আমাদের ত্রুটি-বিচ্যুতি, আর আমাদেরকে মৃত্যু দিন নেককারদের সাথে’।",
    "‘হে আমাদের রব, আর আপনি আমাদেরকে তা প্রদান করুন যার ওয়াদা আপনি আমাদেরকে দিয়েছেন আপনার রাসূলগণের মাধ্যমে। আর কিয়ামতের দিনে আপনি আমাদেরকে অপমান করবেন না। নিশ্চয় আপনি অঙ্গীকার ভঙ্গ করেন না’।",
    "অতঃপর তাদের রব তাদের ডাকে সাড়া দিলেন যে, ‘নিশ্চয় আমি তোমাদের কোন পুরুষ অথবা মহিলা আমলকারীর আমল নষ্ট করব না। তোমাদের একে অপরের অংশ। সুতরাং যারা হিজরত করেছে এবং যাদেরকে তাদের ঘর থেকে বের করে দেয়া হয়েছে এবং যাদেরকে আমার রাস্তায় কষ্ট দেয়া হয়েছে, আর যারা যুদ্ধ করেছে এবং নিহত হয়েছে, আমি অবশ্যই তাদের ত্রুটি-বিচ্যুতিসমূহ বিলুপ্ত করে দেব এবং তাদেরকে প্রবেশ করাবো জান্নাতসমূহে, যার তলদেশে প্রবাহিত হচ্ছে নহরসমূহ; আল্লাহর পক্ষ থেকে প্রতিদানস্বরূপ। আর আল্লাহর নিকট রয়েছে উত্তম প্রতিদান।",
    "নগরসমূহে সেসব লোকের চলা-ফেরা তোমাকে যেন ধোঁকায় না ফেলে যারা কুফরী করেছে।",
    "এসব অল্প ভোগ্যসামগ্রী। এরপর তাদের আশ্রয়স্থল জাহান্নাম; আর তা কতইনা মন্দ বিছানা!",
    "কিন্তু যারা তাদের রবকে ভয় করে, তাদের জন্য রয়েছে জান্নাত, যার তলদেশে প্রবাহিত হবে নহরসমূহ, সেখানে তারা স্থায়ী হবে। এটা আল্লাহর পক্ষ থেকে মেহমানদারী। আর আল্লাহর নিকট যা রয়েছে তা নেককার লোকদের জন্য উত্তম।",
    "আর নিশ্চয় আহলে কিতাবদের মধ্যে এমন লোক রয়েছে, যে আল্লাহর জন্য বিনীত হয়ে ঈমান আনে আল্লাহর প্রতি এবং যা নাযিল করা হয়েছে তোমাদের প্রতি, আর যা নাযিল করা হয়েছে তাদের প্রতি। তারা আল্লাহর আয়াতসমূহ স্বল্পমূল্যের বিনিময়ে বিক্রয় করে না। তাদের জন্য রয়েছে তাদের রবের নিকট পুরস্কার। নিশ্চয় আল্লাহ অতি দ্রুত হিসাব গ্রহণকারী।",
    "হে মুমিনগণ, তোমরা ধৈর্য ধর ও ধৈর্যে অটল থাক এবং পাহারায় নিয়োজিত থাক। আর আল্লাহকে ভয় কর, যাতে তোমরা সফল হও।"
  ]
}