{
  "surahName": "Saba",
  "surahNameArabic": "سبإ",
  "surahNameArabicLong": "سورة سَبَأ",
  "surahNameTranslation": "Sheba",
  "revelationPlace": "Mecca",
  "totalAyah": 54,
  "surahNo": 34,
  "audio": {
    "1": {
      "reciter": "Mishary Rashid Al-Afasy",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/1/34.mp3",
      "originalUrl": "https://server8.mp3quran.net/afs/034.mp3"
    },
    "2": {
      "reciter": "Abu Bakr Al-Shatri",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/2/34.mp3",
      "originalUrl": "https://server11.mp3quran.net/shatri/034.mp3"
    },
    "3": {
      "reciter": "Nasser Al-Qatami",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/3/34.mp3",
      "originalUrl": "https://server6.mp3quran.net/qtm/034.mp3"
    },
    "4": {
      "reciter": "Yasser Al-Dosari",
      "url": "https://github.com/The-Quran-Project/Quran-Audio-Chapters/raw/refs/heads/main/Data/4/34.mp3",
      "originalUrl": "https://server11.mp3quran.net/yasser/034.mp3"
    }
  },
  "english": [
    "All praise is for Allah, to Whom belongs whatever is in the heavens and whatever is on the earth. And praise be to Him in the Hereafter. He is the All-Wise, All-Aware.",
    "He knows whatever goes into the earth and whatever comes out of it, and whatever descends from the sky and whatever ascends into it. And He is the Most Merciful, All-Forgiving.",
    "The disbelievers say, “The Hour will never come to us.” Say, ˹O Prophet,˺ “Yes—by my Lord, the Knower of the unseen—it will certainly come to you!” Not ˹even˺ an atom’s weight is hidden from Him in the heavens or the earth; nor anything smaller or larger than that, but is ˹written˺ in a perfect Record.",
    "So He may reward those who believe and do good. It is they who will have forgiveness and an honourable provision.",
    "As for those who strive to discredit Our revelations, it is they who will suffer the ˹worst˺ torment of agonizing pain.",
    "Those gifted with knowledge ˹clearly˺ see that what has been revealed to you from your Lord ˹O Prophet˺ is the truth, and that it guides to the Path of the Almighty, the Praiseworthy.",
    "The disbelievers say ˹mockingly to one another˺, “Shall we show you a man who claims that when you have been utterly disintegrated you will be raised as a new creation?",
    "Has he fabricated a lie against Allah or is he insane?” In fact, those who do not believe in the Hereafter are bound for torment and have strayed farthest ˹from the truth˺.",
    "Have they not then seen all that surrounds them of the heavens and the earth? If We willed, We could cause the earth to swallow them up, or cause ˹deadly˺ pieces of the sky to fall upon them. Surely in this is a sign for every servant who turns ˹to Allah˺.",
    "Indeed, We granted David a ˹great˺ privilege from Us, ˹commanding:˺ “O mountains! Echo his hymns! And the birds as well.” We made iron mouldable for him",
    "instructing: “Make full-length armour, ˹perfectly˺ balancing the links. And work righteousness ˹O family of David!˺. Indeed, I am All-Seeing of what you do.”",
    "And to Solomon ˹We subjected˺ the wind: its morning stride was a month’s journey and so was its evening stride. And We caused a stream of molten copper to flow for him, and ˹We subjected˺ some of the jinn to work under him by his Lord’s Will. And whoever of them deviated from Our command, We made them taste the torment of the blaze.",
    "They made for him whatever he desired of sanctuaries, statues, basins as large as reservoirs, and cooking pots fixed ˹into the ground˺. ˹We ordered:˺ “Work gratefully, O  family of David!” ˹Only˺ a few of My servants are ˹truly˺ grateful.",
    "When We decreed Solomon’s death, nothing indicated to the ˹subjected˺ jinn that he was dead except the termites eating away his staff. So when he collapsed, the jinn realized that if they had ˹really˺ known the unseen, they would not have remained in ˹such˺ humiliating servitude.",
    "Indeed, there was a sign for ˹the tribe of˺ Sheba in their homeland: two orchards—one to the right and the other to the left. ˹They were told:˺ “Eat from the provision of your Lord, and be grateful to Him. ˹Yours is˺ a good land and a forgiving Lord.”",
    "But they turned away. So We sent against them a devastating flood, and replaced their orchards with two others producing bitter fruit, fruitless bushes, and a few ˹sparse˺ thorny trees.",
    "This is how We rewarded them for their ingratitude. Would We ever punish ˹anyone in such a way˺ except the ungrateful?",
    "We had also placed between them and the cities We showered with blessings ˹many small˺ towns within sight of one another. And We set moderate travel distances in between, ˹saying,˺ “Travel between them by day and night safely.”",
    "But they said, “Our Lord! Make ˹the distances of˺ our journeys longer,” wronging themselves. So We reduced them to ˹cautionary˺ tales, and scattered them utterly. Surely in this are lessons for whoever is steadfast, grateful.",
    "Indeed, Iblîs’ assumption about them has come true, so they ˹all˺ follow him, except a group of ˹true˺ believers.",
    "He does not have any authority over them, but ˹Our Will is˺ only to distinguish those who believe in the Hereafter from those who are in doubt about it. And your Lord is a ˹vigilant˺ Keeper over all things.”",
    "Say, ˹O Prophet,˺ “Call upon those you claim ˹to be divine˺ besides Allah. They do not possess ˹even˺ an atom’s weight either in the heavens or the earth, nor do they have any share in ˹governing˺ them. Nor is any of them a helper to Him.”",
    "No intercession will be of any benefit with Him, except by those granted permission by Him. ˹At last,˺ when the dread ˹of Judgment Day˺ is relieved from their hearts ˹because they are permitted to intercede˺, they will ˹excitedly˺ ask ˹the angels˺, “What has your Lord ˹just˺ said?” The angels will reply, “The truth! And He is the Most High, All-Great.”",
    "Ask ˹them, O  Prophet˺, “Who provides for you from the heavens and the earth?” Say, “Allah! Now, certainly one of our two groups is ˹rightly˺ guided; the other is clearly astray.”",
    "Say, “You will not be accountable for our misdeeds, nor will we be accountable for your deeds.”",
    "Say, “Our Lord will gather us together, then He will judge between us with the truth. For He is the All-Knowing Judge.”",
    "Say, “Show me those ˹idols˺ you have joined with Him as partners. No! In fact, He ˹alone˺ is Allah—the Almighty, All-Wise.”",
    "We have sent you ˹O Prophet˺ only as a deliverer of good news and a warner to all of humanity, but most people do not know.",
    "And they ask ˹the believers˺, “When will this threat come to pass, if what you say is true?”",
    "Say, ˹O Prophet,˺ “A Day has ˹already˺ been appointed for you, which you can neither delay nor advance by a ˹single˺ moment.”",
    "The disbelievers vow, “We will never believe in this Quran, nor in those ˹Scriptures˺ before it.” If only you could see when the wrongdoers will be detained before their Lord, throwing blame at each other! The lowly ˹followers˺ will say to the arrogant ˹leaders˺, “Had it not been for you, we would certainly have been believers.”",
    "The arrogant will respond to the lowly, “Did we ever hinder you from guidance after it came to you? In fact, you were wicked ˹on your own˺.”",
    "The lowly will say to the arrogant, “No! It was your plotting by day and night—when you ordered us to disbelieve in Allah and to set up equals with Him.” They will ˹all˺ hide ˹their˺ remorse when they see the torment. And We will put shackles around the necks of the disbelievers. Will they be rewarded except for what they used to do?",
    "Whenever We sent a warner to a society, its elite would say, “We truly reject what you have been sent with.”",
    "Adding, “We are far superior ˹to the believers˺ in wealth and children, and we will never be punished.”",
    "Say, ˹O Prophet,˺ “Surely ˹it is˺ my Lord ˹Who˺ gives abundant or limited provisions to whoever He wills. But most people do not know.”",
    "It is not your wealth or children that bring you closer to Us. But those who believe and do good—it is they who will have a multiplied reward for what they did, and they will be secure in ˹elevated˺ mansions.",
    "As for those who strive to discredit Our revelations, it is they who will be confined in punishment.",
    "Say, ˹O Prophet,˺ “Surely ˹it is˺ my Lord ˹Who˺ gives abundant or limited provisions to whoever He wills of His servants. And whatever you spend in charity, He will compensate ˹you˺ for it. For He is the Best Provider.”",
    "And ˹consider˺ the Day He will gather them all together, and then ask the angels, “Was it you that these ˹polytheists˺ used to worship?”",
    "They will say, “Glory be to You! Our loyalty is to You, not them. In fact, they ˹only˺ followed the ˹temptations of evil˺ jinn, in whom most of them had faith.”",
    "So Today neither of you can benefit or protect each other. And We will say to the wrongdoers, “Taste the torment of the Fire, which you used to deny.”",
    "When Our clear revelations are recited to them, they say, “This is only a man who wishes to hinder you from what your forefathers used to worship.” They also say, “This ˹Quran˺ is no more than a fabricated lie.” And the disbelievers say of the truth when it has come to them, “This is nothing but pure magic.”",
    "˹They say so even though˺ We had never given them any scriptures to study, nor did We ever send them a warner before you ˹O Prophet˺.",
    "Those ˹destroyed˺ before them denied as well—and these ˹Meccans˺ have not attained even one-tenth of what We had given their predecessors. Yet ˹when˺ they denied My messengers, how severe was My response!",
    "Say, ˹O Prophet,˺ “I advise you to do ˹only˺ one thing: stand up for ˹the sake of˺ Allah—individually or in pairs—then reflect. Your fellow man is not insane. He is only a warner to you before ˹the coming of˺ a severe punishment.”",
    "Say, “If I had ever asked you for a reward, you could keep it. My reward is only from Allah. And He is a Witness over all things.”",
    "Say, “Surely my Lord hurls the truth ˹against falsehood˺. ˹He is˺ the Knower of all unseen.”",
    "Say, “The truth has come, and falsehood will vanish, never to return.”",
    "Say, “If I am astray, the loss is only mine. And if I am guided, it is ˹only˺ because of what my Lord reveals to me. He is indeed All-Hearing, Ever Near.”",
    "If only you could see when they will be horrified with no escape ˹on Judgment Day˺! And they will be seized from a nearby place.",
    "They will ˹then˺ cry, “We do ˹now˺ believe in it ˹all˺.” But how could they ˹possibly˺ attain faith from a place so far-off ˹from the world˺",
    "while they had already rejected it before, guessing blindly from a place ˹equally˺ far-away ˹from the Hereafter˺?",
    "They will be sealed off from whatever they desire, as was done to their counterparts before. Indeed, they were ˹all˺ in alarming doubt."
  ],
  "arabic1": [
    "اَلْحَمْدُ لِلّٰهِ الَّذِیْ لَهٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ وَلَهُ الْحَمْدُ فِی الْاٰخِرَةِ وَهُوَ الْحَكِیْمُ الْخَبِیْرُ",
    "یَعْلَمُ مَا یَلِجُ فِی الْاَرْضِ وَمَا یَخْرُجُ مِنْهَا وَمَا یَنْزِلُ مِنَ السَّمَآءِ وَمَا یَعْرُجُ فِیْهَا وَهُوَ الرَّحِیْمُ الْغَفُوْرُ",
    "وَقَالَ الَّذِیْنَ كَفَرُوْا لَا تَاْتِیْنَا السَّاعَةُ قُلْ بَلٰی وَرَبِّیْ لَتَاْتِیَنَّكُمْ عٰلِمِ الْغَیْبِ لَا یَعْزُبُ عَنْهُ مِثْقَالُ ذَرَّةٍ فِی السَّمٰوٰتِ وَلَا فِی الْاَرْضِ وَلَاۤ اَصْغَرُ مِنْ ذٰلِكَ وَلَاۤ اَكْبَرُ اِلَّا فِیْ كِتٰبٍ مُّبِیْنٍ",
    "لِّیَجْزِیَ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ اُولٰٓىِٕكَ لَهُمْ مَّغْفِرَةٌ وَّرِزْقٌ كَرِیْمٌ",
    "وَالَّذِیْنَ سَعَوْ فِیْۤ اٰیٰتِنَا مُعٰجِزِیْنَ اُولٰٓىِٕكَ لَهُمْ عَذَابٌ مِّنْ رِّجْزٍ اَلِیْمٌ",
    "وَیَرَی الَّذِیْنَ اُوْتُوا الْعِلْمَ الَّذِیْۤ اُنْزِلَ اِلَیْكَ مِنْ رَّبِّكَ هُوَ الْحَقَّ وَیَهْدِیْۤ اِلٰی صِرَاطِ الْعَزِیْزِ الْحَمِیْدِ",
    "وَقَالَ الَّذِیْنَ كَفَرُوْا هَلْ نَدُلُّكُمْ عَلٰی رَجُلٍ یُّنَبِّئُكُمْ اِذَا مُزِّقْتُمْ كُلَّ مُمَزَّقٍ اِنَّكُمْ لَفِیْ خَلْقٍ جَدِیْدٍ",
    "اَفْتَرٰی عَلَی اللّٰهِ كَذِبًا اَمْ بِهٖ جِنَّةٌ بَلِ الَّذِیْنَ لَا یُؤْمِنُوْنَ بِالْاٰخِرَةِ فِی الْعَذَابِ وَالضَّلٰلِ الْبَعِیْدِ",
    "اَفَلَمْ یَرَوْا اِلٰی مَا بَیْنَ اَیْدِیْهِمْ وَمَا خَلْفَهُمْ مِّنَ السَّمَآءِ وَالْاَرْضِ اِنْ نَّشَاْ نَخْسِفْ بِهِمُ الْاَرْضَ اَوْ نُسْقِطْ عَلَیْهِمْ كِسَفًا مِّنَ السَّمَآءِ اِنَّ فِیْ ذٰلِكَ لَاٰیَةً لِّكُلِّ عَبْدٍ مُّنِیْبٍ",
    "وَلَقَدْ اٰتَیْنَا دَاوٗدَ مِنَّا فَضْلًا یٰجِبَالُ اَوِّبِیْ مَعَهٗ وَالطَّیْرَ وَاَلَنَّا لَهُ الْحَدِیْدَ",
    "اَنِ اعْمَلْ سٰبِغٰتٍ وَّقَدِّرْ فِی السَّرْدِ وَاعْمَلُوْا صَالِحًا اِنِّیْ بِمَا تَعْمَلُوْنَ بَصِیْرٌ",
    "وَلِسُلَیْمٰنَ الرِّیْحَ غُدُوُّهَا شَهْرٌ وَّرَوَاحُهَا شَهْرٌ وَاَسَلْنَا لَهٗ عَیْنَ الْقِطْرِ وَمِنَ الْجِنِّ مَنْ یَّعْمَلُ بَیْنَ یَدَیْهِ بِاِذْنِ رَبِّهٖ وَمَنْ یَّزِغْ مِنْهُمْ عَنْ اَمْرِنَا نُذِقْهُ مِنْ عَذَابِ السَّعِیْرِ",
    "یَعْمَلُوْنَ لَهٗ مَا یَشَآءُ مِنْ مَّحَارِیْبَ وَتَمَاثِیْلَ وَجِفَانٍ كَالْجَوَابِ وَقُدُوْرٍ رّٰسِیٰتٍ اِعْمَلُوْۤا اٰلَ دَاوٗدَ شُكْرًا وَقَلِیْلٌ مِّنْ عِبَادِیَ الشَّكُوْرُ",
    "فَلَمَّا قَضَیْنَا عَلَیْهِ الْمَوْتَ مَا دَلَّهُمْ عَلٰی مَوْتِهٖۤ اِلَّا دَآبَّةُ الْاَرْضِ تَاْكُلُ مِنْسَاَتَهٗ فَلَمَّا خَرَّ تَبَیَّنَتِ الْجِنُّ اَنْ لَّوْ كَانُوْا یَعْلَمُوْنَ الْغَیْبَ مَا لَبِثُوْا فِی الْعَذَابِ الْمُهِیْنِ",
    "لَقَدْ كَانَ لِسَبَاٍ فِیْ مَسْكَنِهِمْ اٰیَةٌ جَنَّتٰنِ عَنْ یَّمِیْنٍ وَّشِمَالٍ كُلُوْا مِنْ رِّزْقِ رَبِّكُمْ وَاشْكُرُوْا لَهٗ بَلْدَةٌ طَیِّبَةٌ وَّرَبٌّ غَفُوْرٌ",
    "فَاَعْرَضُوْا فَاَرْسَلْنَا عَلَیْهِمْ سَیْلَ الْعَرِمِ وَبَدَّلْنٰهُمْ بِجَنَّتَیْهِمْ جَنَّتَیْنِ ذَوَاتَیْ اُكُلٍ خَمْطٍ وَّاَثْلٍ وَّشَیْءٍ مِّنْ سِدْرٍ قَلِیْلٍ",
    "ذٰلِكَ جَزَیْنٰهُمْ بِمَا كَفَرُوْا وَهَلْ نُجٰزِیْۤ اِلَّا الْكَفُوْرَ",
    "وَجَعَلْنَا بَیْنَهُمْ وَبَیْنَ الْقُرَی الَّتِیْ بٰرَكْنَا فِیْهَا قُرًی ظَاهِرَةً وَّقَدَّرْنَا فِیْهَا السَّیْرَ سِیْرُوْا فِیْهَا لَیَالِیَ وَاَیَّامًا اٰمِنِیْنَ",
    "فَقَالُوْا رَبَّنَا بٰعِدْ بَیْنَ اَسْفَارِنَا وَظَلَمُوْۤا اَنْفُسَهُمْ فَجَعَلْنٰهُمْ اَحَادِیْثَ وَمَزَّقْنٰهُمْ كُلَّ مُمَزَّقٍ اِنَّ فِیْ ذٰلِكَ لَاٰیٰتٍ لِّكُلِّ صَبَّارٍ شَكُوْرٍ",
    "وَلَقَدْ صَدَّقَ عَلَیْهِمْ اِبْلِیْسُ ظَنَّهٗ فَاتَّبَعُوْهُ اِلَّا فَرِیْقًا مِّنَ الْمُؤْمِنِیْنَ",
    "وَمَا كَانَ لَهٗ عَلَیْهِمْ مِّنْ سُلْطٰنٍ اِلَّا لِنَعْلَمَ مَنْ یُّؤْمِنُ بِالْاٰخِرَةِ مِمَّنْ هُوَ مِنْهَا فِیْ شَكٍّ وَرَبُّكَ عَلٰی كُلِّ شَیْءٍ حَفِیْظٌ",
    "قُلِ ادْعُوا الَّذِیْنَ زَعَمْتُمْ مِّنْ دُوْنِ اللّٰهِ لَا یَمْلِكُوْنَ مِثْقَالَ ذَرَّةٍ فِی السَّمٰوٰتِ وَلَا فِی الْاَرْضِ وَمَا لَهُمْ فِیْهِمَا مِنْ شِرْكٍ وَّمَا لَهٗ مِنْهُمْ مِّنْ ظَهِیْرٍ",
    "وَلَا تَنْفَعُ الشَّفَاعَةُ عِنْدَهٗۤ اِلَّا لِمَنْ اَذِنَ لَهٗ حَتّٰۤی اِذَا فُزِّعَ عَنْ قُلُوْبِهِمْ قَالُوْا مَاذَا قَالَ رَبُّكُمْ قَالُوا الْحَقَّ وَهُوَ الْعَلِیُّ الْكَبِیْرُ",
    "قُلْ مَنْ یَّرْزُقُكُمْ مِّنَ السَّمٰوٰتِ وَالْاَرْضِ قُلِ اللّٰهُ وَاِنَّاۤ اَوْ اِیَّاكُمْ لَعَلٰی هُدًی اَوْ فِیْ ضَلٰلٍ مُّبِیْنٍ",
    "قُلْ لَّا تُسْـَٔلُوْنَ عَمَّاۤ اَجْرَمْنَا وَلَا نُسْـَٔلُ عَمَّا تَعْمَلُوْنَ",
    "قُلْ یَجْمَعُ بَیْنَنَا رَبُّنَا ثُمَّ یَفْتَحُ بَیْنَنَا بِالْحَقِّ وَهُوَ الْفَتَّاحُ الْعَلِیْمُ",
    "قُلْ اَرُوْنِیَ الَّذِیْنَ اَلْحَقْتُمْ بِهٖ شُرَكَآءَ كَلَّا بَلْ هُوَ اللّٰهُ الْعَزِیْزُ الْحَكِیْمُ",
    "وَمَاۤ اَرْسَلْنٰكَ اِلَّا كَآفَّةً لِّلنَّاسِ بَشِیْرًا وَّنَذِیْرًا وَّلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَعْلَمُوْنَ",
    "وَیَقُوْلُوْنَ مَتٰی هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِیْنَ",
    "قُلْ لَّكُمْ مِّیْعَادُ یَوْمٍ لَّا تَسْتَاْخِرُوْنَ عَنْهُ سَاعَةً وَّلَا تَسْتَقْدِمُوْنَ",
    "وَقَالَ الَّذِیْنَ كَفَرُوْا لَنْ نُّؤْمِنَ بِهٰذَا الْقُرْاٰنِ وَلَا بِالَّذِیْ بَیْنَ یَدَیْهِ وَلَوْ تَرٰۤی اِذِ الظّٰلِمُوْنَ مَوْقُوْفُوْنَ عِنْدَ رَبِّهِمْ یَرْجِعُ بَعْضُهُمْ اِلٰی بَعْضِ ١لْقَوْلَ یَقُوْلُ الَّذِیْنَ اسْتُضْعِفُوْا لِلَّذِیْنَ اسْتَكْبَرُوْا لَوْلَاۤ اَنْتُمْ لَكُنَّا مُؤْمِنِیْنَ",
    "قَالَ الَّذِیْنَ اسْتَكْبَرُوْا لِلَّذِیْنَ اسْتُضْعِفُوْۤا اَنَحْنُ صَدَدْنٰكُمْ عَنِ الْهُدٰی بَعْدَ اِذْ جَآءَكُمْ بَلْ كُنْتُمْ مُّجْرِمِیْنَ",
    "وَقَالَ الَّذِیْنَ اسْتُضْعِفُوْا لِلَّذِیْنَ اسْتَكْبَرُوْا بَلْ مَكْرُ الَّیْلِ وَالنَّهَارِ اِذْ تَاْمُرُوْنَنَاۤ اَنْ نَّكْفُرَ بِاللّٰهِ وَنَجْعَلَ لَهٗۤ اَنْدَادًا وَاَسَرُّوا النَّدَامَةَ لَمَّا رَاَوُا الْعَذَابَ وَجَعَلْنَا الْاَغْلٰلَ فِیْۤ اَعْنَاقِ الَّذِیْنَ كَفَرُوْا هَلْ یُجْزَوْنَ اِلَّا مَا كَانُوْا یَعْمَلُوْنَ",
    "وَمَاۤ اَرْسَلْنَا فِیْ قَرْیَةٍ مِّنْ نَّذِیْرٍ اِلَّا قَالَ مُتْرَفُوْهَاۤ اِنَّا بِمَاۤ اُرْسِلْتُمْ بِهٖ كٰفِرُوْنَ",
    "وَقَالُوْا نَحْنُ اَكْثَرُ اَمْوَالًا وَّاَوْلَادًا وَّمَا نَحْنُ بِمُعَذَّبِیْنَ",
    "قُلْ اِنَّ رَبِّیْ یَبْسُطُ الرِّزْقَ لِمَنْ یَّشَآءُ وَیَقْدِرُ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا یَعْلَمُوْنَ",
    "وَمَاۤ اَمْوَالُكُمْ وَلَاۤ اَوْلَادُكُمْ بِالَّتِیْ تُقَرِّبُكُمْ عِنْدَنَا زُلْفٰۤی اِلَّا مَنْ اٰمَنَ وَعَمِلَ صَالِحًا فَاُولٰٓىِٕكَ لَهُمْ جَزَآءُ الضِّعْفِ بِمَا عَمِلُوْا وَهُمْ فِی الْغُرُفٰتِ اٰمِنُوْنَ",
    "وَالَّذِیْنَ یَسْعَوْنَ فِیْۤ اٰیٰتِنَا مُعٰجِزِیْنَ اُولٰٓىِٕكَ فِی الْعَذَابِ مُحْضَرُوْنَ",
    "قُلْ اِنَّ رَبِّیْ یَبْسُطُ الرِّزْقَ لِمَنْ یَّشَآءُ مِنْ عِبَادِهٖ وَیَقْدِرُ لَهٗ وَمَاۤ اَنْفَقْتُمْ مِّنْ شَیْءٍ فَهُوَ یُخْلِفُهٗ وَهُوَ خَیْرُ الرّٰزِقِیْنَ",
    "وَیَوْمَ یَحْشُرُهُمْ جَمِیْعًا ثُمَّ یَقُوْلُ لِلْمَلٰٓىِٕكَةِ اَهٰۤؤُلَآءِ اِیَّاكُمْ كَانُوْا یَعْبُدُوْنَ",
    "قَالُوْا سُبْحٰنَكَ اَنْتَ وَلِیُّنَا مِنْ دُوْنِهِمْ بَلْ كَانُوْا یَعْبُدُوْنَ الْجِنَّ اَكْثَرُهُمْ بِهِمْ مُّؤْمِنُوْنَ",
    "فَالْیَوْمَ لَا یَمْلِكُ بَعْضُكُمْ لِبَعْضٍ نَّفْعًا وَّلَا ضَرًّا وَنَقُوْلُ لِلَّذِیْنَ ظَلَمُوْا ذُوْقُوْا عَذَابَ النَّارِ الَّتِیْ كُنْتُمْ بِهَا تُكَذِّبُوْنَ",
    "وَاِذَا تُتْلٰی عَلَیْهِمْ اٰیٰتُنَا بَیِّنٰتٍ قَالُوْا مَا هٰذَاۤ اِلَّا رَجُلٌ یُّرِیْدُ اَنْ یَّصُدَّكُمْ عَمَّا كَانَ یَعْبُدُ اٰبَآؤُكُمْ وَقَالُوْا مَا هٰذَاۤ اِلَّاۤ اِفْكٌ مُّفْتَرًی وَقَالَ الَّذِیْنَ كَفَرُوْا لِلْحَقِّ لَمَّا جَآءَهُمْ اِنْ هٰذَاۤ اِلَّا سِحْرٌ مُّبِیْنٌ",
    "وَمَاۤ اٰتَیْنٰهُمْ مِّنْ كُتُبٍ یَّدْرُسُوْنَهَا وَمَاۤ اَرْسَلْنَاۤ اِلَیْهِمْ قَبْلَكَ مِنْ نَّذِیْرٍ",
    "وَكَذَّبَ الَّذِیْنَ مِنْ قَبْلِهِمْ وَمَا بَلَغُوْا مِعْشَارَ مَاۤ اٰتَیْنٰهُمْ فَكَذَّبُوْا رُسُلِیْ ۫ فَكَیْفَ كَانَ نَكِیْرِ",
    "قُلْ اِنَّمَاۤ اَعِظُكُمْ بِوَاحِدَةٍ اَنْ تَقُوْمُوْا لِلّٰهِ مَثْنٰی وَفُرَادٰی ثُمَّ تَتَفَكَّرُوْا ۫ مَا بِصَاحِبِكُمْ مِّنْ جِنَّةٍ اِنْ هُوَ اِلَّا نَذِیْرٌ لَّكُمْ بَیْنَ یَدَیْ عَذَابٍ شَدِیْدٍ",
    "قُلْ مَا سَاَلْتُكُمْ مِّنْ اَجْرٍ فَهُوَ لَكُمْ اِنْ اَجْرِیَ اِلَّا عَلَی اللّٰهِ وَهُوَ عَلٰی كُلِّ شَیْءٍ شَهِیْدٌ",
    "قُلْ اِنَّ رَبِّیْ یَقْذِفُ بِالْحَقِّ عَلَّامُ الْغُیُوْبِ",
    "قُلْ جَآءَ الْحَقُّ وَمَا یُبْدِئُ الْبَاطِلُ وَمَا یُعِیْدُ",
    "قُلْ اِنْ ضَلَلْتُ فَاِنَّمَاۤ اَضِلُّ عَلٰی نَفْسِیْ وَاِنِ اهْتَدَیْتُ فَبِمَا یُوْحِیْۤ اِلَیَّ رَبِّیْ اِنَّهٗ سَمِیْعٌ قَرِیْبٌ",
    "وَلَوْ تَرٰۤی اِذْ فَزِعُوْا فَلَا فَوْتَ وَاُخِذُوْا مِنْ مَّكَانٍ قَرِیْبٍ",
    "وَّقَالُوْۤا اٰمَنَّا بِهٖ وَاَنّٰی لَهُمُ التَّنَاوُشُ مِنْ مَّكَانٍ بَعِیْدٍ",
    "وَقَدْ كَفَرُوْا بِهٖ مِنْ قَبْلُ وَیَقْذِفُوْنَ بِالْغَیْبِ مِنْ مَّكَانٍ بَعِیْدٍ",
    "وَحِیْلَ بَیْنَهُمْ وَبَیْنَ مَا یَشْتَهُوْنَ كَمَا فُعِلَ بِاَشْیَاعِهِمْ مِّنْ قَبْلُ اِنَّهُمْ كَانُوْا فِیْ شَكٍّ مُّرِیْبٍ"
  ],
  "bengali": [
    "সব প্রশংসা আল্লাহর, যিনি আসমানসমূহে যা কিছু আছে ও যমীনে যা কিছু আছে তার মালিক। আর আখিরাতেও সকল প্রশংসা তাঁরই এবং তিনি প্রজ্ঞাময়, সম্যক অবগত।",
    "তিনি জানেন যমীনে যা প্রবেশ করে এবং তা থেকে যা বের হয়; আর আসমান থেকে যা নাযিল হয় এবং তাতে যা উঠে* । আর তিনি পরম দয়ালু, অতিশয় ক্ষমাশীল।",
    "আর কাফিররা বলে, ‘কিয়ামত আমাদের কাছে আসবে না।’ বল, ‘অবশ্যই, আমার রবের কসম! যিনি গায়েব সম্পর্কে অবগত, তা তোমাদের কাছে আসবেই। আসমানসমূহ ও যমীনে অনু পরিমাণ কিংবা তদপেক্ষা ছোট অথবা বড় কিছুই তাঁর অগোচরে নেই, বরং সবই সুস্পষ্ট কিতাবে রয়েছে,",
    "যাতে তিনি প্রতিদান দেন তাদেরকে যারা ঈমান আনে ও সৎকর্ম করে। তাদেরই জন্য রয়েছে ক্ষমা ও সম্মানজনক রিয্ক।",
    "আর যারা আমার আয়াতসমূহকে ব্যর্থ করে দেয়ার চেষ্টা চালায়, তাদেরই জন্য রয়েছে কঠোর পীড়াদায়ক আযাব।",
    "আর যাদেরকে জ্ঞান দেয়া হয়েছে তারা জানে যে, তোমার রবের পক্ষ থেকে তোমার প্রতি যা নাযিল করা হয়েছে তা সত্য এবং তা মহাপরাক্রমশালী ও প্রশংসিত আল্লাহর পথের দিকে হিদায়াত করে।",
    "আর কাফিররা বলে, ‘আমরা কি তোমাদেরকে এমন এক ব্যক্তির সন্ধান দেব, যে তোমাদেরকে সংবাদ দেয় যে, তোমরা যখন পুরোপুরি ছিন্ন ভিন্ন হয়ে যাবে তখন নিশ্চয় তোমরা নতুনভাবে সৃজিত হবে’?",
    "সে কি আল্লাহ সম্পর্কে মিথ্যা রচনা করে, না কি তার পাগলামী রয়েছে? বরং যারা আখিরাতের প্রতি ঈমান রাখে না তারা আযাব ও সুদূর বিভ্রান্তির মধ্যে রয়েছে।",
    "তারা কি তাদের সামনে ও তাদের পেছনে আসমান ও যমীনে যা আছে তার প্রতি লক্ষ্য করে না? যদি আমি ইচ্ছা করি তাহলে তাদেরকে সহ ভূমি ধসিয়ে দেব অথবা আসমান থেকে এক খন্ড (আযাব) তাদের উপর নিপতিত করব, অবশ্যই তাতে রয়েছে আল্লাহমুখী প্রত্যেক বান্দার জন্য নিদর্শন।",
    "আর অবশ্যই আমি আমার পক্ষ থেকে দাঊদের প্রতি অনুগ্রহ করেছিলাম। (আমি আদেশ করলাম) ‘হে পর্বতমালা, তোমরা তার সাথে আমার পবিত্রতা ঘোষণা কর’ এবং পাখিদেরকেও (এ আদেশ দিয়েছিলাম)। আর আমি তার জন্য লোহাকেও নরম করে দিয়েছিলাম,",
    "(এ নির্দেশ দিয়ে যে,) ‘তুমি পরিপূর্ণ বর্ম তৈরী কর এবং যথার্থ পরিমাণে প্রস্তুত কর’। আর তোমরা সৎকর্ম কর। তোমরা যা কিছু কর নিশ্চয় আমি তার সম্যক দ্রষ্টা।",
    "আর সুলাইমানের জন্য আমি বাতাসকে অনুগত করে দিয়েছিলাম, যা সকালে এক মাসের পথ এবং সন্ধ্যায় এক মাসের পথ অতিক্রম করত। আর আমি তার জন্য গলিত তামার প্রস্রবণ প্রবাহিত করেছিলাম। আর কতিপয় জিন তার রবের অনুমতিক্রমে তার সামনে কাজ করত। তাদের মধ্যে যে আমার নির্দেশ থেকে বিচ্যুত হয় তাকে আমি জ্বলন্ত আগুনের আযাব আস্বাদন করাব।",
    "তারা তৈরী করত সুলাইমানের ইচ্ছানুযায়ী তার জন্য প্রাসাদ, ভাস্কর্য, সুবিশাল হাউযের মত বড় পাত্র ও স্থির হাড়ি। ‘হে দাঊদ পরিবার, তোমরা কৃতজ্ঞতাস্বরূপ আমল করে যাও এবং আমার বান্দাদের মধ্যে অল্পই কৃতজ্ঞ’।",
    "তারপর যখন আমি সুলাইমানের মৃত্যুর ফয়সালা করলাম তখন মাটির পোকা জিনদেরকে তার মৃত্যু সম্পর্কে অবহিত করল, যা তার লাঠি খাচ্ছিল। অতঃপর যখন সে পড়ে গেল তখন জিনরা বুঝতে পারল যে, তারা যদি গায়েব জানত তাহলে তারা লাঞ্ছনাদায়ক আযাবে থাকত না।",
    "নিশ্চয় সাবা সম্প্রদায়ের জন্য তাদের বাসভূমিতে ছিল একটি নিদর্শন : দু’টি উদ্যান, একটি ডানে ও অপরটি বামে, (তাদেরকে বলা হয়েছিল) ‘তোমরা তোমাদের রবের রিয্ক থেকে খাও আর তাঁর শোকর কর। এটি উত্তম শহর এবং (তোমাদের রব) ক্ষমাশীল রব’।",
    "তারপরও তারা মুখ ফিরিয়ে নিল। ফলে আমি তাদের উপর বাঁধভাঙ্গা বন্যা প্রবাহিত করলাম। আর আমি তাদের উদ্যান দু’টিকে পরিবর্তন করে দিলাম এমন দু’টি উদ্যানে যাতে উৎপন্ন হয় তিক্ত ফলের গাছ, ঝাউগাছ এবং সামান্য কিছু কুল গাছ।",
    "সে আযাব আমি তাদেরকে দিয়েছিলাম তাদের কুফরীর কারণে। আর আমি অকৃতজ্ঞ ছাড়া অন্য কাউকে এমন আযাব দেই না।",
    "আর তাদের ও যে সব জনপদের মধ্যে আমি বরকত দিয়েছিলাম সেগুলোর মধ্যবর্তীস্থানে আমি অনেক দৃশ্যমান জনপদ স্থাপন করেছিলাম এবং তাতে ভ্রমণ করার ব্যবস্থা নির্ধারণ করে দিয়েছিলাম। (তাদেরকে বলা হয়েছিল) ‘তোমরা এসব জনপদে রাত-দিন (যখন ইচ্ছা) নিরাপদে ভ্রমণ কর’।",
    "কিন্তু তারা বলল, ‘হে আমাদের রব, আমাদের সফরের মধ্যে দূরত্ব বাড়িয়ে দিন’। আর তারা নিজদের প্রতি যুলম করল। ফলে আমি তাদেরকে কাহিনী বানালাম এবং তাদেরকে একেবারে ছিন্নভিন্ন করে দিলাম। নিশ্চয় এতে প্রত্যেক ধৈর্যশীল কৃতজ্ঞ ব্যক্তির জন্য নিদর্শন রয়েছে।",
    "আর নিশ্চয় তাদের ব্যাপারে ইবলীস তার ধারণা সত্য প্রমাণ করল, ফলে মুমিনদের একটি দল ছাড়া সবাই তার অনুসরণ করল।",
    "আর তাদের উপর শয়তানের কোন কর্তৃত্ব ছিল না। তবে কে আখিরাতের প্রতি ঈমান রাখে আর কে তাতে সন্দেহ পোষণ করে তা প্রকাশ করাই ছিল আমার উদ্দেশ্য। আর তোমার রব সকল কিছুর হিফাযতকারী।",
    "বল, ‘তোমরা আল্লাহ ছাড়া যাদেরকে ইলাহ মনে করতে তাদেরকে আহবান কর। তারা আসমানসমূহ ও যমীনের মধ্যে অণু পরিমাণ কোন কিছুর মালিক নয়। আর এ দু’য়ের মধ্যে তাদের কোন অংশীদারিত্ব নেই এবং তাদের মধ্য থেকে কেউ তাঁর সাহায্যকারীও নয়।",
    "আর আল্লাহ যাকে অনুমতি দেবেন সে ছাড়া তাঁর কাছে কোন সুপারিশ কারো উপকার করবে না। অবশেষে যখন তাদের অন্তর থেকে ভয় বিদূরিত হবে তখন তারা বলবে, ‘তোমাদের রব কী বলেছেন’? তারা বলবে, ‘সত্যই বলেছেন’ এবং তিনি সুমহান ও সবচেয়ে বড়।",
    "বল, ‘আসমানসমূহ ও যমীন থেকে কে তোমাদেরকে রিয্ক দেন? বল, ‘আল্লাহ’, আর নিশ্চয় আমরা অথবা তোমরা সৎপথে প্রতিষ্ঠিত অথবা স্পষ্ট বিভ্রান্তিতে পতিত’।",
    "বল, ‘আমরা যে অপরাধ করছি সে ব্যাপারে তোমাদেরকে জিজ্ঞাসা করা হবে না, আর তোমরা যা কর সে সম্পর্কে আমাদেরকেও জিজ্ঞাসা করা হবে না’।",
    "বল, ‘আমাদের রব আমাদেরকে একত্র করবেন। তারপর তিনি আমাদের মধ্যে সঠিকভাবে ফয়সালা করবেন। আর তিনিই শ্রেষ্ঠ ফয়সালাকারী ও সম্যক পরিজ্ঞাত’।",
    "বল, ‘তোমরা আমাকে দেখাও তো, তোমরা যাদেরকে তাঁর সাথে শরীক হিসেবে যুক্ত করেছ (তারা কোন সত্তা?) কখনো নয়, বরং তিনিই আল্লাহ, মহাপরাক্রমশালী, মহাপ্রজ্ঞাময়।",
    "আর আমি তো কেবল তোমাকে সমগ্র মানবজাতির জন্য সুসংবাদদাতা ও সতর্ককারী হিসেবে প্রেরণ করেছি; কিন্তু অধিকাংশ মানুষ জানে না,",
    "আর তারা বলে, ‘তোমরা যদি সত্যবাদী হও তবে বল, এ ওয়াদা কখন বাস্তবায়িত হবে’?",
    "বল, ‘তোমাদের জন্য রয়েছে একটি দিনের ওয়াদা যা থেকে তোমরা মুহূর্তকাল বিলম্বিত করতে পারবে না আর তরান্বিতও করতে পারবে না’।",
    "আর কাফিরগণ বলে, ‘আমরা কখনো এ কুরআনের প্রতি ঈমান আনব না এবং এর পূববর্তী কোন কিতাবের প্রতিও না’। আর তুমি যদি দেখতে যালিমদেরকে, যখন তাদের রবের কাছে দাঁড় করিয়ে দেয়া হবে তখন তারা পরস্পর বাদানুবাদ করতে থাকবে। যাদেরকে দুর্বল করে রাখা হয়েছিল তারা অহঙ্কারীদেরকে বলবে, ‘তোমরা না থাকলে অবশ্যই আমরা মুমিন হতাম’।",
    "যারা অহঙ্কারী ছিল তারা, তাদেরকে বলবে, যাদেরকে দুর্বল করে রাখা হয়েছিল, ‘তোমাদের কাছে হিদায়াত আসার পর আমরা কি তোমাদেরকে তা থেকে বাধা দিয়েছিলাম? বরং তোমরাই ছিলে অপরাধী’।",
    "আর যাদেরকে দুর্বল করে রাখা হয়েছিল তারা, যারা অহঙ্কারী ছিল তাদেরকে বলবে, ‘বরং এ ছিল তোমাদের দিন-রাতের চক্রান্ত, যখন তোমরা আমাদেরকে আদেশ দিয়েছিলে যেন আমরা আল্লাহকে অস্বীকার করি এবং তাঁর সমকক্ষ স্থির করি’। আর তারা যখন আযাব দেখবে তখন তারা অনুতাপ গোপন করবে। আর আমি কাফিরদের গলায় শৃঙ্খল পরিয়ে দেব। তারা যা করত কেবল তারই প্রতিফল তাদেরকে দেয়া হবে।",
    "আর আমি কোন জনপদে সতর্ককারী প্রেরণ করলেই সেখানকার বিত্তবান অধিবাসীরা বলেছে, ‘তোমরা যা নিয়ে প্রেরিত হয়েছ অবশ্যই আমরা তা প্রত্যাখ্যানকারী’।",
    "তারা আরো বলেছে, ‘আমরা ধন-সম্পদ ও সন্তান-সন্ততিতে অধিক সমৃদ্ধশালী। আর তাই আমরা আযাবপ্রাপ্ত হব না’।",
    "বল, ‘আমার রব যার জন্য ইচ্ছা রিয্ক প্রশস্ত করেন অথবা সঙ্কুচিত করেন। কিন্তু অধিকাংশ লোক তা জানে না।’",
    "আর তোমাদের ধন-সম্পদ ও সন্তান-সন্ততি এমন বস্তু নয় যা তোমাদেরকে আমার নিকটবর্তী করে দেবে। তবে যারা ঈমান আনে ও নেক আমল করে, তারাই তাদের আমলের বিনিময়ে পাবে বহুগুণ প্রতিদান। আর তারা (জান্নাতের) সুউচ্চ প্রাসাদে নিরাপদে থাকবে।",
    "আর যারা আমার আয়াতসমূহকে ব্যর্থ করে দিতে প্রচেষ্টা চালায় তাদেরকে আযাবের মধ্যে উপস্থিত করা হবে।",
    "বল, ‘নিশ্চয় আমার রব তাঁর বান্দাদের মধ্যে যার জন্য ইচ্ছা রিয্ক প্রশস্ত করেন এবং সঙ্কুচিত করেন। আর তোমরা যা কিছু আল্লাহর জন্য ব্যয় কর তিনি তার বিনিময় দেবেন এবং তিনিই উত্তম রিয্কদাতা।’",
    "আর স্মরণ কর, যেদিন তিনি তাদের সকলকে সমবেত করবেন তারপর ফেরেশতাদেরকে বলবেন, ‘এরা কি তোমাদেরই পূজা করত?’",
    "তারা (ফেরেশতারা) বলবে, ‘আপনি পবিত্র মহান, আপনিই আমাদের অভিভাবক, তারা নয়। বরং তারা জিনদের পূজা করত। এদের অধিকাংশই তাদের প্রতি ঈমান রাখত’।",
    "ফলে আজ তোমাদের একে অপরের কোন উপকার কিংবা অপকার করার ক্ষমতা কেউ রাখবে না। আর আমি যালিমদের উদ্দেশ্যে বলব, ‘তোমরা আগুনের আযাব আস্বাদন কর যা তোমরা অস্বীকার করতে।’",
    "আর যখন তাদের কাছে আমার সুস্পষ্ট আয়াতসমূহ তিলাওয়াত করা হত তখন তারা বলত, ‘এতো এমন এক ব্যক্তি যে তোমাদের বাধা দিতে চায় তা থেকে যার ইবাদাত তোমাদের পিতৃপুরুষগণ করত’। তারা আরও বলে, ‘এটি বানোয়াট মিথ্যা বৈ কিছু নয়।’ আর কাফিরদের নিকট যখনই সত্য আসে তখন তারা বলে, ‘এতো কেবল এক সুস্পষ্ট যাদু।’",
    "আর আমি তাদেরকে কোন কিতাব দেইনি যা তারা অধ্যয়ন করত, এবং তোমার পূর্বে তাদের প্রতি আর কোন সতর্ককারীও প্রেরণ করিনি।",
    "আর তাদের পূর্ববর্তীরাও অস্বীকার করেছে। অথচ আমি তাদের [পূর্ববর্তীদের] যা দিয়েছিলাম এরা তার এক দশমাংশও পায়নি, তবুও তারা আমার রাসূলদের অস্বীকার করেছিল। ফলে আমার প্রত্যাখ্যান (শাস্তি) কেমন হয়েছিল?",
    "বল, ‘আমি তো তোমাদেরকে একটি বিষয়ে উপদেশ দিচ্ছি, তোমরা আল্লাহর উদ্দেশ্যে দু’জন অথবা এক একজন করে দাঁড়িয়ে যাও, অতঃপর চিন্তা করে দেখ, তোমাদের সাথীর মধ্যে কোন পাগলামী নেই। সে তো আসন্ন কঠোর আযাব সম্পর্কে তোমাদের একজন সতর্ককারী বৈ কিছু নয়।’",
    "বল, ‘আমি তোমাদের কাছে কোন প্রতিদান চাইনি, বরং তা তোমাদেরই। আমার প্রতিদান তো কেবল আল্লাহর নিকট এবং তিনি সব কিছুর উপরই সাক্ষী।",
    "বল, ‘আমার রব সত্য পাঠিয়েছেন। তিনি যাবতীয় গায়েব সম্পর্কে পরিজ্ঞাত।’",
    "বল, ‘সত্য এসেছে এবং বাতিল কিছু সৃষ্টি করতে পারে না, আর কিছু পুনরাবৃত্তিও করতে পারে না।’",
    "বল, ‘যদি আমি পথভ্রষ্ট হয়ে যাই তবে আমার অকল্যাণেই আমি পথভ্রষ্ট হব। আর যদি আমি হিদায়াত প্রাপ্ত হই তবে তা এজন্য যে, আমার রব আমার প্রতি ওহী প্রেরণ করেন। নিশ্চয় তিনি সর্বশ্রোতা ও অতি নিকটবর্তী’।",
    "আর যদি তুমি দেখতে যখন তারা ভীত-সন্ত্রস্ত হয়ে পড়বে তখন পালানোর কোন পথ পাবে না এবং নিকটস্থ স্থান থেকে তাদেরকে পাকড়াও করা হবে।",
    "আর তারা বলবে, ‘আমরা তাতে ঈমান আনলাম’। কিন্তু দূরবর্তী স্থান থেকে তারা কিভাবে ঈমানের নাগাল পাবে?",
    "অথচ তারা ইতঃপূর্বে তা অস্বীকার করত এবং তারা দূরবর্তী স্থান থেকে গায়েব সম্পর্কে কুটমন্তব্য ছুঁড়ে মারত।",
    "আর তাদের ও তারা যা কামনা করত তার মধ্যে অন্তরাল করে দেয়া হবে, যেমন ইতঃপূর্বে তাদের সমগোত্রীয়দের ক্ষেত্রে করা হয়েছিল। নিশ্চয় তারা ছিল বিভ্রান্তিকর সন্দেহে পতিত। \n* যমীনে যা প্রবেশ করে তন্মধ্যে রয়েছে বৃষ্টির পানি, বীজ ইত্যাদি। আর তা থেকে বের হয় অঙ্কুর, উদ্ভিদ ইত্যাদি। আসমান থেকে নাযিল হয় রিযক ও তাকদীর এবং আসমানে উঠে ফেরেশতা, রূহ প্রভৃতি।"
  ]
}